Good day, everyone, and welcome to the first InternetBank Corp earnings conference call for the fourth quarter and full year 2021. All participants will be in a listen-only mode. Should you need assistance, please signal a conference specialist by pressing star then zero. After today's presentation, there will be an opportunity to ask questions. To ask a question, you may press star then one on a touch-tone phone. To withdraw your question, please press star then two. And please note that today's event is being recorded. I would now like to turn the conference over to Larry Clark from Financial Profiles, Inc. Please go ahead, Mr. Clark. Thank you, Matt. Good day, everyone, and thank you for joining us to discuss First Internet Bancorp's financial results for the fourth quarter and full year 2021. The company issued its earnings press release yesterday afternoon, and it's available on the company's website. In addition, the company's included a slide presentation that you can refer to during the call. You can also access these slides on the website. Joining us today from the management team are Chairman and CEO, David Becker, and Executive Vice President and CFO, Ken Lovick. David will provide an overview and a company update, and Ken will discuss the financial results. Then we'll open the call up to your questions. Before we begin, I'd like to remind you that this conference call contains forward-looking statements with respect to the future performance and financial condition of First Internet Bancorp that involve risks and uncertainties. Various factors could cause actual results to be materially different from any future results expressed or implied by such forward-looking statements. These factors are discussed in the company's SEC filings, which are available on the company's website. The company disclaims any obligation to update any forward-looking statements made during the call. Additionally, management may refer to non-GAAP measures, which are intended to supplement but not substitute the most directly comparable GAAP measures. The press release, available on the website, contains the financial and other quantitative information to be discussed today, as well as the reconciliation of the GAAP to non-GAAP measures. At this time, I'd like to turn the call over to David. Thank you, Larry. Good afternoon, everyone, and thanks for joining us today. 2021 was a year of significant achievements for First Internet. As you've seen, we had a strong fourth quarter. We generated record numbers. annual net income for 2021, highlighted by advances in key business lines and exceptionally low credit costs. Net income for the year was $48.1 million, and diluted earnings per share were $4.82, both up over 60 percent compared to the 2020 results. This strong performance was driven by substantial growth in net interest income and net interest margin expansion. Our fully taxable equivalent net interest margin for the year was 225, up 57 basis points from 168 in 220. This was primarily the result of lower deposit costs as higher cost CDs matured and our deposit composition shifted towards lower cost non-maturity deposits. We continued to exhibit stellar credit quality in 2021, The balance in non-performing loans decreased 27% over the course of the year, leading to a ratio of non-performing loans to total loans of just 26 basis points at year end, down from 33 basis points at the end of 2020. Net charge-offs for the year were only nine basis points. Our strong performance in 2021 helped us generate a return on average assets of 1.14% for the year, a 45 basis point improvement over 2020. Additionally, the strong earnings allowed us to continue building capital as our tangible common equity to tangible assets ratio increased to 8.93% year-end. While delivering these results is a full team effort, I'd like to highlight a few areas where we are seeing strong growth. We continue to build our national SBA platform steadily gained traction and contributed to our year-over-year revenue growth. Originations were particularly strong during the quarter, and I'm proud to announce that First Internet was ranked among the top 25 lenders for the first quarter of SBA's 2020-2022 year. SBA's first quarter, 22, is our fourth quarter, 21. SBA loan pipelines remain robust heading into January, which will provide a fantastic start to 2022. Our recently formed franchise finance business unit got off to a great start in 2021, funding over $80 million in loans since its launch in July. Our partner, Apple Pie Capital, is one of the leading providers of growth financing to franchise owners. Pipelines in this line of business remain strong as well. We are targeting origination volumes in the range of $115 million for 2022. Our pipelines in construction lending and single-tenant lease financing are also looking very good. In total, compared to the third quarter, our commercial pipeline is up 22%, and unfunded commitments in our construction businesses are up 45%. In addition to our core banking and lending businesses, we have recently announced two strategic initiatives to expand our capabilities. As you know, we announced a transformational acquisition of First Century Bancorp during the fourth quarter of 2021. With the addition of First Century's team, we will acquire four highly scalable business lines that bring fee revenue and additional funding diversification with low-cost deposit platforms. These four business lines include payments, tax product lending, sponsored card programs, and homeowners association services. With our much larger balance sheet, additional dedicated resources, and access to greater sources of liquidity, we plan to aggressively pursue growth opportunities across each of these business lines. We are in conversations with first century's key business partners and are excited about the ability to deepen and expand these relationships. Based on what we know today, we feel as good, if not better, about the forward estimates for the combined company than when we announced the transaction. The year ahead will be one dedicated in part to getting the first century transaction closed. And I would like to thank the teams from First Internet as well as First Century who have been diligently planning the integration of our respective organizations in a manner that will allow us to capitalize on the opportunities that will drive meaningful growth for us in 2023 and beyond. Another area of strategic focus for us in 2022 will be to invest in FinTech partnerships. With the rapid evolution of technology that enables consumers and small businesses to manage their finances digitally, fintechs are addressing a significantly growing marketplace. Partnering with these innovators will benefit First Internet in two ways. First, as we have discussed before, fintechs have created robust digital offerings unburdened by legacy tech impediments that meet and exceed customer expectations. Our teams have been systematically overhauling our digital service delivery capabilities with the introduction of carefully selected partners. We believe these tools will enhance our ability to win and retain consumer and small business relationships well into the future. Second, a growing number of FinTech partners seek to take their products directly to consumers and small businesses. These entrepreneurs need banking expertise and capabilities to go to market. First Internet has now almost 23 years of experience in delivering digital services, including numerous sponsorships that would have been called banking as a service had the term existed at the time. Given both our history and forward-looking vision, we believe First Internet is well-positioned to exceed in the banking as a service space. Earlier this week, we announced a formal agreement with SyncTera, a leading technology platform and matchmaker for bank FinTech partnerships. The relationship will enable us to manage a multitude of partners on a single platform, making it highly scalable and enabling us to drive new revenue streams, acquire lower cost deposits, and pursue additional asset generation capabilities. Banks offering banking as a service partnerships with FinTechs are growing quicker and more efficiently than the overall industry. We believe there is and will be for some time more demand for banking as a service, than the banks can meet, giving us a high degree of confidence that there is a long runway as a banking as a service provider. We are actively working with three FinTechs on the banking as a service front that we will provide a combination of low-cost deposits and non-interest income. We expect to begin announcing these partnerships as we get closer to the formal launch dates. We also continue to have discussions with additional FinTech partners through our own efforts as well as through the relationship with Sync Terra as we build out this attractive line of business. And finally, I want to once again acknowledge our inaugural Environmental, Social, and Governance Report, otherwise known as ESG, which we published in 2021. The report highlights a company's ongoing practices and achievements in four primary areas, governance and leadership, environmental management, human capital, and social responsibility. It chronicles our existing commitments and future priorities around mindful governance and responsible corporate citizenry. By advancing our ESG initiatives, we hold ourselves accountable for effectively managing risk while also facilitating financial inclusion. Before I turn it over to Ken, I would like to thank the entire First Internet team for their hard work and commitment throughout the year. We celebrate innovation and collaboration here We have built a workplace culture that continuously develops the people who embody these strengths. It is the reason why we were named one of the best banks to work for by American Banker for the ninth consecutive year. Our team's talent and dedication are why we are confident in our franchise's ability to capitalize on these new opportunities. With that, I'd like to turn the call over to Ken to discuss our financial results for the quarter. Thanks, David. As David mentioned, we posted record annual earnings capped off by a fourth quarter net income of $12.5 million and diluted earnings per share of $1.25, which included about $650,000 of additional pre-tax expense related to certain non-recurring items. After factoring in these items, adjusted net income was $13 million and adjusted diluted earnings per share were $1.30, increases of 2% and 2.1% respectively, from the third quarter and up over 16% from the fourth quarter of 2020. Profitability continued to be solid with adjusted return on average assets increasing six basis points from the third quarter to 1.24% and adjusted return on average tangible common equity of 13.84%. Looking at slide five, total loans at the end of the fourth quarter were $2.9 billion, down modestly from the third quarter and down 5.6% from December 31, 2020. We were pleased with the growth in our recently launched franchise finance line of business. In total, we originated $58 million of loans during the fourth quarter and closed the year with over $80 million in balances in the specialized lending area. We also grew balances in construction, where we had strong drawdowns from existing projects, and in small business lending, where we originated $54 million of SBA 7A loans $14 million of which were unguaranteed balances retained on the balance sheet. This was partially offset by $12 million in PPP loan forgiveness. However, this activity was more than offset by elevated net payoffs in our single-tenant lease financing, healthcare finance, owner-occupied commercial real estate, commercial and industrial, and public finance portfolios. Also contributing to the decline in loan balance was the sale of $20 million of single-tenant lease financing loans that were sold at an attractive premium. Consumer loan balances decreased moderately compared to the third quarter due primarily to prepayment activity in the residential mortgage, trailers, and other consumer loan portfolios. Moving on to deposits on slide six, overall deposit balances were down modestly from the end of the third quarter, and we continue to see improvement in the composition of our deposit base. During the quarter, non-maturity deposits increased by $51.6 million, driven primarily by increases in small business, commercial, and consumer balances, as our focus in this area continues to pay off. CDs and broker deposits decreased $97.3 million, or 7.1%, as higher-cost CD maturities were either funded with on-balance sheet liquidity or replaced with much more attractively priced money market accounts, checking accounts, and lower rate CDs. This lowered our cost of interest-bearing deposits six basis points during the quarter. In total, we realized $26 million of deposit interest savings for the full year 2021, which is in line with our guidance. Returning to slide seven and eight, net interest income for the quarter was $23.5 million, an increase of $2.6 million, or 12.4% compared to the third quarter. On an adjusted fully taxable equivalent basis, net interest income was $24.9 million, up $1.8 million, or 7.7% from the third quarter. The yield on interest earning assets improved to 3.34% in the fourth quarter due primarily to an increase in loan fee income as well as higher yields on new loan production, which included the growth in franchise finance balances. The average balance of other earning assets and securities decreased $47 million and $36 million respectively compared to the third quarter, while the average balance of loans was down $9 million. We recorded a net interest margin of 2.3 percent in the fourth quarter, an increase of 30 basis points from 2 percent in the third quarter. Adjusted fully taxable equivalent net interest margin increased 22 basis points from 2.21 percent for the third quarter, to 2.43% for the fourth quarter. As you can see on slide eight, the 22 basis point improvement was primarily driven by higher loan yields, including the impact of higher loan fees, which had a positive impact of 21 basis points and lower deposit costs, which provided a benefit of five basis points. This was partially offset by lower yields in the securities portfolio, which had a negative impact of three basis points. Looking ahead to this year, We expect our yield on interest earning assets to revert closer to our results in the third quarter, but increase steadily as we grow the commercial loan portfolio. Compared to the end of the third quarter, we have seen loan pipelines increase 22%, driven by growth in single-tenant lease financing, franchise finance, and SBA, as well as fundings of construction lines. Additionally, we expect deposit costs to continue to reduce over the next year. as $713 million of CDs are scheduled to mature in 2022 with a weighted average cost of 1.02%. Our current replacement cost on these deposits is in the range of 55 basis points. Turning to non-interest income on slide nine, non-interest income for the quarter was $7.7 million, down slightly from $7.8 million in the third quarter. The decrease was the result of lower revenues from mortgage banking activities and a decrease in other non-interest income, partially offset by an increase in gain on sale of loans. Gain on sale of loans totaled $4.1 million for the quarter, increasing $1.4 million compared to the third quarter, driven by a $900,000 gain on the sale of single-tenant lease financing loans and a $500,000 increase in the gain on sale of SBA loans. Mortgage banking revenue totaled $2.8 million for the quarter, down $1.1 million from the prior quarter due to a decrease in interest rate locks, sold loan volume, and margins. In terms of our outlook for mortgage, it remains relatively consistent with our prior comments. We expect mortgage revenue to be in the range of $12 to $13 million for the full year 2022. With regard to SBA gain on sale revenue, we are forecasting that to be in the range of $13.5 to $14 million for the year. Our outlook there has been somewhat impacted by more normalized gain on sale premiums as we've begun to see premiums come down from the elevated levels experienced during much of 2021. Moving to slide 10, non-interest expense for the fourth quarter was $17 million. The $2.5 million increase from the third quarter was driven by higher salaries and employee benefits, consulting and professional fees, and premises and equipment. The higher salaries and employee benefits expense was due mainly to higher incentive compensation, increased medical claims expense, and headcount growth. The increase in premises and equipment was driven primarily by a $500,000 termination fee related to an information technology contract, and the increase in consulting and professional fees was due primarily to $200,000 of acquisition-related expenses as well as third-party external loan reviews. With regard to our outlook on expenses, we expect to see an increase in the range of 15 to 17 percent for the year, driven by several factors. First, we have made a significant investment in SBA personnel, many of which were hired throughout 2021, so we will realize a full year's impact of those additions. Plus, we expect to continue adding personnel as we build out the platform. However, by the fourth quarter of 2022, we expect to be at an annual run rate 300 million of originations in SBA with plenty of room to grow. We also expect to add personnel and technology and risk management to support the FinTech and banking as a service initiatives that David talked about earlier. Also related to both our FinTech and small business initiatives, we expect to invest in partnerships and incur certain consulting fees that will significantly enhance our digital offerings and position First Internet as a leading provider of financial services to the small business market. And finally, we do expect an increase in premises and equipment costs as we recently moved into our new headquarters location, which is a larger facility that accommodates our growing workforce. Now let's turn to asset quality on slide 11. Credit quality improved again during the quarter as non-performing loans declined by $500,000 from the third quarter. Non-performing loans represent 26 basis points of total loans, down from 27 basis points last quarter, and down from 33 basis points at the end of 2020. Net recoveries of $100,000 were recognized during the fourth quarter, resulting in net recoveries to average loans of approximately one basis point. The provision for loan losses in the fourth quarter was a benefit of $238,000 compared to a benefit of $29,000 for the third quarter. The increased benefit was due primarily to the decrease in loan balances, but was partially offset by adjustments to qualitative factors that increased the overall allowance as a percentage of loans. The allowance for loan losses as a percentage of total loans was 96 basis points at year end, or 97 basis points when excluding PPP loans. Both represent a one basis point increase from the third quarter. With respect to capital, as shown on slide 12, Our overall capital levels improved and remain healthy at both the company and the bank. With the strong earnings performance this quarter, our tangible common equity to tangible assets ratio increased to 8.93%, up 32 basis points from the third quarter. Additionally, tangible book value per share increased to $38.51, up from $37.12 in the third quarter, and approximately 16% higher than one year ago. Lastly, during the fourth quarter, we repurchased 100,000 shares of our common stock at an average price of $44.36 as part of our authorized stock repurchase program. Overall, we had an outstanding quarter and continue to position ourselves well for success in future periods. With that, I will turn it back to the operator so we can take your questions. Thank you. We will now begin the question and answer session. To ask a question, you may press star then one on your touch-tone phone. If you are using a speaker phone, please pick up your handset before pressing the keys. If at any time your question has been addressed and you would like to withdraw your question, please press star then two. At this time, we will pause momentarily to assemble our roster. And our first question will come from Nathan Race with Piper Sandler. Please go ahead. Hi, everyone. Good morning. Hey, Nate. I was hoping to just start on the loan growth outlook. It sounds like, you know, maybe on a legacy basis, you guys are feeling, you know, increasingly optimistic on where the pipeline stands in terms of just those opportunities being well positioned to offset some continued runoff in the healthcare book. So as you kind of look out, over the course of this year and excluding the impact from FCB, how do you guys kind of think about overall loan growth levels on a legacy basis, that is? Yeah. You know, right now, Nate, as we kind of look at the world, look at pipelines, I think we feel comfortable forecasting loan growth, you know, in the range of the year for somewhere between 10 to 12%. I think, as we mentioned in the prepared comments, that franchise finance is going to be a big driver of net loan growth for the year. Our construction business as well has really done well this year. Our guys have been out there hustling and generating new commitments, so we expect to see a significant increase in loan balances there. Single-tenant lease pipelines seem to be growing every day. As the longer end of the curve has come up, It's allowed us to be more competitive on pricing. We don't necessarily have to chase rates down to the bottom. And I guess you would say that rates are kind of moving more into the rates that we're used to seeing. So we feel pretty good there. And then, you know, there are some opportunities as well throughout in the C&I business and owner-occupied commercial real estate as well. Backing up, Ken, actually we had a very strong fourth quarter in new loan originations and showed a positive play. We had two very large C&I loans, one a life sciences company and one a privately held group of car washes in Phoenix, Arizona. The two loans together totaled almost $70 million that were paid off in the fourth quarter due to mergers and acquisitions and then We also had almost $40 million in single-tenant leases that were paid off during the month of December. We're guessing it was folks just trying to shuffle the deck a little bit before there were any tax law changes on 1031. So had we not had over $100 million in somewhat unexpected payoffs during the quarter, we'd have had a very solid fourth quarter. So, yeah, as Ken said, we're very confident in looking at that 10% to 12% growth over the course of 2022. Got it. That's very helpful. Changing gears a little bit and just thinking about the overall balance sheet interest rate sensitivity position, if we were to look out over the next few quarters and after we get FCB integrated, how do you guys kind of think about the overall balance sheet sensitivity to the first couple of February hikes that are kind of priced into the forward curve by the end of this year? Yeah, I think when you think about when we get first century integrated, obviously that's going to give us a significant benefit on the deposit side with the zero cost and the low rate deposits that they have there. And that's going to provide a much more stable floor than what we've had in the past as far as deposit pricing goes. I think we'll probably see rates tick up a little bit on some of the deposits But I think as we shifted to, on our own, X first century, the composition has, obviously, it's migrated towards a heavier weighting on the checking account and the money market side. And all of our non-maturity products had a much lower beta in the last upgrade cycle. CD betas were very high, whereas the other betas were lower. So I think we feel pretty good about as far as the impact of interest rate increases. And I think we'd probably try to manage to a neutral position. And then once we get First Century integrated, get their deposits on board, and begin to build out the deposit opportunities there, I think we'd feel pretty good in combination with the addition of construction balances, which are all variable rate, more SBA balances, which are all variable rate, and just shorter duration loans overall that I think over time we migrate towards an asset sensitive position. Perfect. That's super helpful. Thanks, Ken. And one last one from me, and I apologize if you touched on this and I hopped on the call a bit late, but just in terms of the timing anticipated with FCB closing, any updates along those lines? Yeah, real quick update. We've been in conversation. We obviously have three players out here, the Department of Financial Institutions for the state of Indiana, the FDIC, and then ultimately the Federal Reserve. Conversations are going great. We hope to hear some positive news from the state of Indiana during the board meeting in February and FDIC and Federal Reserve behind that. So hopefully latter part of this quarter or very early on in the second quarter. We hope to get them over the finish line. Got it. That's very helpful. I appreciate you guys taking the questions. I'll step back. Thanks again. Thanks, Nate. Thanks, Nate. Our next question will come from Michael Perito with KBW. Please go ahead. Hey, guys. How are you? Doing good, Mike. How are you? Good, thank you. Thanks for taking my questions. I just had a couple things I wanted to hit. I wanted to drill in on the expense commentary for a second here. So Ken, I just wanna make sure I hear you correct. So you guys were saying 15 to 17% growth in 2022 off the kind of 60 and a half million starting core run rate, is that correct? And then is first century on top of that growth rate? First century would be on top of that. What was the first number you said, Mike? I didn't hear you clearly. I just wanted to, I'm sorry. I was just seeing if that 15% to 17% growth was off of kind of like a 16.5 core full year 21 starting point. I would say it's probably off the 60, just call it off 61.5 million. Got it. Okay. And then first century is on top of that, and is that still approximately 11 to 12 million annually of kind of OpEx that's coming on a full year run rate? Yeah, but I would probably back out of that the cost savings assumption. that we had, which was correct. Yeah, I just making sure that was the kind of starting point. All right, cool. And then kind of off that, you know, the two saw the news, obviously, you guys mentioned in the prepared remarks about Sin Cara, which company we're familiar with, you know, it seems like it correct me if I'm wrong here, David, but I mean, obviously, it seemed like first century had a pretty good roster of partners, but but hadn't really been pushing to grow kind of leaning into your your pending acquisition of them. But clearly, you know, you guys are looking to, to grow and, and, and that line of business for you. So I'm just, I guess I'm wondering, you guys kind of alluded to some hires, but, but where do you guys see yourselves in terms of kind of the tech customer service and regulatory oversight angles of, of, you know, of the Bass business in terms of your efforts there and, And I guess how do you kind of see yourself nestling into the competitive landscape, which, you know, isn't very crowded today, but there are other players. You know, what are you guys going to primarily be going after? Is it going to be more deposit-oriented to start, or is it going to be mixed amongst, you know, assets and deposit-type partnerships? Just would love some more color there, if you don't mind. Yeah, actually, we're almost on a 50-50 basis, Mike, with the folks we're talking to right now. Obviously, there's some very good low-deposits. low-cost-to-deposit channels that we're on. There are some very interesting loan opportunities at a higher yield and a shorter duration than we're used to seeing. So the great part about it, we discussed this in previous calls, over the last 18 months during the COVID crisis, we had already started a lot of build-out and a lot of testing and work on kind of banking as a service. Sync Terra has been in the works for months on end here. What First Century's announcement did, along with Cinque Terre and Pensley and other things we've announced and more to come, has put us on everybody's radar screen. As you pointed out, there are other players, but for the demand in the fintech space, there's not nearly as many banks that need to be in the space. There's plenty of folks to choose from. I would tell you we're way down the road with three to four folks that could get announced and processed yet this quarter. every one of the customers of First Century that we talked to. We turned up additional opportunities with them. The tax servicing side of things is going to be at least 2019 numbers, almost double what they did in 2020, if not more. The largest player on tax services, we're actually going to help them because they wanted to boost the volume above First Century, so we will actually some of those loans over the course and participate with them during the first quarter. So it's coming up roses absolutely every person that we talk to. If anything right now, it's a decision of trying to pick the best of the best. As Ken pointed out in his comments, we've hired some people in anticipation. The good part about the first century and a lot of the regulatory BSA, KYC, et cetera, et cetera, et cetera, concerns from the regulators. They've got a tremendous team in Georgia that's been doing a lot of this for years. In payment services, it's also very similar to banking as a service from a regulatory compliance place. So their team added to our team and the new people that we've hired, we're very confident and we've had no pushback at all from the regulatory agencies about our forward-looking plans to handle all those components. So It's looking rock solid, and like I say, there's tremendous opportunities out here. The phone's ringing on a daily basis, and the first century move really put us in kind of a spotlight on us that we're in it. And as we said, we were in banking as a service long before they coined that term. We were in fintech before the fintech term was coined, if you take a look at how the bank got off the ground. It's kind of fun now. I'm back in my element. This is what I've been doing for 40 years and having a great time. And Nicole and Ken and the rest of the team here are taking care of the day-to-day issues. And 2022 will be a little bit crazy, and we will try to give you guys guidance as much as we can as the year evolves. 2023 is looking absolutely like it's going to be a hit-it-out-of-the-park year. So very excited about everything that's going on. That's a great update. Thank you. Thank you for that, David. And then just lastly for me, Ken, just to drill in on the NIM a little bit more. I mean, if we can just kind of directionally try and gauge this thing here. I mean, you guys are obviously at 243 in the third quarter. You know, sounds like you guys can probably get between the CDs repricing and first century coming on into kind of like the high, you know, maybe like the two 60, two 70 type brains without really pushing too hard. And then, you know, where you guys go from there with, with rates will really depend kind of on the rate of growth of the banking as a service initiative and where that CD and kind of higher cost deposit rate portfolio grows to over time. Is that anything in there that kind of gives you heartburn or do you think that's generally pretty fair at this point, given what we know? Yeah, and I would say with regards to the NIM numbers you threw out, that's probably 23 and beyond. You know, in 2022 here, you know, one thing about our performance in the fourth quarter here is that we did have a lot of loan fees in there. We did have, as David talked about, there was elevated prepayment activity. You know, we probably had a million, a million one of what I'd call excess loan loan fees in there with the prepayment activity. David talked about the CNI loans and the single tenant. We usually run about 1.1 million to 1.1 million of prepayment fees and loan fee income a quarter, and we were about double that this quarter, which kind of equates into about maybe 11 to 12 basis points of margin. So with my comment earlier about our asset yields kind of reverting back to where they were in the third quarter, I mean, we were probably really in for the quarter about a low 230s NIM, and I think that's probably a good starting point for the year, but we obviously expect that to grift upwards. The deposit leverage isn't quite as strong this year as it was last year, but there still is repricing leverage there. And just the deployment of loans and the deployment of cash into commercial loans. I think, Mike, you kind of hit it right there. When we do get First Century on board and integrated with their low-cost platforms and start building those out, I think, you know, call it longer term, that NIM trajectory you talked about is what our goal is. One of the things, Mike, once we get past tax season and the demand for the tax loans here. The cash on balance sheet when we get first century and ourselves together, we're going to be in the $600 to $700 million range. It's the real key, and that's why we're looking for fintech loan opportunities. We've got to put that money to work just as quick as we can. Obviously, the securities industry and the other alternatives, the yields there aren't significant enough to make a big difference. It is much lower cost, thankfully. It won't be as big a drag as our traditional excess cash has been, but we're gonna have about 700 million to play with come April, May that we need to put to work as soon as possible. So that can hold us back a little bit for the first half of the year. As Ken said, the numbers you're quoting, that's probably very reasonable for 2023 and above, but I'd keep us in that 240 to 245 range by year end here in 2022. Got it. Very helpful. And then just to kind of be crystal clear about it, though, I mean, with the first century deal, your name, if we do get some type of more aggressive four hike scenario in the next four to five quarters where, you know, historically would have been pretty punitive to you guys on a relative basis. I mean, you don't expect that to be the case this time around. Now, with the changes you've already had, you're balancing and then the addition of a first century, you would expect that margin should be able to hold. steady at a minimum, you know, in a rising rate environment. Is that fair or is that too strong? Yeah. No, that's fair, Mike, because, I mean, if you just think about the simple math, even if we're carrying the excess liquidity but you get that many rate hikes, we'll make that much more yield on the cash balances at the Fed and elsewhere, you know, versus paying zero to a very low amount of basis points on it. So, yeah, you're right. I think that, as David said, the depending on how many rate hikes you want to look at, it's really just getting that cash put to work. Yeah, technically, if we get three to four rate hikes over the course of the year, our overnight investment yields will be above our cash costs for maybe the first time in the history of the bank. Very good. Thank you for all the color. Appreciate it. Thank you. Yep. Thanks, Mike. Our next question will come from Brett Rabaton with Hobdie Group. Please go ahead. Hey guys, good morning. Morning, Brett. Morning, Brett. I wanted to first ask, you were just mentioning the excess liquidity that you're going to be getting with the FCB deal. Can you talk about, with the initial terms of the deal, you anticipated having 21% accretion. and that included the excess liquidity deployment, the rate environment looks different now. Can you maybe give us an update on how creative this deal could be now relative to when you announced? Well, I think as David mentioned, I'd even back out the excess liquidity question because some of that to some extent may just be financial engineering, but I think when we put out the original guidance on 23 earnings, I think we knew that there were going to be a number of opportunities to look at, and I think we felt conservative at the time. We felt good about what we put out there, but conservative. And as we've gotten in and gotten to really get under the hood and get familiar with and get to know some of their customers, their clients, their key business partners and the opportunities there, as well as the expanded opportunities in the tax business. I think just from their core business alone, fee revenue and tax revenue should exceed the number that we put out there in our initial guidance. And then to me, If rates are going up and we do get this, we will get this very low-cost deposit platform, whether we deploy those proceeds into loans or even just deploying to securities. At the time we did the DAC I think our assumption on putting some of that cash to work in mortgage-backed securities were just plain vanilla. Agency MBS was 150 to 155, and I think now we can buy those same bonds at 190 to 2%. And the cost of the deposits isn't changing. So I think there is certainly some upside leverage there. But I think it will be, again, as we talk about it, it will just be how fast we can put that cash to work. Okay, that's helpful. You didn't really talk a whole lot about the HOA business and the payments and card programs. Obviously, fee income is a big piece of this transaction. It sounded initially like you were optimistic that those things could continue to grow and you wanted to invest in them. Can you maybe give us some color or an update on the Homeowners Association? Platform in particular, if you're optimistic they'll be able to grow that business and what the outlook might be for that to contribute to the deposit growth. The HOA business, as we're getting more under the covers and more detailed information, it's strong. It's a great opportunity for us. It's a very stable base that they have today. Growing that base is fairly seasonal. There's two times in the course of the year that an HOA will change banking relationships. One is kind of here at the end of the year, beginning of the year. When they start afresh, they'll make a move to a new bank. A lot of it is one of the things we need to do at the current time. Their HOA team only has integration into the Sync software platform, Bill's other platform, to really make that grow and go. We need to, there's probably four to five kind of major platforms. That's 90% of the HOA business. We need to build out a couple of additional APIs so they can service other platforms. But we still think it's solid. It's growing. It's very stable. The HOA world has woke up to the fact that they don't have to give their money away. Where it used to be very low balance, it's still, I think, an all-in blended cost between the checking and the long-term kind of money market or saving side of things. They're still in the 22, 23 basis points, which is tremendous for us compared to our traditional cost of funds. The one that is really taking off and has grown significantly through the course of the fourth quarter since we've gotten involved and knowledgeable of what's going on in their world is the deposits come with the prepaid card programs and some of the payment services. Obviously, there's cash moving in there, but some of that on the prepaid and the virtual credit cards and stuff, there's a deposit base to support those that have gone up $45, $50 million, and that's interest-free cash. We're not paying anything on that. So our thought that first century is going to drop in $500 million in low-cost deposits over the next 24 months, that still might even be a little bit of a low number. It'll be a combination of HOA and the card services side of things, but we think it's very, very doable and maybe even a little bit low. Okay, that's helpful. One last quick one on the Syncter relationship and the FinTech partners that you expect. You indicated kind of a 50-50 blends with new partners. On the lending side, would you anticipate that mostly being consumer-oriented, or would there also be commercial opportunities as well? We're looking, actually, quite honestly, we're looking at both. We've got two very attractive consumer and one commercial opportunities that we're looking at at the current time. Both of them have also opportunities, obviously, on the consumer lending side. We've been online banking for 23 years, so a cross-sell opportunity is huge there, as well as from the commercial side with the small business opportunities we're looking at to bring in deposit base as well. Most of the fintechs are single dimension. They're either looking at lending or they're looking at savings, but all the ones we're looking at, we think there's a cross-sell opportunity to pick up the other side of the coin. We hope it really comes in at about a 50-50 split and kind of balances each other out Okay, great. Appreciate the call. Thank you. Our next question will come from George Sutton with Craig Hallam. Please go ahead. Thank you. Just to clarify on the FinTech side, you did mention, and I think it was the prepared comments, that non-interest revenues could be nicely impacted. Could you just explain what you meant by the non-interest revenue side? Yeah, on the non-interest income side, there's a lot of the partnerships, whether it's banking as a service or enhancing our own offerings, can generate non-interest income, whether it's through interchange split or fees for providing access to the rails, to the debit and the credit rails, as well as just fee revenue for providing a service. Okay, I just want to clarify that. So when you talked about your commercial pipeline being up 22% and your construction unfunded up 45, I wanted to better, those are huge numbers, and I just want to understand, is this driven by having more people out in the market pursuing opportunities? I assume there's been no change to what you are looking to try to fund. Could you just give us a little bit more perspective on what's driving that strength? Yeah, George, it's a combination of both. We have additional staff. We've added three people to kind of that commercial real estate side of things over the past year. We got into a nice niche on, I'd call it, with obviously the logistics issues all over the United States. There's massive amounts of warehouse activity going on across the country. We're in a pipeline with a builder that has a lot of Amazon activity. One of the biggest issues with known builders and people that we've worked with in the past, we're kind of moving out of the Midwest footprint. If they're building something in Denver or Miami and it's folks that we know, we're going along with them. It's expanded market as well as expanded teams and just a nice niche as we carved out single tenant and franchise, etc. We found a nice niche in those big, large warehouses. Quick to build. Most of them sell very quickly. Obviously, in a lot of cases, it's a single-tenant occupancy like an Amazon. They're a very investable product. We do the construction phase. We're not doing long-term, 23-year financing. We're doing the upfront on the construction side and then They get turned over to permanent financing at the end. That's great to hear. So lastly for me, just some credit goes to you for stepping up and buying some stock back in Q4, and you got some good prices. With your tangible book continuing to move higher, I'm just curious if you can give us some sense of what may happen with much of the rest of your program. We just completed our strategic planning Monday and Tuesday with our board looking for through 2022. We're going to continue to buy shares over the course of the year if it is under a one and a half times book. So obviously pulling in the 100,000 shares fourth quarter at $44 and change was a tremendous investment. It's paid off handsomely and we're We're getting close to that one-and-a-half times book, and we'll see where it goes. But if it stays below one-and-a-half, we'll continue to buy. You have $4.50 to go, so nice job. Your math was faster than mine. I was trying to do that in the back of my head. Yeah. Our next question will come from John Rodas with Jani. Please go ahead. Good afternoon, guys. Hey, John, how are you? Good, good. How are you doing, David? David, you said I think one of your comments on the margin was roughly 240 to 245 by the end of this year. Was that on a combined basis with FCB? No, that's really us on a standalone basis, John. And I think, again, it kind of comes back to the second half of this year being a little bit uncertain as to the impact of first century. So we're going to get a lot of very low-cost deposits, but we're also going to have a lot of cash on the balance sheet. So there could be some excess liquidity drag as we deploy those funds Again, whether we get some out the door to buy some bonds, we get some out to fund loans, we get some out to fund higher-cost CDs as they mature, there's going to be some positive benefits, but there may be just some drag just due to the excess liquidity. Okay. And then, Ken, I guess a quarter or two ago, I think you put in the presentation that As far as cost saves on the deposit side, I think that it was around $10 million. Do you still expect that for legacy First Internet? Well, I know we talked about what we expected in 2021, and we hit that number of $26 million. The deposit leverage we have today isn't quite that great. As you can tell, if you can go back and remember when we started talking about our CD costs that mature over the next 12 months, It's 1.02% today. You go back in time a year or 18 months, and that number was 1.5% to 2%. So there's not as much. But I would say on the deposit side, there's probably, over the course of this year, just on our legacy first internet deposit base, $3 million to $4 million of savings on the deposit side. And again, our models do take into account, we kind of follow the forward curve on the short-term rates so that as some of those CDs roll off and are replaced with money markets or checking accounts, we are forecasting, because the market is forecasting higher short-term rates in the back half of the year, we are capturing that in those numbers I gave you. Okay, okay. And then maybe one more, Ken, just the tax rate. Do you have what the tax rate should be going forward on a combined basis with FCB? Ballpark? Yeah, I would bump it up a couple points from where we're at today. We kind of have settled into this call it 15%-ish range, give or take. We're obviously going to be collecting a bunch of new revenue from Revenue and net earnings from FCB, very little of which has any sort of tax-exempt status to it. So probably looking forward, that rate longer term probably bumps closer to 17% to 18%. Okay. Thanks, guys. Thank you. This concludes our question and answer session. I would like to turn the conference back over to David Becker for any closing remarks. Well, everybody, I'd like to thank you for joining us today. Obviously, we're very excited about 22 and beyond. Hopefully, you are as well. We hope you have a great day and continued success, and we'll talk to you again soon. Thank you. The conference is now concluded. Thank you for attending today's presentation. You may now disconnect.