Good day, everyone, and welcome to the first Internet Bancorp Earnings Conference call for the fourth quarter and full year 2022. All lines will be muted during the presentation portion of the call with an opportunity for questions and answers at the end. If you would like to ask a question, please press star 1 on your telephone keypad. Please note that today's event is being recorded. I would now like to turn the conference over to Nick Tallboys from Financial Profiles, Inc. Please go ahead, Mr. Tallboys. Thank you, Hannah. Good day, everyone, and thank you for joining us to discuss First Internet Bancorp's financial results for the fourth quarter and full year 2022. The company issued its earnings press release yesterday afternoon, and it is available on the company's website at www.firstinternetbancorp.com. In addition, the company has included a slide presentation that you can refer to during the call. You can also access these slides on the website. Joining us today from the management team are Chairman and CEO David Becker and an Executive Vice President and CFO Ken Lovick. David will provide an overview and Ken will discuss the financial results. Then we'll open up the call to your questions. Before we begin, I'd like to remind you that this conference call contains forward-looking statements with respect to the future performance and financial condition of First Internet Bancorp that involve risks and uncertainties. Various factors could cause actual results to be materially different from any future results expressed or implied by such forward-looking statements. These factors are discussed in the company's SEC filings, which are available on the company's website. The company disclaims any obligation to update any forward-looking statements made during the call. Additionally, management may refer to non-GAAP measures, which are intended to supplement but not substitute the most directly comparable GAAP measures. The press release available on the website contains the financial and other quantitative information to be discussed today, as well as the reconciliation of the GAAP to non-GAAP measures. At this time, I'd like to turn the call over to David. Thank you, Nick. Good afternoon, everyone, and thanks for joining us today as we discuss our fourth quarter and full year 2022 results. For the fourth quarter of 2022, we reported net income of $6.4 million and earnings per share of 68 cents. For the full year 2022, we reported net income and diluted earnings per share of $35.5 million and $3.70, respectively, compared to $48.1 million and $4.82, respectively, for full year 2021. Most of our lending teams had strong production in 2022. Net interest income for the year was up 12.1% compared to 2021. As we deployed cash balances to fund loan growth, driving average loan balances higher along with higher loan yields from the rise in interest rates throughout the year. Loan demand was particularly strong in the fourth quarter as portfolio balances totaled 3.5 billion at year end, increasing 7.5% compared to the third quarter and 21% compared to one year ago. During the quarter, we posted strong Across-the-board growth, led by our commercial lending areas, where balances were up 184 million, or 7.3%, and were up 350 million, or 15%, for the year. We saw growth in franchise finance, construction, single-tenant leasing, small business lending, and commercial and industrial. Our consumer loan balances increased 61 million, or 9%, compared to the prior quarter, and grew by $263 million for the full year 2022, or 56%, with residential mortgage, trailers, and RVs leading the way. We achieved this exceptional loan growth without sacrificing our proven commitment to credit quality. While the provision for loan losses in the fourth quarter was higher than in our prior quarters, the increase was due primarily to the strong loan growth as net charge-offs remained low. or about three basis points of average loan balances and only 1.1 million throughout all of 2022. Again, only about three basis points for the entire year. In fact, our asset quality improved on a year-over-year basis with non-performing assets representing just 17 basis points of total assets at year-end and non-performing loans representing just 22 basis points of total loans, both of which are well below industry averages. With the increase in interest rates throughout the year, we have been able to increase rates on loans as new portfolio origination yields increased to 84 basis points during the fourth quarter as compared to the prior quarter, resulting in the total portfolio yield increasing 39 basis points quarter over quarter. However, intense competition for deposits through the most rapid set of federal funds rate hikes in decades has also driven interest expense higher. pressuring net interest margin. To defend net interest margin on the asset side, our 2023 loan origination efforts will be focused on variable rate loan products, notably commercial construction and small business lending, and then other high-yielding portfolios such as franchise finance and consumer lending. We believe the increasing mix of variable rate loans combined with new loan production coming on at higher rates will help to offset the pressure of higher deposit costs. If interest rates follow the market's expectations, deposit costs should stabilize later this year and decline thereafter, setting the stage for us to achieve higher earnings and profitability in 2024. Turning to mortgage, while other lending lines have strong demand, the combination of housing prices, housing supply, economic uncertainty, and interest rates have caused mortgage applications nationally to plunge to the lowest level in 26 years. Due to the steep decline in mortgage volume, the unfavorable outlook for mortgage lending over the coming years, we announced yesterday that we are exiting our consumer mortgage business. This includes our direct-to-consumer mortgage business that originates residential loans nationwide for sale in the secondary market, as well as our local traditional consumer mortgage and construction-to-PERM business. This was a difficult but ultimately necessary decision. Given every economic outlook we have reviewed, it points to prolonged sluggishness across mortgage banking. Excluding one-time costs, we estimate we will deliver approximately $2.2 million in higher pre-tax income in 2023, and over a longer horizon, remove an element of volatility from our earnings and be a stronger, more efficient company. I want to thank everyone on the mortgage team for their hard work and dedication to homeowners. We are providing each of them with tools and resources to help them transition into new opportunities. I would also like to note that our commercial construction and land development business will not be affected by this decision and remains an important part of our lending strategy. To wrap up the lending discussion, one final point I want to make. is that we have never wavered from our underwriting and credit standards, regardless of market conditions. We believe our excellent asset quality and strong credit culture, in addition to our strong capital levels, positions us well to weather any economic slowdown that might be on the horizon. Lastly, I want to provide an update on our banking as a service and fintech partnership initiatives. During the fourth quarter, we went live with our platform partner, Increase, and launched our first program through that partnership with RAMP, the corporate card and spend management fintech. We are providing payment services to RAMP's bill payment offering for about 30% of their customers currently and are now processing between $8 to $10 million a day in daily volume. We also have two other fintechs, a payroll provider and a neobank in the pilot phase, and we have four more fintechs that are approaching the pilot phase and one in due diligence. We are also vetting new opportunities with INCREASE on a weekly basis. We also expect our other partnership with the platform Treasury Prime to be fully implemented through the first quarter of 23, with the first FinTech partner to be onboarded in the second quarter. Similar to our partnership with INCREASE, we are looking at new opportunities regularly as we get ready to go live with Treasury Prime. To wrap up my prepared comments, this past year was a mixture of both successes and challenges. I'm proud of the business that we have built over the last two decades, and of course, there is always still work to do. We are focused on controlling what we can control to build an earning stream that is resilient to changes in the economic and interest rate environment. We have a strong balance sheet and are well capitalized, allowing us to withstand whatever challenges the economy may throw at us. Like you, we are shareholders and we are committed to continuous improvement in creating shareholder value. Before I turn it over to Ken, I'd like to thank the entire First Internet team for their hard work and commitment to both our customers and our shareholders. We have developed a culture that fosters and champions teamwork and innovation. That's why we were named one of the best banks to work for by American Banker for the ninth consecutive year And it's why I'm confident in our collective ability to identify compelling new opportunities that will further diversify our business lines, improve our funding profile, and elevate our status as a leading technology forward financial services provider. With that, I'd like to turn the call over to Ken to discuss our financial results for the quarter. Thanks, David. The first thing I will start with is discussing the financial impact of the decision to exit the mortgage business that David spoke about earlier. We expect this to reduce total annual non-interest expense by approximately $6.8 million and increase annualized pre-tax income by approximately $2.7 million. We expect to realize about 80% of the annualized improvement in 2023 and 100% in subsequent years. Additionally, we estimate that we will incur total pre-tax expense of approximately $3.3 million associated with the exiting of this line of business. The majority of this is expected to be recognized in the first quarter of 2023 with the remaining amount in the second quarter. Therefore, the earn back in this decision will be between four and five quarters to exit a line of business that is otherwise forecast to remain subdued for the next three years. Now turning to slide seven, David covered the highlights for the quarter from a lending perspective, including the growth across the board in all active lines of business. Throughout 2022, we increased rates on new loan originations. Our fourth quarter funded portfolio origination yields were up 84 basis points from the third quarter and up 118 basis points year over year. We did fund certain loans during the quarter that were in the pipeline before the Fed September Fed rate increase and were therefore priced at lower rates, which created a drag on new origination yields. The majority of these loans have been cleaned out of the pipeline. With our focus on higher yielding asset classes, new production is coming on with yields north of 7% and in many cases much higher, setting the stage for higher average loan yields in 2023 and beyond. While loan growth was very strong during the fourth quarter, we expect overall portfolio growth in 2023 to be lower than it was for 2022. Our higher yielding and variable rate channels continue to have solid pipelines, but much of that growth is expected to be financed by cash flows from other portfolios over the course of the year as we remix the composition of the total loan book. Moving on to deposits on slide eight, Overall deposit balances were up $249 million, or 7.8% from the end of the third quarter. Non-maturity deposits, excluding banking as a service broker deposits, increased by $64 million compared to the linked quarter, with money market accounts leading the way, which were up $41 million. We also had a nice increase in non-interest bearing deposits of almost $33 million, the majority of which were driven by deposits from our commercial construction borrowers. As we previewed in the third quarter earnings call, we expected and we experienced a significant decline in Bass broker deposits during the quarter due to the winding down of a FinTech deposit relationship. However, this was partially offset by just over $13 million of new deposits related to the payment services we are providing to RAMP that David referred to earlier. We also brought in about $18 million of deposits from our relationship with increase, which are classified within the interest bearing demand deposit line item. As we grow the number of FinTech partners, we expect these types of deposit opportunities to expand in the future. CD balances were up over $100 million compared to the prior quarter due to new production in the consumer channel, while broker deposits increased $166 million as we access the wholesale market for longer duration funding to take advantage of the inverted yield curve and help to offset the impact of continued Fed rate hikes on deposit costs. Competition in the digital checking and money market space, combined with ongoing Fed rate increases and the continued trend of overall deposits leaving the banking system, continue to present challenges to grow non-maturity deposits. In both the digital bank and small business markets, we saw peer betas in the fourth quarter range from 80% to 100%. With the 425 basis point total increase in the Fed funds rate since March 2022, including 125 basis points in the fourth quarter, our current pricing on money market products results in a cycle to date beta of about 70%. As a result of all the deposit and interest rate activity during the fourth quarter, The cost of our interest-bearing deposits increased by 104 basis points from the third quarter. Turning to slides 9 and 10, net interest income for the quarter was $21.7 million and $23.1 million on a fully taxable equivalent basis, down 9.6% and 8.7% respectively from the third quarter. Our yield on average interest earning assets increased to 4.40% from 3.91% in the linked quarter due primarily to a 39 basis point increase in the average loan yield, a 60 basis point increase in the yield earned on securities, and a 103 basis point increase in the yield earned on other assets. The higher yields on interest earning assets combined with the growth in average loan balances produce solid top line growth in interest income increasing 16.5% compared to the linked quarter. Deposit costs, however, increased at a faster pace, resulting in the decline in net interest income. We recorded a net interest margin of 2.09% in the fourth quarter, a decrease of 31 basis points from the third quarter. And fully taxable equivalent net interest margin was also down 31 basis points to 2.22% for the quarter, right in the middle of the range that we guided to on last quarter's call. The net interest margin roll forward on slide 10 highlights the drivers of change in the fully tax-equivalent net interest margin during the quarter. For 2023, we continue to feel confident that the combination of higher-priced new loan originations, variable rate assets repricing higher, and additional draws on the high level of construction commitments will drive strong growth in total interest income. Currently, we expect the yield on the loan portfolio to be up around another 40 to 45 basis points for the first quarter of 2023, with loan interest income up in the range of 10 to 12 percent compared to the fourth quarter, and for the full year to increase 35 to 40 percent compared to 2022. On the funding side, with higher forward rate expectations based on the Fed's continued language regarding rates and inflation, we also expect deposit costs to increase. The pace of increases will depend heavily on price competition and the magnitude of Fed rate increases, as well as for how long it maintains a terminal rate. Assuming the Fed continues to increase rates early in 2023, we expect the cost of deposit funding to increase 60 to 65 basis points in the first quarter, with total interest expense up in the range of 25 to 30%. In terms of how this impacts fully taxable equivalent net interest margin, we expect elevated deposit costs will compress margin further for much of 2023. However, as we improve the composition of the loan portfolio, margins should stabilize and be in the range of 2.05% to 2.15% through the first three quarters of the year. If the Fed hits its terminal rate during 2023, we should see the dollar amount of interest expense stabilize in the fourth quarter, which would get us back to a higher fully tax equivalent net interest margin in the range of what we realized during the fourth quarter of 2022. Turning to non-interest income on slide 11, non-interest income for the quarter was $5.8 million, up $1.5 million from the third quarter. Gain on sale of loans totaled $2.9 million for the quarter, up slightly over third quarter, and consisting entirely of gains on sales of U.S. Small Business Administration 7A guaranteed loans. Our SBA team closed out the year well as sold loan volume was up 23% over the third quarter. Net gain on sale premiums were down almost 120 basis points, however, offsetting the impact of greater sale volumes. Mortgage banking revenue totaled $1 million for the fourth quarter of 2022, and other income totaled $1.5 million for the fourth quarter, up significantly over the third quarter due to distributions received on certain SBIC and venture capital fund investments. Moving to slide 12, non-interest expense for the fourth quarter was $18.5 million, up $500,000 from the third quarter. Now let's turn to asset quality on slide 13. As David mentioned earlier, credit quality continues to remain excellent as non-performing loans and non-performing asset ratios remain low. Net charge-offs of $238,000 were recognized during the fourth quarter, resulting in net charge-offs to average loans of three basis points, as David referenced earlier. Total delinquencies 30 days or more past due were 17 basis points of total loans as of December 31, compared to six basis points at September 30. When delinquencies are this low, it takes just one loan to make the difference. In this case, we had to delay converting a CNI construction loan to a 504 loan for its permanent mortgage when it was determined there was a mechanic's lien on the property. However, subsequent to year end, the construction loan was brought current. The provision for loan losses in the quarter was $2.1 million, up from about $900,000 in the third quarter. As David commented earlier, the increase was driven primarily by overall growth in the loan portfolio. This was partially offset by a reduction in specific reserves related to positive developments on a certain monitored loan. The allowance for loan losses increased $1.9 million, or 6.3%, to $31.7 million at quarter end, while the ratio of the allowance to total loans decreased one basis point to 0.91%. While growth in the allowance was generally in line with overall loan growth, the slight decline in the coverage ratio also reflects the removal of the specific reserve I just mentioned, growth in the residential mortgage portfolio that has a lower coverage ratio, and the continued decline in health care finance balances that have a higher coverage ratio. We will be implementing the current expected credit losses, or CECL, model during the first quarter of 2023. As a result, we expect our initial adjustment to the allowance for credit losses to be in the range of $2.5 million to $3 million. With respect to capital, as shown on slide 14, our overall capital levels at both the company and the bank remain strong. While total shareholders' equity increased in terms of dollar amount, our tangible common equity ratio declined to 7.94% as the combination of balance sheet growth and share repurchases offset the effect of net income earned during the quarter and the decrease in the accumulated other comprehensive loss. During the fourth quarter, we repurchased 284,286 shares of our common stock at an average price of $25.16 per share as part of our authorized stock repurchase program. For the full year 2022, we repurchased just over 800,000 shares at an average price of $34.62 per share. Along the lines of controlling what we can control, Our solid capital position allowed us the flexibility to be in the market repurchasing our shares at a price far below what we believe to be our franchise value, helping to increase tangible book value per share to $39.74 at quarter end, up 3.7% over the third quarter. Before I wrap up my comments, I would like to provide some comments on our forward outlook for earnings. Earlier, I provided some thoughts on loan yields, deposit costs, and net interest margin. With the planned exiting of the mortgage business, there will be some noise in the first quarter's results, but going forward from there, the impact should be accretive to earnings in the range of 25 to 26 cents on an annualized basis, so around 20 cents for 2023. The largest impact of exiting mortgage will be on non-interest expense. When excluding the one-time costs of $3.3 million, we expect total non-interest expense for 2023 to increase in the range of 2.5% to 3.5% compared to 2022's full-year results, which is much lower than the previous guidance we gave on expense growth for the year. On the flip side, non-interest income will be down from the original forecast in the range of a 15% decline from 2022's total non-interest income. In line with the fully tax equivalent net interest margin expectations discussed earlier, we expect net interest income to remain consistent with the fourth quarter's results and remain stable from the first quarter through the third quarter 2023 as earning asset growth and higher loan yields help to offset the increased deposit costs. If deposit costs stabilize in the fourth quarter, as the forward curve suggests, we would expect to see low double-digit growth in net interest income during the back end of the year. For the full year, we are expecting operating earnings per share, excluding the mortgage exit costs, to be in the range of $2.55 to $2.75 per share. with the first quarter to be roughly in line with the average estimate and improving in the second and third quarters. As deposit costs stabilize and loan income continues to grow, combined with the seasonality of the SBA business, we are expecting significantly improved results in the fourth quarter with earnings per share in the range of 92 to 98 cents. Looking ahead to 2024, if you simply take the low end of that range and annualize it, the results are significantly higher than the current 2024 estimates. Some factors that might provide additional upside to 2024 results may include the pace of Fed reductions should they follow the market's expectations as opposed to the Fed dot plot, SBA gain on sale premiums reverting to historical averages as rates and prepayment speeds decline, and higher than expected non-interest income from banking as a service activities. To wrap up, while the next several quarters may continue to provide challenges from an earnings perspective, we are beginning to see light at the end of the tunnel. When the Fed begins to bring rates back down, whether in line with the forward curve expectations or the Fed dot plot, deposit costs should come down significantly with a meaningful and positive impact on net income and earnings per share. With that, I will turn it back to the operator so we can take your questions. Certainly. If you would like to ask a question, please press star followed by one on your telephone keypad. If for any reason you would like to remove that question, please press star followed by two. Again, to ask a question, press star one. As a reminder, if you are using a speakerphone, please remember to pick up your handset before asking your question. We will pause here briefly as questions are registered. The first question is from the line of Brett Rabaton with Hodvay Group. Please proceed. Good afternoon. Wanted to start with the buyback. And first, I think you had the $25 million authorization. How much is left and then how much or how active you think you might be this year, just given the opportunity with the stock where it is presently? Thanks. Brett, we're in the market, have been since the first of the year, buying on average about 4,000 shares a day. and intend to continue that. Would you have an idea, David, of how much you might purchase this year or a targeted capital ratio or how to think about the volume that you might do this year? Well, targeted capital ratio, we want to stay pretty close to that 8% level. So as Ken said, there's a little noise here in the first quarter, so we'll definitely be in that $4,000 range, probably the same for the second quarter, and then we'll figure out as things start to come our way in the second half of the year. We're forecasting out of the 25 million, probably by year end, getting to 20 million in buybacks. Okay. But we, obviously, it's a balancing act, as you said, between TCE and share buyback, too. Okay. And then you've made some progress on the fintech front and just wanted to make sure I understood the implications of the two that you've got and then Treasury Prime as well as the two fintechs in the pilot phase and the four others that could be soon. Can you give us any color? You gave us a lot of color on expectations for various metrics. Any thoughts on what those fintechs might contribute or how to think about that this year? Well, the one that we discussed in there that came live back in November ramped which is the National Credit Card Program. We're doing their bill payment services, and between November and now, we've converted about 30% of their customers onto our side. So that $10 million a day we're clearing in payments should go up to $30 million plus a day in the next few months. The deposit balance offsetting from them is going to triple down the same way we have a clearing account. The two that are in pilot phase, one is a small business payroll system, and the other is a neobank that's launching and in pilot phase with kind of friends and family side of things that we hope to come live maybe beginning of the second quarter. So our overall forecast being pretty conservative, on the rollout of this stuff is probably about $1 million this year in income, somewhere $750,000 to $1 million in income from the fintech side, and a couple hundred million in pretty low-cost deposits to kick it off. The neobank could be a home-run hit. It's backed up by some phenomenally strong VCs on the West Coast. That one could be an out-of-the-park play. Like I say, it's stable, it's running, and we're really looking forward with Treasury Prime. They got a couple good candidates for us. We're doing the final phase of testing on the, I think, the credit card portion of their interface, and we'll be live with them hopefully in the second quarter with one or two opportunities as well. Okay. And if I could sneak in one last one on the loan growth, the construction growth specifically Where might you guys be on a risk-adjusted basis to capital? Are you close to 100%? And how much growth would you expect from here in the construction portfolio? Oh, we won't even be close to the 100%. Because remember, that's done at the bank level, Brett. So I mean, we got well over half a billion in capital at the bank. But we do, you know, obviously we expect, you know, we do have our construction team had a great year this year with originations and those will fund. You know, we actually pulled forward some of that funding this quarter as some deals started to fund earlier than we expected. But, you know, we expect, you know, next year, I guess the good part about from the construction piece is that, you know, historically we've had a, you know, maintain balances in the 50 million-ish range revolving around residential land development here around in our home market here. But as we built out construction, I mean, we're really starting from a low base. So, you know, even if we hit our targets for next year, the construction portfolio is still under 10% of the total loan portfolio and, you know, well under capital limits. Okay. Great. Thanks for all the color. Thank you. Thank you, Mr. Robinson. The next question is from the line of George Sutton with Craig Howland. Please proceed. Thank you. I just wondered if you could walk through the decision to exit the mortgage business versus just pulling it back to a smaller level, being able to reenter the market when that seemed to be the right thing to do. George, we probably spent the last 60 days doing all kinds of configurations of cutting back on sales, marketing efforts, staffing, trying to hold a shell together. There was just no way to get there. We couldn't even get it close to a break-even basis. So staring at a solid 6 million potentially plus in losses over the next three years, And no idea, I mean, that's as far forecasting out as Fannie and Jenny and everybody's doing. They don't even know come 2026 whether mortgage is going to rebound or not. Consumers are getting used to a 6% interest rate, assuming that's all they can get. But it fell off so dramatically that we just couldn't make sense out of it to have that kind of a loss for that long a period of time. And the sad part about it on the other side, when mortgage is going great, the market doesn't give us credit for it. And when mortgage is bad, everybody yells at us. So it's kind of one of those products where you're damned if you do, damned if you don't. So it was, believe me, from my perspective, probably the toughest business decision I've made in my 40-year career. It's been a tremendous group of individuals, loved working with them for some of them now almost 16 years. And... It's tough. It is really, really tough. As you know, the market nationally is just blowing up, so there's not a lot of great opportunities staring them in the face in the industry they've been a part of for years. Mortgage has been cyclical. I've been around it now for close to 25 years, and I've seen three or four cycles, but this is by far the worst that I've seen. in my lifetime and probably the worst we've seen in the country in 40 to 50 years. I appreciate that perspective. One other thing, Ken mentioned you're doing this active buyback, which we love to see, but you mentioned you're doing it in part because you're well below what you define to be your franchise value. I just wanted to see if we could get a picture into what you believe your franchise value to be. Well, at the very least, from my perspective, franchise value should be book value. And that's almost on $40. We'll be $40 by the end of the year. And when we're below that, I think it's good use of capital. We don't want to put ourselves in a bad position, obviously, with TCE and capital risk out here. But again, the quality of our portfolio, who knows, six months from now, we might be in a full-blown recession and the walls are coming down. But from everything we see and what we know of what we're doing today, we're comfortable to, we're below 40 bucks to keep buying back shares. We think it's a great use of capital. Perfect. Thanks, guys. Thanks, George. Nice talking to you. Thank you, Mr. Sutton. The next question is from the line of Nathan Race with Piper Sandler. Please proceed. Yep. Hi, guys. Good afternoon. Hey, Nate. Hey, Nate. I apologize, I got on a little late. As you're going through, Ken, your comments around the margin outlook for the first half of the shooting, you know, we get the grades twice between now and then. Hey, Nate, you're cutting out. Yeah, Ken, I apologize. I was just wondering, can you hear me any better? not really yeah we get about every third word i'll i'll call back in sorry about that okay thank you thank you mr race the next question is from the line of john rodas with janie please proceed hey good afternoon guys hey john um Ken, you said, I think you said, you know, in your discussion, your comments about loan growth, you said loan growth for 23 would be less than 22. Loans were up, I think, by my math, 20, 21 percent in 22. I mean, can you narrow down the growth a little bit more? I mean, are we talking 10 to 12 percent? Are we talking 15 percent? Or what are we sort of talking about? No, overall, John, we're probably talking in the range of 5 to 7 percent. And maybe I'll just elaborate on that a bit. I mean, we have, you know, as we talked about focusing, kind of remixing the composition of the loan book. I mean, we still have within construction and SBA and franchise and consumer, we still have some great opportunities to put on, you know, higher rate and variable rate. And in both cases, both the variable rate are higher rates. But a lot of that financing is going to be done through amortization and cash flows from other parts of the portfolio. There's just some of our lending areas right now, the market is so, the competition still has rates very, very low that just don't work for us. So we're going to see, I mean, there's probably, you know, there's probably in combination within, say, residential mortgage and some other areas that there's going to be roughly $250 million of lower balances year over year. So again, a lot of that focus on the higher yielding asset class is just going to be a reshuffling of the loan book, if you will. One of the other issues out there, John, is on the consumer lending side, we had tremendous growth in the RV horse trailers last year. A lot of that was pent up demand because of the pandemic. and the demand for those units. Elkhart, Indiana and Northern Indiana is kind of the heartland for the RV industry. Their pipelines are getting caught up. They're getting back to normal sales activity. I think fourth quarter 22 versus fourth quarter 21 sales are down 26% or thereabouts close to 30%. So that's going to drop down tremendously too over the course of the next year. We were up you know, 200 million plus over 21, and that'll fall off. So as Ken said, between repayment of existing, again, the healthcare portfolios and a total wind down and repayment status, we're still going to do a lot of volume of new loans, but the overall balance sheet growth is not going to be that huge. Okay. And then, Ken, the securities portfolio was down, I think, 10%, 12% this year. Would you expect sort of a similar amount next year just to fund that loan growth too? Well, yeah, I mean, we'll probably got to keep it. We got, we kind of got to keep it somewhat flattish a bit or, or perhaps down a little bit because, you know, right now we, we still have to maintain a certain amount of liquidity on the balance sheet, but I'll tell you right now, you might, we might be better off just keeping it in cash at fed funds than, than buying mortgage backs. Yeah. So I would expect, you know, probably you might see higher cash balances at quarter ends than what you've seen here maybe in the past couple quarters. Okay. And then, Ken, just a couple of other quick notes. On your expense guidance, you said up 2.5% to 3.5%, excluding the $3.3 million. Is that based on total expenses for the year, so $73 million? Yeah. Yep. Yep. And then I'm sorry, just, I was trying to write while you were talking, but on spread it net interest income, I think you said the first quarter sort of flat with the fourth quarter and then sort of stable for the first three quarters. Is that right? Yes. Okay. And then, and then I guess you would expect to see some ramp in the fourth quarter is what you said. Yeah, that's what we said. We'd like to, yeah, we think as, you know, assuming the Fed hits the terminal rate and keeps it there, that deposit costs will stabilize and we'll be able to start kind of net interest income will begin to start growing again in the fourth quarter. Okay. Okay. Thank you, guys. All right. Thanks, John. Thanks, John. Thank you, Mr. Roadhouse. The next question is from the line of Tim Switzer with KBW. Please proceed. Hey, good afternoon. I'm on for Mike Pareto. Thanks for taking my question. Yeah, nice to talk to you. You got the tough job, Tim. Yeah, yeah, I do. I had a clarifying question first real quick. You mentioned $250 million of lower balances year over year. and like the uh you know some of the portfolios that are paying off was that in reference to the residential mortgage portfolio only or all of like like oh that's that's that's probably spread among three or four different portfolios that's you know resi is going to be down david talked about healthcare finance that's um you know that's basically uh you know we're not originating anything new there I would expect to see balance declines in public finance and single-tenant lease financing as well. Just simply as my comments earlier that some of those markets right now are just so competitive. We got price floors in there, and we might win a deal every now and then, but we're not chasing, you know, we're not doing deals below 7%. So when we can't get that, it's hard. So you'd expect to see some decline in those portfolios. okay yeah i was just making sure that wasn't just the residential mortgage it seems a little fast that's like at the end of the year that's what you're talking about 250. yeah i'm just talking year over year yeah gotcha um and then with all the actions you guys have taken the initiatives you have going on you know the bass program as we look out over the next few years What is like a realistic mix of revenue and do you have a target or anything kind of like spread income versus fee income? Just trying to get an idea of what that could look like over the long term. Well, Tim, if I had a crystal ball that could do that, I could make a small fortune on the predictions. The best world, it was a darling of everybody 12, 18 months ago. Now everybody's question is, should we be in there? And, Two or three American Banker articles in the last couple days, banks should run from the best world in play. There is a tremendous opportunity to do partnerships with great folks like the RAMP organization that we're working with now on the bill pay services. There's a lot of those out there. Obviously, there are banks and fintechs getting in trouble with the regulators because they're not doing the proper due diligence and the overseeing on the compliance issues. which is one of the reasons we were a little slower to market than a lot of other people because we wanted to make sure we had the house in order and we could handle it. Our prior acquisition opportunity would have given us a great team. We had to build that. So we're very thoughtful, very judicious. I've used the term several times on the calls that we're kissing a lot of frogs to find the princess. And we thank very good companies in the pipeline. The one I talked about a minute ago, the neobank could be the unicorn that just blows up, and that's deposits, that's fees, that's lending income. There's just a ton of things that could come out of that. Probably that half a million to a million in revenue for 23 That might be a little bit to the conservative side with some of the things that are in signed, sealed, and delivered in the pipeline, but we'll have a better handle on that as the year goes by. And again, we see how the market shuffles. There's some other institutions that might have to exit from some of their programs, and we could be in position to pick up some very well-established customers just because they got into regulatory issues. that we could pick up and move forward. So we probably can't give you much more guidance than that kind of half a million to a million in revenue this year. And as these come on and we get a handle for how they're going to grow and go, we'll have better numbers. We'll update you on a quarterly basis. Great. Yeah, no, that's helpful. A lot of good info on there. And if I could ask one more, or you maybe need to crystal ball too, but like what is sort of a realistic expectation for how these BAS deposits can help on the funding side? I know it's still a small part of your business right now, but what is sort of the cost range these deposits are coming on at? Are they priced at Fed funds minus something? Yeah, I would tell you historically a lot of the BAS funds were zero cost, but much like HOA dollars, much like $1031, all these funds that historically have never cost an institution anything. These folks are getting very smart. The vast companies, the fintech companies, all have to make a profit. And for them to continue to survive and get VC money, they have to show a path to profitability. So where they were giving away the deposits and didn't have any value to them, they now know they do have value. I would say ours are somewhere between Fed funds minus 50, minus 75. Most of them are not above Fed funds. But yeah, it's not free money. But I'd say, well, I can't take that back on the other side. The two accounts that Ken talked about are both free. If it's a settlement account where we're just drawing funds for payments against them, those are still free. But if we get deposit base with the neobank, that's probably going to be somewhere in the range of Fed funds minus 50, minus 75. Gotcha. That's great. Really helpful. Thank you, guys. Thanks, Tim. Okay. Thanks, Tim. Tell Mike we said hi. I will. Thank you, Mr. Slitzer. The next question is a follow-up question from the line of Nathan Race with Piper Sandler. Please proceed. Yeah, hi, am I coming through okay? Hey, you're so clear, Nate. So far, Nate. Okay, good to hear. A lot of my questions have been asked and answered at this point, but just wanted to think about kind of the reserve trajectory, maybe on a percentage or absolute dollar basis after the CECL adjustment in the first quarter. I guess I'm just curious about if you guys have seen any major charge-offs on the horizon or how you guys are kind of thinking about the reserves trajectory over the course of 2023? Well, I guess the question on the horizon is no. You know, we continue to, you know, try to stay on top of the portfolio and, you know, have all of our teams and credit admin looking at things real closely given the uncertainty and You know, if you, you know, that's why I kind of threw the number in with everything we released, just so, you know, you guys out there would see that the reserve is going to go up, you know, call it to, you know, in the, you know, 98 basis point range or so, 98.99. I guess what I would also add to that, though, is most banks, especially banks our size, don't have a, you know, 20% of their loan portfolio that is in public finance. That is, we've never had a credit loss, never had a delinquency, and the coverage ratio for that portfolio, because of its nature and sources of repayment, is very low. When you exclude the public finance portfolio, the coverage ratio is closer to 115 basis points. So I think even though, again, maybe credit losses, the unforeseen, none of us have a crystal ball, maybe credit losses or net charge-offs tick up a little bit, but I think, you know, with, you know, the increase in where we're at with the increase with CECL plus factoring in what the coverage ratios are in our commercial lines and consumer lines, I think we feel pretty good about where that coverage is. Okay. Great. That's all I had. I'll step back. Thank you. Great. Thanks, Shane and Nate. Thanks for calling back. Thank you, Mr. Brace. Once again, to ask a question, press star 1. The next question is a follow-up question from the line of Brett Rabitin with Havde Group. Please proceed. Hi. I just wanted to follow up on a couple topics, if I could. One, on the link quarter increase in loan yields and funding costs. I guess first, the 45 basis point increase in loan yields in the first quarter. Can you talk about how many loans or the bucket of loans that's repricing in the first quarter? How do you get to that 45 basis points? I guess it's the first part of that. Well, I mean, it's a combination, Brett. We do have You know, construction, I mean, if you figure that, you know, right now the market's got a couple Fed increases in there, because you're talking about 23, correct? Correct. Okay. Yeah, I mean, between, you know, our construction portfolio is virtually, you know, all variable. The SBA is virtually all variable. There's a component of CNI that's variable. And we also have pipelines in franchise finance that, again, that pipeline continues to remain strong. Those yields now are coming on, you know, high sevens, eights, and nines in some case. And, you know, again, we're not really lending in certain other areas unless we can get really good pricing. So it's, you know, it's continued higher yields. new production, lower yielding stuff, you know, paying off or just amortizing cash flowing. So it's just, it's a combination of all those factors that should continue to drive the overall portfolio yield higher. The other issue that's going to make it a little stronger in the first quarter, Brett, is a lot of those loans that we added in the fourth quarter came on in the last two weeks. Everybody was trying to get things done before year end. So we'll have a full 90 a full quarter run on those balances, which we only had them for the last five to seven days of the fourth quarter. So that's part of that boost too. Okay, that's helpful. And then the same sort of topic on the funding side, the 60 to 65 basis points. You know, when I look at the current rates, I see it looks like from an MMDA perspective, you're at 335, maybe retail, and maybe 340-ish on the commercial for that. versus the 289 for the billion four average in the fourth quarter. Can you remind me how much of the money market is retail versus commercial? And then, you know, did those rate, I assume you're kind of thinking those rates have close to have topped out on the money market, but any color on that would be helpful. Thanks. Yeah, the breakdown is roughly one-third commercial, maybe one-third to 40% consumer, and the remainder is commercial. And we do have two tiers of pricing in there. We do have some that are, you know, if your balance is above a certain amount, you're getting a higher rate, but You know, probably the biggest single bucket in there is the, is what we'll call small business and commercial money markets. And those are, the current rate on that's 280. I would say we, you know, again, I know we got a Fed rate hike here coming up in a week or expected, possibly another one. But I would say as of late, the pace of increase has slowed down. I mean, we still kind of run what I'll say pretty high betas through our model. But the pace of increases seemed to slow a bit. So, you know, I don't think, you know, obviously we saw over 100 basis points of increase in the last quarter. Again, think about it, you had 125 basis points of Fed increases in the fourth quarter, whereas, you know, this could be, you know, I guess a minimum of 50 and a maximum of 100. depending on your view on what the Fed's going to do. So, I mean, just by virtue of, you know, what the Fed is expected to do this quarter versus what they did in the fourth quarter, I would, you know, our forecast suggests that the pace of increase shouldn't be as high quarter over quarter as it was last time. Okay. That's helpful. And I guess one thing, probably, Brett, one more thing I'd probably add to that is we We did, as you saw the balance of brokered deposits go up. And I said in my prepared comments, we probably pulled forward some deposit funding as well, just because of where the long rates were relative to, again, the short end of the curve continuing to go up. We took advantage and did some three-, four-, and five-year brokered CDs at a blended rate that's lower than Fed funds. So, you know, some of that is good for long-term interest rate risk, but also good to give us some stability pulling that funding forward as opposed to, you know, trying to go out and do more in the, you know, the Fed Funds Plus wholesale market in the quarter. Okay. And then maybe one last one. I was trying to keep up with the notes. I missed what the commentary around the SBA expectations were. um for the full year any any color on sba and i know that's not necessarily an easy business to predict given you know lower gain on sale margins etc but any color on how much that might contribute to fee income this year yeah i mean the the thing is we still have we we continue to bring on high performing bdos um we brought some on in the later part of the year have staff in place to service and we have originations you know up year over year but I will tell you that from our perspective right now I mean gain on sale premiums in the fourth quarter net gain on sale premiums were very low you know they were in kind of the six and a half 107 range and our forecast we're not making any assumptions that those go up so We're just, and for the full year of 2022, you know, on the front end of the year, we were getting higher gain on sale premiums. We were, you know, getting 110s, 109s, in some cases higher than that, and that came down. So we're, while we do have origination growth for the year, a lot of that is really offset by just assuming lower gain on sale numbers for the full year. So, I mean, we're probably right now modeling that number that we uh you know that we recognized in in uh that for the full year for 2022 we're probably think modeling right now that to be flat to down a little bit but entirely driven by entirely driven by gain on sale premium okay put it into english for you real quick that's 10 and a half million to 11 million right okay thanks guys You're welcome. Thank you, Mr. Robinson. The next question is a follow-up question from the line of John Rodas with Janie. Please proceed. Hey, Ken, just back on fee income. In my notes, did you say fee income down 15% for the year? Is that total fee income? Or did I miss? Yes, that is total non-interest income. So, I mean, still while... Yeah, if you take the 21.3 million for 2022 and just cut that 15%, that's probably where we'll be. That's what we're estimating. So obviously we did have mortgage revenue that's not going to be here this year. And, you know, as we talked about SBA here, you know, being flattish, David did talk about what we think are conservative expectations on some increase from BAS revenue. But for this year, we're forecasting that to be down just by, I mean, the biggest piece is just removing the mortgage number out. Yep. Okay. And then just one other question, Ken. The tax rate kind of made a new low in the fourth quarter. What should we use for next year? Yeah, you know what? I'll guide you back to about 12 to 13. The one reason why the tax rate was low in the fourth quarter is When we do taxes, I will tell you that the calculation isn't necessarily done for a quarter at a time. What we're trying to do is forecast, you know, we use earnings taxable income estimates for the year. And I will tell you, back earlier in the year, in the first couple quarters before the Fed started really rapidly raising rates and, you know, having the subsequent impact on earnings in the back end of the year, our taxes, we were you know, probably we were estimating higher net income. So all it really is, I don't like to use the word true up, but maybe that's the best term I can come up with is that effective tax rate is really what it takes for us to get our taxes in line for the full year. So again, I'd probably just guide you back to the 12 to 13% and think that'll probably be a reasonable estimate. Okay. Thank you guys. Yep. Thanks. Thank you, Mr. Rodas. There are no additional questions waiting at this time, so I will turn the call over to David Becker for any closing remarks. Everybody, I'd like to thank you for joining us on today's call. We'll continue to exercise discipline and use all the tools at our disposal to preserve earnings in 2023. As fellow shareholders, we remain very committed to driving improved profitability and enhanced shareholder value. Thank you again for your time and have a good afternoon. That concludes today's call. Thank you for your participation. You may now disconnect your lines.