Good day, everyone, and welcome to the first Internet Bancorp earnings conference call for the first quarter of 2023. My name is Jason, and I'll be the moderator for today's call. All lines will be muted during the presentation portion of the call with an opportunity for questions and answers at the end. If you'd like to ask a question, please press star one on your telephone keypad. Please note that today's event is being recorded. I would now like to turn the conference over to Larry Clark from Financial Profiles. Please go ahead, Mr. Clark. Thank you, Jason. Good day, everyone, and thank you for joining us to discuss First Internet Bank Corp's financial results for the first quarter of 2023. The company issued its earnings press release yesterday afternoon, and it's available on the company's website. In addition, the company has included a slide presentation that you can refer to during the call. You can also access these slides on the website. Joining us today from the management team are Chairman and CEO David Becker, and Executive Vice President and CFO, Ken Lovick. David will provide an overview, and Ken will then discuss the financial results. Then we'll open the call to your questions. Before we begin, I'd like to remind you that this conference call contains forward-looking statements with respect to the future performance and financial condition of First Internet Bancorp that involve risks and uncertainties. Various factors could cause actual results to be materially different from any future results expressed or implied by such forward-looking statements. These factors are discussed in the company's SEC filings, which are available on the company's website. The company disclaims any obligation to update any forward-looking statements made during the call. Additionally, management may refer to non-GAAP measures, which are intended to supplement but not substitute the most directly comparable GAAP measures. The press release, available on the website, contains the financial and other quantitative information to be discussed today, as well as a reconciliation of the GAAP to non-GAAP measures. At this time, I'd like to turn the call over to David. Thank you, Larry. Good afternoon, everyone, and thanks for joining us today as we discuss our first quarter 2023 results. Before we walk through the financial and operating results for the quarter, I would like to start with some comments regarding the sustainability and resilience of our business in light of the stunning external events during March and the challenges faced by the banking system. You'll find these points on slide three in the earnings presentation. First, continued outflows of deposits from the banking sector during the quarter have brought deposit retention and liquidity to the forefront. Of course, Internet Bank increased deposits by $181 million, or 5.3% from year-end. Earlier in the quarter, we took advantage of consumer demand for CDs and brought in over $200 million in new CD volume, allowing us to build liquidity at pricing below forecasted increases in the Fed funds rate. The demand for CDs remained fairly strong later in the quarter as well, and we also had the opportunity to increase certain larger deposit relationships. This calculated growth allowed us to easily absorb a decline in money market balances, some of which was due to outflows to money center banks in the U.S. Treasury market. While we experienced a modest decline in deposits from mid-March to quarter end, balances have rebounded and are up $135 million thus far in the month of April. As of March 31st, nearly 75% of our deposits were covered under FDIC insurance. The percentage increases to over 80% when you exclude public fund deposits that are either insured or collateralized and other deposits under contractual agreements. Despite the volatility in the banking industry during March, on-balance sheet liquidity remained strong, and we did not need to access any additional borrowings from either the Federal Home Loan Bank or any of the new emergency facilities established by the Federal Reserve in response to the events during March. Another hot topic at the moment is office commercial real estate exposure. Within our commercial portfolio, office exposure is limited to suburban and medical offices. There is no central business district exposure. And overall, it represents less than 1% of our total loan portfolio. Our capital levels remain strong, with tangible common equity to tangible assets of 7.47%, and a common equity tier one capital ratio of 10.35% at quarter end. Our securities portfolio has not been immune from the impact of higher interest rates. However, regulatory capital ratios remain well above minimum requirements, even after adjusting for unrealized losses in the securities portfolio. We did not go all in on buying securities back in 2020 and 2021 with excess liquidity when rates were an all-time low. As a result, total unrealized security losses only represent 13.3% of our tangible shareholder equity at quarter end. Furthermore, tangible book value per share was relatively stable at $39.43. This brings me to our financial and operating results, which are highlighted on slide four of the presentation. For the first quarter, 2023, we reported a net loss of 1.3 million and deleted loss per share of 14 cents. The loss for the quarter can be largely attributed to two events. First, we had a partial charge off of a $9.8 million commercial and industrial loan based on events we learned of after the end of the quarter. The partial charge off was $4.7 million, which amounts to a per share impact of $0.41. I will come back to this loan and to credit quality generally in just a moment. Our results for the quarter also include 3.1 million of mortgage operations and exit costs and about 100,000 of mortgage banking revenue. In January, we announced our plan to exit this line of business. We have completed substantially all originations that were in the pipeline and costs associated with winding down the line of business were generally in line with our guidance and had a per share impact of 26 cents. Adjusted for these two discrete items, net income was $4.8 million and earnings per share were $0.53, which was in line with analysts' expectations. In terms of our core operation, the performance for the quarter reflects the execution of our strategy we discussed last quarter. First, we focused on controlling what we can control, and so we looked to expenses. Excluding mortgage costs, operating expenses across the organization declined 3.3% from fourth quarter of 2022. We have also focused on positioning the loan portfolio to generate increased revenue in future periods. With variable rate lending in construction, investor commercial real estate, and SBA. And higher yielding fixed rate lending in franchise finance and consumer lending. During the quarter, the weighted average yield on new fund originations was 7.76%, which was up 161 basis points over the fourth quarter of 2022. As the composition of the loan portfolio continues to migrate towards a more favorable mix of variable rate and new production at higher rates, we continue to believe that we will be well positioned to achieve higher earnings and profitability in future quarters once the Federal Reserve hits its terminal debt funds rate. Commercial loan balances were up $89 million, or 3.3%, compared to the prior quarter as cash flows from longer-term fixed-rate products were redeployed to support growth in franchise finance, small business lending, and construction and investor commercial real estate. Consumer loan balances increased $23.1 million, or 3.1%, compared to the prior quarter as trailers, RV, and other consumer loan production remained solid despite the higher interest rate environment. With regard to asset quality, I would like to provide some more color around the CNI loan that we partially charged off. This particular account is a participation through a program we have been a part of for about nine years that allows smaller banks access to the leveraged loan market. Historically, these loans have performed exceptionally well for us with only about 20 basis points of cumulative losses over the nine-year period up to this point. This loan began to demonstrate some weaknesses and was moved to non-accrual status late in the first quarter. Our credit team is highly engaged with the program manager on resolution strategies the borrower and the lending group are evaluating. Subsequent to quarter end, we were made aware of developments related to these resolution efforts, that made it clear, in our opinion, the loan was impaired, which resulted in a partial charge-off. Through this program, we had only $11.8 million of other loans in addition to this credit outstanding a quarter in, $2 million of which has been paid off in full in April. The remaining credits are performing well, and we see no signs of potential problems on the horizon. Despite the developments on this particular loan, our overall levels of non-performing loans, two total loans, of 32 basis points to non-employment assets to total assets of 24 basis points are still relatively low compared to the rest of the banking industry. Furthermore, delinquencies 30 days or more past due declined during the quarter at 13 basis points, while net charge-offs, excluding the effect of the partial C&I charge-off, remained low at three basis points of average loan balances. To wrap up the credit discussion, I want to emphasize that we believe that participation credit discussed earlier is an isolated incident within our portfolio. The less than $15 million now outstanding loans from this program represent a very small portion of our portfolio and, again, have historically performed extremely well. Speaking to our credit standards generally, our disciplined underwriting standards have remained consistent over time, regardless of market conditions. We remain confident in the high quality of our loan portfolio as evidenced by the continued low levels of delinquency and net charge-off. Turning back to the operating highlights, our SBA team had an outstanding quarter, posting its highest level of quarterly gain on sale revenue to date, which was up over 40% compared to the prior quarter on increases in both sold loan volume and net gain on sale premiums. Our SBA pipeline has continued to build, which is a testament to the high-performing team we have put together, and it leaves us confident that we will achieve the growth targets we have set for them. Lastly, I want to provide an update on our banking as a service and 10-deck partnership initiatives. Programs that were in pilot are now live and gaining momentum. We have a dozen programs either live or preparing to go live when their platform partners increase. From the total deposit standpoint, we now have over $80 million of banking as a service deposit. Program fees contributed $125,000 to non-interest income during the quarter will grow as more programs go live on the platform. Additionally, our partnership with the platform Treasury Prime continues to move forward. Similar to our partnership with Increase, we are looking at new opportunities regularly as we get ready to go live with Treasury Prime. To wrap up my prepared comments, I want to reiterate that we are focused on controlling what we can control to build an earnings stream that is resilient to changes in the economic and interest rate environments. We have a strong balance sheet, well capitalized, allowing us to withstand the challenges of an uncertain economy. Like you, members of the board and the bank's senior leadership team are shareholders. We are committed to improvement in our financial performance in order to create shareholder value. With that, I'd like to turn the call over to Kim for more details of our financial results for the quarter. Thanks, David. Now turning to slide five, David covered the highlights for the quarter from a lending perspective, so I will just add some additional color. In line with our focus on higher yielding asset classes, we were pleased to see that our first quarter funded portfolio loan originations continued to increase from the fourth quarter. Because of the fixed rate nature of some of our larger portfolios, there is a lagging impact of the higher origination yields on the overall loan portfolio. However, these originations should have a positive impact on the loan yields in future periods. Our SBA, construction, and franchise finance channels continue to have healthy pipelines. Our intent is to fund the majority of this production using cash flows from other loan portfolios as we continue to rebalance the composition of our total loan book. Moving on to deposits on slides six through eight, for the quarter, our deposit balances were up $181 million, or 5.3% from the end of the fourth quarter. As David mentioned, early in the first quarter, we took advantage of strong consumer and small business demand and pulled forward deposit growth, primarily with CDs, which increased $296 million from the prior quarter, locking in rates ahead of the expected March Fed rate hike. Additionally, brokered deposits increased $69 million from the end of 2022 as we proactively expanded existing contractual deposit relationships with certain customers and issued long-term fixed-rate callable brokered CDs. Non-maturity deposits, excluding BAS deposits, decreased by $227 million compared to the linked quarter. with money market accounts non-interest bearing and interest bearing demand deposits declining $165 million, $35 million, and $23 million, respectively. We estimate that about half of the decline in money market balances was the result of outflows of uninsured deposits in mid-March, while the other portion of the decline was considered to be business as usual from our commercial and small business customers to fund ongoing operations. The decline in non-interest-bearing deposits was due primarily to drawdowns from commercial real estate development and construction clients contributing equity to projects we're financing, while the decline in interest-bearing demand was due to normal activity associated with the municipal deposit relationship. We more than doubled our BAS deposits, which increased from $40 million at the end of 2022 to $82.4 million at the end of the first quarter. As a result of all the deposit and interest rate activity during the first quarter, the cost of our interest-bearing deposits increased by 79 basis points from the fourth quarter. Looking at slide seven, at quarter end, we estimate that our uninsured deposit balances were $950 million, or 26% of total deposits, down from 33% at the beginning of the year. This decrease was driven primarily by the decline in money market balances conversions to reciprocal deposits, and the drawdowns on construction-related non-interest-bearing balances. Included in the uninsured balance total are Indiana-based municipal deposits, which are insured by the Indiana Board for Depositories and neither require collateral nor are reported as preferred deposits on the bank's call report, as well as certain larger balance collateralized public funds and accounts under contractual agreements that only allow withdrawal under certain conditions. After adjusting for these types of deposits, our adjusted uninsured balance drops to $695 million, or 19% of total deposits, comparing favorably to the rest of the industry. Moving to slide eight, at quarter end, we had total liquidity of $932 million, including cash and unused borrowing capacity. With the deposit growth since quarter end, we have increased cash balances by an additional $100 million. Currently, our cash and unused borrowing capacity represent 109% of total uninsured deposits and 149% of adjusted uninsured deposits. So we continue to feel comfortable that we have the ability to meet any future customer liquidity needs if they arise. As David noted earlier, total deposit balances declined modestly from mid-March through quarter end, and have since rebounded up $135 million through April 20th. Turning to slides nine and 10, net interest income for the quarter was $19.6 million and $21 million on a fully taxable equivalent basis, down 9.7 and 9.1% respectively from the fourth quarter. Our yield on average interest earning assets increased to 4.69% from 4.4% in the linked quarter due primarily to a 24 basis point increase in the average loan yield, a 36 basis point increase in the yield earned on securities, and a 94 basis point increase in the yield earned on other earning assets. The higher yields on interest earning assets combined with growth in average loan balances produce strong top line growth in interest income, increasing 13.9% compared to the linked quarter. Deposit costs, however, increased at a faster pace, resulting in the decline in net interest income. We recorded a net interest margin of 1.76 in the first quarter, a decrease of 33 basis points from the fourth quarter. Fully taxable equivalent net interest margin was also down 33 basis points to 1.89% for the quarter. This was down from the range we provided on last quarter's call for a couple of reasons. The primary one being the impact of pulling forward deposit growth and building liquidity with CDs. Additionally, average commercial loan balances, specifically construction and CNI loans, came in a bit lower than our forecast, which impacted top line loan income. The net interest margin roll forward on slide 10 highlights the drivers of change in fully tax equivalent net interest margin during the quarter. Looking ahead, with higher price new loan originations and variable rate assets repricing higher, we believe that we will deliver another increase in total interest income for the second quarter. Currently, we expect the yield on the portfolio to be up around another 15 to 20 basis points for the second quarter. We also expect deposit costs to increase given forward rate expectations based on the Fed's continued language regarding rates and inflation, as well as the effect on deposit pricing following the events of March. The pace of increase will depend heavily on price competition as deposits continue to leave the banking system. Given the expectations for higher short-term interest rates in the near term, we anticipate the net interest margin and net interest income will contract further in the second quarter, although not at nearly the same pace as the past two quarters and are expected to increase thereafter. Turning to non-interest income on slide 11, non-interest income for the quarter was $5.4 million, down $400,000 from the fourth quarter. Gain on sale of loans totaled $4.1 million for the quarter, up 42% over the fourth quarter, and consisted entirely of gains on sales of U.S. Small Business Administration 7 guaranteed loans. Our SBA team continues to perform well as sold loan volume increased 16.4%, and net premiums were up over 150 basis points as well. Other income totaled $400,000 for the first quarter, down $1.2 million compared to the linked quarter due to distributions received on our fund investments in the fourth quarter. Mortgage banking revenue totaled less than $100,000 for the first quarter, as we began to wind down our consumer mortgage business in late January. Moving to slide 12, excluding $3.1 million of mortgage operation and exit costs, non-interest expense totaled $17.9 million for the first quarter, declining $600,000, or 3.3%, compared to the linked quarter. Excluding the mortgage operations and exit costs, Salaries and employee benefits expense decreased by $800,000 compared to the linked quarter due to lower incentive compensation and bonus accruals. Now let's turn to asset quality on slide 13. David covered the major components of asset quality for the quarter in his comments. I will just add some color around the provision and the allowance for credit losses. The provision for loan losses in the quarter was $7.2 million. up from $2.1 million in the fourth quarter of 2022. The increase in the provision was largely driven by the partial charge off of the C&I participation loan, as well as growth in the loan portfolio and changes in certain economic forecasts that impacted qualitative factors, quantitative factors related to the allowance for credit losses in certain portfolios. The allowance for credit losses as a percentage of total loans was 1.02%, as of March 31st, compared to 91 basis points as of December 31st. The increase in the allowance for credit losses reflects the day one CECL adjustment of $3 million, which was in line with the estimate we provided last quarter. The increase also reflects the portfolio growth and the impact of economic forecasts mentioned earlier. With respect to capital, as shown on slide 14, Our overall capital levels at both the company and the bank remain strong. Our tangible common equity ratio declined 47 basis points to 7.47% due to the combination of share repurchase activity, the day one CECL adjustment, and the reported net loss for the quarter, partially offset by the decrease in the accumulated other comprehensive loss as securities valuations improved since year end. During the quarter, we repurchased 161,691 shares of our common stock at an average price of $24.50 per share as part of our authorized stock repurchase program. In total, we have repurchased $36.2 million of stock under our authorized programs to date. As a result of share repurchase activity, tangible book value per share remained relatively stable at $39.43 at quarter end. Before I wrap up my comments, I would like to provide some additional comments on components of forward earnings. As we discussed on the expense side, excluding the impact of mortgage, total non-interest expense was down 3.3% compared to the prior quarter. Along the lines of controlling what we can control, we do have levers we can pull to control expense growth and expect full year 2023 total non-interest expense to be in the range of $72 to $74 million, which is a little lower than the previous guidance. Related to non-interest income, our solid performance in the first quarter sets us up to outperform the guidance provided on last quarter's call. For the full year 2023, we now expect total non-interest income to be in the range of $19 to $21 million, which is up from our prior guidance. Our revised outlook reflects increased SBA origination and loan sale volume and modestly higher net gain on sale premiums. We expect the next several quarters may continue to provide a level of uncertainty from an earnings perspective due to where deposit costs may trend and determining the right level of liquidity to maintain on the balance sheet. However, we also continue to remain very optimistic about 2024 and beyond. When the Fed begins to bring rates back down, whether in line with the forward curve expectations or the Fed dot plot, deposit costs should come down significantly with a meaningful and positive impact on net income and EPS. One final area I would like to address is our commitment to preserving and growing tangible book value per share. While the impact of operating in a challenging interest rate and deposit environment may be new to many bank management teams, we have operated successfully with our business model for decades. And along with that, we have a demonstrated track record of building tangible book value per share. Regardless of what interest rate or economic scenario actually comes to fruition, the stability in our business model gives us the confidence that we will continue to build tangible book value per share over the long term. With that, I will turn it back to the operator so we can take your questions. If you would like to ask a question, please press star followed by 1 on your telephone keypad. If for any reason you'd like to remove that question, please press star followed by 2. Again, to ask a question, it is star 1. Our first question is from Nathan Race with Piper Sandler. Your line is now open. Yep. Hi, guys. Good afternoon. Hi, Nate. Hey, Nate. Question just on the margin guidance. I appreciate all the details in terms of kind of the trajectory for 2Q. And it sounds like you guys think you can kind of keep the margin stable in the back half of the year. So I guess I'm just curious what kind of rate environment does that contemplate? Does that just assume the Fed hikes in May and then is on hold from there? And I guess what kind of gives you guys confidence that the deposit pricing pressures may moderate or at least the margin can stabilize with the Fed on hold, 3Q and 4Q? Well, you know, Nate, we, at this point, we're not, we don't, we kind of model out several different scenarios. So we're, you know, again, I think we're in line with, you know, the Fed raising one more time, perhaps another, but perhaps being done with that. But you got the forward curve that says rates are going to come down at the back end of the year. I don't know if we're convinced that that's going to happen, so we look at a few different sets of scenarios. But, you know, I think the wild card, Nate, with deposit pricing and why it's hard to pin it down exactly is you've got the effective interest rates on deposits, but you also have deposits coming out of the system and a scarcity value for deposits. So, you know, as you've seen with your banks and others who've had to go to different different deposit markets than they're used to. I mean, the cost and whether it's Fed funds or spread to Fed funds seems to vary by channel. But I think, you know, as we model it out, once the Fed stops, and again, assuming that, you know, spreads aren't really widening in that, we feel pretty good that the cost of deposits, whether it's the cost itself in percentage terms or the dollar amount, is going to stabilize. It will be stable, and once rates start coming down, whether it's this year or next year, we're going to pick up a lot of leverage on earnings because those deposit costs are going to come down pretty rapidly. Okay. Yeah, one comment I'll add, Nate. We started a little higher than the rest of the folks did in coming into this marketplace. Our rates are higher to begin with. We haven't. Robert Anthony?s iPhone 2?s iPhone 2?s iPhone 2?s Robert Anthony?s iPhone 2?s Robert Anthony?s iPhone 2?s Robert Anthony?s iPhone 2?s And we've increased deposits outstanding without going to the extremes of the market. As he stated, we did not go to any third parties to borrow funds to get it up there. So our world is pretty stable. We've also increased the loan rates on the other side. And we're funding a lot of that activity through repayments from longer term lower cost loans and The real guess and hedge for us is how much liquidity do we need to hold on the balance sheet. We don't have to go back out to additional deposits at this point. We've reeled in CDs and stuff and we'll let it work. And we think the worst is kind of behind us by far. So you have to see what happens. If First Republic blows up, it might send another shockwave through the system and have people clamoring. But yet to be seen. Right. Got it. That's helpful. And just turning to credit, you mentioned in the release, David, that your exposure to similar type loans is very limited. So I was wondering if you could just size up kind of what the participation C&I loan portfolio looks like, what credit quality metrics are trending there in terms of criticized classified trends and so forth. And just maybe if you could shed any more light in terms of some of the uniqueness around this specific charge off in one queue? Yeah, that loan to Bank Alliance, a partnership we've been a part of for nine, 10 years. It was a company that during COVID was absolutely booming. And unlike other companies, when COVID started to go away, they readjusted the business model and slowed down. This company kept building product and got kind of out over their skis on development of product. And it's really the biggest issue they got internally today is phenomenal excess inventory and then spending millions of dollars on consultants trying to figure out how to solve the problem. And that's why it's a good company. We had write-ups from S&P, Moody's. We've been privy to some potential sales discussions about the company. So there is still value there, but it's the management team just did not keep track with what was going on post COVID and wound up getting in over their head. The rest of the loan portfolio, we still have about 4 million, a little over 4 million of this loan on the books. We've got about 10 million in four or five other loans. They've all been on the books for years performing as agreed. I never had a problem. They're all pass except for this one loan is on non-accrual. rest of our cni portfolio and no degradations during the quarter everything is running kind of business as usual so had we not moved this one to non-performing that this one hadn't gone bad we would have actually seen a million dollar decrease in non-performing assets over fourth quarter so literally the bump up in all the statistics is due to this one loan and there's a forecasted you know for the last couple quarters i'm not in the mindset of Jamie Dimon thinking that we're looking at a hurricane, but there would be a tornado or two that might come through and blow them up. And that's exactly what happened on this one. It's a little bit of the interest rate move, but more importantly, it's just somebody that didn't follow up post-COVID like they should have on the operations that got them into trouble. That's very helpful and sounds like just, you know, the broader participation book where you guys are the non-agent is fairly small. Very, very small. We've got a couple of C&I loans that we've done with a couple of other banks in Indiana on some construction, but they're all as agreed. And I couldn't even hazard a guess, Nate, but it's in, I'm going to say 25, 30 million in total exposure on participations with other financial institutions above and beyond Bank Alliance. It's a small number. Okay, got it. And then just maybe lastly, with the mortgage right-sizing seemingly largely behind you guys at this point, how should we be thinking about the tax rate going forward, any other one-time costs in 2Q and beyond? Nate, are you asking if there's any more one-time costs in 2Q and beyond? Yeah, and just the tax rate going forward. Obviously, we have the tax reversal in the quarter. Yeah, well, the first question, no, with mortgage, we took all of our one-time costs in the first quarter. So there should be no more additional costs associated with exiting the mortgage business or any other one-time costs that we see on the horizon right now. You know, I'd say in a more, you know, normalized environment, I'd say that tax rate's probably closer to the 12 to 15 percent that we've had, but you know, with earnings being a bit lower than what they were a year ago. You know, the tax rate, I'm going to tell you, we model internally at 12%, but, you know, reality it's probably, you know, somewhere maybe 9% to 12%, only because it's lower because we get a benefit from the tax-exempt public finance portfolio we have. You know, so as earnings are a little bit lower, the impact of that is much greater. So... um that that's probably the way that i'd look at it okay got it uh i appreciate the color i'll sit back thank you guys thank you thanks nate our next question is from brett rapaton with ovid group your line is now open hey guys good afternoon um i wanted just to start hey, David, just wanted to start strategically and just thinking about the balance sheet options. Is it not under consideration to maybe shrink down some of the balance sheet? Are there loan pieces of the loan book that maybe you could sell and just given the stock price, maybe retrench and buy back more stock or just any thoughts on the strategic opportunities that your stock price here might be giving you relative to the balance sheet. At the current time, Brett, we do intend to continue to stock buyback, particularly at the price of debt today, excluding the Chris Knott too. On the sell-off on some of the balance sheet or point back, if you'll note, if you compare individual categories to last quarter or back into fourth quarter, single-tenant leasing, some of the stuff that we have on the municipal lending, and there are segments of the market that we're out of in total because the pricing is so low it makes no sense for us to compete. When we're bringing in funds at a 4% level and we're putting it back out the door in the 8%, 9%, 10% level through the commercial side, municipal, or excuse me, not municipal, SBA and the consumer, it makes sense to continue, and it's good quality lending. we're not buying business and we're not growing the balance sheet for the sake of growth but if we can get a three to four hundred point spread over what um the cost of the funds versus what we're able to be loaned at we're positioning it we tested the market throughout the quarter to sell segments of the portfolio but we can't justify the hit we would take in the recycle to put it back to work it's If you take that cost of the hit on the loss on the portfolio, we're making a better spread doing what we're doing. So we'll just weather it out. And when we come out the other side, then we'll have value. We could shrink a little bit if we need to, but we're still rock solid on the capital requirements. So we do this kind of business as usual. We've been through these cycles, as Ken stated, several times over the last 20 years. And we survived them all and come out stronger on the other side. And we're going to do that again. Okay. And then from a repricing perspective, can you give us, I think you said, 15 basis points of improvement in asset yield in 2Q, if I caught that right? And just wanted to make sure I had it. Sorry, Brad. That's more like the loan book, 15 to 20%. And I think one of the, I mean, some of that is obviously, that's really no new loan yield generation. That's new loans coming out in the books, not necessarily repricing, if you will. That's just new origination yields being up. Okay. Okay. That's helpful, Ken. And on the CD book, how much do you have maturing in the next two quarters? And it looks like you're paying a little over 5% for the one-year CD, but it looks like your money market rate is actually, you know, 356 on consumer. I'd be curious to hear what it is on the commercial. Yeah, we also pay on... One thing on the money markets, too, if you have a balance above certain amounts, we will pay a higher rate as well. But in terms of what's maturing, say, over the next two quarters, we got about 360 million of CDs maturing with... kind of an average rate, those are going to be rolling off in kind of the, call it 270 to 3% range. Okay. Okay. And then this last one on the BAS platform, how many people have you guys added in compliance? I'm just curious, thinking about that platform and how you've built that out over the past year or so in particular. In the past year on the compliance side, we've added about six individuals, more than doubled the team that we had on board. Part of it was setting the stage, obviously watching some of our peers get in trouble for relying on the third party vendor or the FinTech to do compliance efforts. We knew that wasn't the smart business play. So we built out MoFu technology and bodies internal tracking to be better position for BSA, KYC, KYB, all the regulatory play. And even though some of our FinTech partners do check some of that and kind of comply to banking standards, we double check everything. We have some good automation tools to process the volume and transactions back through. Our proposals and programs were audited by the FDIC and the DFI when they came through last fall. And we've Tad Piper- The comment from one of those it's one of the stronger programs that they've seen internally and things before the bass services so we're we're comfortable that we've got to. Tad Piper- tease cross in the eyes on it and we're continually reviewing and looking at it, but right now, we think it's very strong very stable and we're literally picking up some of the activity we're getting. Tad Piper- folks leaving other financial institutions where they got sideways with the regulators. Okay, that's great. David, that kind of addresses what I was trying to get at, so I appreciate the color there. You're welcome. Once again, if you would like to ask a question, it is star 1 on your telephone keypad. Our next question is from George Sudden with Craig Holland. Your line is now open. Thank you, David wondered if you could just go further on what you were just referring to relative to the fintech update just to take this a little higher level, the idea of creating this was to bring in low cost deposits. Do you feel like this area can achieve that going forward, and can you give us a little bit more detail on the scarcity. Of the deposit sort of importance relative to bringing these potential partners in. George, as you well know in the marketplace today, I don't think there is a free deposit of any kind out there. As we were analyzing and looking at all the stuff in preparation for the call and just getting a handle on our deposits, I'll give you a couple. For instance, we were looking at the first century deal because we were going to get $300 million in cheap deposits from the HOA side of things. Tad Piper- We actually when we went through and did an analysis by sick codes, we actually have more hla deposits on the books today. Tad Piper- than per century had and they're not free, but they are lower level money market, there are services provided with them and we're not reimbursing them for their counting services that they do. a firm that's having performance. So when you put the two together, kind of the net cost for us on those deposits is equal or lower than what would have been at first century. The other side, there's still good money coming in on that end, but all bets are off after the first quarter here. Everybody understands what money market rates are. Everybody understands what the Fed Fund program is today. So we're not paying that. We're getting discounted below Fed funds on everything that's coming in with the vast deposits, depending on services and products. And part of it's in pricing, part of it's in yielded rate. But we're getting them anywhere from 50 points below Fed funds to we really do have some zero-cost deposits. But it's growing quickly. Fee income is coming on strong. We have one group this month. on a monthly basis now we're processing over 500 million in ACH transaction activities so we've got the increased customer base is really getting up to speed quickly and I think the offset with the revenue opportunity and lower cost of funds is what's in the marketplace today I think it's still it's a great model for us and it's a great opportunity and we can scale it pretty effectively in the near term. And I think there's going to be a lot of consolidation going on in the FinTech space. Folks are finding out when they're going for that B and C round of financing, that if they don't have a path to profitability, they need to partner up or they need to do something else. So there's a, It's going to be a lot of shuffling, and as I've said before, I kind of think it's time for FinTech 2.0, and there will be some very strong, good customers, and there's going to be strong, good customers on the market because the banks themselves did not invest. When you take a small community bank that's in vast services and they're opening 1,000 new accounts a month and they don't do 1,000 new accounts in a calendar year as a traditional bank, things are going to blow up on them. So we think we're well-positioned. Is it free money? I don't think there's free money in the industry today, but it is lower cost funds than a lot of the outside sources we have in the fee revenue and the partnerships have real value to us. One other thing, have you put in a reciprocal deposit program? And my assumption is you probably have. I'm just curious the feedback you've gotten in terms of keeping some of those uninsured deposits. We have. We've been part of Intrify for the last couple of years. And obviously, when Silicon Valley blew up, we had virtually no request for it. And it's kind of interesting, the fact that we offer it is taking the edge off a lot of our larger depositors. um i think the last number i saw and do it just is going to be probably two weeks old we have about 60 million 60 to 70 million now that has moved to the enterprise and spread their monies across multiple institutions but again it's still low cost the service fee for that is nominal it's one of those things i think the comfort that we have it available uh kind of took the edge off from the consumer and Some of the deposits we did lose in March, we've regained. That's part of the deposit growth here in April. Some of the customers looking for that have come back to us and spread the money through Intrapod. So it's a nice tool. And again, if First Republic or another big bank goes down, I think it'll be a necessary tool for probably everybody in the industry to retain deposits. But right now, it's more of a safety net than it is a true selling point. All right, good to hear. Thank you both. Thank you. Thanks, George. Once again, if you would like to ask a question, it is star one. Our next question is from Nathan Race with Piper Sandler. Your line is now open. Yeah, I appreciate you taking the follow-up, and I apologize if I didn't catch it in your prepared comments, Ken, but can you guys just remind me kind of what your outlook is for core deposit growth and loan growth over the next couple quarters? Yeah, I think, you know, one of the things, Nate, that we've kind of, you know, that we've talked about a couple times here is You know, it's the concept of kind of remixing the loan book and having the idea that the, you know, I think overall loan balances over the course of the next, you know, two to three quarters really aren't expected to grow tremendously. It's really just more remixing it and using cash flows from public finance and healthcare and single tenant and mortgage to fund growth in construction and ICRE and franchise and SBA and our consumer channels where we're getting, you know, certainly the variable rate portfolios and a little bit more yield. So that's really the way that I would look at it. Okay, so kind of a flat earning asset base, give or take, from the level on 1Q? Yeah, maybe just a, yeah, yeah, a little to maybe some slight growth. But again, it's really the concept of remixing the book organically. versus, you know, growing the overall balance sheet. The only, again, the caveat to that is David said in his comments was, you know, what is the right amount of liquidity to maintain on the balance sheet? Right. You know, because with, you know, unforeseen events going forward, it probably is prudent to maintain more liquidity right now. And as we all know, balance sheet growth isn't really driven by loans. It's driven more by deposits. So that's just the one wild card on that. Yep, understood. Sorry, go ahead, David. One real quick comment on the deposit side need. I know one of the things that the investor community and folks get antsy about, it hasn't bothered us over the years, but when the loan-to-deposit ratio gets north of 100%, everybody gets pretty nervous. So if you want to factor the deposit side of things, we're now in a position where we're under one-to-one, it's still 98%, 99%. But we'll focus on the deposit side to keep us at par with the loans. Loan growth are a little above so that we stay under that 100% loan-to-deposit ratio. And that's how I would kind of model. And as Kim said, I'd see low single digits, 2%, 3% probably max in loan growth in future quarters. Okay, great. Sounds good. Thanks, guys. Thank you. Our next question is from Ross Haberman with RLH. Your line is now open. How are you guys? I just had a quick question I got on late. Could you touch upon any weakness in any of the loan categories which you are beginning to see or like a lot of banks, you're not seeing any Robert Marlayson, cracks yet, thank you. Robert Marlayson, You know Robin at the current time we're not seeing any cracks per se like I said we had the one off on this. Robert Marlayson, Participation loan that we discussed earlier, but the overall delinquency is down this quarter over the last quarter, we do have one rdo property it's a home in Vermont it's less than $200,000 and that's. Tad Piper- Then in foreclosure process for three and a half years, it has nothing to do with the current economy so overall the portfolio and staying solid no pending losses. Tad Piper- Even the SBA world which is kind of new to us and staying phenomenally stable working really solid small business community is doing what they always do they're just knuckling down and keeping the work going on so. Across the board, we're not seeing any cracks yet at all. This one loan is truly a one-off. We're pretty confident that unless the Fed really goes nuts and ratchets those up to a 6%, 6.5% interest rate, which causes some pretty massive unemployment across the country, we're not worried about anything in the portfolio today. Just one follow-up. Could you refresh us? How big is your total loan participation book as percentage of the total loans? Thanks. We have about $15 million through the Bank Alliance program, which is where this one CNI loan was. That's what's left after we took the write-down. And then we said earlier, I think we're somewhere in that range of $20 to $30 million max with other in the state of Indiana that we do a couple of participations with. It's a real small percentage of our book. We like to control our . Go ahead. So you're saying a total of 45 million about in total? Does that sound right? Yeah, in total. Yeah. Okay. No, actually it's about, it's closer to 30 in total. It's about 15 and 15. So 15 with our existing program and another 15 with the partner banks. Thank you very much. Yep. Our next question is from Brett Rabaton with Hove Group. Your line is now open. Hey, thanks for the follow-up. On the buyback, I missed, if you gave it, the remaining authorization, and then just I know it probably depends on a lot of factors, but any kind of broad color on how much you think you might buy back the rest of the year, and if there are capital ratios that would constrain that, that you wouldn't want to go beyond just how you're thinking about to buy back specifically from there. At the current time, Ken, correct me if I'm wrong, but I think we have a little over $19 million left on the $25 million that we started the year with. And we're in the market buying today, and particularly at this price, we'll continue to do that. We're not going to push ourselves below 7%, I guess, if you want to look at a capital marker by buying back the stock. But shy of that, we're in consistently, and we'll stay there when the price is at this level. If it starts to climb back up again, we might re-evaluate in the second half of the year, but we're set to continue buying at this quarter at this price we can't afford not to it's the best use of capital that we have okay and seven and seven percent david is that tce i assume yes yes correct okay okay great thank you Our next question is from Howard Henick with Scurly Dog Capital. Your line is now open. Hey, guys. I have a quick question. I've seen other banks in the past have issues with Bank Alliance loans. I never really understand originating CNI loans in a consortium anyway, because obviously it's in some extent a character loan. Are you still originating loans through Bank Alliance, or is that program shut down? Thank you. I can't tell you the last one we've done with them. It's been several months. Obviously, the experience of this loan has tainted us on the program, but we've been in it nine years, and we've only had 20 basis points of losses over nine years. We obviously don't participate in every loan that they do by any means. We probably, over the years, have looked at maybe one in 20 of what's presented that we would take advantage of. We have not done anything in the last six, seven months. So what's out there today and just kind of that whole leverage market is crazy as the capital markets and the industry is in the future. The economics, we kind of backed off purposely and then taking a hit on this level will make it even tougher for us to make a decision to afford. We got good opportunities with our existing clients and demand out here that we don't have to go to the third party. So. I'm going to tell you, I'm not going to say we would never, ever do another one, but it would have to be Goldman for us to take a look at it. We've got enough opportunity ourselves. We don't need to backfill the balance sheet with any more of their product. Yeah, I agree. Okay, thank you. There are no more questions, so I'll pass the call back over to David Becker. Hello, everybody. We thank you for joining us on today's call. We will continue to use all the tools at our disposal to maintain a strong balance sheet and liquidity position, as well as drive for more resilient earnings going forward. Again, as fellow shareholders, we remain very committed to driving improved profitability and enhanced shareholder value. We thank you for your time today and have a good afternoon. Appreciate it much. That concludes the conference call. Thank you for your participation. You may now disconnect your lines.