at any time. And please note that today's conference is being recorded. I would now like to turn the conference over to Larry Clark from Financial Profiles Incorporated. Please go ahead, Mr. Clark. Thank you, Jenny. Good day, everyone, and thank you for joining us to discuss First Internet Bancorp's financial results for the fourth quarter and full year 2023. The company issued its earnings press release yesterday afternoon, and it's available on the company's website. at www.firstinternetbankcorp.com. In addition, the company has included a slide presentation that you can refer to during the call. You can also access these slides on the website. Joining us today from the management team are Chairman and CEO David Becker and Executive Vice President and CFO Ken Lovick. David will provide an overview and Ken will discuss the financial results. Then we'll open up the call to your questions. Before we begin, I'd like to remind you that this conference call contains forward-looking statements with respect to the future performance and financial condition of First Internet Bank Corp. that involve risks and uncertainties. Various factors could cause actual results to be materially different from any future results expressed or implied by such forward-looking statements. These factors are discussed in the company's SEC filings, which are available on the company's website. The company disclaims any obligation to update any forward-looking statements made during the call. Additionally, management may refer to non-GAAP measures, which are intended to supplement but not substitute for the most directly comparable GAAP measures. The press release, available on the website, contains the financial and other quantitative information to be discussed today, as well as the reconciliation of the GAAP to non-GAAP measures. This time, I'd like to turn the call over to David. Thank you, Larry. Good afternoon, everyone, and thanks for joining us today as we discuss our fourth quarter and full year 2023 results. The fourth quarter was notable for a multitude of reasons, but most importantly, because it showed the meaningful progress and early signs of the tangible financial benefits resulting from our efforts to transform our company and balance sheet over the past few years in order to improve returns for our shareholders. We are a little less than a month away from our 25th anniversary. And while each year brings both triumphs and setbacks, I can honestly say that 2023 was peppered with a greater variety of challenges than the rest. It was this time one year ago that we announced our decision to exit the residential mortgage business a cyclical, transactional, low multiple business. Also in 23, we managed successfully through a very challenging interest rate cycle while also navigating an industry liquidity scare. We now stand poised to benefit as Fed policy looks set to provide a helpful tailwind rather than a headwind to our business. We also effectively turned a battleship and transitioned our loan composition in favor of variable rate and higher-yielding loan products, which have helped to diversify our loan portfolio and significantly improve our interest rate risk profile. Necessary but never easy, these actions have, in the aggregate, improved our balance sheet positioning and financial results and will enable us to continue to drive improvement in our earnings and profitability. Starting with the highlights on slide three, I'd like to discuss some key themes for the quarter. As I said, we continue to transition the composition of our loan portfolio and optimize our overall balance sheet mix. We deployed some of the liquidity we had built up in the previous quarter to drive loan growth of $105 million or 2.8% during the fourth quarter. New funded loan origination yields were 8.85%, relatively consistent with the third quarter and up over 275 basis points from the fourth quarter of 2022. Additionally, deposit costs increased at the slowest pace by far in the past six quarters at just five basis points. As a result, net interest income was up 14%, and net interest margin expanded by 19 basis points relative to the prior quarter. We told you on the last quarterly earnings call that we believed net income and net interest margin had bottomed out in the third quarter, and that has proven to be the case. With our continued focus on improving the loan composition and stabilization and deposit pricing, we are confident that net interest income and net interest margin will continue to trend higher in this calendar year. Another highlight for the quarter was the performance of our SBA business. The team delivered another quarterly record of gain on sale revenue, which was up 8% from the third quarter, driven by another strong increase in both origination and sole loan volume. Our nationwide platform continues to provide growth capital to entrepreneurs and small business owners across the country, with the year-over-year SBA loan originations increasing by almost 140% from the 2022 levels. We generated over 20 million of gain on sale revenue in 2023 from our SBA loan sales, which was up 9 million or more than 80% from 2022. This increased more than offset the 5.5 million of mortgage banking revenue we earned in 2022 from our former direct to consumer mortgage business. We successfully moved away from, again, an over reliance on the cyclicality of the low multiple mortgage business in favor of a more consistent, reliable, and growth-oriented revenue stream that can deliver regardless of the interest rate environment. Our small business pipeline continues to flourish, and we remain among the top 10 most active SBA 7 lenders in the country. Solid loan growth, net interest margin expansion, net interest income growth, and non-interest income powered by record gain on sale revenue drove a nearly 10% increase in total revenues related to the prior quarter. While revenue surged, costs were held mostly in check as non-interest expense increased by less than 2% compared to the third quarter. As a result, we delivered positive operating leverage and a significant improvement in operating efficiency. Credit quality remains healthy overall with non-performing loans to total loans of 26 basis points and non-performing assets to total assets of 20 basis points a year in. Non-performing loans did increase from the third quarter due to additions in small business lending, franchise finance, and residential mortgage, but our ratios still remain well below industry averages. Additionally, delinquencies 30 days or more past due were 31 basis points of total loans, while net charge-offs to average loans remain low at 12 basis points. I would also like to remind everyone that our exposure to office commercial real estate is less than 1% of total loan balances and does not include any central business district exposure. Our capital levels remain sound with a common equity tier one capital ratio of 9.6% and the tangible common equity ratio increasing 30 basis points to 6.94% at year end. Tangible book value per share, a key measure of shareholder value creation, increased 4.7 during the quarter and is up 4.2% year over year. I would also like to point out that the prudent conservative management of our investment portfolio and overall balance sheet has resulted in First Internet being among the few banks to have grown tangible book value per share from the start of this historic cycle of interest rate hikes that began in early 2022. We did slow the pace of share buybacks during the fourth quarter, repurchasing 40,000 shares at an average price of $18.78 per share. For the full year, we repurchased just over 500,000 shares, or approximately 5.5% of our total common shares outstanding at the start of 2023, at an average price of $18.40 per share, a discount of over 30% relative to the current stock price. Now turning to our financial and operating results for the fourth quarter of 23, we reported net income of 4.1 million and a diluted earnings per share of 48 cents in the fourth quarter, increases of 22 percent and 23 percent, respectively, from the third quarter. Total revenue was 27.2 million, up almost 10 percent from the third quarter, driven by the expansion in net interest income. Operating expenses were in line with our expectations, and non-interest expense to average assets remain low at 1.54%. We produced solid loan growth during the quarter, led by our commercial lending areas, where balances were up $98 million, or 13% on an annualized basis, and were up $287 million, or almost 11% for the year. During the quarter, we experienced growth in franchise finance, small business lending, commercial and industrial, and construction lending. This was partially offset by declines in the fixed rate public finance and the healthcare finance portfolio. Our construction team had another great quarter, originating $69 million in new commitments. At quarter end, total unfunded commitments in our construction line of business increased to $540 million, nearly double the $275 million year-end 2022, leaving us well positioned to continue shifting the composition of the loan portfolio towards higher yielding variable rate loans. Our consumer loan balances increased $10 million or 5.3% on an annualized basis compared to the prior quarter and grew by 64 million or 9% on a year-over-year basis. We remain focused on high quality borrowers while rates on new production were consistent with the third quarter and in the mid 8% range. Furthermore, the delinquencies in these portfolios remain very low at just seven basis points. And lastly, I want to provide some commentary on our FinTech partnerships program. In many respects, First Internet Bank was a FinTech itself when we launched in 1999. With a 25-year track record of innovation in financial services that has included partnerships over the years, it was out of our enduring passion to nurture new ideas that we launched our FinTech Partnership Program two years ago. The program is a source of inspiration and energy to all of us at First Internet Bank, and importantly, to our shareholders. It will be accretive to earnings in 2024. Ken will provide some more details here in just a moment. We have a dozen live programs of varying purpose and scope against the backdrop of a $5 billion balance sheet. The FinTech Partnership Program does not amount to a material part of our business today, but we intend for it to be one component of a well-diversified portfolio of business lines, many of which I have already highlighted for you today. I am a lifelong entrepreneur, and one thing I learned from my years as a tech CEO is not to oversell the pipeline. We have a healthy queue of new programs already in various stages of implementation, and our intention is to stay focused there. If some of the programs are not able to meet the requirements to go live, we may bring in a new program. But overall, we expect the number of programs to be pretty flat over the next few quarters. To wrap up my comments, we performed well in the fourth quarter and entered 2024 with momentum and confidence. From a safety and soundness perspective, liquidity and credit quality remain very strong, and the capital levels are sound. With interest rate hikes by the Federal Reserve likely now behind us, we expect deposit costs to stabilize. Combined with the continued improvement in our loan portfolio mix, the positive outlook for our SBA team, and favorable asset pricing, we should be well-positioned to achieve higher earnings and improve profitability in 2024 and beyond. A couple of final thoughts before I turn the call over to Ken. Many of you will recall that First Internet Stock, along with many other bank stocks, fell out of the Russell 2000 Index around the same time of the regional bank failures in the spring. We are keeping an eye out as we head into the reconstitution of the Russell Index this year. Of course, there are certainly no guarantees. But it is possible, given the recovery in the stock price, especially relative to the small-cap universe as a whole, that First Internet stock might again qualify for inclusion in the index. Finally, I want to personally thank our clients and the entire First Internet team, without whom our achievements this quarter and over the past 25 years would not have been possible. And with that, I'd like to turn the call over to Ken for more details on our financial results for the quarter. Thanks, David. Since David covered the loan portfolio, let's jump to deposits on slides five through seven. Deposit balances declined slightly from the prior quarter as we deployed some of the liquidity built up in the prior quarter to fund loan growth and to pay down higher cost broker deposits. Non-maturity deposits were up over $82 million, or 4.6%, due to increases in FinTech partnership deposits and money market balances. Deposits from our FinTech partners were up 34% from the third quarter and totaled $218 million at quarter end. Additionally, these partners generated over $4.7 billion in payments volume, which was up 23% from the volume we processed in the third quarter. Total FinTech partnership revenue almost doubled quarter over quarter to $414,000 with the large majority of the increase consisting of recurring interest income, oversight, and transaction fees. Related to CD activity during the quarter, total balances were down about $19 million from the link quarter. We originated $278 million in new production and renewals during the fourth quarter at an average cost of 5.03% and a weighted average term of 15 months. These were more than offset by maturities of $297 million with an average cost of 4.34%. Looking forward, we have $466 million of CDs maturing in the first quarter of 2024 with an average cost of 4.61% and $337 million maturing in the second quarter with an average cost of 4.81%. So as we noted last quarter, the repricing gap between the cost of new CDs and the cost of maturing CDs is closing, which will contribute significantly to the continued pace of slowing deposit costs. Additionally, as I noted earlier, we used liquidity to pay down broker deposits, which decreased $79 million from the end of the third quarter as we continued to reduce higher cost portions of our deposit base. As we discussed on the prior quarter's calls, Our expectation was that when the Federal Reserve was done raising rates, we should see stability in the cost of our deposit funding. This was the case in the fourth quarter, as the cost of interest-bearing deposits increased only five basis points, which, as David mentioned, is by far the slowest pace of growth over the last six quarters. Looking at slide six, at quarter end, we estimate that our uninsured deposit balances were just over $1 billion, or 25% of total deposits. which is up from $948 million, or 23%, at the end of the third quarter. The increase was due primarily to new customer balances and growth in existing depositor balances. After adjusting for Indiana-based municipal deposits and larger balance accounts under contractual agreements, our adjusted uninsured balances dropped to $774 million, or 19% of total deposits, which compares favorably to the rest of the industry. Moving to slide seven, at quarter end, total liquidity remains very strong as we had cash and unused borrowing capacity of $1.6 billion. As we mentioned a moment ago, we deployed some of the liquidity we built up in the prior quarter to pay down broker deposits and also to fund loan growth. As a result, the loans to deposits ratio increased to 94.4%. At quarter end, our cash and unused borrowing capacity represents 156% of total uninsured deposits and 208% of adjusted uninsured deposits. Turning to slides eight and nine, net interest income for the quarter was $19.8 million and $21 million on a fully taxable equivalent basis, up 14% and 12.9% respectively from the third quarter. The yield on average interest earning assets increased to 5.28% from 5.02% in the linked quarter due primarily to a 26 basis point increase in the yield earned on loans, a 40 basis point increase in the yield earned on securities, and a 27 basis point increase in the yield earned on other earning assets. The higher yields on interest earning assets combined with the growth in average loan and securities balances produce strong top line growth in interest income. increasing over 5% compared to the linked quarter. As deposit costs and average interest bearing balances were up modestly, net interest income grew during the quarter, reversing a trend that began in the second quarter of 2022. Net interest margin for the fourth quarter was 1.58% and 1.68% on a fully taxable equivalent basis in the fourth quarter, both of which were 19 basis points, increases of 19 basis points from the third quarter. The net interest margin roll forward on slide 9 highlights the drivers of change in the fully taxable equivalent net interest margin during the quarter. Last quarter, we told you we believed the third quarter would be the inflection point for net interest income and net interest margin as long as the Federal Reserve rate cycle was near completion. The stability in deposit costs is highlighted in the graph on slide 9 that tracks our monthly rate on interest-bearing deposits against the Fed funds rate. which is a significant catalyst in driving net interest margin expansion going forward. With our focus on improving the composition of the loan portfolio and replacing lower yielding assets with higher yielding and variable rate production, we continue to forecast growth in total interest income in the first quarter of 2024 and throughout the year. Currently, we expect the yield on the loan portfolio to be up around 20 to 25 basis points for the first quarter. Furthermore, with short-term interest rates stabilized and the narrowing repricing gap in CDs, we anticipate only a modest increase in interest-bearing deposit costs, similar to what we experienced in the fourth quarter. Turning to non-interest income on slide 10, non-interest income for the quarter was $7.4 million, consistent with the third quarter, and up $1.6 million, or 27%, over the fourth quarter of 2022. Gain on sale of loans totaled $6 million for the quarter, up 8% over the third quarter, and setting another quarterly record for our SBA team. Loan sale volume was nearly $90 million for the quarter, an increase of over 11% when compared to the linked quarter. We also saw net gain on sale premium stabilize, up a modest 11 basis points quarter over quarter. However, the increase in gain on sale revenue was almost entirely offset by a decline in the net servicing revenue due to a lower fair value adjustment to the loan servicing asset. Moving to slide 11, non-interest expense for the quarter was $20.1 million, up $300,000 from the third quarter. We saw increases in premises and equipment due to a lower property tax accrual in the third quarter. consulting and professional fees due to the timing of third-party loan review and stress testing, and deposit insurance premium as assessments have increased due to year-over-year asset growth and loan composition. These increases were partially offset by a decline in salaries and employee benefits due to lower incentive compensation and lower benefits costs, and lower data processing costs driven by lower variable deposit account opening costs related to lower new CD production. Turning to asset quality on slide 12, David covered the major components of asset quality for the quarter in his comments, so I will just add some commentary around the allowance for credit losses and the provision for credit losses. The allowance for credit losses as a percentage of total loans was 1.01% at the end of the fourth quarter compared to 0.98% in the third quarter. The increase in the allowance for credit losses reflects the addition of specific reserves related to small business lending and franchise finance, as well as loan growth and portfolios with higher ACL coverage ratios. The provision for credit losses in the fourth quarter was $3.6 million, compared to $1.9 million in the third quarter. The provision for the fourth quarter includes the additional specific reserves and net charge-off activity as well as the ACL bill related to the healthy pace of loan growth during the quarter. If you exclude the balances and reserves on our public finance and residential mortgage portfolios, which have modest coverage ratios given their lower inherent risk, the allowance for credit losses represented 1.21% of loan balances. Furthermore, with minimal office exposure, we do not require the excess reserves around that asset class that many other banks have. Moving to capital on slide 13, our overall capital levels of both the company and the bank remain solid. The tangible common equity ratio increased 30 basis points to 6.94%. This was due primarily to the decline in the accumulated other comprehensive loss as interest rates declined during December, as well as net income earned during the quarter. If you exclude accumulated other comprehensive loss and adjust for normalized cash balances of $300 million, The adjusted tangible common equity ratio would be 7.66%. From a regulatory capital perspective, the common equity tier one capital ratio remains solid at 9.6%. At quarter end, tangible book value per share was $41.43, which is up almost 5% from the third quarter. Before I wrap up, I would like to provide some commentary on our outlook for 2024. Our current forecast conservatively assumes that the Federal Reserve maintains a higher for longer outlook and does not lower the Fed funds rate during 2024. We expect loan yields to increase as we continue to remix the portfolio while we expect deposit costs to stabilize. Assuming loan growth in the range of 5% to 6% for the year, we expect that annual net interest income will increase by a minimum of 20% and fully taxable equivalent net interest margin will increase throughout the year and should be in the range of 1.95% to 2% by the fourth quarter of 2024. If the Federal Reserve were to begin reducing short-term interest rates, our net interest income and net interest margin would likely exceed these projections. With regard to non-interest income, as our SBA team continues to grow and deliver consistently higher origination activity, we expect annual non-interest income to be up by at least 30% over our reported amount in 2023. A primary risk to this forecast will be loan sale pricing in the secondary market. While gain on sale premiums stabilized in the fourth quarter, and we are encouraged by pricing received on our January sales, higher interest rates have created volatility in gain on sale premiums, and if pricing were to soften, It may make economic sense to hold a loan yielding 11% or more versus selling for a premium far below the annual spread income we would earn. And of course, a government shutdown would bring a temporary halt to secondary market sales that would impact all SBA lenders equally. In connection with the continued investment in personnel to support the planned increase in the level of SBA originations, as well as additional personnel and risk management and compliance to support our FinTech partnership initiatives. We do expect compensation expense to increase in 2024. All in, we expect annual non-interest expense to be up in the range of 8% to 10%. With that, I will turn it back to the operators so we can take your questions. Thank you. Ladies and gentlemen, we will now begin the question and answer session. Should you have a question, please press the star followed by the one on your touchtone phone. You will hear a three-tone prompt acknowledging your request. Questions will be taken in the order received. Should you wish to cancel your request, please press the star followed by the two. If you are using a speakerphone, please lift the handset before pressing any keys. Once again, that is star one should you wish to ask a question. Your first question is from Brett Rabaton from Hup2Group. Please ask your question. Hey, guys. Good afternoon. I wanted to start with just the funding mix from here and just thinking about you mentioned the fintech opportunities, and those seem to be slightly lower cost than maybe the CDBs. internet rates. Just wanted to see what the outlook was for growth of those deposits. And then it does seem like your cost of funding has kind of gotten close to peaking out. I see on the internet a 535 rate for a one-year CD, so maybe there's still a little pressure left. Can you maybe talk about the funding mix from here? And obviously, if rates do go down, I would assume you'll see some benefit from that in the back half of the year. Yeah, we'll take the CDs and the benefit on the back half of the year. I think in the CD, what we have found here, I mean, in the first quarter here, actually our CD origination, new origination costs have actually come down. What we've seen is actually consumers and small business going out longer on the curve where, you know, the yield curve is still inverted. So we're seeing more, you know, three-year and five-year CD mix than say one year. So our new CD volume is actually coming in around 480 right now. You know, that could change based on the outlook, but that's what we're seeing right now. You know, and certainly in the back end of the year, you know, it's hard to predict when or if rates will come down. But certainly as as the Fed brings, if the Fed were to bring the front end of the curve down, there is a benefit for us. I mean, just kind of as a data point, we have, we got a billion dollars of CDs that are tied in, or not CDs rather, a billion dollars of deposits that are tied in some way directly to Fed funds. So you can kind of do the math on what impact rate declines will have on deposit costs when and if the Fed starts bringing rates down. From that side of things, Nate, Ken made the comment that in his presentation, I can't remember off the top of my head, that we had an increase in the fourth quarter. We have that same capability going forward. As stated earlier, we are still a little bit cash flush. So kind of depending upon loan demand, we can move that number up and down. But you hit the nail on the head. It is very inexpensive. compared to some of the other alternatives for cash. So that'll be kind of dependent on what goes on. We don't want to be in a position to bring in a ton of cash and then have to move it out into the secondary market. So we're paying attention and trying to balance both sides. But you're right, it is less expensive than CDs today. It's on par with our internal money market accounts. It's not as expensive as it was in the first quarter of last year by any means, and most of those higher balances we've been able to run off, and we're kind of at the end of the line on swapping higher rate for lower rate. So it's available to us, and we'll take it as needed, I guess, would be how I'd leave it for you. Okay. And that brings up the second question. You mentioned liquidity and cash. You obviously used some cash this quarter to fund the loan growth. Can you talk about what the right liquidity level is or cash and where you see that number bottoming out or what's a good liquidity ratio for you guys? Yeah, you know, I think as, you know, kind of the things that went on earlier in 23 have kind of settled down. I mean, I think for us a good liquidity number is probably somewhere in the 3 to 350 range on any given day. You know, we have been maintaining slightly higher than that and certainly much higher than that earlier in the year. But that's probably a good balance on a day-to-day basis for us. Okay. Great. If I can sneak in one other, I've got a ton of questions. I'll jump back in the queue. But on the fee income growth of 30%, can you break out maybe how much of that would be SBA versus other sources of fee income, fintech opportunities, et cetera? Yeah, I would say that, you know, probably, well, let's, I would say SBA is forecasted to be up about maybe 25%, but that's obviously the biggest number in there. So that's the biggest driver. There is certainly a fee. There's probably about an additional, I don't know, maybe million dollars of extra income that we're forecasting from FinTech. We also expect to start to get some distributions from some of our fund investments. That's a piece of it as well. But certainly the biggest piece of it is just growth in SBA. Okay. Great. Thanks, Joel Keller. Thank you. Thank you. Your next question is from Michael Perito from KBW. Please ask your question. Hey, guys. Good afternoon. Happy New Year. Thanks for taking my questions. Hey, Mike. Hey, Mike. I wanted to maybe just start building on some of the guide that you guys provided, which was helpful, so thanks for that. But just as we think about the NIM getting to 195.2 by the end of the year, rate cuts, obviously, if they come to fruition, probably helpful on top of that. Can we start kind of getting back in the conversation about like the ROE on the business here and what you guys think we can maybe exit the year at conservatively on that 195 to tune in and probably have some upside if we get two or three cuts? Just trying to think about how you guys are positioning the business from a profitability standpoint and kind of prioritizing growth. Like I mentioned, SBA has been very ROE accretive. You've exited some lower yielding loans. Just trying to get some updated thoughts around that. I'll let Ken hit the ROE question for you, but from an earnings perspective, as we discussed last quarter, we think earnings for the year will be right at the $3 mark, a little above, maybe a penny or two below, and that's with no change in the Fed funds rate. If that happens, then kind of a little bit of modeling for every quarter point they drop The Fed rate that impact us is going to be somewhere in the half a million to $600,000 range. So it could move significantly if the Fed starts popping, but we're pretty comfortable we're going to have a three handle on earnings at the end of the year. Ken could convert that to ROE for me. Yeah, maybe. Yeah. I mean, in terms of our, if we just look at our baseline. I'm not necessarily asking for like ROE guide, but like just what, if you guys are picking where to allocate capital and what business is to grow, like what are the ROEs you think like the business can start to generate as this name finally gets some recovery here, which is great to see. Well, I mean, I, I think if you, if you think about like what we've been doing on the lending side where we've been you know, in terms of maybe even say allocating or reallocating capital, right? With this interest rate environment, it hasn't made sense to be lending in competitive long-term fixed rate verticals. And we focused on the SBA, which obviously has higher yield, and you have the fee income, you have construction, which, you know, when we started, we were coming from almost nothing. in a higher, you know, not only the benefit of a higher yield, but certainly, you know, improves the interest rate risk profile of our institution. And we've had some growth in franchise finance. And some of that growth will probably not be as pronounced as it was this past year. We pulled forward some growth there. But, you know, in terms of the lending areas, you know, that will be, you know, the primary focus as we remain in this elevated, you know, rate environment. You know, I think all in, if we're looking, you know, on our baseline assumption, we're probably getting, starting to get close to a 10 ROE by the fourth quarter. And as David, you know, David talked a little bit about the impact of rate hikes or, excuse me, rate cuts on that, you know, then it goes north of that. Pre the run-up in rates and stuff when we were running at a 1% ROE, our ROE was in that 10.5 of 11.5% range. And I can tell you, senior management for the bank, our long-term incentive this year is based on, Mike, us getting back to 1% ROA. That's going to be a tough call, but we think it's achievable. And so if we hit the 1%, as Ken said, we should be back into the low double digits on ROA. It's helpful, guys, and it makes a lot of sense. And then I guess the follow-up I have is just understanding you guys are allocating capital to a bunch of different things, but with that ramp in mind, does it make sense for buybacks to continue at some pace here, and any updated thoughts around that UC Capital for the next couple of quarters here? Yeah, we're still in the market, and we're buying back shares, but would tell you we slowed down significantly in the fourth quarter and until we get kind of back above the uh seven percent in the ten percent on the uh tce and common equity tier one common equity tier one uh we are going to be conservative a little bit on the stock uh repurchase but we are in the market we're out there the numbers will be a little thinner than it was uh last quarter but Again, that's a tremendous use when book value is $45. I think we were top 30 today. That's still a pretty serious discount to book value. So we will take advantage of it. And for some reason, some geopolitical event or something blows up out here, we will be back in the market if it knocks down pricing and become an active purchaser again. Got it. And then just lastly for me, you know, The SBA and the bank as a service businesses seem like good stories where you guys invested early and they're now kind of bearing fruits from those early labors. Is there any other kind of initiatives you feel like you're at earlier stages where you think over the next year or two, we should be mindful of revenue ramp or is it just kind of, or is there just more kind of continued runway in those two that you think is still worth the majority of your attention? Just would love a kind of an initiative update. I would tell you that, yeah, there's still a tremendous upside for both of those. And as I stated, we don't even, within the vast businesses we have aligned today, if we don't add another one, we have phenomenal upside and opportunity. If somebody falls out, we might take a look or a good opportunity comes along. But, yeah, there's tremendous upside there. We continue to look at other verticals. We've talked to different equipment leasing firms and things, but I would tell you, Those two will be the line share of our effort and focus in 2024. Got it. Great. Hey, guys, thanks for taking my questions for all the call. I appreciate it. Appreciate it, Mike. Thank you. Thank you. Your next question is from George Sutton from Craig Holmes. Please ask your question. Thank you. David, you were pretty optimistic about the construction loan market, and you have some pretty big year-over-year growth. Can you just talk about the pricing dynamics in that market, how it might compare to the overall portfolio? Yeah, George. Ken, correct me if I get this wrong. It's SOFR. SOFR, bingo, plus 3%. On average, some cases a little bit higher, maybe just a tad bit lower. But it's all yielding north of 8% now, adjustable rate. So it is very accretive to the in and day out earnings for us with the portfolios averaging a little over 5. That's a nice bump. And it's a big number. It's solid. We've got no concerns about any of the commitments that we've made. And it's a real strong piece of business for us. That sounds great. One quick question for Ken. How do we think of the economic impact to you? You mentioned $1.4 billion of volume coming through the FinTech partnerships. How do we think of that netting down to you? That's on the payment processing side of things. That's really just a transactional fee on the ACH clearings where the income comes in to us, George, is We're in the lending side of things today. Obviously, it's kind of the buyer's market today as the fintechs are having some issues and concerns out in the marketplace. We're adjusting pricing on a unit-by-unit basis, both on a fee, on a transactional play, as well as base fees for the ongoing monitoring. Revenue is going to increase, but as we said, we went up 83% fourth quarter over third quarter, and I would tell you it will be up probably double that by the end of the year. So we're looking at this year we had probably about a million, right at a million, a little over a million in revenue. Out of BAS next year, it'll be closer to two and a half million in total revenue. Yeah, the added value Piece two on payments volume is just more deposit activity because you have higher balances there. So if you look at the line item that's the Bass Broker deposits, you saw that go up. I mean, that kind of goes up in line with the volume of payment volume processed. Perfect. Thanks, guys. Thanks, George. Appreciate it. Thank you. Your next question is from John Rodas from Jenny. Please answer your question. Hey, good afternoon, guys. Hey, John. Hey, John. Ken, David. David, I guess a question for you, or maybe, I guess, Ken, really. David, but David, you mentioned, you know, sort of $3-ish for this year in earnings. I guess the question is for you, Ken, what sort of tax rate would that, you know, assume? And then how should we think about provision expense? Yeah, I think, you know, obviously our tax rate this year was wonky because of what went on in the first quarter. Obviously we had the charges on shutting down mortgage and we had the large charge off. So we kind of started the year in a loss and reaped kind of a tax benefit throughout the year. And fourth quarter had some additional state tax adjustments in it as well. I think as we forecast, and we're forecasting, obviously, quite a significant increase in net income, but net income for the year. So the way that we're modeling it right now internally is about a 12% tax rate, effective tax rate. You know, and then on the provision side, you know, historically, you know, our quarterly provision has kind of been in the one to one and a half million a quarter. Back out one, you know, unusual event from the first quarter of last year. But, you know, we've kind of seen that, seen that charge-offs creep up a little bit, at least relative to what we've done historically. So, you know, we're modeling more like a two to two and a half million dollar provision a quarter versus, which is higher than our historical average, but trying to be kind of in line with what we've done over the last few quarters. Yeah, it makes sense. So, but probably not as high as you saw in the fourth quarter, Ken, on the provision? No, no, uh-uh. Okay, okay. One other question. On the balance sheet, just, Ken, the size of the securities portfolio, all things equal, continue to see decent deposit growth. Will the securities portfolio be flattish or maybe trend down some? You know, it would probably, I would look at it as maybe the percentage of the balance sheet that's in security should remain consistent over the course of the year. I mean, it is, the securities portfolio is a source of liquidity. So I would just view it in terms of being a consistent percentage. Okay. Okay. Thank you, guys. Appreciate it, John. Thanks, John. Thank you. Your next question is from Nathan Reyes from Piper Sandler. Please ask your question. Yeah. Hi, guys. Good afternoon. Hey, Nate. Just a question on kind of the outlook for deposit growth and the sources there and kind of what are you seeing in terms of the blended rate on deposits coming in the door across the various channels that you guys are generating deposit growth across? Well, as I said earlier, right now we're seeing on the CD side, we're seeing new volume come in around a 4.8% range. You know, and on the other side, too, like the FinTech deposits that we talked about a little bit earlier, I mean, those can range anywhere from, say, a Fed Funds minus 100 to a Fed Funds, you know, Fed Funds minus 50. We are, you know, we are still having success on small business checking. We can, you know, grow that business. That would be fantastic because we're paying 50 or 60, no, I think maybe 80 basis points on that. That's very low-cost funding. You know, in the money market side, we have different tiers, and the heaviest side of that, the two-thirds of that is we're kind of paying – a rate anywhere from 3.4 to 3.6%. So money that's coming in the door is that kind of yield. So we prefer the lower cost sources that we can, but the CD side is certainly very consistent. Okay, got it. So it still sounds like, you know, if you're putting new loans on the portfolio around 8% versus those blended rates, I mean, it's definitely margin accretive, even if you don't use some of the cash on hand to fund loan growth going forward? Yeah, absolutely. Yeah. Gotcha. Okay. Just changing gears a little bit on credit. Curious, you know, outside of the handful of loans that you guys called out within the franchise and SBA portfolio, just curious more broadly what you're seeing in terms of credit migration to criticize classified across those two portfolios in particular lately? Actually, we had credit committee meeting this morning, so fresh off the list here. In the non-performing asset side of things, as we mentioned a couple minutes ago, we kind of bumped up reserves in the fourth quarter. Everything that's sitting in the NPA today is fully reserved. If we have a loss or a write-down. We've got a couple SBA loans in there. We have five residential properties. Two of those are from mortgage portfolios we've purchased in the past. Three are locally originated by us. So we're in good shape coming through the pipeline. We had a little tick up in the actual delinquency During the fourth quarter, that was primarily due to a one loan. It's an Urban Air organization, one of our franchise loans, and that's current. It was supposed to be paid by quarter end, didn't make it. And out of credit committee this morning, we're not seeing any significant bump-ups. we'll probably have somewhere in the range of a half a million dollar in specific reserves on SBA this quarter, but that's as bad as it is. And right now we don't see anything else in the franchise. So a little bit was timing. The one thing that we're, we have looked at, obviously we've grown SBA phenomenally fast. The quality is great for us. It is a different asset class than we've had in the past and we've, kind of resigned ourselves. We're getting phenomenal yield off of it and phenomenal income, but delinquency and some of those issues are going to run a little higher than we have in the past. Losses might be a tad bit higher, but compared to the national figures in about all categories, we're below national averages on delinquencies, on losses, on reserves, whatever. So we think we're in good shape there. Part of the Growth side of things, though, that obviously impacts our upfront reserving because of the amount and the volume, and it is a higher percentage than most of our loan categories today. So it's bumping reserves, and that'll continue, as Ken said, a little higher in 24 than we did in 23, but it's more over the growth factor than the loss factor. Okay, got it. And then just, you know, think about the driver's serve. I think you said, you know, five to 6% loan growth this year can just in terms of the drivers to get there. I mean, obviously, you guys had tremendous growth in the franchise book this year, how you guys kind of think about where that growth is going to come from? And does that type of growth incrementally require higher levels of provisioning or reserving needs relative to what we saw during 2023? Just on standalone production? Yeah, I think, I think, you know, David just commented that some of the, you know, we're, we're, you know, some of the provision increase is going to come from growth in portfolios with kind of higher coverage ratios. You know, we, we look about growth. A lot of it, it's, it's a lot of very similar to what we did in, in, in 23. It's, it's a, You know, for some of our verticals that are longer-term fixed rate, it's just right now the market is still competitive and pricing deals low. That doesn't make any sense for us. So it's still, it's kind of just continued remixing of you're going to see balances down, certainly in healthcare where we're not originating new loans anymore. You'll probably see a net decline in public finance. We still will do deals in public finance on the shorter end of the curve. There are some good opportunities that our team looks at, but net-net, it'll probably be down year over year. Kind of hard to predict what the long end of the curve is doing right now, but it makes the single-tenant business very, very competitive. You have folks out there who are doing stuff at rates that don't make sense to us, so you probably see a net decline there. you know, you combine, you know, you have runoff there, but you're going to see, you know, you expect to see growth in construction as some of the commitments, the unfunded commitments become funded. Our team had a tremendous year last year on the origination side, and now those balances need to be drawn. SBA is, you know, forecasted to have a fantastic year, and you will see balances up in franchise, although probably not nearly as much as you saw last year. We pulled we pulled forward a little bit of our volume from our partner in the fourth quarter that was budgeted for first half of this year. And just in terms of, again, just kind of allocating where we're allocating capital, you'll see lower growth in franchise compared to what you saw last year. Got it, very helpful. And just a clarification question, lastly, I was scribbling down, guidance, Ken, in terms of kind of SBA gain on sale revenue for this year? And I think you also provide some guidance around banking as a service as well revenue. Well, on the total, what we talked about in terms of total non-interest income, we expect that to be up in excess of 30%. And one of the other Folks on the call asked about the components of that. I mean, the biggest component is going to be SBA. We expect growth in the 23, 24% range there, as well as, you know, growth in the banking as a service. We're probably on the fee income side, about maybe a million to a million and a half of growth there year over year. And then the other pieces of it are we expect to get some distributions from some of the funds, SBIC funds and the like that we've invested in. Understood. And just trying to understand kind of that significant ramp in SBA revenue, can you just remind us in terms of how large that team is today versus maybe a year or so ago? I think on the staffing side, we're up probably in the range of 20 to 25% on a year-over-year basis. We added a number of folks at the end of the year, and it's going to go up, and it's in the earnings release, so the numbers from Ken about the biggest expense we're going to have in costs next year is still going to be in the employee queue, and a big chunk of that is going to be for SBA and compliance issues within the BASC world. So that's where most of the employee growth is coming from through 2024. And I think that's going to put us somewhere in the 68% bump in salaries or employee expense. We gave total non-interest income in the range of 8% to 10%. Total non-interest income up 8% to 10%. I'm sorry, non-interest expense. Sorry. Non-interest income is going to go up higher. It's going up 30%. Right, yeah. That's what I thought. Okay, great. I appreciate you guys taking the questions in all the color. Thank you. Great. Thanks, Nate. Thank you. Thank you. There are no further questions at this time. I will now hand the call back to Mr. Becker for the closing remarks. Great. Thank you, Jenny. Thank all of you for joining us on today's call. The anniversary gives us an opportunity to reflect, and it is really remarkable. The storms we've weathered in our first 25 years from the dot-com bubble burst in the early days, the mortgage meltdown of 07 and 08, a global pandemic followed by the steepest, fastest rate increase in history. We have survived them all. We have lived to find another day. And as we look forward to 2024 and our next 25 years, we're extremely optimistic about our outlook. The strong performance of our commercial and consumer lending team, including our growth in small business and construction lending, can drive greater revenue growth, throw in the stabilized deposit costs, and it paints a real favorable picture for earnings. As fellow shareholders, we remain committed to driving improved profitability and enhanced shareholder value. We thank you for all your support and wish you a good afternoon. Thanks, everyone.