Good day, everyone, and welcome to the first Internet Bancorp earnings conference call for the third quarter of 2024. At this time, all lines are in a listen-only mode. Following the presentation, we will conduct a question-and-answer session. And if at any time during this call you require immediate assistance, please press star zero for the operator. And please note that today's event is being recorded. I would now like to turn the conference over to Ben Rutkovitz from Financial Profiles, Inc. Ben, please go ahead. Thank you, Sylvie. Hello everyone, and thank you for joining us to discuss First Internet Bancorp's third quarter financial results. The company issued its earnings press release yesterday afternoon, and it is available on the company's website at www.firstinternetbancorp.com. In addition, the company has included a slide presentation that you can refer to during the call. You can also access these slides on the website. Joining us today from the management team are Chairman and CEO, David Becker, and Executive Vice President and CFO, Ken Lovick. David will provide an overview, and Ken will discuss the financial results. Then we'll open up the call to your questions. Before we begin, I'd like to remind you that this conference call contains forward-looking statements with respect to the future performance and financial condition of First Internet Bancorp that involves risks and uncertainties. Various factors could cause actual results to be materially different from any future results expressed or implied by such forward-looking statements. These factors are discussed in the company's SEC filings, which are available on the company's website. The company disclaims any obligation to update any forward-looking statements made during the call. Additionally, management may refer to non-GAAP measures, which are intended to supplement but not substitute for the most directly comparable GAAP measures. The press release available on the website contains the financial and other quantitative information to be discussed today, as well as the reconciliation of GAAP to non-GAAP measures. At this time, I'd like to turn the call over to David. Thank you, Ben. Good afternoon, everyone, and thanks for joining us today as we discuss our third quarter 2024 results. We have turned in four consecutive quarters of double-digit earnings growth. and improved profitability for the company, driven in large part by the recovery in our margin and the growth in net interest income that we projected at this time last year. Our third quarter results were strong in virtually all areas. Increase in net interest income was driven by solid loan growth, a larger balance sheet, and higher yields on our earning assets, anchored by continued stabilization in funding costs. Strong growth and non-interest income was powered by continued expansion of our national SBA platform with a record gain on sale revenue. In short, the revenue side of the equation is firing on all cylinders with total operating revenue growth of over 4% compared to the prior quarter and up over 36% year over year. At the same time, our efforts to improve the risk profile of the company are also bearing fruit. The exceptionally strong deposit growth in conjunction with the ongoing and deliberate shift in our loan mix have increased our balance sheet flexibility. Our balance sheet liquidity, as measured by the loan-to-deposit ratio, is the strongest it's been in recent history. Starting with the highlights on slide three, I would like to discuss some key themes for the quarter in more detail. As a result of our continued improvement in operating performance, we report a net income of $7 million up 21 percent, and diluted earnings per share of 80 cents, up over 19 percent from the second quarter's reported results. Compared to the second quarter's adjusted results, net income was up over 12 percent and earnings per share was up over 11 percent, which, as I noted a moment ago, marks the fourth consecutive quarter of double digits earnings growth. Our earnings growth was driven by continued expansion of non-interest income and gain-on-sale revenue to complement our sustained growth in net interest income. The excess liquidity created by the robust deposit growth caused a short-term drag on net interest margin, but it provides us a great deal of balance sheet flexibility that will be useful to us over the next two quarters. On the lending side, new funded loan origination yields were 8.85%, consistent with the prior quarter. The yield on overall loan portfolio increased seven basis points from the second quarter, with deposit costs increased only one basis point. As a result, net interest income was up over 2% from the prior quarter. Furthermore, compared to the third quarter of 2023, net interest income was up 25%, and net interest margin expanded by 21 basis points on a fully taxable equivalent basis. We remain confident that net income will continue to trend higher in the fourth quarter as we experience a full quarter's impact of the September Fed rate cut on deposit costs, and we continue to improve the composition of the loan portfolio. We also expect that net interest margin will rebound as we deploy liquidity to fund both loan growth and maturing higher-cost CDs and wholesale funding. A key driver in our efforts to reposition the loan portfolio and diversify our revenue is our small business lending team, which delivered another standout quarter. The team continues to perform remarkably well, delivering strong production volume and another record quarter of gain-on-sale revenue. Compared to 20, 23 year-to-date SBA loan originations are up 35%, and sold loan volume is up almost 60%. demonstrating the tangible results of the investment we have made in providing growth capital to entrepreneurs and small business owners throughout the country. Our small business pipeline continues to flourish, and we are proud to announce that we were the eighth largest SBA 7a lender in the country for the SBA's 2024 fiscal year, which ended on September 30th. Congratulations to our SBA team on another impressive quarter. The growth of our SBA business propels non-interest income, which now comprises one-third of total revenue year-to-date, compared to 25% for the comparable period last year. Bank-wide, we drove a 4% increase in total revenue over the prior quarter, our fifth consecutive quarter of revenue growth and continued improved profitability. Moving to the asset quality, our overall credit quality remains sound. despite an increase in non-performing loans during the quarter. Non-performing loans to total loans were 56 basis points, and non-performing assets to total assets were 39 basis points at quarter end. The increase in non-performers due to additions in franchise finance, small business lending, and residential mortgage. Our metrics still compare favorably to similar-sized banks. Furthermore, we have specific reserves on about 45% of the total non-performing loan balance. Net charge-offs to average loans remain low at 15 basis points and were driven primarily by SBA charge-offs. A key measure of our focus on shareholder value creation is growth in the tangible book value per share, which increased by 3.6% in the third quarter and is up almost 11% year over year. Since 2018, First Internet has grown tangible book value per share by more than 55%. We are among just a handful of banks that have grown tangible book value per share in each of the past five years, which is a testament to our prudent balance sheet management and operational discipline through some very challenging periods for the industry. Turning now to slide four, I'll spend a couple minutes discussing our lending activity during the quarter. We produced solid loan growth of 7.5% on an annualized basis for the quarter. Growth was led by our commercial lending teams, where balances were up almost 75 million from the second quarter, or 9.6% on an annualized basis. Our construction team had another solid quarter, originating over 94 million in new commitments, Late in the third quarter, 71 million of construction balances converted to investor commercial real estate due to the projects being substantially complete. And the aggregate construction and investor commercial real estate balances grew $84 million. At the quarter end, total unfunded commitments in our construction line of businesses were $515 million. As those projects progress, draws on these loans in the upcoming months, combined with the optionality to deploy excess liquidity to hold a portion of our SBA originations on our balance sheet, will play a meaningful role in the continued shift of our loan portfolio towards higher yielding variable rate loans. On the consumer side, balances were up modestly as new originations in our specialty consumer channels were offset by declines in the residential mortgage and home equity balances. We focus on the super prime borrower and our consumer lending and rates on new production remained in the mid 8% range consistent with the second quarter. Furthermore, delinquencies in these portfolios remain extremely low at under one basis points of total loans. To wrap up my comments, we continue to build off the last nine months of improving performance and delivered another solid quarter. We remain confident in the earnings momentum we have built and are excited at the end of the year on a high note. Liquidity, asset quality, and capital levels remain sound. With a continued evolution of our loan portfolio and greater revenue diversification, combined with expected declines in deposit costs following the first wave of Fed rate cuts, we believe we are well positioned to continue to achieve higher earnings and improve profitability in the fourth quarter and into 2025. Now I'd like to turn the call over to Ken, for more details on our financial results for the quarter. Thanks, David. As David covered the loan portfolio, let's turn to slides five and six, where I will cover deposits in more detail. The average balance of deposits increased over $211 million, or 5%, during the third quarter, and period-end deposits were up almost $524 million, or 12%, from the prior quarter, driven by growth in CD production and FinTech partnership deposits. Non-maturity deposits were up almost $123 million, or 6%, which reflects the increase in FinTech partnership deposits. Additionally, total deposits from our FinTech partners, including those classified as broker deposits, were up 35% from the second quarter and totaled $507 million at quarter end. Additionally, these partners generated almost $11.4 billion in payments volume, which was up 34% from the volume we produced in the second quarter. Total FinTech partnership revenue was $771,000 in the third quarter, which was up over 30% from the second quarter, as contributions from one of our key partnerships began to scale up during the quarter. Mike Pratt- Related to CD activity during the quarter, total balances were up $281 million or 15% from the linked quarter, driven by continued strong demand in the consumer channel. Mike Pratt- We originated $697 million in new production and renewals during the third quarter at an average cost of 4.77% and a weighted average term of 21 months. These were partially offset by maturities of $391 million with an average cost of 5.05%. Looking forward, we have $238 million of CDs maturing in the fourth quarter of 2024 with an average cost of 5.01% and $407 million maturing in the first quarter of 2025 with an average cost of 5.08%. CD pricing broke through its inflection point during the third quarter as the weighted average cost of new CDs was 28 basis points lower than the cost of maturing CDs. As interest rates across the yield curve began falling ahead of the expected cut in the Fed funds rate, we reduced CD rates significantly throughout the quarter. Accordingly, the weighted average cost of CD production during the month of December was 4.45%, or over 30 basis points lower than the average cost of new CDs for the quarter. This is also 56 basis points lower than the rates on CDs maturing in the fourth quarter of 2024. With the combination of CDs repricing at lower rates and the cost of high beta deposits coming down 50 basis points, we feel confident that deposit pricing has hit its peak and will trend downward in the fourth quarter. Moving to slide six, at quarter end, with the heightened level of deposit growth, total liquidity remained very strong, reflecting cash and unused borrowing capacity of $2.1 billion. We deployed some of the liquidity to pay down FHLB borrowings, as well as to fund loan growth and securities purchases during the quarter. With total deposit balances increasing 12% and loan growth of $75 million, or about 2%, the loans to deposits ratio declined to 84% from 93% at the end of the second quarter. At quarter end, our cash and unused borrowing capacity represented 179% of total uninsured deposits and 230% of adjusted uninsured deposits. Turning to slide seven and eight, net interest income for the quarter was $21.8 million and $22.9 million on a fully taxable equivalent basis, up 2.1% and 1.8% respectively from the second quarter. The yield on average interest earning assets increased to 5.58% from 5.54% in the linked quarter due primarily to a seven basis point increase in the yield earned on loans, but partially offset by a decline in the yield earned on other earning assets. The higher yield on the loan portfolio combined with higher average loans, securities, and cash balances produced solid top-line growth in interest income, increasing 5.7% compared to the linked quarter. Factoring in the strong growth in average interest-bearing deposit balances, net interest income was up over 2% during the quarter, building on last quarter's increase and further distancing us from the low point in the third quarter of 2023 as shown in the bar chart on slide seven. Net interest margin for the third quarter was 1.62% and 1.70% on a fully taxable equivalent basis, decreases of five and six basis points respectively from the second quarter. The net interest margin roll forward on slide eight highlights the drivers of change in fully taxable equivalent net interest margin during the quarter. Similar to last quarter, I'd like to clarify one item on this chart. The impact of deposits on net interest margin is more a factor of dollar volume than rate. That is, as I mentioned earlier, average interest-bearing deposits were up over $211 million during the quarter, whereas average loan balances were up only $93 million. As David referenced in his comments, net interest margin for the quarter was impacted by carrying higher cash balances. We estimate that the excess liquidity negatively impacted net interest margin by six basis points. However, the elevated on-balance sheet liquidity also provides a great deal of flexibility going forward. As I mentioned moments ago, we have over $600 million of higher cost CDs maturing over the next two quarters, as well as nearly $250 million of higher cost broker deposits maturing over that same time period. Furthermore, we estimate that loan activity, primarily early payoffs of higher yielding loans and loans with premiums, had an additional negative impact on net interest margin of six basis points. However, loans pipelines remain solid, especially in the small business lending and construction lines of business, and our focus on improving the composition of our loan portfolio gives us further confidence that net interest income will continue to increase in future quarters. Related to deposits, looking at the graph on slide 8 that tracks our monthly rate on interest-bearing deposits against the Fed funds rate, you can see the stability in deposit costs over the last several months. As I mentioned a few minutes ago, with the recent cut in the Fed funds rate and other short-term rates following suit, as well as lower CD pricing across the maturity curve, we anticipate that interest-bearing deposit costs will begin trending downward in the fourth quarter. This should also drive further net interest income growth and provide a strong catalyst for net interest margin expansion. Turning to non-interest income on slide 9, non-interest income for the quarter was $12 million, up $1 million or 9% from the second quarter. Gain on sale of loans totaled $9.9 million for the quarter, up 20% over the second quarter, setting another quarterly record for our SBA team. We originated over $163 million of SBA loans during the quarter, an increase of 42% over the linked quarter. Furthermore, loan sale volume was $126.5 million, up 22%, while net gain on sale premiums saw a decline of 65 basis points. Other non-interest income declined from the prior quarter to $1.1 million due primarily to lower distributions received from fund investments. These decreases were partially offset by a modest increase in net loan servicing revenue. Moving to slide 10, non-interest expense for the quarter was $22.8 million, up $450,000 from the second quarter. When you exclude non-recurring costs of almost $600,000 from the second quarter's results, operating expenses were up $1 million, or 4.7%. The increase was due almost entirely to an increase in salaries and employee benefits driven by higher small business lending commissions in line with the higher volume of originations. Additionally, we added staff to our small business lending and risk management teams as we continue to build bench strength to support further growth. Turning to asset quality on slide 11, David covered the major components of asset quality for the quarter in his comments, so I will just add some commentary around the allowance for credit losses and provision for credit losses. The allowance for credit losses as a percentage of total loans was 1.13% at the end of the third quarter, up three basis points from the second quarter. The increase in the allowance for credit losses reflects growth in the loan portfolio and continued shift in the composition of the loan portfolio towards certain loan types with higher coverage ratios. The increase also reflected additional reserves related to small business and franchise loans. Provision for credit losses in the third quarter was $3.4 million compared to $4 million in the second quarter. The provision for the third quarter was driven by loan growth and changes in the loan portfolio composition, net charge-offs, and the additional reserves related to small business and franchise lending. If you exclude the balances and reserves on our public finance and residential mortgage portfolios, which have lower coverage ratios given their lower inherent risk, The allowance for credit losses represented 1.35% of loan balances. Furthermore, as a reminder, with minimal office exposure, we do not have the excess reserves for that asset class that many other banks require. Moving to capital on slide 12, our overall capital levels at both the company and the bank remain solid. The tangible common equity ratio was 6.54%. which experienced a decline due primarily to the strong deposit growth during the quarter and the increase in cash balances. If you exclude accumulated other comprehensive loss and adjust for normalized cash balances of $300 million, the adjusted tangible common equity ratio would be 7.49%. From a regulatory capital perspective, the common equity Tier 1 capital ratio remains solid at 9.37%. Before I wrap up, I'd like to provide some updates on our outlook for the fourth quarter of 2024. With regard to net interest income, as I mentioned earlier, with a solid loan pipeline, we expect loan balances to be up another 1.5% to 2% in the fourth quarter, while the all-in yield on the portfolio should be up a few basis points as origination volume is expected to outweigh the impact of recent rate cuts. Additionally, we expect the rate cuts to have a positive impact on the cost of funds related to deposits, although dollars of interest expense may be up a little bit due to the increase in average balances. However, top-line interest income growth should far outweigh the dollar growth in deposit costs, with net interest income increasing in the range of 10 to 15 percent on a quarterly basis. We also expect net interest margin to rebound and resume an upward trajectory. While the elevated cash balances will still weigh on margin expansion in the near term, we expect fully taxable equivalent net interest margin to be in the range of 1.8% to 1.85% for the fourth quarter. And related to non-interest income and non-interest expense, our view remains consistent with our comments on last quarter's call. With the combination of our SBA team continuing to deliver consistently higher origination activity Our outlook remains extremely optimistic and we expect gain on sale revenue to be in the range of this quarter's elevated results. On the expense side, we expect continued growth in the salaries and employee benefits line item as we build further bench strength in risk management and small business lending, especially as we plan for SBA origination growth in the range of 15 to 20% for 2025. Furthermore, we have technology investments slated for the fourth quarter, many of which pertain to further enhancing the digital experience and adding product features for our consumers in small business. With that, I will turn it back to the operator so we can take your questions. Thank you, sir. Ladies and gentlemen, if you would like to ask a question, please press star followed by one on your touch-tone phone. You will then hear a three-tone prompt acknowledging your request. And if you would like to withdraw from the question queue, simply press star followed by two. And if you're using a speakerphone, we ask that you please lift the handset first before pressing any keys. Please go ahead and press star one now if you do have any questions. And your first question will be from Brett Rabaton at Havde Group. Please go ahead. Hey, guys. Good afternoon. Hi, Brett. Hey, Brett. Hey, I wanted to start with just the comments or the franchise finance and the small business loans that were either past due or moved to non-accrual. Can you give us some additional color on what components of franchise finance that was, what small business is doing, and then just maybe any comments on the RV portfolio? And I know like Walgreens and CVS have also had some some recent mentions of foreclosures, et cetera. With regards to like in the franchise and small business, Brett, so on the franchise side, we've just had a handful of delinquencies there, mostly having to do with, you know, certain brands and closures of units, trying to work with the borrowers to get them to the table to restructure loan, pay off the loan that we've had to take some action on and move to non-accrual since they went 90 days past due. Probably not a common theme other than what you're hearing across the industry as far as restaurants and other retail entities struggling a bit. But we just had to take action on a pool of those loans that hit 90 days On small business, there's really no consistent theme amongst them. In small business, it's like every credit is a story. But kind of similar along the lines of franchise, just, you know, had either businesses closing or struggling. Again, where we've had to kind of take action and, you know, maybe where we've offered a deferral or two and the borrower is struggling, so we just have to move it to non-accrual and work with the SBA to repurchase the loan and work with the borrower to finalize an exit strategy. Yeah, the apple pie stuff is really our internal policy. When it hits 90 days, as Ken said, we move it to non-accrual. We take a specific reserve against it. I don't know that the portfolio, as he said, the loans are that bad. It's more an internal policy. We've had a tough time working with they service the loans or have a Third-party service or work on the loans. They're not really incented to do anything until the loans hit that 90-day bucket Then they get 35 cents on the dollar of everything they recover. So we're coming at this from different viewpoints They wanted to get delinquent so they can pick up a little income We want to be at the front of the food chain when things go south. So we're renegotiating currently a service in agreement with them. So we're in the deal and have an opportunity to get involved much earlier in the process, not waiting until it gets to 90 days. The SBA side of things kind of peaked in July. The outstanding problem loans dropped in August and September, not tremendously, but they're not continuing to climb period over period. So SBA, as Ken said, there is no specific industry or type of loan or location or anything. It's a very diversified nationwide, no real common themes within. On the consumer side of things, we have less than 1% delinquency. Horse trailers, RVs are not a problem. The resale value, they were selling at a premium during COVID when nobody could get a new one. Resale has come down if we happen to have one come back to us, but outside of that, we're not seeing any cracks whatsoever there. The CBS and the Walgreens is kind of the same story that we had with Red Lobster when everybody's worried about them 90, 120 days ago. We have about 35 CBS stores. Nothing is delinquent at the current time. Nothing is closed. Most of those are still in the middle of five-year plus lease agreements. We're not hearing from anybody. We have a service that checks like we just recently put on four CVS stores, taking us up to, I think, 31 or 32 outstanding. And in their region, they were all four in the top performers, and they were in the upper 4% of performance within CVS. So again, because we have the national footprint and the play, we're buying grade A quality locations, loan-to-value is still in that 47, 50% range, and good, solid sponsors behind them. Walgreens, the same boat. We've not had anything go dark on us. We haven't got any notices of closure. We did have a Rite Aid where they had two in a town and they opted to close the new one on the outskirts versus the older one that was kind of in the heart of town. But again, the sponsor on that is continuing payments and is repurposing the store. So the STL product right now, we don't have a delinquent account. And if you remember over the years, and we've gone through all kinds of crisis over the last 12 years, we've only had two loans go bad, and on $2 billion in originations, our total losses have been a little over $1 million. So we're not worried about the STL products nor the consumer side. Time will tell. Obviously, rates going down, particularly on the SBA, will help. That does, they're adjustable on a quarterly basis, so that'll help lower payments and help the cash flow. And I think just give the SBA and the small business owner just a kind of a light at the end of the tunnel that things are getting better and rates are coming their way. Inflation continues to slow. Obviously, there's certain spots that are still high, but as a whole, it's coming down. So I think everything is going in the right direction for them as well. That's a lot of great color. And just to clarify, if I heard you correctly, kind of the the peak of SBA delinquencies in your portfolio is in July. There's another competitor that is, um, you know, out today with some adverse migration in their non-guaranteed SBA book. And so they made a big provision. I know you can't comment on someone else's portfolio, but you know, I think that might be, might be weighing somewhat on your stock as, as well as theirs. Uh, we had that same thought this morning when we saw the same thing you did, uh, Yeah, from our standpoint, as Ken said, we've taken specific provisions. If it's over 90 days past due and we think we're going to have some kind of impairment on that non-guaranteed part, we've already taken a provision against it. So we evaluate them as they kind of break that barrier. But yeah, we hit the top, and it's come down a little bit. Who knows what? We're still early in October here, too. 15th is kind of a universal payment date, so we'll have a better handle in another week to 10 days. But, yeah, we seem to be headed in the right direction, at least stabilizing, I guess, if nothing else. So, yeah, we read the same thing you read this morning, and that was kind of a shock to us. We're not experiencing anything like they're experiencing. Okay. So we're talking about the same institution. Okay. Um, and then the other question I had was just, uh, I kind of figured you guys might wait a quarter or two for rates to come down, possibly a little more before you went and maybe built some liquidity and put on more CDs, but you seem to do that a little, a little earlier. And if I heard right, the production on CDs in the last month of the quarter was 445. Was that correct? I'm just curious why you guys may be building a little. Correct. It was not intentional. We had been lowering rates. We actually started lowering rates probably about a month before the Fed made a cut, anticipating we were thinking it'd be 25, and we had lowered rates about 40 basis points on the 45-day period prior to the cut. But when it hit 50 basis points, the good and bad part about being an internet institution is experienced by Silicon Valley and First Republic when they started to hit the wall all the deposits called in 24 hours 36 hours on our side when the consumers and the business folks thought oh my god the bottoms falling out on the savings rates they slammed in and bought CDs Faster than we could lower the rates we took them down another 40 basis points on the consumer side and 50 basis points on the commercial we've cut off the inflow but in that 24, 36, 48-hour period, post the Fed announcement, they were flying to the door faster than we could lower the rate. So lesson learned that that sword cuts both ways on withdrawals as well as deposits. Yeah, okay. That makes sense. Great call, guys. Thanks. Appreciate it. Thanks, Brett. Thank you. Next question will be from Tom Switzer at KBW. Please go ahead. Hey, good afternoon. Thanks for taking my questions. Hey, Tim. I wanted to ask about the SBA origination outlook. I think you have a pretty wide range of 15% to 25% in 2025. What are some of the factors that could drive it to the low or high end of that range? Is it mostly rate driven? And then what are your expectations for pricing as we get into next year? Well, you know, our expectation right now is that we'll, you know, somewhere be in the range of, say, 525 to 530 million of originations for this year. And we're targeting 600 million for next year. So you do the math on that, and you're probably in the range of 15. You know, I think for us, I think we've put together just a really good team. We have a great team of BDOs out there. And we have a great support team behind them on credit, servicing, closing. And, you know, it is reflected, we've made this comment the past couple quarters, we continue to build the bench strength to support that growth. And that'll be key to achieving it. But I think we feel, again, we feel really good about, you know, the folks we have out there sourcing deals for us. and expect, you know, I guess if you look at kind of we have grown each quarter this year. So when you look at what we've done in the fourth quarter, or excuse me, the third quarter, and what we're looking at for the fourth quarter, it's not, I don't think it's an unreasonable jump to get to that 600 million target for next year. Tim, one of the uncertainties is the sales price in the secondary market. I think Ken made a comment that it had dropped 65 basis points third quarter over second quarter as people try to get comfortable with what the Fed's going to do. Do we do two more quarter point drops in this quarter? The excess liquidity that we have on the balance sheet, as I stated in my comments, gives us a position if the bottom falls out in the secondary market, we have cash and liquidity rather than sell a 10.5%, 11% yearly loan in the secondary market for 5.5%, 6%. carry it on the books, and we'll make up that difference in a five-, six-month window of time. So we've got a lot of optionality and a lot of flexibility going into 2025, and we can handle kind of whatever the market gives us on the SBA side. As Ken said, we've got a team and an organization out here now that is just a pretty well-oiled machine that can produce the product and the volume we're looking for. I think I made a comment in the last call, probably somewhere in that $600 million range might be kind of our cap, looking at annual sales growth. But if we get it, we can hold it on the books, we can sell it in the secondary market, we'll do whatever is in the best interest of the institution. The good part about the excess cash is it gives us an awful lot of flexibility. Okay, great. Yeah, that was really helpful. And then I wanted to ask about the NIM trajectory. Obviously, pretty good expansion expected in Q4. How should we think about 2025, particularly the Fed cutting rates? I think last quarter you guys said each 25 base points is about a $2.8 million annual benefit. Is that still the right range? And, you know, with the loan growth you're expecting to put on, you know, how should we expect the NIM to move next year? Well, I think the last quarter that math was based on a static balance sheet. I think the wild card for this is just the cash balance that we have and how that's deployed. I mean, I think about if you just, I'm going to give you some numbers here to think about that you can run some math on, but we got about $1.3 to $1.4 billion of what I'd call high beta or 100% beta deposits that are a combination of some brokered and and some of our own deposits that are higher balance. But those reset immediately. So you can do the math on every 50, 100, 25, 50, 75 basis points of cuts. Really offsetting that, we probably got about $760 million of loans that would reprice either immediately or within three months in the case of SBA loans We do have more variable rate loans on our balance sheet, but some are at price ceilings already. So you have that going one direction. But then we also have $1.4 billion of CDs with an average cost of close to 5% that mature over the next 12 months. And new production right now coming in the door in the month of October is 4.19, 4.2%. So there's a lot of dollars of NII that we expect that we will pick up over the course of next year. How that translates exactly into margin is a little bit hard to project in terms of, you know, because of the excess liquidity and what you're going to run it off at. But I, you know, just sitting here thinking about it i mean i would think that we would be able to at least expect perhaps 10 basis points of of margin expansion a quarter just depending on how we get the liquidity out the door and as david said too if there's optionality for holding sba loans for example that would be incredibly accretive to net interest margin and net interest income so we're still we're still working on our on our forecast for next year know it's hard to you got the long rates that are doing something different than the short rates right now and we got an election to get through so i guess we'll see what rates happens to long rates after that um but i think all in all just doing math and what we have today for just dollars of net interest income i think we see a significant pickup next year we still think we're going to hit the the three dollar mark that we had forecasted for this year closing out here in the fourth quarter will be pretty close to almost a dollar in income. We had forecasted four for next year. Obviously, with the Fed starting to move, that's a lock on our side. And it could, depending on, as Ken just outlined for you, how the Fed rates move over the course of the year, that could move from four up to five pretty quickly. So we think we're going to finish strong here for this year, and 25 looks real, real good. Political and third world or overseas wars off the table, if everything stays fairly stable in the political arena and the world arena, we should have one bang up year in 2025. Yeah, well, I'll pray for that. But thank you guys for the commentary. Appreciate it. Thank you. Thanks, Tim. Next question will be from Nathan Race at Piper Sandler. Please go ahead. Hey guys, good afternoon. Thanks for taking the questions. I just want to clarify on the loan growth expectations for 4Q. Did you mention one to 2% and then also be curious to get your preliminary thoughts on overall balance sheet growth expectations next year as well? Yeah, I think I said one and a half to 2%, which probably is kind of in the range of where we were in the second or excuse me, the third quarter for loan growth. Okay. So that's not, I think we said that the, maybe the wild card for that could be if, if we don't like what we see in the secondary market for SBA, retaining some SBA loans, um, that could boost that a bit, but, uh, yeah, probably in the range of growth that we saw this quarter. Okay. So that's one or 2% not annualized. No, no, no, no. Yeah. That's not annualized. That's just gross for the quarter. Tad Piper- gotcha Okay, and then just any thoughts on how you see organic balance sheet growth in terms of both loans and deposits point out next year as well, just given the fluid curve as well. Tad Piper- I think yeah again it kind of come back to with you know the liquidity, we have on the balance sheet and if go I guess i'll go back to my comments earlier about you know over. You know, $600 million of CDs maturing in the next six months, $1.4 billion maturing next year, $250 million of higher cost brokered deposits maturing over the next six months. I mean, I expect that our balance sheet will be down in the fourth quarter. at the end of the year relative to where we were at the end of the third quarter as we deploy some of that cash to just, again, pay down higher cost deposits. I think year over year, our total loan growth for this year, 2024, will probably be somewhere in the range of 7% to 9%. You know, I think if we're doing what we're doing today, that number might be still the same. But again, I'll come back to what David said with the optionality we have on SBA loans. And, you know, some other, you know, initiatives that we, you know, that we're working on that could drive further growth beyond that. We've been working with some of our FinTechs. We have JARIS in particular that we kept thinking we would get the loan program up and running during the third quarter. We just made a small purchase here in October just to kind of validate and test everything to make sure all the mechanics and stuff are in play. They've got a couple new clients coming their way. That one could jump up pretty quickly. We brought on two new programs here in the last 30 to 45 days in the fintech space that could have some opportunities for us. So as Ken said, there's a lot of options and a lot of play. And we're just kind of taking stuff day by day, but everything really does look good for us going forward. Got it. That's helpful. And then just within that context, a high-level strategic question, you know, just with the momentum you're seeing on the SBA side of things and with some of the partnerships, just curious if it makes sense to maybe slow balance sheet growth. Particularly just given coming out of 3-2, it seems like, you know, the loan and deposit growth is margin dilutive. And, you know, that may change and should change with, you know, Fed cuts and depending on the forward curve or depending on how the yield curve plays out. But just curious on your thoughts around slowing balance sheet growth and just leaning on some of those more profitable lines of business. And then just build capital and perhaps, you know, resume buying back the stock just given where it's trading relative to tangible book. Well, hopefully you're spot on. We have a lot of flexibility without growing the balance sheet to kind of remix things and get higher earnings and higher yield. We can get that 10% growth technically right now with the cash we have on the balance sheet. So there's no need to bring in deposits for the sake of deposits or the balance sheet. So we agree with the 100%. It's kind of remix things a little bit, maximize earnings, and not necessarily pump up the balance sheet. And we're spot on, I would hope. that the stock appreciates quickly as we add better earnings to the bottom line and gets back towards that book value plus. But I don't think, being real honest, in 2025 that I don't want to set the stage that we're going to go back and do a big stock repurchase because if we get into that 40 range, it doesn't make a lot of sense. I'd rather build capital and save that for a rainy day or save it for position. We got a couple sub debt items coming up. We could take the extra capital and pay down some sub debt and get stability in the capital network. So we might have other options for it versus buying back stock. Understood very helpful and can I think you mentioned expenses should be up a little bit just based on some. Commission costs tied to the similar SBA revenue expectations and some other investments, but just curious how your preliminary thinking about expense growth in 2025. I know it's going to be contingent on the SBA. revenue side of things, but assuming SBA revenue continues to ramp up by maybe at least 5%, just curious how you're thinking about the overall expense trajectory within that context. Yeah, well, I think we've done quite a bit of hiring this year to build out the SBA platform and enhance risk management and kind of add some positions around the country to, as I like to say, add bench strength. You know, we'll have kind of a full year's run rate of folks there. But, you know, if I'm, you know, thinking about next year, you're probably 7% to 8% expense growth for next year, for the year. I was going to guess 9% to 10%. So blend this together. If we get the ball out of the park on SBA, then we'll be closer to that 9% to 10%. Yeah. And it's hitting the ballpark out on SBA. Is that growing SBA revenue 5%, 10% next year? How do you quantify that, I guess? Well, I guess on the sales volume side of things, as Ken said, we're going to end up a little over $500 million probably this year, and we're looking at $600 million next year. So we've got a nice bump up, which also, if you take a look where we're at this quarter, it's only going to get bigger through the course of the year, as long as premiums don't fall apart on us. And if they start to, or we take that excess growth into next year and put it on the balance sheet, we got a real chance of picking up a nice uptick in earnings out of SBA. Either way it goes in the secondary market or on the balance sheet. So it'll compensate for the growth in the expense cycle. Got it. And then just one last one, just from a housekeeping perspective, any thoughts on the tax rate going forward? Depends on who wins the election. You know what, I think right now we're probably thinking that, you know, probably like fourth quarter will be kind of in the same tax rate area as it was in the third quarter. You know, with higher earnings, you know, we do get a very strong benefit from our public finance portfolio. But as our, you know, just our pre-tax earnings continue to grow, that benefit on a percentage basis is less. So, you know, I would think our tax rate for next year with higher earnings is probably going to migrate over the course of the year from, you know, maybe ranging from anywhere from, you know, call it, you know, a high eight to, you know, somewhere perhaps as high as 11 to 12% by the end of the year. It's kind of the way I would look at it. Got it. Very helpful. I appreciate all the color. Thanks, guys. Thank you. Thanks, Nate. Next question will be from George Sutton at Craig Hallam. Please go ahead. Thank you, David. I wanted to test one statement you made in your prepared comments. You mentioned we in Q3 were firing on all cylinders. I think if you really thought about it, you might say firing on many cylinders. I'm just curious what you think firing on all cylinders should look like. I think it's the bump up, George, that we have coming here for the fourth quarter. And then if the Fed continues to drop rates significantly through the course of 2025, we're going to just kind of blow the roof off in earnings and structure here in the institution. Taking it back to the racing analogy, we'll set a track record by the end of the year. We've just got a lot of good things going every place and we got it for us and our balance sheet historically has been unbelievably pristine. We've got a bump or two on the, a little bit on the SBA side and a little bit on the franchise end, but that's all manageable. We'll get a handle on it. So I think the future is really, really looking good for us. The gentleman you headed my way, we've had a good conversation. I think there might be some opportunities there. We're getting a lot of good inquiries from people. The dust is just settling. The fintech space, we wound down a client here over the last quarter who just could not raise any additional capital. They had a great program. They had a great product, but they just couldn't get the capital to get there, and as the institution's kind of pull back on some of the VC stuff. There might be opportunities to actually pick up a FinTech or two and put that product into our mix. There are other very solid programs that are looking for solid players that understand and can provide the services they're looking for. So I just think we have an awful lot of good things going on within our product mix and good things coming to us from the outside world. So 25 looks really strong. Fabulous. I did want to say congratulations to Ken and Nicole and Ann and Tim and Nick and Dustin and Maris, fellow Indiana graduates on the 7-0 start to the year. Yeah, believe me, they had their first sellout football game last year in like 50 years. So it's a very... A lot of cheering for basketball over the years, but it's been very rare. A lot of good tailgating, but most people just tailgate and pass on the games. They've got a full house now, so that's great. Thank you. Thanks, guys. All right. Thanks, George. At this time, I would like to turn the call back over to David Becker for closing remarks. Thank you, Sylvie. Thanks, everybody, for joining us today. As I said, we've kind of produced some really consistent improving results throughout 2024. We're extremely confident in our ability to deliver a strong finish to the year. And as we looked at 25 and beyond, we're extremely excited about what the future holds. Strong performance of the lending teams, including continued execution in the SBA and construction area, emerging growth opportunities with key FinTech partnerships. are expected to drive greater and more diversified revenue growth. We combine that with the prospects for a more favorable interest rate environment and the positive impact that will have on deposit costs. We believe we are very well positioned to achieve stronger earnings over the next several quarters. As fellow shareholders, we remain committed to driving improved profitability and enhanced shareholder value. We thank you for your support and wish you a good afternoon. Thank you, sir. ladies and gentlemen this does indeed conclude your conference call for today once again thank you for attending and at this time we do ask that you please disconnect your line