Good day, everyone, and welcome to the first Internet Bancorp earnings conference call for the first quarter of 2024. At this time, note that all lines are in a listen-only mode. Following the presentation, we will conduct a question and answer session. And if at any time during this call you require immediate assistance, please press star zero for the operator. And I would like to turn the conference over to Larry Clark from Prevention Profiles, Inc. Please go ahead, Mr. Clark. Thank you, Sylvie. Good day, everyone, and thank you for joining us to discuss First Internet Bancorp's financial results for the first quarter of 2024. The company issued its earnings press release yesterday afternoon, and it's available on the company's website. In addition, the company has included a slide presentation that you can refer to during the call. You can also access these slides on the website. Joining us today from the management team are Chairman and CEO David Becker, and Executive Vice President and CFO, Ken Lovick. David will provide an overview, and Ken will discuss the financial results. Then we'll open the call to your questions. However, before we begin, I'd like to remind you that this conference call contains forward-looking statements with respect to the future performance and financial condition in the First Internet Bank Corp that involve risks and uncertainties. Various factors could cause actual results to be materially different from any future results expressed or implied by such forward-looking statements. These factors are discussed in the company's SEC filings, which are available on the company's website. The company disclaims any obligation to update any forward-looking statements made during the call. Additionally, management may refer to non-GAAP measures, which are intended to supplement but not substitute for the most directly comparable GAAP measure. Press release available on the website contains the financial and other quantitative information to be discussed today, as well as the reconciliation of the GAAP to non-GAAP measures. This time, I'd like to turn the call over to David. Thank you, Larry. Good afternoon, everyone, and thanks for joining us today as we discuss our first quarter 24 results. Those of you who regularly attend these meetings will recall that two quarters ago, we called the bottom. In late October, we predicted the third quarter of 2023 would mark a low point for net interest margin and net interest income. We also estimated net interest margin would turn higher from there, regardless of whether or not and at what pace the Federal Reserve chose to start reducing short-term interest rates. Since then, and despite ongoing uncertainty around the future monetary policy and continued volatility in long-term rates, we have now reported two consecutive quarters of strong earnings growth and improved profitability, driven in a large part by the recovery in our margin and growth in net interest income that we had projected. This quarter's results continue to demonstrate the meaningful progress we've made repositioning the loan portfolio and optimizing our overall balance sheet mix while keeping deposit costs in check and improving our interest rate risk profile. Starting with the highlights on slide three, I'd like to discuss some of the key themes for the quarter. As I just noted, we continue to transition the composition of our loan portfolio and optimize both sides of the balance sheet. We experienced strong deposit growth during the quarter and deployed a portion of the liquidity to drive net loan growth of $70 million, or over 7% on an annualized basis. New funded loan origination yields were 8.84%, consistent with the fourth quarter of 2023, and up 108 basis points from the first quarter of 2023. The yield on the overall loan portfolio increased 23 basis points, From the fourth quarter of 2023, deposit costs only increased 11 basis points. As a result, net interest income was up almost 5%, and fully taxable equivalent net interest margin expanded by 7 basis points over the prior quarter. Since the third quarter of last year, when we believe those metrics hit their low, net interest income has increased by 19%, and net interest margin has expanded by 27 basis points. With our emphasis on improving the composition of the loan portfolio and stabilizing deposit prices, we remain confident that net interest income and net interest margin will trend higher for the remainder of this year, which is consistent with the guidance we issued in January. Notably, as a reminder, Our estimates do not reflect any expectation for short-term rate cuts by the Federal Reserve this year. Another highlight for the quarter was the performance of our SBA business. Despite the seasonally lower SBA activity in the first quarter of the year, the team continued to perform exceptionally well, delivering solid production and another record quarter of gain on sale revenue. Compared to the first quarter one year ago, SBA originations and sold loan volume were up 27% and 55%, respectively, demonstrating the tangible results of the investment we have made in providing growth capital to entrepreneurs and small business owners throughout the country. Our small business pipeline continues to flourish, and we remain among the top 10 most active SBA 7a lenders in the country. Congratulations to our SBA team on another standout quarter. It is the combination of all of these efforts, solid loan growth, net interest margin expansion, net interest income growth, and non-interest income powered by record gain on sale revenue that drove a nearly 7% increase in our total revenue over the prior quarter. For revenue expansion, and only moderate expense growth, generally driven by the typical annual reset on employee benefit costs and merit pay increases, we delivered a second consecutive quarter of positive operating leverage and continued improvement in operating efficiency. Credit quality remains healthy overall, with non-performing loans to total loans at 33 basis points and non-performing assets to total assets at 25 basis points at quarter end. Non-performing loans did increase from the fourth quarter, due primarily to additions in small business lending and, to a lesser extent, legacy residential mortgage. But our ratios continue to compare favorably to the rest of the industry. Furthermore, net charge-off to average loans remained low at just five basis points. We also saw an increase in delinquencies 30 days or more past due, which totaled 53 basis points of total loans a quarter in. The increase during the quarter is due primarily to an increase in delinquencies in small business lending and franchise finance portfolios. Some of this was simply due to the timing of payments. Subsequent to quarter end, a number of these borrowers have become concurrent on their payments, and as of today, those delinquencies have declined to 32 basis points in total loans. As it relates to current industry concerns around office real estate, I'd just like to remind everyone that our exposure to office commercial real estate remains at less than 1% of our total loan balances and does not include any central business district exposure. Our capital levels remain sound with a common equity tier one capital ratio of 9.52%. Tangible common equity ratio of 6.79% at quarter end. Tangible book value per share, a key measure of Shareholder value creation increased 1% during the quarter and is up 6.6% year over year. As a further example of the value we have created for shareholders since 2018, First Internet has grown tangible book value per share by nearly 50% compared to an average of 33% for all publicly traded banks during that time period. We are among just a small handful of banks that have grown tangible book value per share in each of the past five years, which is also in part a testament to our prudent balance sheet management and operational discipline through a very challenging period for the banking industry. As a result of our continued improvement and operating performance, we reported net income of $5.2 million, up 25%. and diluted earnings per share of 59 cents, up 23% from the fourth quarter of 2023. This was the second consecutive quarter of earnings growth in excess of 20%. Let me now take a couple minutes to discuss our lending activity during the quarter. Turning to slide four, we produced solid loan growth during the quarter, led by our commercial lending teams, where balances were up 75 million from year end or 10% on an annualized basis. We generated growth in construction, small business lending, and franchise finance. This was partially offset by declines in the fixed rate public finance and the healthcare finance portfolios. Our construction team had another solid quarter originating 90 million in new commitments. Additionally, funding construction loans increased 24% on a late quarter basis as borrowers drew on existing lines to fund their projects. At quarter end, total unfunded commitments in our construction line of business increased to $552 million, up from $540 million at the end of the fourth quarter, leaving us very well positioned to continue shifting the composition of the loan portfolio towards higher yielding variable rate loans. On the consumer side, balances were down modestly as expected declines in residential mortgages were partially offset by production in our specialty consumer channels, which is traditionally lower during the winter months. We focused on the super prime borrower in our consumer lending, and rates on new production were consistent with the prior quarter and in the mid-8% range. Furthermore, delinquencies in these portfolios remain low at just eight basis points of the total loans. Before I turn the call over to Kidd to cover deposits and more detail, I want to provide an update on our FinTech partnerships. Not long after I launched First Internet Bank 25 years ago, we entered into our first partnership program, recreational vehicle lending, a channel that continues to grow long-term customer relationships with outstanding credit quality and favorable yield. Over the years, we forged additional partnerships. Some of our initiatives, like the one delivering on-demand payments to workers in the gig economy drove innovation, while others helped establish entities like our home state's Department of Revenue, lower processing costs, and build out online delivery channels. Still other partnerships have provided necessary growth capital to underserved markets with niche partners that know their target audience well, bringing to us loan growth with acceptable yields and excellent credit quality. without the cost of supporting in-house origination teams. As anyone who has ever paid for coffee with an online wallet, or used a P2P app to split the dinner bill, or carried an affinity card to earn miles or reward points will tell you, partnerships are vital to the evolution of financial services. And First Internet Bank is proud of the role we have played in this financial services arena for the past 25 years. As I noted last quarter, we currently have a dozen live programs of varying purpose and scope and several other programs that are in various stages of implementation. As our attention is focused on bringing these programs live, we did not add any new programs during the quarter. However, we did activate a new service channel for one of our more significant partners, which provided a sizable increase in quarterly FinTech revenue. Ken will provide more details on that in just a moment. I want to temper your expectation. We are not forecasting revenue to continue to grow at that same rate in the remaining quarters of this year. However, the additional reoccurring revenue from this service channel will enable us to hit our forecasted FinTech revenue for the year, which we expect will be almost three times the amount we recognized last year. To wrap up on my comments, we delivered improved performance in the first quarter and look forward to the rest of the year with confidence. Furthermore, liquidity and credit quality remain strong and capital levels are sound. With the continued evolution of our loan portfolio mix, the positive outlook for our SBA team, and stabilized deposit pricing, we believe we are well positioned to continue to achieve higher earnings and improve profitability for the remainder of 2024 and beyond. To touch on a topic I covered last quarter, many of you recall that First Internet Bank stock along with many other stocks, fell out of the Russell 2000 Index around the same time as the regional bank failures in the spring. As we head into the reconstitution of the Russell Index later this quarter, we are keeping an eye on where the estimates of minimum market capitalization are being reported. While there are certainly no guarantees with a recovery in the stock price over the last six months, especially relative to the small-cap universe as a whole, We remain optimistic that First Internet stock might again qualify for inclusion in the index. Finally, I want to personally thank the entire First Internet team for the dedication to our clients and their contributions to our strong results. Our team's talent and commitment to constant improvement give me great confidence in the future of First Internet and our long runway of opportunities ahead as a premier technology-forward digital financial services provider. With that, I'd like to turn the call over to Ken for more details on the financial results. Thanks, David. As David covered the loan portfolio, let's turn to slides five through seven, where I will cover deposits in more detail. Deposit balances grew by $206.8 million, or 5.1%, from the prior quarter as we saw strong demand across our customer base. Non-maturity deposits were up over $66 million, or 3.6%, due to increases in FinTech partnership deposits and money market balances. Deposits from our FinTech partners included in broker deposits were up 32% from the fourth quarter and totaled over $280 million at quarter end. Additionally, these partners generated almost $6.1 billion in payments volume, which was up 29% from the volume we processed in the fourth quarter. Total FinTech partnership revenue was $610,000 in the first quarter an increase of 47% over the linked quarter, with the majority of this revenue consisting of recurring interest income, oversight, and transaction fees. Related to CD activity during the quarter, total balances were up $134 million from the linked quarter, driven by strong demand in the consumer channel. We originated $632 million in new production and renewals during the first quarter at an average cost of 4.96% and a weighted average term of 23 months. These were partially offset by maturities of $475 million with an average cost of 4.62%. Looking forward, we have $360 million of CDs maturing in the second quarter of 2024 with an average cost of 4.76% and $383 million maturing in the third quarter with an average cost of 4.96%. So as we noted last quarter, the repricing gap between the cost of new CDs and the cost of maturing CDs is narrowing, which will continue to contribute to slowing the pace of increases in deposit costs. Additionally, we continue to reduce higher cost deposits when we can and used on-balance sheet liquidity to pay down some callable brokered CDs, as well as a maturing federal home loan bank advance. Looking at slide six, at quarter end, we estimate that our uninsured deposit balances were $1.1 billion, or 26% of total deposits, which is up $76 million from the end of the fourth quarter. The increase was due primarily to new customer balances and growth in existing depositor balances. After adjusting for Indiana-based municipal deposits and larger balance accounts under contractual agreements, our adjusted uninsured balances dropped to $859 million, or 20% of total deposits, which continues to compare favorably to the rest of the industry. Moving to slide seven, at quarter end, total liquidity remains very strong as we had cash and unused borrowing capacity of $1.7 billion. As mentioned a moment ago, we deployed some of the liquidity provided by deposit inflows to pay down higher cost broker deposits and to reduce our borrowings at the Federal Home Loan Bank, as well as to fund loan growth during the quarter. As deposit growth outpaced loan growth, the loans to deposits ratio declined to 91.5% from 94.4% at the end of 2023. At quarter end, our cash and unused borrowing capacity represented 158% of total uninsured deposits and 203% of adjusted uninsured deposits. Turning to slides eight and nine, net interest income for the quarter was $20.7 million and $21.9 million on a fully taxable equivalent basis, up 4.7% and 4.2% respectively from the fourth quarter. The yield on average interest earning assets increased to 5.45% from 5.28% in the linked quarter due primarily to a 23 basis point increase in the yield earned on loans and a nine basis point increase in the yield earned on securities, partially offset by a six basis point decline in the yield earned on other earning assets. The higher yields on interest earning assets combined with the growth in average loan and securities balances produce solid top line growth in interest income, increasing nearly 3% compared to the linked quarter, As deposit costs and average interest bearing balances were up modestly, net interest income was up almost 5% during the quarter, building on last quarter's increase and further reinforcing our belief that net interest income hit its low point in the third quarter of 2023, as shown in the bar chart on slide eight. Net interest margin for the first quarter was 1.66% and 1.75% on a fully taxable equivalent basis. which were increases of eight and seven basis points respectively from the fourth quarter. The net interest margin roll forward on slide nine highlights the drivers of change in fully taxable equivalent net interest margin during the quarter. The relative stability in deposit costs is highlighted in the graph on slide nine that tracks our monthly rate on interest-bearing deposits against the Fed funds rate, which has been and will continue to be a catalyst in driving net interest margin expansion. With our focus on improving the composition of the loan portfolio and replacing lower yielding assets with higher yielding and variable rate production, we continue to forecast growth in total interest income in the second quarter of 2024 and throughout the year. Currently, we expect the yield on the loan portfolio to be up around 15 to 20 basis points for the second quarter. Furthermore, with short-term interest rates stabilized and narrowing repricing gap in CDs, we anticipate only a modest increase in interest-bearing deposit costs, similar to what we experienced in the first quarter. Turning to non-interest income on slide 10, non-interest income for the quarter was $8.3 million, up 900,000 from the fourth quarter. Gain on sale of loans totaled $6.5 million for the quarter, up 8% over the fourth quarter, and setting another quarterly record for our SBA team. Loan sale volume was $80 million, down 11.5% due to seasonal factors compared to the linked quarter, but this was more than offset by higher net gain on sale premiums, which were up 150 basis points quarter over quarter. We also saw an increase in net servicing revenue during the quarter as our service SBA portfolio continued to grow following the strong origination results of the last two quarters. Moving to slide 11, non-interest expense for the quarter was $21 million, up almost $1 million from the fourth quarter and in line with our expectations. The increase was due primarily to higher salaries and employee benefits and marketing expenses. The increase in salaries and employee benefits was the result of annual resets on certain employee benefits, payroll taxes, and incentive compensation accruals, as well as annual merit increases and new hires. partially offset by lower small business incentive compensation and lower medical claims. The increase in marketing expenses was due mainly to higher advertising, media, and seasonal sponsorship costs. Turning to asset quality on slide 12, David covered the major components of asset quality for the quarter in his comments, so I will just add some commentary around the allowance for credit losses and the provision for credit losses. The allowance for credit losses as a percentage of total loans was 1.05% at the end of the first quarter, up four basis points from the fourth quarter. The increase in the allowance for credit losses reflects the addition of specific reserves related to the additional non-performing SBA loans, as well as loan growth in portfolios with higher ACL coverage ratios, partially offset by the positive impact of economic data on forecasted loss rates in other portfolios. The provision for credit losses in the first quarter was $2.4 million, compared to $3.6 million in the fourth quarter. The provision for the first quarter was driven primarily by the additional specific reserves, growth in certain loan portfolios, and the modest net charge-offs. If you exclude the balances and reserves on our public finance and residential mortgage portfolios, which have lower coverage ratios given their lower inherent risk, the allowance for credit losses represented 1.25% of loan balances. Furthermore, with minimal office exposure, we do not require the excess reserves around that asset class that many other banks have. Moving to capital on slide 13, our overall capital levels at both the company and the bank remain solid. The tangible common equity ratio was 6.79%, down modestly from the fourth quarter. This was due primarily to an increase in accumulated other comprehensive loss as medium and long-term interest rates increased throughout the first quarter. The tangible common equity ratio was also impacted by the strong deposit growth and increases in cash balances during the quarter. If you exclude accumulated other comprehensive loss and adjust for normalized cash balances of $300 million, the adjusted tangible common equity ratio would be 7.61%. From a regulatory capital perspective, the common equity tier one capital ratio remains solid at 9.52%. At quarter end, tangible book value per share was $41.83, which is up 1% from the fourth quarter and up almost 7% year over year. Before I wrap up, I would like to provide some updates on our outlook for the remainder of 2024. As a reminder, our approach to forecasting this year is to assume that the Federal Reserve maintains a higher for longer outlook and does not lower the Fed funds rate during 2024. We still feel confident that annual earnings per share for the full year of 2024 will be in the range of $3 per share. However, some of the moving parts that get us to that number have changed a little bit. With regard to net interest income, as I mentioned earlier, We expect loan yields to continue to increase while growth and deposit costs should be relatively modest. With loan growth in the range of 5 to 10% for the year, we still expect annual net interest income to be up 20% for 2024 with fully taxable equivalent net interest margin continuing to increase throughout the year and be in the range of 1.9% to 2% in the fourth quarter. Related to non-interest income, with the combination of our SBA team continuing to deliver consistently higher origination activity and stabilization in secondary market pricing, our outlook is even more optimistic than it was at the beginning of the year. However, the expectations for higher fee revenue will be partially offset by higher expenses as we expect to add additional personnel in SBA and risk management, as well as make additional investment investments in technology, and in our risk management processes around our FinTech partnerships program. With that, I will turn it back to the operator so we can take your questions. Sylvie? Thank you, sir. Ladies and gentlemen, if you would like to ask a question, please press star followed by one on your touchtone phone. You will then hear a three-tone prompt acknowledging your request. And should you wish to withdraw from the question queue, simply press star followed by two. And if you're using a speakerphone, we do ask that you please lift the handset before pressing any keys. Please go ahead and press star one now if you have any questions. And your first question will be from Tim Switzer at KBW. Please go ahead. Hey, good afternoon. Thanks for taking my question. Hi, Tim. Hi, Tim. My first one is I appreciate the guide on NII and NIM trajectory, and you guys have been conservative excluding the impact of rate cuts. If we get, say, one or two rate cuts near the back half of the year, what kind of impact do you guys think that has on NII and the NIM? And then does the beta on deposits kind of change over time? If we get into 2025 and it's a series of rate cuts, does that beta kind of accelerate and you start to get even more of a benefit over time? Let's take the first part of your question first. I think, roughly speaking, depending on how you want to slice it, it's, you know, a 25 basis point rate cut is roughly a million dollars or so of NII. So that's on an annualized basis. So I guess you would have to, wherever you want to choose to put the timing in on that, but that's about an annualized number. On the betas on the deposit side, We do have, we have over a billion dollars of deposits that are tied directly to Fed funds. So the beta on those is going to be 100% regardless. And then you get into CDs, if you're repricing CDs, those generally follow 100% beta or pretty close to that as well. So CDs will reprice down as well. We probably got some other money market and savings accounts where the beta isn't going to be 100. It's probably closer to, say, 50 or 60. And those have been pretty consistent over time. But that's kind of the way that I would look at deposit betas on the way down. Great. That's really helpful. And then I have kind of a more specific question, but one of your disclosed borrowers and your single tenant lease financing portfolios. Red Lobster, he recently is going through a bankruptcy. And I don't know if you can talk about a customer specifically, but could you generally talk about your collateral and how a bankruptcy could work? Because I know it's the company, not necessarily the franchises and your single tenant portfolio, how that could work. And then if you have other exposure in your other portfolios like franchise finance. The Red Lobster side of things, we just actually had a credit committee meeting this morning and got an update. At our peak, we were almost $82 million in Red Lobster facilities across the country, and that's now down around the $40 million mark. We've been, on our single tenant lease portfolio, it's the borrower first, property second, franchisor third. Red Lobster happens to all be company-owned stores. There's not really a franchisee involved. What we are hearing from the company at this point, it's been post-COVID the company's changed hands twice. It's really a restructuring of some of their long-term debt. If you remember back when COVID hit, Red Lobster was in trouble with No delivery system, no online ordering, no whatever. So they put a lot of infrastructure into play over the last three or four years. Ran up some pretty significant costs. Question whether the current owner paid the right price or not when they bought the services. But all of our buildings are in great metropolitan locations. Our average loan-to-value on the real estate itself is under 50%. We have had Red Lobsters over the years go dark and be repositioned generally as some other franchise restaurant or label within a matter of a couple, two or three months. And we've been in them for seven, eight years now and we've never had an account show up on a delinquency list. So we're pretty confident right now that we're okay. I don't think they're going to go into full liquidation. That would definitely change things a little bit. But with particularly the borrowers we have in the Red Lobster vertical, they have the capacity to carry those loans for months until they could be repositioned into something else. So at the current time, we're not too worried about what's going on with them. Great. That was awesome, Culler. Really appreciate it. Did you say all these properties, they're all company-owned and none of them are franchises? Yeah, the actual operations of the restaurant are done by Red Lobster. It's not a franchisee. They're all company-owned locations. Okay, so your borrower for all of these is actual Red Lobster, the company? No, no, no. They're individual real estate investors. Individual, virtually all of them are consumers. In our single-tenant lease product, we... I don't know, Tim, you've kind of been listening in on our call. The single penalty side of things, it's individuals that'll buy, take Red Lobster aside, but like CBS comes in and puts a new drugstore here in Fishers. They don't want to hang on to the property and the real estate, and a single store doesn't get the insurance companies or the big banks interested in buying them in the one-off. So we kind of fill that market for them where an individual investor will come in and buy it. Most of them have $1031 associated with them, so their portfolio as a whole is right at 50% or less in loan to value on the actual property. So we value the property, we make the credit decision based on the investor, and then we look to the franchisee or franchisor as kind of a third-party repayment stream. We've been doing this for 12 years now, probably $2 billion plus in origination, and all that time we've only had one loan that we took a loss on. So it's just a rock-solid product. We've weathered different reorganizations. Applebee's a few years ago went into massive reorganization. Six, nine months ago, Burger King did the same thing, and it's had no impact on our portfolios and our clients. I got you. That makes sense. Really appreciate the color details there. That's all for me. Yeah. Welcome aboard. Thank you. Next question will be from Brett Rabaton at HVD Group. Please go ahead. Hey, good afternoon, guys. Hey, Brett. Hey, Brett. Wanted to start with SBA and well, I guess first, just let me go back to the guidance. I think you were giving guidance for 30% fee income growth and 8% to 10% expense growth. And it sounds like both those numbers are a little higher now, but I didn't get, if I heard, if you guys gave an exact number, I didn't get one if you're pointing to a specific number for those two items. I wanted to let you do a little bit of homework. Yeah, I would say that the expenses are probably you know, probably closer to some of the investments we have to make are probably closer to the 10 to 12% range. But I can tell you that the outlook for SBA is up significantly from where we had talked about at the end of the year. Okay. And as it relates to SBA, you know, another bank today was out building reserves on their SBA portfolio and was basically just indicating that some Mainstream SBA borrowers were struggling with the higher rate environment and the impact to their overall debt obligations. Can you guys maybe talk about how much of your SBA portfolio on balance sheet is guaranteed versus non-guaranteed, and then if you're seeing anything specific in that portfolio? What's on the balance sheet is our risk. That's 100% on us. That's in the outstanding asset. As we've sold loans over time, and during COVID, there was a period where the SBA was guaranteeing 90% of the balance. So I don't know how that blends out between that 25-10 number. But to give you a feel, Brett, we just, the most current information, the SBA, like any governmental agency, runs slow. We received a report last week, that's the end of November data, and what they classify as non-performing assets, anything of 90 days or more past due or on non-accrual, our ratio was 2.19%, and we're rated low risk compared to our peer group, which was 8.02%. So we're one quarter of a percent of what the industry as a whole was experiencing. So SBA is a higher delinquency and will potentially have higher loss rates then we're used to, you know, we've been in the RV industry for 25 years and have a cumulative or an average of less than 75 basis points and losses. So SBA numbers are a little high for us, but again, on industry standards, we're on the low end of the risk spectrum as far as the SBA products. So we're diligent on the underwriting. Some people view, you know, anybody can get an SBA loan because it's government guaranteed and you only have a, 25% risk, we don't view it that way. We still have very solid credit underwriting standards that we comply with. So again, it's high for us, but from an industry level, we're very comfortable where our portfolio is at. Okay, that's helpful. And then just lastly, you mentioned building up the FinTech from a risk perspective with back office hires. You know, with the novel activity guidance from the SEC and now from other regulators as well, is it fair to assume that you're going to be building capital ratios and liquidity from here? Or how should we think about, you know, maybe some of the requirements that the regulators are imposing on balance sheets? Well, I think. Well, I mean, probably, I mean, just from an overall perspective, we view this year as building capital anyways. And I think we've maintained pretty high liquidity, high levels of liquidity over the last several years. I don't think, I mean, we think about it in the context of the overall organization, not necessarily specific to one line of business. We can tell you, we obviously can't give you ratings, Brett, but we've completed the safety soundness exam for 2023, and they had no questions or concerns on our capital ratios for liquidity. Okay. Great. Appreciate all the cover. Thanks, guys. All right. Appreciate it, sir. Next question will be from George Sutton at Craig Hallam Capital Group. Please go ahead. Hey, guys. This is James on for George. Nice results and thanks for taking my question. Hey, James. How you doing, sir? I'm good. Could you talk about the FinTech partner pipeline a little bit, that pipeline growing, how have conversations with customers that have been in the pipeline for a while kind of evolving? And then longer term, what's sort of your vision for the FinTech franchise in terms of types of partnerships like lending versus deposit, the potential financial contribution? I'll take it and then Ken might give you some more color. On the sales side or the pipeline end of it, we have 10 in some state of being live or in process of testing. We've got 10 more. We're sitting on about 20 that were in some kind of contract negotiation, some part of due diligence that we're looking at. Our play is to kind of clean up that pipeline. There's a lot, a lot of noise in FinTech now with Synapse being acquired or in the process of being purchased. Treasury Prime has changed their operation. There's just a lot of craziness going on. We've got some very solid prospects. As Ken stated, we had a nice bump up in revenue here in the first quarter. It's not going to double down for the rest of the year every quarter, but we've got some really strong players in the pipeline and some nice stuff coming. We're getting some interesting at-bats with some of the things that's happening in the marketplace. So we're going to kind of keep our powder dry and look for really good opportunities. I would tell you in the 10 that are not live, there are some of them that now because of capital constraints on their part or ability to raise additional capital and pressure that they're getting from their original investors, as we all know, 12, 18 months ago is all about growth. Nobody cared about the bottom line. And that's done a 180 on them now. It's all about bottom line, not necessarily growth. And some of them are trying to figure out how to get to a positive bottom line. So one of my philosophies for 40 years in business is when there's the greatest chaos in the marketplace is also the greatest opportunity. So we're kind of watching what's going on and we'll selectively... pick up opportunities where we can. Some of the folks will drop out and some folks will pop in. So it's still a good growing part of our business. Ken said we're going to at minimum triple down on what we did last year, which is great growth. And some of the stuff on the other side, I'll go back to the comment about staffing and Compliance stuff. A lot of those part of this can also mention we're installing some new tools. A lot of those things can be tracked electronically now. New tools, new services. So it is a combination of staff. Somebody's obviously got to run those tools, but control and operation and staying on top of the best companies are a lot easier with some of the newer technology tools out here today. So a little bit of that is get the house in order, get that set up, and that will allow us to even grow some of them a little bit faster. So crazy market, but I still think it's a good market all in all. Gotcha. And then what percent of the loan book today is variable rate, and where would you expect that mix to trend in a higher for longer scenario versus scenario where we get a couple of breakouts? You know, we're kind of in the low 20% of the portfolio, probably getting closer to 25. And, you know, look, our goal, and that's probably coming from somewhere closer to 10% to 12%. So I think, you know, the higher for longer scenario, we certainly want to keep managing it. But probably just even if rates come down, it's still just prudent to have a higher portion of the portfolio in variable rates. assets so our you know we're trying to trying to drive that that number as high as we can here over the next you know next couple years makes sense um and then last one for me just what do you guys think is working so well in sba thanks guys i would say um some of our peers over the last 18 to 24 months uh for any myriad of reasons coming out of covet balance sheet issues uh deposit issues and some of the smaller community banks where all of a sudden their customers have woke up to the fact they get much better money elsewhere and pulling deposits there's just a lot of people that have pulled back in the sba arena over the last 12 to 18 months and we've been able to hire some absolutely tremendous people with very seasoned veterans in the industry with uh good lead sources, good operational background, good oversight. So I think our key to success versus the rest of the market, quite honestly, has been the people we've been able to attract over the last 24 to 36 months. There's a lot of folks that put the brakes on and either stopped lending in total or pulled back for a period of time. As you well know, any good salesperson can't stand idle for very long. So we've been very, very fortunate to kind of hit the market at the right time and really build a tremendous team of people all across the country in the SBA arena. So I think that's our key to success compared to some of the other folks in the market today. And again, our underwriting standards. We don't view SBA licenses, abilities, and loans to anybody. We still have some standards and protocol that we go through. We do not approve every loan that we see. And I think in some respects, we're a little faster. and maybe a little more efficient than some of the other facilities because of some of the tech we're able to use. Some of the systems in SBA are very antiquated. Some of them are real close to old green screen still. But we've got great people behind it that can move things along. And I think our key to success really is people. Thank you. Next question will be from Nathan Race at Piper Sandler. Please go ahead. Hi, guys. Good afternoon. Thanks for taking the question. Hey, Nathan. Just going back to your comments kind of around some of the CDs that have matured over the next couple quarters, I'm not sure if you called it out, but just in terms of the replacement cost today. Oh, yeah. Well, I mean, I guess if you make the assumption that our kind of our blended rate on new originations and renewals currently, which is kind of a 495 number. By the time we get to the third quarter, we're pretty much right on top of that. And in fact, over the next 12 months, there's $1.2 billion of CDs maturing at roughly that same rate. So we've kind of, you know, again, in another quarter or so, we're going to hit that repricing where the repricing gap is essentially zero. Okay. Provided the Fed doesn't jump right on us. Right, right, right. And, you know, assuming the Fed remains on pause through the end of this year, just based on what you guys are seeing from a competitive perspective, excuse me, relative to the other internet banks, do you foresee the opportunity in your margin guidance to reduce certain rates ahead of Fed cuts, or how are you guys kind of thinking about that opportunity potentially? We dropped CD rates, Nate, from six months up about a month ago. We just talked earlier this week on a few of them. We're going to drop another five basis points. I think everybody's, from the financial institution level, if you've been watching money market rates, American Express, Ally, a bunch of folks have bumped down. I think Cap One has lowered their money market rates by 5, 10 basis points here in the last 30, 45 days. So I think the industry is ready to drop rates. And as they do, we will as well. And as Ken said, we're right on top of it on the CD level. And I think we'll actually get that turned around the other way so the replacements coming on board today will be cheaper than what's rolling off in the not too distant future. And if the, I agree 100% with Ken, if the Fed does bump anything, it'll be 100% data obviously on the Fed funds floaters, but on the CD world, that'll be almost 100% across the line too. Our basic money market account rate for the folks less than a million in deposits that'll probably stay pretty constant and won't be a 100 percent beta maybe a five ten point bump down when the fed moves but yeah anything will help us and i think we're in a great position going forward that we could actually be in a position in the third and fourth quarter for the replacement funds to be cheaper than what's rolling off okay great very helpful um and then just on deposit growth expectations i think can get guided to 5 to 10% loan growth this year. Is the expectation that deposit growth will largely run at a consistent level, or is there maybe just an opportunity to bleed down some of the excess cash that you still have on the balance sheet? Probably a little bit of both, right? I mean, we've built some liquidity here in the first quarter. I think we recognize that it's probably smarter to keep higher liquidity than historical, but there's, I think we expect to probably bleed down a little bit of that, but I expect deposit growth to, you know, obviously it was much more than loan growth in the first quarter, but it should, you know, keep pace with loan growth, maybe a little bit more as we bleed some cash down, but it should, I mean it should be relatively, you know, in line with loan growth throughout the rest of the year. We also have some commitments we made back in the financial craziness following Silicon Valley and everything blowing up. We made some pretty long-term commitments, long-term at the time of 12 months, 14, 18-month commitments with individuals that had a Fed Funds plus 10, plus 20, plus 25. And we've got a bunch of that coming due here. almost 250 to 300 million over the next three to six months. And we're in a position now that we can let that go away and replace it with less than Fed Funds money. So as Ken said, we're keeping a little extra liquidity on the balance sheet today for opportunities like that repriced up and let some of that more broker type money go away here over the next three to six months. Yeah, that makes sense. And David, I think earlier you mentioned revenue from partnerships is expected to double year-over-year versus 2023. I guess that number is not necessarily disclosed or released, so can you kind of help frame out specifics around that? Yeah, we, as I think I said in my comments, we had about 600,000-plus of FinTech partnership revenue in the first quarter. And when we look at our forecast, that number is going to grow. It was up almost 50% over fourth quarter. In David's comments, what he was trying to say is that don't expect that to grow 50% every quarter here. But there is a big piece of that that's recurring revenue. So we're going to see some more kind of more single to low double digit growth in that number. But for the full year, our expectation is that FinTech partnership revenue, which includes interest income and fee income, will be about three times what our revenue was last year. I'll pinpoint that one for you, Nate. Our revenue last year was around $900,000. So we're going to push it up between that $2.5 to $3 million mark this year. And that's including both the income and interest income? I heard you right. Yeah. Yep. Right. Yep. OK. I believe that's all I had. Thank you. Oh, I'm sorry. Ken, just lastly on the tax rate going forward, um depends on who becomes president right um no i think you know our effective tax rate our effective tax rate this quarter was seven and a half um you know it's probably that's probably not a bad number for the next few quarters obviously as income continues to grow and as we you know get into next year as well if you take a fourth quarter eps number and just run rate that for next year that that number is going to migrate probably closer to 10 to 12%, but I think in the near term here, kind of seven and a half to eight is probably an okay number. Okay, great. Thanks, sir. Thanks, Nate. Next question is from John Rodas at Janney. Please go ahead. Hey, good afternoon, guys. Hey, John. Actually, Ken, I was going to ask you on the tax rate, but um you know i guess i i'm just curious on the loan growth five to ten percent that's a pretty pretty wide range last quarter you said five five to six percent just curious why you know why such a wide range um you know some of it is you know in in this environment too i i think what we've seen and this probably doesn't surprise anyone is that some of we probably had to slow down some I mean, we had slow prepayment speeds in the model to begin with, but they've probably even slowed down further this year. So we're probably retaining balances at a higher rate than we would have originally forecast. And then, you know, just as we've talked about with SBA having a very strong year, our construction team continues to do well. We've had a few deals in our construction space that We're scheduled to pay down here in the first quarter or early second quarter, but we've kind of converted them to a mini perm and we put them into the investor CRE bucket and we'll be holding those for longer. So those are just some of the dynamics that are impacting that estimate of growth, overall growth for the year. Okay. The other side is too, John, we're out there, we're seeing larger deals on the construction opportunities, particularly in the warehousing space, as more and more stuff is coming back to the U.S. and being built locally and stored locally, shipped locally. Warehouse transactions are huge. Just here in the state of Indiana, in the last 48 hours, they've announced like 4 million in warehouse space needs and companies coming into the state of Indiana. And those are big, choppy, big chunks that are kind of choppy. So we could pick up some of that business, which would be great for us. And there's just a lot of activity. So our CRE guys are pretty bullish on what's out there in the marketplace right now. Okay. Thanks, David. Hey, Ken, just back to the tax rate. So you said near term, so it sounds like the next couple of quarters, you said 7.5% to 8%. And then and maybe going to sort of that 10 to 12% range? Yeah, I would probably walk it up in your model as we get, you know, again, as we, you know, continue to build net income quarter over quarter. Yeah, I mean, you know, you can probably walk it up from seven and a half to eight through this year. And if you're starting to work on a 25 or have a 25 number, it's probably maybe somewhere in the eight to 10 range there. Maybe even that's probably maybe even higher, maybe 10 to 12 there. Okay. And then Ken, just one final question. Just if you look at the level of fee income to total revenue for the quarter, it's 27, 28%. Do you think, do you think you can grow that, you know, if SBA continues to be strong, but the margins going up to, do you sort of think you stay in that state and that high 20, you know, 20, 25 to approaching 30%, I guess. Is that sort of the right way to think about it? Yeah, I think so. I mean, I think eventually, you know, we'll probably, you know, I guess if we assume for this year with no rate cuts and we're growing NII because we're repositioning the loan book and making more on loan yield than deposit costs are going up, that's good. I mean, when we start getting some real rate cuts, that might change a little bit because NII growth will accelerate. But I think you're looking at it. I think that's the right way to look at it, John. Okay. Okay. Thanks, guys. Have a great day. Thank you. Thank you. And at this time, Mr. Becker, we have no other questions registered. Please proceed. All right. Thank you, Sylvie. Thanks, everybody, for joining us on today's call. Obviously, there's a lot of craziness out here in the market at the current time, a lot of issues about the path inflation is going to take, and based on that, what the Fed might do on rate cuts. We're optimistic about our outlook, regardless of kind of what happens in that space. The strong performance, as we just discussed, about our commercial and consumer lending teams, including all the growth we've experienced in small business and construction, can drive even greater revenue growth for us, though in a stabilized deposit cost, and it paints a real favorable earnings picture for us going forward. As fellow shareholders, we remain committed to driving improved profitability and enhancing shareholder value. And we thank you for your support, your time today, and wish you a good afternoon. Thanks, everybody. Thank you, sir. Ladies and gentlemen, this does indeed conclude your conference call for today. Once again, thank you for attending. And at this time, we do ask that you please disconnect your lines.