Good day, everyone, and welcome to the First Internet Bancorp earnings conference call for the second quarter of 2022. And please note that today's event is being recorded. I would now like to turn the conference over to your host, Larry Clark from Financial Profiles. Please go ahead, Mr. Clark. Thank you. Good day, everyone, and thank you for joining us to discuss First Internet Bancorp's financial results for the second quarter of 2022. The company issued its earnings press release yesterday afternoon and it's available on the company's website at www.firstinternetbankcorp.com. In addition, the company has included a slide presentation that you can refer to during the call. You can also access these slides on the website. Joining us today from the management team are Chairman and CEO David Becker, Executive Vice President and CFO Ken Lovick. David will provide an overview and Ken will discuss the financial results. Then we'll open the call up to your questions. Before I begin, I'd like to remind you that this conference call contains forward-looking statements with respect to the future performance and financial condition of First Internet Bancorp that involve risks and uncertainties. Various factors could cause actual results to materially be different from any future results expressed or implied by such forward-looking statements. These factors are discussed in the company's SEC financial statements. which are available on the company's website. The company disclaims any obligation to update any forward-looking statements made during the call. Additionally, management may refer to non-GAAP measures, which are intended to supplement but not substitute the most directly comparable GAAP measures. The press release, available on the website, contains the financial and other quantitative information to be discussed today, as well as the reconciliation of the GAAP to non-GAAP measures. This time, I'd like to turn the call over to David. Thank you, Larry. Good afternoon, everyone, and thanks for joining us today. The First Internet team delivered another strong quarter, highlighted by robust commercial and consumer loan production while maintaining excellent credit quality. Through the first half of 2022, yields on new loan originations were up over 100 basis points compared to this point in time last year. We benefited from the rising rate environment and deployed existing on-balance sheet liquidity to drive growth in net interest margin. Fully taxable equivalent net interest margin increased five basis points to 274. For the second quarter, we are reporting net income of 9.5 million and diluted earnings per share of 99 cents. Excluding non-recurring expenses, which we will cover in just a moment, we recorded adjusted net income of 10.3 million, or $1.06 per diluted share. Adjusted for the non-recurring loans, we generated return on assets of 1% and a return on average tangible common equity of 11.15%. And both tangible book value per share and tangible common equity to tangible assets increased even as we repurchased over $11 million of our common stock during the quarter. Loan production was the highlight of the quarter. Total loan balances increased 201.3 million or 7% from the prior quarter, and now stand at an all-time high of $3.1 billion. Total portfolio originations for the quarter were $333.5 million, up almost 115% over origination volume in the first quarter. Nearly $250 million of that came from our commercial lending line. Our partnership with Apple Pie Capital, a FinTech-oriented specialty lender that focuses on lending to the franchise industry, will continue to be a standout performer in the second quarter. Together, we are providing credit to proven entrepreneurs throughout the country. We funded over $63 million of attractively priced franchise loans during the quarter and now hold nearly $170 million in this portfolio. Our public finance team had an outstanding quarter as well with over 37 million of funded originations during the quarter. The team has intentionally focused on shorter duration loans and with a rise in interest rates has capitalized on a number of opportunities to fund 12 to 18 month term loans at tax exempt spreads well above treasury yields. Singleton and Lease Financing also had a fantastic quarter. We funded over $50 million of new loans during the period. The single-tenant pipeline is approaching an all-time high, and as we neared the end of the quarter, the majority of the new production came in at an interest rate north of 5%. Construction lending continues to be another key line of business for us. Our team sourced over $65 million of new originations during the quarter, which included almost $17 million of funded balances. At the close of the second quarter, unfunded commitments in our construction line of business totaled $211 million, up 15% over the levels at March 31st. Despite the fact that gain-on-sale revenue was down in the second quarter, we remained very bullish on our SBA platform. We finished the quarter on a great note. June production was a year-to-date high for us, and that momentum has carried into July. The second half of the year is seasonally stronger for small business lending, Our pipeline is continuing to grow, and we expect strong originations in the third quarter. That said, the secondary market for the guaranteed portion of these loans has reverted to historical averages following the conclusion of government programs that inflated these premiums over the last two years. Because we have balance sheet capacity, we can and have added SBA loans to our portfolio rather than sell them when the market premiums are soft. After taking into account the lower amount of loan sales in the second quarter, as well as lower gain on sale premium expectations, we now forecast SBA gain on sale revenue to be in the range of $10.5 to $11.5 million per year. Overall, our commercial loan businesses are performing extremely well. The pipeline is up 28% from the end of the first quarter, which leaves us well positioned to capitalize on growth opportunities for the remainder of the year. And as we mentioned on the call in early May, we have additional opportunities in the commercial finance space that we are confident have substantial upside as we pair our balance sheet, capital, and nationwide lending expertise with specialized asset generation platforms. Our consumer lines of business also performed well during the quarter with higher balances in residential mortgage, recreational vehicles, and trailer loan portfolios. While rising interest rates and inflationary pressures may inevitably impact consumer demand, particularly in the residential mortgage, we experienced strong origination growth in our specialty consumer lines, which were up 72% over the first quarter. Our credit quality, meanwhile, remains excellent and among the best in the industry. During the quarter, our ratio of non-performing loans to total loans improved by 10 basis points instead of just 0.15% as we continue to resolve problem credits in a very positive manner. The last line of business I want to discuss is our ongoing strategy around FinTech partnerships and banking as a service. We have spent the last 12 months building out a robust risk management and compliance infrastructure to support this strategy. In my 40-year career, most of that in technology and software as a service, I have seen time and time again that you have to have the back of the house ready before you turn on the sales picket. We have brought on new talent with deep risk management experience in the banking as a service space. We have reallocated internal resources to ensure that we are building the appropriate policies and procedures to review, onboard, and monitor FinTech partners in a scalable manner. As FinTechs and bank partnerships with FinTechs are coming under increasing scrutiny from the regulatory world. Our goal is to ensure that we have a best-in-class risk management platform to support our banking as a service strategy. Furthermore, as many of you are aware, the fintech space is currently experiencing upheaval. Venture capital firms are focusing more on long-term viability and profitability as opposed to simply customer or revenue growth. We have a similar view and are approaching these potential partnerships methodically with rigorous due diligence to ensure that they have compelling unit economics, which will be accretive to earnings and are scalable across our platform. With these objectives in mind, we do have a number of initiatives in motion to help drive higher financial performance over the next several years. We are currently working towards finalizing agreements with two leading banking as a service platforms that are expected to both increase the number of FinTech partnership opportunities and make it easier for us to bring the partnerships to market faster. We are also actively sourcing and evaluating our own direct FinTech partnership opportunities. Since launching our FinTech partnership effort, we have reviewed over 100 opportunities. However, and to my comments earlier on the long-term viability of FinTechs, the funnel is very steep. Most of them have been of low or average quality that do not meet our organizational objectives or quality standards. In just the last two quarters alone, we have evaluated over 80 opportunities. While we are in various stages of evaluation with several of these FinTechs, we have only moved on to further due diligence with three of them. And with only one have we elected to move on to implementation. We went into this with our eyes open about the state of the FinTech space and the patience to search for the right partnerships. So to wrap up the FinTech discussion, we remain committed to building a strong presence in the banking as a service and FinTech partnership space and remain optimistic that over the long run, it will provide new channels for lower cost deposits, fee revenue, and lending capabilities. However, we only do so in a manner that has a rigorous risk management framework and with partnerships that meet our organizational and financial objectives. Before I turn it over to Ken, I would like to recognize the entire First Internet team for their commitment to our customers and the company's success. In the second quarter, we said goodbye to three senior leaders who retired. Associated with their departures, we incurred an expense of $300,000 in accelerated equity compensation. of expenses one time, their legacy will be long-lasting. I wouldn't be surprised if they're listening to this presentation, and so I thank each of them for their enduring contribution to our organization. I hope the fish are biting and the fairways are rising up to meet them. I believe First Internet has been able to attract and retain talent of their caliber because we foster a workplace culture that encourages innovation, collaboration, and customer focus while supporting work-life balance. We also champion diversity as evidenced by the composition of new hires we brought aboard in the first half of 2022. A broader spectrum of backgrounds and experiences produces more ideas and creativity and ultimately better results for all of our stakeholders. It was gratifying to see these attributes recognized when our employees voted us one of the top workplaces in central Indiana by the Indy Star for the ninth consecutive year. As an employer of choice, we felt the responsibility to address the rapid rise in transportation, housing, and food costs in order to allow our employees to devote their best mental energy to serving our customers. In the second quarter, we implemented a $20 minimum hourly wage for full-time employees across the company. Additionally, we paid a bonus to those employees most impacted by the current inflationary environment. The bonus amounted to $500,000 as a one-time expense, one I was very proud to support. For more than two years, we have been living in extraordinary times. We intend to stand behind our professionals who have stood with us and our customers through it all. I would like to thank the entire First Internet Bank team for their consistent execution of our strategies and for delivering solid operating and financial performance. while providing an exceptional experience for our customers. With that, I'd like to turn the call over to Ken to discuss our financial results for the quarter. Thanks, David. Looking at slide four, total loans at the end of the second quarter were $3.1 billion, up 7% from the first quarter, and up 4.2% from June 30th of 2021. David covered the highlights for the quarter from a lending perspective, including the growth pretty much across the board in our commercial segments, as well as strong growth in our specialty consumer lines. This activity was offset by decreases in healthcare finance, which has been in a runoff mode for several quarters, and in construction lending, where we had about $34 million of loans convert to permanent financing and another $8 million pay off. Moving on to deposits on slide five, Overall, deposit balances were down modestly from the end of the first quarter, but we continued to see notable improvement in the composition of our deposit base. During the quarter, non-maturity deposits increased by $53.5 million, due primarily to a $144 million increase in banking as a service deposits from a relationship that we developed in the first quarter. However, this was partially offset by a $112 million decline in money market accounts, due mainly to some customer activity that can be uneven from quarter to quarter. Additionally, CDs and broker deposits continued their downward trend, decreasing $119 million, or 10.2%. Compared to the first quarter, the cost of interest-bearing deposits increased four basis points. Turning to slides six and seven, net interest income for the quarter was $25.7 million, and $27.1 million on a fully taxable equivalent basis. Both were relatively stable with the first quarter. With the strong loan production during the quarter, we capitalized on the opportunity to further optimize the balance sheet by deploying excess liquidity to fund higher yielding originations as well as support continued CD and broker deposit maturities. We were especially thrilled that we were able to effectively offset the expected decline in net interest income from revenue on tax refund advance loans, which totaled $2.9 million in the first quarter. The yield on average earning assets increased to 3.65% from 3.58% in the first quarter due primarily to a 33 basis point increase in the yield earned on securities and a 66 basis point increase in the yield earned on other earning assets. While the reported yield on average loans was down 21 basis points from the first quarter, If you exclude the effect of the revenue we received on tax refund advance loans, the yield on the loan portfolio increased seven basis points to 4.29%, again reflecting the strong growth and higher pricing on new originations. We recorded a net interest margin of 2.60% in the second quarter, an increase of four basis points from 2.56 in the first quarter, and fully taxable equivalent net interest margin increased five basis points to 2.74%. As you can see on slide 7, the five basis point improvement was driven by a five basis point contribution from securities and a four basis point contribution from cash, partially offset by modestly higher deposit costs and the impact of lower reported loan yields, which again included the effect of tax refund advance lending in the first quarter. As you can see on the graph on slide seven, thus far in this rate tightening cycle, we have been able to keep deposit costs relatively constrained in comparison to the increase in the Fed funds rate. As we noted in the earnings release, given the 150 basis point increase in the Fed funds rate beginning in March and through June 30, we have not increased the rate paid on consumer, small business, and commercial interest-bearing demand deposits. Related to money market products during this period, The rate paid on consumer money market balances increased 50 basis points, resulting in a cycle-to-date deposit beta of 33%, and the rate paid on small business and commercial money market balances increased 30 basis points, resulting in a cycle-to-date deposit beta of 20%. With small business and commercial balances now representing 62% of total money market balances, the all-in cycle-to-date deposit beta on money market products is 25%. With regard to our outlook on net interest income and net interest margin for the remainder of the year, I would like to highlight a couple observations. First, this is one of the few times in the history of the bank that money market rates have been lower than the Fed funds rate. So we are effectively making a positive spread on our cash balances at the Federal Reserve. Second, during the last cycle, we relied on higher cost, higher beta CDs to support balance sheet growth. As we entered the current cycle, The improved composition of our deposits means we are funding growth with lower cost and lower beta non-maturity deposits. As far as top line interest income goes for the second half of the year, we feel confident that the combination of continued loan growth and higher yields on new production, as well as variable rate assets repricing higher, will drive strong growth in total interest income. On the funding side, with higher forward rate expectations, we do expect deposit costs to increase as well. However, we also expect that the pace of increase in total interest-bearing deposit costs to be somewhat lower than the increase in interest-earning asset yields. As a result, we forecast continued growth in net interest income with modest net interest margin expansion. Turning to non-interest income on slide eight, non-interest income for the quarter was $4.3 million, down from $6.8 million in the first quarter. The decrease was a result of a decline in gain on sale of loans, lower other income, and lower revenues for mortgage banking activities. David covered the activity and the outlook for our SBA line of business. So beyond that, other income declined $300,000 due primarily to a decline in the value of fund investments carried at fair market value. And consistent with other mortgage originators, we saw a decline in mortgage revenue due to a decrease in interest rate locks and sold loan volume driven by the higher rate environment and its impact on both the purchase and refinance markets. In terms of mortgage banking revenue going forward, given the broader negative outlook for the mortgage industry, we are now decreasing our forecast for the remainder of the year. We now expect mortgage revenue to be in the range of $5.5 million to $6.5 million for the full year of 2022. This forecast represents the outlook for our existing digital direct-to-consumer and central Indiana-based mortgage businesses. With the current challenges in the mortgage market, we are in the earlier stages of evaluating a couple innovative partnerships that could potentially open up new origination channels for us. More to come on these opportunities on future calls. Moving to slide nine, non-interest expense for the second quarter was $18 million, down $800,000 from the first quarter. The decrease was due primarily to lower loan expenses, consulting and professional fees, and other expense, partially offset by increases in salaries and employee benefits and marketing costs. The decrease in loan expenses was driven primarily by lower service and fees, as $900,000 of fees related to the tax refund advance loans were incurred in the first quarter as opposed to a nominal amount of such fees in the second quarter. The decrease in consulting and professional fees was due primarily to $900,000 of non-recurring consulting fees that were incurred in the linked quarter. Additionally, we incurred $100,000 of acquisition-related expenses in the second quarter as opposed to $200,000 of these costs in the first quarter. The higher salaries and employee benefits expense was due mainly to the $500,000 discretionary inflation bonus and $300,000 of accelerated equity compensation that David mentioned in his comments, partially offset by lower incentive compensation in the company's small business lending and mortgage banking divisions. The increase in marketing costs was due to higher media costs, mortgage lead generation costs, and sponsorships. Now let's turn to asset quality on slide 10. As David mentioned earlier, credit quality remains excellent and even improved during the quarter as non-performing loans and non-performing asset ratios continue to decline. Net charge-offs of $283,000 were recognized during the second quarter, resulting in net charge-offs to average loans of four basis points. Excluding net charge-off activity related to the final balance of tax refund advance loans, We recognize net recoveries of $100,000 resulting in net recoveries to average loans of one basis point during the quarter, our second straight quarter of net recoveries. The provision for loan losses in the second quarter was $1.2 million compared to $791,000 for the first quarter. The length quarter change was driven primarily by the growth in the loan portfolio. The allowance for loan losses increased $900,000, or 3.2%, to $29.2 million as of June 30, 2022, compared to $28.3 million as of March 31, 2022. And the ratio of the allowance to total loans decreased three basis points to 0.95% as of June 30, 2022. The ratio of the allowance to non-performing loans increased to 644% at quarter end compared to 399% as of March 31st due to the increase in the allowance and a decrease of $2.6 million or 36% in non-performing loans. The decrease in non-performing loans was due primarily to the upgrade of a C&I relationship and the full payoff of a single tenant lease financing loan. With respect to capital, as shown on slide 11, our overall capital levels at both the company and the bank remain strong. Our tangible common equity to tangible assets ratio increased four basis points to 8.81%, which is the highest it has been in recent history. Additionally, while many banks are experiencing a decline in tangible book value per share, ours increased during the quarter, to $38.35, up from $38.21 in the first quarter, and up almost 7% year over year. During the second quarter, we repurchased 294,464 shares of our common stock at an average price of $37.77 per share as part of our authorized stock repurchase program. including shares repurchased in the fourth quarter of 2021 and the first quarter of 2021 or 2022, we have repurchased 498,167 shares at an average price of $41.50 per share through June 30th. In total, we have repurchased $20.7 million of stock under the total authorization of $30 million. With regard to capital management going forward, we enjoy being in the position of having excess capital as it provides tremendous flexibility. As David mentioned earlier, our lines of business have strong pipelines, and we continue to explore new opportunities in both the commercial finance space and through banking as a service and FinTech partnerships. We want to be able to capitalize on these opportunities as they arise, as these are what will drive outsized earnings growth in the years to come. However, that flexibility also allows us to remain in the market for our stocks, supporting our shareholders when the price is not reflective of our franchise value. And now turning to slide 12, we continue to feel we are much better positioned for a rising rate environment than we were at the beginning of the last rate tightening cycle. Over the last two years, we have improved our deposit composition with a larger percentage of non-maturity deposits. And as I mentioned earlier, During the last cycle, we were much more reliant on CDs to support balance sheet growth, which experienced deposit betas at or in excess of 100%. Furthermore, cycle to date, we are experiencing much lower betas in our non-maturity deposits than in previous cycles. And even within money market balances, our ability to grow small business accounts, which are much less rate sensitive than consumer balances, has muted the impact of price competition on our all-in cost of deposits. We also continue to remain focused on originating higher yield and variable rate in short duration loans, notably through both SBA and construction lending. And while we are still originating longer fixed rate loans, areas of growth, notably franchise finance and single tenant lease financing, new originations are coming on at much higher yields. And finally, while mortgage revenue is expected to pull back from the historic highs we have seen over the last two years, Our long-term investment in SBA lending has added greater diversification to non-interest income, which we expect will be further diversified as we onboard FinTech and banking-as-a-service partnerships, providing revenue stability regardless of the interest rate environment. With that, I will turn it back to the operators so we can take your questions. We will now begin the Q&A session. If you would like to ask a question, please press star followed by one on your touchtone keypad. If for any reason you would like to remove that question, please press star followed by two. Again, to ask a question, please press star one. As a reminder, if you are using a speakerphone, please remember to pick up your handset before asking your question. We will pause here briefly to allow questions to generate in queue. The first question is from the line of Michael Pareto with KBW. You may proceed. Hey, good afternoon, guys. Hi, Mike. Hi, Mike. So, thanks for the prepared remarks. A lot of helpful commentary in there. There are a couple things I wanted to expand on. First, just, Ken, on the OpEx side, I wanted to to hit this before I kind of dig into some of the growth opportunities. But you talked about some of the pressure, some one-time items, but obviously the run rate was a little lower. I mean, is there any more specifics you can give kind of on the back half here, understanding it's kind of a difficult OPEX prediction environment, but just any kind of range you guys are thinking of, especially with the mortgage run rate stepping down to the range you guys disclosed, the 5.5 to 6.5, what the OPEX could look like here? Yeah, I think obviously it came in a little bit lower than our forecast when you get rid of the one-time charges. And obviously some of that, as we talked about, had to do with mortgage commissions being down as well as SBA commissions being lower. And some of it is just the timing of new hires and scheduled technology investments. I think for the remainder of the year on a quarterly basis, You know, I think you guys got it pretty good out there. I mean, I think we're probably looking at, you know, probably somewhere in the, you know, call it 18, you know, low 18s to high 18s over the next couple of quarters, probably ramping up a little bit. I mean, as David talked about on the tech side, we continue to invest in people. And as I mentioned, we got some scheduled investments that are coming on board. So, It'll creep up a little bit, but I don't think really out of line with what a lot of you guys have in your models already. Got it. Helpful, Ken. Thank you. And then secondly here, on some of the FinTech partnership initiatives, you know, it sounds like you guys are being highly selective, which I think makes a lot of sense because, you know, obviously it's a, an interesting market in the realm of FinTech right now. But I was wondering if you can maybe bifurcate for us a little bit more, you know, how you're viewing these opportunities in terms of kind of lending deposits and fees and where the pipeline sits today and, you know, maybe what opportunities you think could be the most meaningful near-term? Could we see some fee acceleration? Are they largely deposit opportunities that we've seen you guys have success with already? I know you mentioned a couple of lending. Just spending a little bit more time there I think would be helpful. Mike, we have a lending opportunity that's rolling up somewhere here in the next 30 to 45 days. We should be live. Deposits is... Ken, it's already related to from the FinTech VAS side of things. We've got another pretty good-sized relationship coming up in the next 45 to 60 days. It really is a mix across the line, service fee, income, potential. I can tell you it's been a little bit frustrating. I've used the statement before. We've kissed an awful lot of frogs looking for a prince, but I got to tell you, as we've been out in the marketplace and we're getting more visibility and we're really getting attached to good partners that have been in this space for a long period of time, there's probably three deals out there now that we've been exposed to in the last three weeks that are probably the best deals we've seen all year. So it's one of those you just have to, you know, keep going to bat, and one of them will come over the finish line. We've got a couple in the pipeline that we think could speed up. Talking to a gentleman on Monday afternoon, he said, you know, it's really frustrating. It takes a fintech six months to line up a partnership, and then it takes six months to get that partnership live. And talking to him, I think we can narrow that window from an intro conversation to from being a 12-month process down to a 90-day to 6-month process. So that's what we've kind of created internally, and I think we're in a position to deliver that. And it's really creating some good opportunities. We have good partners on the kind of legal and accounting side that have been working with fintechs. There's a couple of fintechs that are now looking for new banks because their existing banks have gotten sideways through the regulators for one reason or another. So there's some that could drop in with ready volume, and I think there's still a lot of really good novel opportunities out there that we're going to get a solid shot at. So it's been frustrating for all of us internally, but we've also had the opportunity to really build out a good system on onboarding people, and hopefully we have more than built up our compliance in that. back office team so we don't want to follow the regulators as we bring these people on and some of our peers have. Got it, David. Thank you. Very helpful. And just last for me, maybe a question back to Ken. And I apologize if I missed this. You know, I heard some of the micro NIM commentary and whatever. But it's just as we think about your overall positioning, the rate environment as it stands today, the balance sheet positioning as it stands today, I mean, you guys have kind of been flat at about $27 million on the NII for the last two quarters. I mean, are you guys hopefully be able to hold the line there, you know, within a reasonable range? Or do you think there will be some downward pressure that starts to manifest, particularly if we get another, you know, 75 base point hike next week and the rate of hikes remains accelerated? No, I think... You know, I think the way that we look at it is if you back out the tax revenue, the revenue from tax refund advance lending last quarter, which was about $2.9 million, and, you know, you're familiar with that business, Mike. That's, you know, predominantly a quarter event. When you back that out, I think what we were really, really happy about is that we made up that difference, right? So if you want to back that out, call that a core number for lack of a better term, I mean we picked up almost $3 million of NII and I think with the way, looking at what the forward rate curves look like with our production, our loan production focused on higher yielding products, things repricing higher and where betas have been on deposits and we're going to do everything we can. I mean we're not really getting pressure to go above these betas on the deposit side. So with that, we continue to expect to see, as far as net interest income grows, continued growth. I think one thing this quarter is we did put a lot of cash to use and to try to expect, call it a 30 basis point bump in net interest margin is probably unrealistic because of our deployment of cash. You know, but I think in terms of being able to creep net interest margin up as well as grow NII dollars, we see a clear pathway to being able to do that. Great. Yeah, no, I mean, it's definitely, the balance sheet definitely seems like it's positioned much differently this time around. So that's good to hear. Thank you guys for taking my questions. Yep. Thanks, Mike. Thank you. The next question is from the line of Nathan Race with Piper Sandler. You may proceed. Yeah. Hi, guys. Afternoon. Hey, Nate. Hi, Nate. Question, maybe just drill into the margin outlook a little bit more. I know you guys indicated in the deck that rates on new loan originations are 100 basis points above what we saw last year. So I was hoping you could just kind of quantify where you guys are putting loans on the portfolio today relative to, I believe, the portfolio yield at 431 or so in the quarter? Yeah, I mean, obviously, that's kind of a blended yield for it. But I would say on the commercial and the consumer side, again, keep in mind that some of the deals that funded in May and June were being priced in April. But new production during the quarter in all came on, you know, kind of in the, you know, north of four and a half. But I think what, again, what we remain up, you know, what's exciting for us is that new deals now are being quoted at, you know, in the single tenant world, new deals are above 5%. Our partnership with Apple Pie, those deals are priced close to 6%. As we've seen the rate bump, we've seen the yields and the variable stuff and the construction and SBA. Our SBA portfolio is, on average, prime plus 250-ish. That continues to go up. I think that, again, we'll continue to see a nice bump in the overall yield. To some extent, it's a little bit like turning a battleship because you've got a $3 billion portfolio. But as older loans amortize and new productions coming on at higher rates, that, you know, kind of all-in portfolio yield, call it core on a, you know, excluding tax, you know, excluding tax stuff there is call it 430-ish. You know, we expect to see continued growth in that all-in yield on the loan book. Okay, great. And then just maybe think about the right side of the balance sheet. You know, deposit growth lagged relative to loans in the quarter. I know you guys spoke about a a banking as a service deposit win. So just curious kind of what rates you're paying on those deposits and just the opportunity to fund deposit growth commensurate with that alone, which it sounds like you guys are still comfortable with, you know, kind of 10 to 12% loan growth going forward. Yeah. And I, you know, our intent is to fund loans with deposits. So we continue to see, you know, again, we had some volatility and some money market balances at the end of the quarter, but You know, we continue to grow small business money markets. And the banking as a service deposits, those are, you know, those are priced close to Fed funds. So those do have, you know, those will increase. But I think, you know, the good thing about those are that much, you know, call it 200 basis points less than, say, funding with CDs. Another way to look at that, Nate, though, and we don't want to go borrow, to necessarily make loans, but we can go to the federal home loan bank and do a five to seven year loan cheaper than we can go get six to nine month commercial CDs. As crazy as the market is with long term rates not moving and short term escalating, Fed does 75 basis points in the next week. The short term money cost could be 100, 125 basis points higher than five-year money. So we're way in all avenues. Believe me, Ken's team are watching rate curves and activity on an almost minute-by-minute basis, but there's a lot of turbulence in the marketplace that could be beneficial, could be obviously detrimental at the same time. So we're watching it all, but I think Ken laid out a pretty good play. We think we have opportunities to bring in deposits. We're looking at them, as I explained to Mike a minute ago, on a day-to-day basis from FinTechs and other players that are somewhere between that 1% rate up to Fed funds rate. So we're hustling and looking at it daily and taking advantage of opportunities where they exist. Yeah, one thing I think will be a very interesting prospect for us is we're We're getting ready to launch a partnership with a commercial finance company that both on the lending and the deposit side, and the deposit opportunities are really operating accounts for their client base. And that's exciting because that's small business checking that we're paying 40 basis points on. Okay, gotcha. Just trying to put those pieces together, it sounds like you're still comfortable with kind of 10 to 12% loan growth and maybe a moderate lag in deposit gathering? Yeah. Okay. Great. And just kind of thinking about that loan growth outlook, obviously you guys had to provide for, you know, really strong growth in the quarter. And assuming, you know, growth reverts that 10 to 12% range, how are you guys thinking about providing for that growth relative to where the reserve stands today? It'll probably be in line with that. Obviously, we reserve a little heavier on the commercial side than the consumer, but some of that is offset as we continue to put some short-term money to use in public finance. So I would say just kind of model the reserve where it is at today. Okay, perfect. I appreciate all the color. Thank you for taking the question. Thanks, Nate. Thanks, Nate. Thank you. The next question is from the line, Brett Robinson with Huff Grove. You may proceed. Hey guys, good afternoon. Hey Brett. Hey Brett. Wanted to talk about FinTech for a second and on the call with the first century transaction cancellation, you indicated that the things that were in progress could add about 35 cents a share to the 23 um earnings can you give us an update on that and then also wanted to ask about these you know from a lending perspective opportunity these credits that you're putting on are there any credit enhancements or generally speaking what is the framework on the loans that are going to come from fintech players I'll address the EPS buildup first. When we look at those opportunities going forward, I think kind of the guidance we gave them I would say is probably on the low side when we talked about existing opportunities with 35 cents of additional EPS on that. You know, some of those players, some of those things that we're working on, again, the thing I mentioned before with the loans and deposits thing, that is one of the items, and we're getting closer to launching on that. And that probably, to be honest, has more earnings upside than we initially modeled out. And we continue to work on some of these other projects as well. I mean, I know, like, one of the things we were moving towards was more of a consumer lending project. opportunity. We're probably slowing that down a bit just kind of in the wake of, you know, in the wake of potential recessionary fears and just kind of making sure we got our arms around that. But we've had a couple other things slide in as well that, you know, as David alluded to on projects we're working on in the FinTech space. So I think a couple moving parts, but I think we still feel pretty good about the upside earnings contribution which quite frankly could be conservative in the long run. Hit me again on the credit enhancement question. I didn't quite... Yeah, sorry. Yeah, so David, what I was just trying to figure out is on these FinTech loans that you'll add to the balance sheet, is there any structure where they have to set up a reserve for the loans that you're that you're putting on your balance sheet or is it just straight amortization and there's no credit enhancement? What kind of terms are you doing these loans on? It's a mixture of both. There is some call it escrow funds that come in on a percentage basis on a per loan deal and some that are in the commercial segment. But I would say the lion's share is just straight up credit and we're getting the yield to cover the reserves and stuff. So the net effect of the yield on the loans will compensate for the higher reserving on some of the more consumer-oriented pieces. As Ken said, we kind of stepped back on a couple of the consumer opportunities just for the risk. We hear some of our peers talking about hurricanes coming. I don't think there's hurricanes, but there could be a tornado here and there that kind of hits spot places. So consumer, this showed no kinks to date. Our RV portfolio, whether the $5 gasoline without a blip and seems to be very, very stable and continuing to grow with tremendous volume. So the consumer came into this exercise in a much better position than they have historically. but we're still a little bit cautious. Probably the biggest issue we have in the fintech space right now, there's an awful lot of people we've been chatting with that are trying to wrap up their B and C and D rounds of financing to help take them up to that next level. And folks have said, hey, we're going to have money in June or July or August. It's now, well, maybe it'll be October, September. So that's what's kind of slowed down the the game at the current time is to make sure they get the right funding to get up to the next level. VCs, private equities, they're all focused on what's the path to profitability. As you've seen, the article's been reprinted and I think about every trade magazine going that they estimate 95% of all FinTech companies at the current time have no clear path to profitability. If by chance that next round doesn't come in and it blows up, it's not technically our problem because they're the one that's made the promises and servicing to the customer, but it's still, you know, the customer's left in a lurch and we're almost guilt by association. So it's a reputation risk that we don't have control over and we don't want to, you know, step off a cliff here and just in search of opportunities. We're being very, very methodical to the point of frustrating probably some of my team because in 40 years in the software industry, I've seen a lot of the pitfalls and can see a lot of the warning signs. So we do have some really strong fintech players, very well capitalized. But when you have public companies out here, The folks at Upstart were trading eight, nine months ago at $400 a share. Now they're at $26. That whole market is just getting beat up. We want to make sure we got it right before we jump in here. Brett, maybe to address the question on the credit enhancement, when I hear that, I associate that with perhaps lending opportunities that are a little bit further out on the risk spectrum. That's not the type of lending that we're looking at. Most of the lending opportunities we're looking at, like on the consumer side, it's going to be prime, super prime, the type of consumer that we're used to underwriting and comfortable with. On the commercial side, it's going to be more established types of credits than, say, lending to startups or something like that. So we're not going out on the risk spectrum when we're looking at FinTech lending opportunities. Okay, that's really helpful. And then I wanted to make sure I understood the discussion around the deposit betas from here and just thinking about money market in particular. I know money market didn't really move much In 2Q, when I look online, I see a lot of pretty high rates, and I see a posted rate of 116 for you guys, and some higher rates even than that. Explain to me, if you can, kind of the thought process on the deposit basis from here, specifically in the money market account. Well, I mean, again, what we've, What we've seen to date is that pricing has been relatively well constrained in the competition out there, especially on the consumer side. There's a lot more competition on the consumer side. It's been a little bit more well-behaved than it was the last time around. Last rate tightening cycle, it was a race to the top. So, I mean, I, you know, look, as what we've seen to date, and we don't, you know, there's not money, money is not going out the door. So I think with the, you know, our view right now is that we expect at least, you know, over the next several quarters here that betas, you know, should be, should remain relatively well constrained. And I, you know, a point, I know I talked about it in my prepared comments, but I think it's important to hit home is that Since the last rate tightening cycle where our money markets were almost exclusively consumer, with the growth in our small business and the efforts that we've put in there, almost two-thirds of that money market base now is small business or commercial, and it's predominantly small business. That pricing has been much less rate sensitive this time around. It was probably less rate sensitive before, but we just didn't play in that space. Whereas today, that's where the bulk of our money markets are, and that pricing has been less rate sensitive. So I think as we sit here today, I think our belief is that betas on the money market should remain well below what they were in the last cycle. okay um that's helpful great uh congrats on the strong longer from the quarter thanks sir thanks thank you the next question is from the line of john robis with jamie you may proceed hey good afternoon guys hey hey john hey hey ken just on the uh the tax rate drop down some this quarter? What shorter rate should we use going forward? Yeah, I mean, you know, it's really what drove the rate down is when you think about the all-in composition of revenue with, you know, with the big decline in mortgage as well as the decline in SBA and And the growth on the public finance side as well, just the proportion of tax-exempt income was a little bit higher. I mean, I think as we have, you know, as we continue to, you know, we'll have the success with the, you know, commercial loan growth in single tenant and franchise, see some rebound in SBA. You know, I think if you use the 13 to 13.5% tax rate, that'd be fine. Okay. And then Ken, just one more question on your comments on the margin. I think you said modest expansion from the second quarter level. And if you look at the reported margin from the first quarter, the second quarter, you know, was up by basis points on an FTE basis from two 69 to two 74 is a five basis point increase. Is that modest in your, or how should we think about this? Yeah. That's in the range. Okay. Okay. Just wanted to check. Thanks. Thanks, Jeff. The next question is from the line of George Sutton with Craig Holland. You may proceed. So, guys, relative to the gain on sales spreads having come down, I'm curious how you're now going to market with your SBA. offering. You were fairly active in the market at times. Many were not. And that, I think, at the end of the day was related to the high spreads. How are you going to market now, given that it's more on your balance sheet? Just curious about the total volume opportunity. Actually, George, we're probably as active or more active than we've been historically for the reasons you just outlined. A lot of folks are starting to pull back on the SBA side of things. And from our balance sheet perspective, if we can put a 75% guaranteed loan on the books or a 7% to 8% rate, we'll do it all day, every day. So we had, we kind of finished the quarter with what we called internally about a $28 million bubble. It is $28 million worth of loans that were done, approved, ready to go. As you well know, the SBA has a myriad of SOPs you have to comply with. So this is stuff that's been through credit, been through underwriting. We're just waiting on a specific document, piece of paper, a signature on something, or T-Cross, I dot it to get it to the finish line. So we had $28 million pending that's ready to close, plus we had another $34 million in pipeline. SBA is stronger, stronger than it's been. We were targeting this year to get to $200 million. I think just with the market activity and the rate increases, there's some folks, this is the housing market is starting to shrink a little bit and the refi game has completely gone away because of higher rates. I think SBA overall activity will slow down. in the fourth quarter due to you know seven seven and a half eight percent rates with if that follows through with another 75 points but as far as our activity in the market and our pursuit of sbas it's uh the pedal's still down we're going after gotcha okay thank you for that what one uh refinement to an earlier question related to the first century call that you had the suggestion at that time was when we we bulk up the various opportunities in the core business and then the buybacks that you were doing. The thought was that you could get to a $6 type of a number for 2023. Are you still suggesting that kind of opportunity or has there been a change to that? I would say, George, probably the one, if you wanted to take the most conservative look at that possible, I would think about mortgage, because obviously mortgage, you know, our forecast for 2022, mortgage was coming down, right? It was down, and we were kind of forecasting consistent for 23 with what we had for 22. Well, now, obviously, as we mentioned earlier and what's gone on, we've revised mortgage down a bit. One conservative way to look at that is you could probably take $4 million or call it roughly $0.40 of VPS away due to mortgage and look at it that way as the most conservative sense. On the other side of it, I would say that some of these other opportunities we had or maybe we were saying $0.35 of opportunities, that could be north of $0.50 or $0.60. We have to let some of those play out, but I think we have some tremendous opportunity with some of these others. On the low end, you could cut, but I think on the high end and some of the things we're looking at, I think we feel that we could get back to that number anyways. The big play, too, will be, George, depending on what the Fed does for the balance of the year. The forward curves are showing that by first quarter next year, they're going to be back in a position to lower them a little bit if they keep going up at 50, 75 every time they meet. That could bring mortgage back mid-year. I think if mortgages got back into a mid-four handle, it's going to pop right back to where it was, at least on the purchase side of things. Refi, maybe not so much, although there's some people that are out there now getting 550, 575, 6% mortgages that in the mid-four could open up a refi business second half of the year. I agree with Ken 100%. The biggest wild card we have We think SBA will be strong. We think all of the other lending verticals we've got are strong. A couple verticals and new opportunities we're bringing on have tremendous potential that we're going to hit it all across the line. The real, real wild card for it is mortgage. Perfect. Thanks, guys. Thank you. There are no additional questions at this time. I will pass it back to David Becker for any closing remarks. Well, again, we appreciate all of you joining us today. We hope you have a great day and look forward to speaking with you all again soon. Thank you very much. That concludes today's conference call. Thank you. You may now disconnect your line.