Good day, everyone, and welcome to the first Internet Bancorp earnings conference call for the fourth quarter and full year 2020. All participants will be in listen-only mode. Should you need assistance, please signal a conference specialist by pressing the star key followed by zero. After today's presentation, there will be an opportunity to ask questions. To ask a question, you may press star, then one on a touchtone phone. To withdraw your question, please press star, then two. Please note this event is being recorded. I would now like to turn the conference over to Larry Clark from Financial Profiles, Inc. Please go ahead, Mr. Clark. Thank you, Operator. Good day, everyone, and thank you for joining us to discuss First Internet Bank Corp.' 's financial results for the fourth quarter and full year 2020. The company issued its earnings press release yesterday afternoon, and it's available on the company's website at www.firstinternetbankcorp.com. In addition, the company has included a slide presentation that you can refer to during the call. You can also access these slides on the website. Joining us today from the management team are Chairman, President, and CEO David Becker, and Executive Vice President and CFO Ken Lovick. David will provide a company update, and Ken will discuss the financial results. Then we'll open up the call to your questions. Before we begin, I'd like to remind you that this conference call contains forward-looking statements. with respect to the future performance and financial condition of First Internet Bank Corp. that involve risks and uncertainties. Various factors could cause actual results to be materially different from any future results expressed or implied by such forward-looking statements. These factors are discussed in the company's SEC filings, which are available on the company's website. The company disclaims any obligation to update any forward-looking statements made during the call. Additionally... Management may refer to non-GAAP measures, which are intended to supplement but not substitute the most directly comparable GAAP measures. The press release, available on the website, contains the financial and other quantitative information to be discussed today, as well as the reconciliation of the GAAP to non-GAAP measures. At this time, I'd like to turn the call over to David. Thank you, Larry, and good afternoon, and thank you for everyone for joining us today. We are very pleased with the fourth quarter and full year results. The pandemic created some substantial challenges during the year, as you all know, but we adapted to the conditions, helped our customers navigate the impact of the pandemic, and continued to identify and capitalize on growth opportunities. We delivered record net income and record earnings per share in both the fourth quarter and for the calendar year. Driven by very strong revenue growth, higher net interest income, robust mortgage banking revenue, and increased SBA loan sales. Our significant earnings growth throughout a historically low interest rate environment and uneven economy demonstrated the power of our business model and our increasingly diverse revenue streams. Over the course of the year, we drove down our interest costs through favorable deposit repricing opportunities that lifted profitability as our fourth quarter fully taxable equivalent net interest margin expanded 24 basis points from a year earlier. Additionally, we maintained strong credit quality, even as we took extraordinary steps in the form of loan deferrals to help our clients weather the public health crisis. Nearly all of our borrowers who needed payment relief resumed payments well before the year ended. As of January 15th, we had only $8.3 million of loan balances remaining on deferrals, or well under 1% of the total portfolio, down from a peak of almost $647 million in late May, which was about 22% of the portfolio. We deepensize with our clients through this experience and remain optimistic in our customers' collective ability to fully bounce back and succeed in the year ahead. Our credit metrics remain among the best in the industry because of our strong credit culture and disciplined approach to underwriting. We also focus on certain specialty lending lines that are target lower-risk asset classes, such as our public finance, single-tenant lease financing, and healthcare finance business. During the quarter and for the full year, non-performing loans and net charge-offs remain low. We also continue to build reserves, conservatively positioning the bank to begin 2021. Finally, we delivered on a key strategic priority by strengthening earnings generated capital throughout the course of the year. Our team delivered annual net income of $29.5 million and fourth quarter net income of $11.1 million. Each company records as we boosted profitability throughout 2020. Revenue in the first quarter of 2020 increased 52% from a year earlier to $31.5 million. driven by continued strength in our direct-to-consumer mortgage business. Our bankers met the surge in demand brought on by low interest rates, winning business with a demonstrated commitment to excellent customer service. Our mortgage pipeline is strong heading into 2021, and we expect this business line to remain an important component of our profitability as interest rates remain low and both the purchase and refinance markets continue to experience high demand all across the country. Our small business lending area was another vital contributor to our growth. We built more momentum during the fourth quarter as the accelerated build out of our national platform in 2020 resulted in increased loan production and a higher gain on sale revenue. There is tremendous potential in this business unit with attractive opportunities on both sides of our balance sheet. We brought on talent and expertise in 2020 that will help drive further growth in originations in 2021. We are forecasting originations of around $225 million this year, the majority of which are SBA 7A loans that are expected to produce gain-on-sale revenue of between $14 to $15 million for the full year. SBA lending is an important element of our long-term strategy, and we are proud to play a leading role in providing financing for the entrepreneurs and small businesses that drive job creation across our country. As I noted, our asset quality remains strong, and we are cautiously optimistic about 2021. To be sure, the pandemic continues to present substantial difficulties for many Americans. We are monitoring our loan portfolio closely and working with our clients to help them bridge from this challenging environment to what we anticipate will be a strong economic rebound once we as a country achieve widespread virus inoculations. As we look ahead, we are confident in the strength of our franchise and our growth potential. Despite the pandemic, our digital business model enables us to serve our customers without interruption and allows our team to focus on our core lines of business and earnings growth. As always, I would like to thank the entire First Internet Bank team for their hard work and dedication to excellent customer service. Their collective effort and teamwork are ultimately the reasons for our record performance in 2020 and our optimistic outlook for the year ahead. Our employees are at the heart of our strong workplace culture. They are the reason First Internet was recognized for the seventh consecutive year on the Indianapolis Star's Top Workplaces in Central Indiana list. With that, I'd like to turn the call over to Ken to discuss our financial results for the quarter. Thanks, David. As David mentioned, we were very happy with our performance for the fourth quarter and full year. delivering record revenue, net income, and earnings per share. We generated these strong results with very modest balance sheet growth during the quarter and the year, which is consistent with our disciplined balance sheet management strategy. Our business model emphasizes capital efficiency and increasingly diverse revenue streams that drive increased profitability, and our financial results reflect solid execution of this plan. Now let's turn to details of our results for the fourth quarter. record diluted earnings per share of $1.12, an increase of 30% from our third quarter results, and up 56% from the fourth quarter of 2019. Profitability improved significantly with fully taxable equivalent net interest margin increasing 24 basis points to 1.91%, a return on average assets of 1.02%, and a return on average tangible common equity of 13.84%. Over the last 12 months, we had to adapt to a swiftly changing operating environment related to the COVID-19 pandemic. With interest rates falling to record lows and uncertainty about the economy and credit quality, we were able to successfully navigate these challenges and deliver outstanding results, including a rapidly improving net interest margin through lower deposit pricing and stabilized asset yields, strong revenue growth, and excellent credit quality. Looking at slide four, we saw these trends begin to develop in the third quarter, and once fourth quarter results are all reported, we believe our performance relative to similarly sized institutions will compare even more favorably. Looking at slide six, total portfolio loans at the end of the fourth quarter were 3.1 billion, an increase of 46.3 million or 1.5% from the third quarter. Commercial loans increased 73.1 million, or 3%, compared with the third quarter due primarily to production in healthcare finance and construction lending. This growth was partially offset by lower single-tenant lease financing and public finance balances due mostly to prepayment activity in the single-tenant portfolio and the sale of some public finance loans during the quarter. Consumer loans decreased $25.3 million, or 5%, compared to the third quarter, due primarily to increased prepayment activity in the residential mortgage portfolio and seasonally lower production in the recreational vehicle and trailer portfolios. Moving on to deposits on slide seven. While overall deposit balances were down 3% from the end of the third quarter, we saw continued improvement in the composition of the deposit base. During the quarter, CDs and broker deposits decreased $130.5 million or 7.6% on a combined basis, while non-interest bearing and interest bearing deposits increased $44.3 million or 18.4% on a combined basis. CDs and broker deposit balances declined as higher cost CD maturities were largely funded with on-balance sheet liquidity or were replaced with much more attractively priced money market accounts and lower rate CDs. This activity lowered our cost of interest-bearing deposits 22 basis points in the quarter, and we still see opportunity to reduce deposit costs in 2021. Due to the combination of significantly lower money market pricing and the continued CD repricing opportunity, we are forecasting interest expense savings of approximately $25 million for 2021 based on the current deposit pricing environment. Turning to net interest income and net interest margin on slides eight and nine, net interest income and net interest margin on both a GAAP and fully taxable equivalent basis showed strong improvement compared to last quarter. As you can see from the net interest margin bridge on slide nine, Deposits and loans had the largest positive impact on margin during the quarter. Although the average balance of interest-earning assets was essentially flat from the third quarter, interest income from earning assets was up about 3%, driven mostly by a more favorable mix of assets, reflecting the deployment of on-balance sheet liquidity and the redeployment of cash from the securities portfolio to fund new commercial loan originations. Average loan balances were up about $73 million, or over 2%, from the third quarter, due mainly to growth in health care finance and construction lending, as well as higher average balances in small business lending. In addition to the shift in loan mix, we also recognized a higher level of prepayment fees, both of which helped drive loan yields higher during the quarter. In the near term, we expect our yield on interest earning assets to remain relatively stable as we continue to deploy liquidity to fund new loan originations. We are pleased to have delivered a 24 basis point improvement in our fully taxable equivalent net interest margin during the quarter and expect the upward trend to continue next quarter and throughout 2021. Turning to non-interest income on slide 10, Non-interest income for the quarter was $12.7 million, up slightly from the third quarter. The increase was driven primarily by increased gain on sale of loans, which was due mainly to a higher amount of SBA 7A guaranteed loan sales in the quarter, as well as the sale of public finance loans that I mentioned earlier. Mortgage banking revenue was strong again during the quarter, but declined modestly from the record level we generated in the third quarter. With respect to small business lending activities, our increased origination activity translated into 100% growth in SBA gain on sale revenue from the third quarter. With the accelerated build out of our small business lending platform, we expect that the fourth quarter's level of fee revenue from SBA loan sales is a reasonable run rate for the near term. And as David mentioned, we are targeting total revenue from this line of business to be in the range of $14 million to $15 million for the full year of 2021. Looking forward into 2021, while we expect mortgage revenue to remain strong in the near term, we are not forecasting it to be at the record level achieved in 2020. That being said, we are not forecasting a drop in annual non-interest income, as the decline in mortgage revenue should be offset by our expectations for increased gain-on-sale revenue from SBA lending activities. With respect to non-interest expenses, as shown on slide 11, the decrease to $14.5 million was mainly the result of last quarter's $2.1 million write-down of two legacy commercial Oreo properties. Excluding that impact, non-interest expenses increased slightly on a linked quarter basis, driven primarily by a $200,000 increase in loan expenses and a $200,000 increase in consulting and professional fees, but was partially offset by a $400,000 decrease in salaries and employee benefits. The increase in loan expenses was due primarily to costs associated with a non-performing loan relationship, and professional fees were up due to the timing of third-party loan reviews and some other smaller consulting fees. The lower salaries and employee benefits expense was due mainly to the timing of incentive compensation in the company's small business lending division and lower incentive compensation in the mortgage banking division due to lower mortgage production quarter over quarter. Now let's turn to asset quality on slide 12. The allowance for loan losses increased $2.6 million, or almost 10%, to $29.5 million, resulting in an increase in the allowance to total loans to 96 basis points, or 98 basis points excluding Paycheck Protection Program loans, which are both up seven basis points from the linked quarter. As growth in the loan portfolio was modest during the quarter, The increase in the allowance for loan losses was driven primarily by changes in portfolio composition, as well as further modifications to qualitative factors in our allowance model to reflect the ongoing economic uncertainty related to the COVID-19 pandemic. In addition, we increased the specific reserve on an existing non-performing single-tenant lease financing relationship by $1.1 million. As a result of the continued reserve build, we recognized a loan loss provision of $2.9 million for the fourth quarter, up 14% from the third quarter. Overall credit quality remained stable during the quarter as non-performing loans to total loans of 33 basis points was comparable to 32 basis points at the end of the third quarter. Net charge-offs of $300,000 were recognized during the quarter, resulting in net charge-offs to average loans of four basis points as compared to one basis point in the prior quarter. For the full year 2020, net charge-offs to average loans was a relatively low six basis points. While we continue to build our reserves out of an abundance of caution in this ongoing uncertain environment related to the pandemic, we also still feel very good about our asset quality and credit performance, as evidenced by the modest amount of net charge-offs to date. With respect to liquidity and capital, as shown on slide 13, our overall capital levels remain healthy at both the company and bank levels. With the solid earnings performance for the quarter, our tangible common equity to tangible assets ratio increased to 7.69% from 7.24% in the third quarter. Additionally, tangible book value per share increased to $33.29, up from $31.98 in the third quarter. In terms of our outlook for 2021, we believe we are extremely well positioned for the lower interest rate environment, and there are a few things I want to reiterate and summarize for you. As mentioned earlier, we are forecasting approximately $25 million of interest expense savings for the year, from deposit repricing. When you combine that with stabilized asset yields, which should improve slightly in future periods due to a better asset mix, we are expecting significant growth in net interest income and expansion in net interest margin for 2021. We also expect to maintain a strong level of non-interest income going forward. As mentioned earlier, we are forecasting $14 to $15 million of gain on sale revenue from SBA loan sales next year. which will be supplemented by increased servicing revenue as our managed SBA portfolio grows. When combined with a solid outlook for mortgage banking revenue, we feel confident in our ability to generate a similar level of annual non-interest income again in 2021. We remain cautiously optimistic regarding the impact of the pandemic on the credit quality of the loan portfolio. We are vigilant in our monitoring and underwriting procedures and do not see elevated credit losses on the horizon at this point. Because of these earnings drivers, we anticipate improved profitability in 2021 with quarterly return on average assets in the range of 95 basis points to 1%, although first quarter may be a little bit lower due to annual expense resets, primarily in salaries and employee benefits. And finally, with increased profitability and modest balance sheet growth expectations, we are forecasting increased capital levels with tangible common equity to tangible assets expected to be in the range of 8.4% by the end of 2021. With that, I will turn it back over to the operators so we can take your questions. We will now begin the question and answer session. To ask a question, you may press star, then 1 on your touchtone phone. If you're using a speakerphone, please pick up your handset before pressing the keys. If at any time your question has been addressed and you would like to withdraw your question, please press star, then two. At this time, we will pause momentarily to assemble our roster. The first question comes from Brett Rabitin with Havdi Group. Please go ahead. Hey, good afternoon, everyone. Hey, Brett. Hi, Brett. I wanted just to start with, you know, you talked about there's obviously still some savings to come on the interest expense side of the equation, but you also managed the balance sheet that aided the margin in the fourth quarter. Can we just talk for a second about the expectations for loan growth in 21? And then, you know, what are the things you might be doing with the balance sheet to help manage that margin higher? Yeah, I mean, on the loan side, you know, what we expect to do is, you know, like many other institutions out there, you know, we have quite a bit of excess liquidity still on the balance sheet, a lot of cash. And, you know, that will allow us to really grow the loan portfolio without necessarily growing the balance sheet. You know, so we continue to deploy. As you've seen, we had, you know, we grew the healthcare finance portfolio and That portfolio may not grow as much year over year, but we still expect some solid growth there. We're having a lot of success on the construction side, which has a higher yielding product there, and the small business lending side as well. Even though we're selling quite a bit of the guaranteed piece of that, we'll still grow the unguaranteed piece, and those are coming on at yields of 550 to 6%. really the managing the loan yield on that side and I guess the all-in earning asset yield is really going to be a function of deploying excess liquidity from loan yield and cash into the portfolio. Okay, that's helpful. I mean, it looks to me like the margin could get to kind of a two and a quarter run rate at some point this year. Is that seeing fair to you guys? Yeah, that's a good forecast, but Okay. And then the other thing I wanted to just touch on was, you know, expectations for expenses. I know you're going to have somewhat of a reset in the first quarter. Can you just talk about the expense bill this year, what you might be investing in, you know, how we should think about your managing the efficiency ratio? Yeah, I mean, on the personnel side, you're going to see an increase in compensate, you know, if you look at year over year, forecast for annual compensation costs, you're going to see an increase there just simply because of the investments we've made in the small business unit. You know, we've brought on a lot of talent there over the course of the year. Obviously, that's not fully baked into a 2020 number, but you're going to see an increase in compensation there. And again, we also continue to add folks in other areas across the bank as well. But that comp and salaries number will be up. And we obviously continue to invest in, we'll have some marketing initiatives on the table this year to help build some of the, contribute to the small business checking and small business money market growth. Probably marketing may go up a little bit this year as well as even though we expect mortgage to remain strong, We'll probably have to increase some marketing costs on the mortgage side as well. Okay. That's helpful. And then I want to make sure I heard the number correctly. I thought I heard you say the ROI you're expecting was at 95 to 105? Yes. Yeah, 95 to 1. We'll probably be, like I said, first quarter, you know, we'll have probably some of the expense resets that you normally see, a lot of them on the salary and the comp side of things with employee benefit resets, merit increases, that type of thing. So first quarter may be a little bit lighter, but certainly as we get into second and then the back half of the year, third and fourth quarter are looking at a solid kind of one range. One other issue that might bump is just that we've been in the first quarter on the SBA side. Everybody knows there's another round of PPP coming to the marketplace for both first time and second time. Folks on the borrowing side, they're redoing some of the rules on the 7A program. A little bit of confusion in the marketplace right now. Focus on the SBA side. They're also going to come back on new loans after the 1st of February. with some payment deferrals or payments being actually made by the federal government, not really deferrals. They'll make cash payments like they did last spring. So a lot of folks are kind of sitting on their hands right now in the SBA world. And they're also upping insurance levels to 90% of the loans, et cetera. So a lot of activity there on the back office side that might slow down a little bit of origination. But when it's all said and done, we think it'll help tremendously in the balance of the year. So it might be just a tad bit of a slow start, but it should come on strong in the second, third, and fourth quarters. Okay. Thanks, Charlie Keller, and congrats on a great quarter. Thank you. Thanks, Brad. The next question comes from Nathan Reese with Piper Sandler. Please go ahead. Yep. Hi, guys. Afternoon. Good afternoon. Hey. was hoping to start on credit um i got on kind of late i apologize um but we're just hoping for any other details on that single tenant um relationship that went over to um where you um allocated that specific reserve in the quarter and just any other thoughts on just the uh provision outlook as we enter 2021 uh technically it was not a new relationship made it's the one that we had put reserves against back in the early part of last year, a couple of Shopko stores that had closed. We have a personal guarantee and we validated that the owner of the properties is more than able to cover that personal guarantee on the loans. So we did not reserve against that. Year-end regulators or year-end auditors came in and didn't like our position. So just to back it up in safety, we added another million dollars in reserve on that loan, but we do anticipate getting that full million dollars back from the owner of the properties. So it's really not a new problem. It's an old loan that the audit team just wanted us to reclassify a little bit. Okay, great. That's helpful. Sorry. And I was going to say, Nate, just for the outlook for the year, on the provision levels. I think we've done a pretty good job of bumping our coverage levels over the course of the year with the allowance in terms of gross dollars as well as the coverage of going up almost a third. Also, as we said in the prepared comments, net charge-offs has remained relatively low. and right now we're not necessarily forecasting a lot of credit losses on the horizon. So I would expect, at least as we sit here today, probably the level of provisioning will be down relative to what we did this year, but we still expect to continue building the reserve and expect by year end we'll be well above a coverage ratio in excess of 100 basis points on the portfolio. Okay, great. Very helpful. And then just switching over to fees, I think the NBA's forecasting volumes will be down, you know, 20%, 22% in 2021. Any expectations just in terms of if you guys think you can kind of outperform that level or just generally how you're thinking about that line entering 2021? Yeah, I think when we look at the forecast for this year, obviously our, you know, we did – you know, 23 million plus of mortgage revenue this year. And our forecast and some of the numbers we provided earlier on our way outlooks and stuff, we are certainly not forecasting that. In fact, we have our cut, you know, we're cutting it by a third in our forecast this year. A lot of that, again, has to do with the NBA outlook as well as just more competition in the market. You know, last year there was so much demand out there that mortgage originators were able to... ratchet up margins a little bit just to dial back, just to be able to handle the workload. And with originations forecasted to be down this year, probably margins will come down a bit too. So we're trying to take, even though I think our forecast for 2021 on mortgage is still, would be extremely strong by historical standards, it's coming down from what we did this year. And, you know, fortunately we're in the position with the, the investments we've made in SBA that we have a clear pathway to backfill in that. So as I said in the comments, we really don't see a decline in overall non-interest income. It's just the mix in those line items is going to be a little different. Got it. That's helpful. Makes sense. And if I could just ask one more housekeeping question on the tax rate going forward. Is the 4Q level a good run rate to use going forward? That was probably a little bit inflated. Just when you think about we had record pre-tax earnings and record revenue and taxes in the first part of the year were pretty light, so there was a little bit of catch-up there this quarter. I think the run rate going forward is probably a high team number is probably the right number to put in your model. Okay, perfect. Congrats on a great quarter, guys, and a great year. Thank you. Great, thanks, Nick. Thank you, Nick. The next question is from George Sutton with Craig Hallam. Please go ahead. Thank you. David, in your prepared comments, you mentioned that you continued to identify and capitalize on opportunities last year, and I would point out SBA and PPP were two of those. I'm curious how you're thinking about, particularly on the identification of opportunities and and what sort of other things you might be pursuing this year that might not be obvious to us? George, we continue to look at opportunities. Obviously, there's a lot of verticals we're not in, and kind of especially finance lending side of things. We're chatting with a group in California at the current time about potentially another vertical. So we're actively looking, and we'll tell all you guys, if you've got somebody out there, send them our direction. particularly anything that can be done on a national footprint basis like we've done with SBA and the other verticals, the healthcare services that we've gotten into. I know there's a lot of forecasts in the industry about the stepped-up M&A activity here in 2021. For us to go, as we've discussed in the past, pick up a traditional bank doesn't make a lot of sense, but there are a lot of banks that have a particular franchise and a given vertical of lending and or specialty finance companies out here. We're continually, we probably sign one to two NDAs a month of opportunities we're taking a look at. Some of them have some very inflated pricing, but we're constantly looking at opportunities. I would tell you at the current time, there's nothing close to being finalized, but Ken and I spend a lot of time looking at new space and new opportunities for us. So let me ask the same question a different way. And I give you good credit for running the bank on a very conservative basis last year, given pandemic and economic challenges. But, you know, with things starting to improve, I think what I'm hearing from you is a willingness to potentially hit the accelerator, just hitting the accelerator if you find the right opportunities. Is that a fair way to summarize it? That's a fair way to summarize it, yes. Perfect. Thanks, guys. Thank you. The next question comes from George Sutton with – oh, sorry. The next question comes from Michael Schiavone with KBW. Please go ahead. Hi. Good afternoon. Good afternoon, Michael. Hi, Michael. Regarding the deposit portfolio, when you look at other digital challenger banks, many of them offer checking and high-yield savings accounts as opposed to CDs. I was just wondering if there is any opportunity or any strategic plans to accelerate the remix of the deposit portfolio towards more of that makeup. That's kind of taken place through the course of 2020. I don't know whether you caught it. About a month ago, the Newsweek magazine rated us as the best small business checking account in America. We put on a concentrated effort to bring in money market and small business checking accounts, consumer checking accounts. We spent a fair amount of money in the latter part of 2019 to upgrade the onboarding process for new accounts. We had some pretty antiquated software from Fiserv that was taking 17 to 20 minutes for a person to get through an application. We've now got that down to three to five. We brought those same tools over to the small business product in the latter half of 2020. So if you go back and look, the CDs, as Ken reported in his statistics, dropped, and the checking and money market accounts are picking up. If you look at most of the FinTech opportunities out there. Our products are very, very comparable to theirs. We're not able to go quite up the food chain that they are on some of them because of the cost of funds. Obviously, you guys are looking for a bottom line from our side that doesn't have brackets on it that they have. The marketing expense and the fees, quite honestly, or the rates that they're paying today don't make sense for us, but they're still Millions of consumers out here, particularly in the consumer and small business because of the pandemic over the course of the past year, millions and millions of people who could not get to the branch had to move to the Internet or the mobile phone, electronic devices to get access to the financial information. Obviously, we've been doing that for 20 years plus. As I stated, we didn't have to worry about all the branch problems this past year that our peers did, so that enabled us to stay focused on the business, make some good money, and increase our customer base. So as those consumers, and there's a number of surveys out here, show that 90% of them do not want to go back to banking the way they used to pre-pandemic. So once they figure out that their institution doesn't really have feature functionality that they're looking for, we're picking them up. We're setting records on new account openings and services through the second half of the year. So I think That's going to continue into 2021, and you'll see that product mix even shuffle a little bit more. Thanks for that color. And you guys mentioned a $14 million to $15 million number for SBA gain on sale in 21. But can you just provide some color on your long-term growth expectations for that business line, say two, three years? At the current time, I was asked the same question by one of the employees on a Meet the CEO call yesterday afternoon. I don't think we really have a cap on the small business opportunity. As Ken and I have stated in previous calls, as the SBA comes on board, we have the option of selling the insured piece, which generates non-interest income, or we can maintain it. We're picking up account balances. The SBA product just fits our bank phenomenally well, and I think that customer mix is great for us from a personal standpoint. Being a 40-year entrepreneur myself, I love the idea of helping small businesses all across the country. So we went from about $100 million this year to $225 million next year. I think Mark Gibson, who kind of heads up our sales team, is on this call. If I tell you it's going to be $300 million plus a year after that, he's probably fainting on the other end of the line right now. You know, I really don't think we have a limit, and if we can continue to find good people and good opportunities, that one really fits. We can grow SBA exponentially without straining our capital, without straining the balance sheet, and just continue to put great earnings to the bottom line. So it's a tremendous niche for us, and we're a product that has a lot of niches, and there's a lot we could do with that, and I anticipate it growing pretty geometrically over the next few years. Great. Thanks for taking my questions, and Happy New Year. Great. Thanks, Michael. Thank you. As a reminder, if you have a question, please press star, then 1. This concludes our question and answer session. I would like to turn the conference back over to David Becker for any closing remarks. Well, guys, I'd just like to say thank you for joining our call today. Obviously, these calls are a lot more fun when it's all good news, but I hope you enjoyed it as much as we did, and we hope everyone remains healthy and safe during these challenging times. Have a great day. We appreciate you being here. Thank you. The conference has now concluded. Thank you for attending today's presentation.