Good day and welcome to the first Internet Bancorp earnings conference call for the third quarter of 2021. All participants will be in a listen-only mode. Should you need assistance, please signal a conference specialist by pressing the star key followed by zero. After today's presentation, there will be an opportunity to ask questions. To ask a question, you may press star then one on your touchtone phone. And to withdraw your question, please press star then two. Please note this event is being recorded. I would now like to turn the conference over to Mr. Larry Clark from Financial Profiles Incorporated. Please go ahead, Mr. Clark. Thank you, Chuck. Good day, everyone, and thank you for joining us to discuss First Internet Bank Corp's financial results for the third quarter of 2021. The company issued its earnings press release yesterday afternoon, and it's available on the company's website. In addition, the company has included a slide presentation that you can refer to during the call. You can also access these slides on the website. Joining us today from the management team are Chairman and CEO David Becker and Executive Vice President and CFO Ken Lovick. David will provide an overview and a company update, and Ken will discuss the financial results. Then we'll open up the call to your questions. However, before we begin, I'd like to remind you that this conference call contains forward-looking statements with respect to the future performance and financial condition of First Internet Bancorp that involve risks and uncertainties. Various factors could cause actual results to be materially different from any future results expressed or implied by such forward-looking statements. These factors are discussed in the company's SEC filings, which are available on the company's website. The company disclaims any obligation to update any forward-looking statements made during the call. Additionally, management may refer to non-GAAP measures, which are intended to supplement but not substitute the most directly comparable GAAP measures. The press release, available on the website, contains the financial and other quantitative information to be discussed today, as well as a reconciliation of the gap to non-gap measures. At this time, I'd like to turn the call over to David. Thank you, Larry. Good afternoon, everyone, and thanks for joining us today. We are pleased with our results this quarter as we reported net income of $12.1 million and diluted earnings per share of $1.21, both of which are up more than 40% from a year ago. Excluding $800,000 of pre-tax costs incurred as we redeemed $25 million of 6% sub-debt, we recorded adjusted net income of $12.7 million, or $1.27 for diluted shares. The Board of Directors and Management are intent on increasing shareholder value, and I would like to highlight several ongoing initiatives in that pursuit. We have improved profitability by expanding our net interest margin, diversifying our fee revenue, in managing our expenses. Our performance in the third quarter generated an adjusted return on average assets of 1.18%, marking a substantial advance from a year earlier. This is the fourth straight quarter we have generated ROAA in excess of 1%. We are confident in our ability to continue growing revenue and earnings for the remainder of the year and into 2022. In the third quarter, we were very pleased with the balance growth in C&I and single-tenant lease financing. Our newest lending area, franchise finance, which I'll talk a little more about in just a moment, got off to a great start with over $25 million in originations in just three months' time. Importantly, commercial loan pipelines heading into the fourth quarter are strong, up 65% through our team's diligent work sourcing new opportunities. We expect construction activity and small business lending to be key areas of growth for us in the months and quarters ahead. As of September 30th, unfunded construction commitments across all business lines were $190 million, up 30% from the start of the year. Our commercial real estate construction team has several new opportunities in the pipeline, and we expect our unfunded commitments to increase by an additional $100 million during the fourth quarter. These projects typically fund over a 12 to 24-month horizon. The second leading growth driver for us is small business lending, which remains strong. In 2021, we made a $300 million commitment to the small business owners. As part of that pledge, we recently announced that we have teamed up with Apple Pie Capital, a leading provider of growth financing to franchisees in various industry segments across the country. Together, we are funding loans to proven businesses, fueling economic growth and job growth while deploying our capital into an attractive asset class with strong risk-adjusted returns. We began working with Apple Pie in the third quarter. As I noted earlier, we funded just over $25 million of loans during that time and expect to fund up to $100 million of originations in total by the end of 2021. We anticipate funding up to $150 million in additional loans next year. We have had a very positive experience with Apple Pie to date, and I would also note that we are actively exploring balance sheet relationships with several other fintech companies. Of course, the cornerstone of our commitment to small business is the small business lending platform we've built out over the past two years. Through the end of the SBA year, ended September 30th, we have secured approvals for 172 million SBA 7 program loans. We also funded 30 million of PPP loans earlier this year. To date, 85% of our PPP loans have been forgiven by the SBA. I'm very proud of the way our team responded to the operational challenges brought on by a series of PPP rule changes, 7 program updates, and the SBA's move to a new transfer agent, which added complications to the collection of relief payments as well as the sale of loans. Looking ahead to 2022, we anticipate originating $215 million of SBA 7 loans, which is expected to generate sales on revenue in the range of $15 million for the year. Keep in mind that secondary sales volume will be impacted as the standard government guarantee on SBA 7A loans reverts to 75% compared to the 90% guarantee temporarily installed in response to the pandemic. We are also building out of water rings and services to serve our small business customers. We recently announced a partnership with Sinsley, a FinTech provider of modern banking solutions, to provide an innovative payments hub that will enhance the digital experience for our small business owners and empower them to manage their business and cash flows more effectively. Over the last year and a half, the COVID-19 pandemic has accelerated the demand for digital banking services. Thanks to our branchless banking model, we did not have to lose time transitioning away from the branch operations. We were able instead to leverage our customer-focused product and our expertise in the digital service delivery to attract new customers and enhance the customer experience. We continue to invest in our digital capabilities and expect to announce additional relationships within the next few weeks. To conclude, we are committed to continuous improvement to serve our growing base of customers nationwide, and we believe this dedication puts us in a great position to expand our relationships and generate strong results for our shareholders in the upcoming quarter. Before I turn it over to Ken, I'd like to call your attention to two important announcements. First, I am pleased to share that our Board of Directors has authorized the repurchase of up to 30 million of our common stock. This authorization is open through the end of 2022. Additionally, we released our first ESG report earlier this week. The report chronicles our existing commitments and future priorities around mindful governance and responsible corporate citizenry, including the company's response to the financial effects of the COVID-19 pandemic on our customers and communities. By advancing our ESG initiative, we hold ourselves accountable for effectively managing risk while also facilitating financial inclusion. I'm proud of our team's efforts and successes I encourage you to read the report, which is, of course, available exclusively in digital format at FirstInternetBankCourt.com. With that, I'm just going to turn the call over to Ken to discuss our financial results for the quarter. Thanks, David. As David mentioned, it was another strong quarter with net income of $12.1 million and $1.21 diluted earnings per share. which included about $800,000 of additional pre-tax interest expense related to the redemption of $25 million of subordinated debt. After taking into account these costs, adjusted net income came in at $12.7 million, and adjusted diluted earnings per share were $1.27, representing increases of 14.7 percent and 14.4 percent respectively from the second quarter. Profitability continued to improve with an adjusted return on average assets increasing 12 basis points from the second quarter to 1.18%, and an adjusted return on average tangible common equity increasing 118 basis points to 13.97%. Looking at slide five, total loans at the end of the third quarter were $2.9 billion. down modestly from the second quarter and down 2.5% from September 30th of 2020. As David mentioned earlier, we were pleased with the growth in commercial and industrial and single-tenant lease financing during the quarter and are excited about the early performance in our new franchise finance lending area. The growth in these lines of business were largely offset by net payoffs in our healthcare finance and public finance portfolios, as balances were down $38.5 million and $10.4 million, respectively. Additionally, small business lending balances were down $20.4 million due primarily to $25 million of PPP loan forgiveness, but partially offset by new production. Consumer loan balances increased moderately compared to the second quarter due primarily to higher balances in the residential mortgage portfolio. Moving on to deposits on slide six, overall deposit balances were up modestly from the end of the second quarter, and we again saw improvement in the composition of our deposit base. During the quarter, non-maturity deposits increased by $58.3 million, or 3.2 percent, driven primarily by increases in small business and commercial balances as our focus in this area continues to pay off. CDs and broker deposits decreased $39.9 million, or 2.8%, on a combined basis. CDs and broker deposit balances continued to decline as higher-cost CD maturities were either funded with on-balance sheet liquidity or replaced with much more attractively priced money market accounts, checking accounts, and lower-rate CDs. This lowered our cost of interest-bearing deposits nine basis points during the quarter and we expect to experience continued reduction in deposit costs in the fourth quarter and into next year. Compared to the first nine months of 2020, we've realized $22 million of deposit interest expense savings to date and expect to realize around $26 million for the full year based on the current deposit pricing environment. Turning to slides seven and eight, Compared to the second quarter, both reported net interest income and fully taxable equivalent net interest income decreased $700,000, or 3.2% to $20.9 million and $22.3 million, respectively. Excluding the cost associated with the redemption of subordinated debt, net interest income increased $100,000 to $21.7 million, and fully taxable equivalent net interest income increased to $23.1 million. The average balance of interest earning assets increased $48 million, or 1.2%, compared to the second quarter, with higher average balances of securities being partially offset by lower average balances of loans and other earning assets. The yield on interest earning assets declined to 3.16% due to the changes in the earning asset composition, as well as lower loan Net interest margin decreased 11 basis points from 2.11 percent for the second quarter to 2 percent for the third quarter, and fully taxable equivalent net interest margin decreased 12 basis points from 2.25 percent for the second quarter to 2.13 percent for the third quarter. Fully taxable equivalent net interest margin adjusted for the cost of the subordinated debt was 2.21 percent, down four basis points from the prior quarter. As you can see on slide eight, the four basis point decline was driven primarily by lower average loan balances and fees, which had a negative impact of 14 basis points. This was partially offset by continued decreases in deposit costs, which provided a benefit of eight basis points. The securities portfolio also added a benefit of three basis points. Elevated cash balances also continued to negatively impact net interest margin. Currently, Cash balances have already decreased by about $100 million compared to the end of the third quarter as we put cash to work by funding loans and retiring high cost CD maturities. Although not included in the net interest margin roll forward as cash balances have been elevated for some time, 100 million of excess cash balances held at the Federal Reserve had a six basis point punitive effect on net interest margin. Looking ahead to the fourth quarter and into 2022, we expect our yield on interest earning assets to revert closer to what they were in the second quarter and then increase from there as we grow the commercial loan portfolio. Compared to the end of the second quarter, we have seen loan pipelines increase 65%, primarily driven by growth in SBA franchise finance and construction opportunities. Additionally, we continue to see opportunities for further downward deposit repricing in future periods. Over the next 12 months, approximately $787 million of CDs are scheduled to mature with a weighted average cost of 122 basis points. Currently, the replacement cost of these deposits is in the range of 36 basis points. Looking ahead to 2022, with our expectations for loan growth and continued downward deposit repricing, we anticipate annual net interest income growth to be between $9 million and $11 million. Turning to non-interest income on slide nine, non-interest income for the quarter was $7.8 million, up from an adjusted $6.4 million in the second quarter. The increase was driven primarily by higher revenues from mortgage banking activities, but was partially offset by slightly lower gain on sale of loans. We sold $22 million of SBA 7A guaranteed loans during the quarter, which was consistent with the second quarter. However, we experienced lower premiums on those sales. As I mentioned earlier, loan pipelines, especially in our SBA business, are strong heading into the end of the year. Therefore, we expect SBA gain on sale revenue to be up in the fourth quarter, probably in the range of $5 million. Turning to non-interest expenses, as shown on slide 10, The decrease on a linked quarter basis was driven primarily by a decline in consulting and professional fees and loan expenses. The decrease in consulting and professional fees was mainly due to the timing of normal third-party loan review work performed on our loan portfolio. The decrease in loan expenses was due to the reimbursement of costs incurred in prior periods related to non-performing loans. Now let's turn to asset quality on slide 11. Credit quality improved during the quarter as non-performing loans declined by $1.2 million, mainly due to the payoff of a single-tenant lease financing relationship which had previously been classified as non-accrual. Non-performing loans now represent 27 basis points of total loans, down from 31 basis points last quarter, and down from 32 basis points in the third quarter of 2020. Net charge-offs were less than $100,000 during the quarter, and net charge-offs to average loans was one basis point. We are proud of the fact that we continue to exhibit high asset quality that is among the industry's best. The provision for loan losses in the third quarter was a benefit of $29,000 compared to a provision of $21,000 in the prior quarter. The decrease was due primarily to the $22 million decrease in loan balances as qualitative factors in the allowance model remained consistent with the second quarter and net charge-offs were low. Overall, the ratio of allowance for loan losses to total loans remained unchanged from the prior quarter at 95 basis points and 96 basis points excluding PPP loans, which totaled $15 million at quarter end. With respect to capital, as shown on slide 12, Our overall capital levels improved and remain healthy at both the company and the bank. With the strong earnings performance this quarter, our tangible common equity to tangible assets ratio increased to 8.61%, up 18 basis points from the second quarter. Additionally, tangible book value per share increased to $37.12, up from $35.92 in the second quarter, and over 16% higher than one year ago. As David mentioned earlier on the call, our board of directors have authorized a new stock repurchase program with an aggregate purchase price of up to $30 million that will run to the end of 2022. We also completed a $60 million offering of 3.75% fixed to floating rate subordinated notes due in 2031 during the quarter. While a portion of the proceeds were used to redeem the $25 million of subordinated debt callable at the end of the quarter, They offer further strengthened regulatory capital and provides greater flexibility to evaluate strategic opportunities or deploy cash towards share repurchases. With that, I will turn it back to the operator so we can take your questions. We will now begin the question and answer session. To ask a question, you may press star then 1 on your touchtone phone. If you're using a speakerphone, please pick up your handset before pressing the keys. And if at any time your question has been addressed, and you would like to withdraw your question, please press star then two. And at this time, we'll pause momentarily to assemble our roster. And the first question will come from John Rodas with Jannie. Please go ahead. Hey, good afternoon, guys. How you doing? Doing good, John. How are you? Good, good. So I guess I got a few questions. I guess first off, let me just start on the buyback. Great to see that announcement. You know, the stock's up some this morning, but obviously stock's still trading below tangible book. You know, for modeling purposes, how should we model it? You know, how aggressive, I guess, do you guys plan to be with this buyback? Yeah. I think, you know, obviously we're in a blackout period right now. I think as we, you know, it was nice to see the price pop up today. But, yeah, to your point, John, we're still below tangible book. And we have it in place through the end of next year. So I think, you know, obviously we need to weigh strategic opportunities we have in front of us with the buyback. But I think we can do both. So, I think it's really a timing issue. I think, you know, ideally we feel like through the end of 2022 we should be able to do, I think, a pretty good portion, if not all, of the buyback. But just timing may impact that just due to other strategic opportunities we have in front of us that we're evaluating. Okay, Ken. Okay, so it sounds like it'll be more of a, I guess, just to rephrase, more of a drawn-out process. It's not something you'd look to do the whole $30 million in the next quarter or two? Correct. Yeah, as Ken said, we've got other opportunities we're taking a look at, John, and we think there's a position to do both. And if for some reason we get something over the finish line that the market doesn't like, then we'll come in with guns blazing on the buyback and take advantage of it. But we have definitely enough capital, and with the increase in earnings over next year, we think we're in a position we can feasibly do both very easily. Okay. And, Ken, switching gears on expenses, they were downlinked quarter, but it looked like there was some noise, I guess you said, some OREO sale gain, and then it looks like you had the reimbursement of some expenses. So how should we think about operating expenses going forward? Yeah, they were. I mean, obviously we were pleased with how they came in, but there were some moving parts in there that were a benefit of timing and, you know, just other offsets to expenses. You know, I think, you know, if we go back and look at, we're probably close to a, you know, call it a 15 to 15.5 million run rates. as we get in, you know, for the fourth quarter, that's probably a good estimate in that line. And then kind of looking forward, you know, we've continued to build out our SBA platform in terms of headcount. Some of that was delayed over the course of the year due to the timing of originations, but we've continued to add there and obviously add folks around the bank. So, you know, you take a full year's run rate of, headcount into next year's expenses. And, you know, we're probably closer to, you know, 15 and a half to 16 looking forward to next year. Okay. Okay. Thanks, Ken. And maybe just one more question. Ken, your, I guess, sort of near-term drivers, the increase in spread income of 9 to 11 million, just curious, does that off of 20, of off of this year, is that with or without the $800,000 of sub-debt expense and spread income? That would be without. Okay. So the reported number. Yeah. Okay. Makes sense. Thanks, guys. Thanks, John. The next question will come from Michael Perito with KBW. Please go ahead. Hey, good afternoon, guys. Hey, Mike. I wanted to start on the Apple Pie partnership. David, I was wondering if you could maybe just give us a little bit more color on kind of how those loans are sourced and then what the nature of the partnership is. Are they... originating loans and you guys are holding them on balance sheet or are you guys involved in the underwriting? Is there something more beyond that within the partnership? I'd love a little bit more color there if you don't mind. Sure, Michael. The partnership is actually almost identical to what we were doing with Provide Healthcare Lender slash Lendeavor over the last three or four years. Apple Pie has been around about eight to 10 years, I think, and existence has originated over a billion dollars worth of franchise loans. And they have long-term relationships with franchisees all over the country continue to increase. They, like the banking world as a whole, were a little soft during the COVID crisis because the franchise or has kind of pulled in the reins to help existing franchisees instead of expanding. So they're on a a nice growth curve themselves here in the second half of the year, which is great timing for us. We have created a credit box like we did with Provide, and they source those loans and fit that credit box. I can tell you from our underwriters and internal folks, they're ecstatic with what we've seen to date. I think out of all the loans we've processed, we only had a discussion about maybe one or two as far as some of the information in the file. It comes to us. We fund it, stays on our books. We're doing full servicing. They do the origination, but we take it from there. So it's been a great program. We're real excited about the kickoff and it looks like it's going to be very strong for 2022. Is there any opportunity with these these customers to pick up funding or anything else along those lines over time, or is it really just purely a lending relationship partnership? No, they're taking a look at the funding side, and I misspoke there, Michael. They are doing the servicing. We purchased the loan, but we have talked to them about getting the deposit opportunity with these folks as well. And one of the nice things about it, they've been in the industry long enough. A lot of these individuals are not brand new franchisees. They're the guy coming back for store number three, store number four. They're multi-franchisees. So it's good, strong credits, good, strong businesses. Kind of the opposite of our FDL program. Historically, we've financed the facility and not the operator. So it's been... an interesting time for us to look at the credits, but yeah, there is definitely, with this program, where it is not just a real estate, we're hopefully working on a program-gift-to-deposit relationship as well. And is this kind of an indicator of the type of things that you guys are looking at that are in the pipeline? Are they mostly partnerships that would fall into this type of arrangement, or is there more diversity in some of the incremental things that you guys are alluding to that could come in the near term? A lot of diversity. The other partnership we announced here during the third quarter with Fensley, that's just a technology which actually complements our small business products. We have other folks where it's a lending opportunity. We have two or three FinTech firms out here where it's a deposit opportunity. So we're looking at all facets, and we obviously have other FinTech companies that have technologies that just make our existing systems work better. So we've got, as I think I said, probably one or two calls back. We've got about 10 different services that we're actively looking at and talking to and should have hopefully several more announcements here in the fourth quarter and early next year. And what are the rates kind of on these Apple Pylons, you know, roughly? Apple Pie Netto is a little over 5%, and the term is a little lower than the healthcare loans where we're averaging, I think, about a seven-year term on it versus 10. So a nice bump up in yield as well as a shorter term. Got it. Helpful. And I wanted to clarify on the top line guide, Ken, the 9 to 11 million of growth in 2022, I mean, just Are we basing that off kind of like an annualized year-to-date run rates or something like in the high $90 million range? Is that the right way to think about it? Or is there a different, would you clarify that at all? Oh, that's exactly it, Mike. On an FTE basis, you're spot on. Okay. And then just lastly, I was wondering if you guys could just spend a minute on the dynamics within the SBA in the quarter. You know, it sounds like Was pipeline pushed out? Was it really just the margin contracted more than you expected, but now the pipeline is larger than you expected for the fourth quarter? Just curious about the dynamics there with the revenue pickup in the fourth quarter. And then part B of that, just wondering if you can provide a little bit more color behind the scenes about the pipeline for next year, the revenue targets. Is that, you know, the current team, is that continuing to add more salespeople? Just would love a little bit more insights there, if you guys don't mind. Yeah, quick one for you. At the end of the third quarter, during the month of September, the SBA had used Colson as their transfer agent, I think, from the beginning of time. They switched over to a new firm called Guidehouse. That created a lot of slowdown and complications with the CARES payments that were being made by the government. as well as getting sales to the secondary market. So part of the push here, fourth quarter and the bump up is stuff that we just couldn't get through the pipeline. Obviously, September 30th is their physical year end, which is just massive volume for them to begin with. It was also the end of the 95% insurance riders. So SBA was flooded, picked a pretty poor time to change their transfer agent in hindsight. So a little bit of the fourth quarter bump up its carryover going into 2022. We just had a meeting with the SBA team and plotting out with financing their budget. We hope to add another BDO or two, but we've got a good solid team. We're definitely adding some more back office staff to support that volume growth, but they're pretty comfortable It was 48 hours ago that the 215 is a realistic number and a good opportunity for us. So obviously SBA has been up. PPP is getting out of the way and kind of getting cleaned up for everybody, so it's making it a little more competitive. But we think we've got a great team, great program, and look forward to really growing significantly again next year. Awesome. Thank you guys for the color and taking my questions. Appreciate it. Appreciate it, Mike. Thanks, Mike. The next question will come from Brett Rabattin with Hovde Group. Please go ahead. Hey, good afternoon. Hey, Brett, how are you? Good. I wanted to first ask, when we think about the loan portfolio growth in the fourth quarter, you know, looking at some of the individual segments that have had payoffs, I guess I'm curious, do you expect that some of the line items like healthcare maybe continue to have some atrophy due to rate competition. And as we think about fourth quarter and 2022, I mean, it looks like you could be a double-digit core grower as the PPP winds down here. What are your thoughts on net origination versus the payoffs that you might be looking at? Yeah, I think we feel pretty good about pipelines going into the into the fourth quarter here. Obviously, healthcare finances, it's an asset class we like, and we'd love to find a new team to work with in that area and grow that portfolio. But there may be some continued decline in the short run there. But obviously, the apple pie growth forecasted for the year, which is right on track, is You know, that remains right on track, remains pretty robust. You know, but we're also seeing in areas in single tenant, for example, you know, paydowns, prepayment activity has slowed a bit there. And with kind of the bump up in the longer rates on the curve, our pricing is more competitive than it was earlier in the year when the 10-year was at a bottom. So I think kind of across the board in a handful of areas and what we retain on the SBA as well. I mean, our SBA pipeline is strong and, you know, we're still probably selling some of that volume at the 90% guarantee. So we're not retaining as much as we would kind of in a normalized environment. But I think kind of across the board as we look at loan growth for the fourth quarter, I think we feel good about it in several different areas about just overall net growth. We're at the only area that's going to be a little soft for us here in the fourth quarter. Our teams feel like they've been running in place all year. We've got a couple very large C&I opportunities or C&I loans that are on the books today that there's a potential sale of the companies here in the fourth quarter. So that could have some impact on C&I business. Ken said everything else looks really stable and growing, and we're pretty pumped up. Obviously, the apple pie adding $100 million there will more than compensate, particularly with the yield on it, any loss that we have from health care. So we're pretty excited about fourth quarter numbers. Okay. And then the other thing I was curious about was just thinking about the deposits. You've obviously managed the CD costs down nicely. Most of the industries just had so much liquidity kind of come at them from a deposit perspective, but you guys deposits have been fairly stable. Can you talk maybe about the management of the deposit base and then I think people are starting to think about rates and don't know if it's a late 22 or 23 possibility, but as we think about the eventuality of higher rates, how you're thinking about managing you know, the deposit costs when we go to the other side of the point on rates? Yeah, I mean, you know, obviously we're like many other banks in the industry that have suffered from excess liquidity on the balance sheet. We alluded to it. I alluded to it in my comments on the margin. But we also had the position of, you know, CD maturities You know, coming off and really, I mean, we've had the growth and we've seen the growth in money markets and checking accounts, especially in the small businesses. We've thrown a lot of time and effort and marketing behind growing those balances. But in terms of deposit growth overall, we had the luxury of having those dollars come in the door that really replaced the maturities on the CD side. And I think as we kind of look forward into 22 as well, we continue to see that happen. Eventually your CDs can't, you know, there's eventually gets to a point where the maturities kind of, the pace of maturities will go down. But just looking into 2022, we just see continued, again, I'll call it just continued shift in the composition of deposits from, you know, CDs to money markets, checking, et cetera. And I think when we think about pricing, and what may happen in different rate environments. You know, last time the rate environment was we were in an up rate environment, betas on CDs were at 100 percent, whereas in the other non-maturity products, they were lower than that. In the money market space, too, they were, you know, probably closer to 50 to 60 percent than the 100 percent on CDs. going into an up-rate environment, when that occurs, I think we feel much, much better about the composition of the deposit base. And like I said, we're not done. We continue to foresee this continual shift well into 22 and beyond. One of the things we're doing, Brett, obviously, somewhere in 22, they're probably going to have to do something on rates. You made the comment that everybody's flush with cash, so hopefully As the rates start to climb, it won't be the feeding frenzy we had the last time in 18, where if the Fed moved 25 institutions, we're moving 35 to get the money, as Ken said. One of the other things we're doing right now, we can lock up some commercial CD opportunities with insurance companies, et cetera, in that three-, four-, five-year range that are under 100 basis points. We're trying to adjust the pricing a little bit to pick up some stuff. little longer in term, obviously a little more costly, but still in the big scheme of things, very cheap money for that next three to five year window. Okay. And then maybe just one last one, if I could, just around capital, you know, you could obviously do the entire 30 million and it wouldn't really, you still not have any issues with capital. I'm curious, some of these other investments that you're thinking about or partnerships, are they going to require equity capital to be deployed with these firms or how should we be thinking about some of these additional partnerships that you're considering? Acquisition opportunities, obviously, that's going to involve some dollars. I will tell you in a couple of the FinTech companies that we're working with and opportunities. We are making, hopefully in some cases, capital investments in that company by a percentage. A lot of them are in a Series B, Series C round, etc. There's an opportunity to participate. Not only are we signing on as customers and providing products or services to each other, but we're also taking an equity stake in the companies if possible. So a little bit, it's not massive dollars. We're not playing Silicon Valley Bank here, but it's a good opportunity for us to kind of get on the ground floor with some really, really strong opportunities, at least from my background in 40 years in technology. There's some neat things happening out here that I think could be, in the long term, very beneficial to us. But as Ken said, we're continuing to look at opportunities for acquisition. That obviously would hit the capital pretty heavily, but or the cash base, pretty heavily, not capital. But we've generated the... I guess we're in a great position right now. We're closing in on 9% PCE. That's probably the highest we've been since the very earliest days of the bank, so we've got a lot of flexibility and a lot of opportunity here. Okay, great. Appreciate all the color. Thank you. Thanks, Brett. The next question will come from George Sutton with Craig Halem. Please go ahead. Thank you. I wanted to address, David, if we could, the commercial pipeline in a little more detail. How much of that is market dynamic? Because I haven't heard much of increased commercial demand out there. So I'm wondering market versus your execution and just the strength of your go-to-market that's really creating these opportunities. We're kind of in an enviable position, George. I think with the last expansion we had of the FedEx hub here in Indianapolis, we're now actually larger than the home base in Memphis, Tennessee. And there are warehouses popping up. There's this little firm called Amazon that's trying to suck up every square inch of space in and around Indianapolis for distribution. So it's just that we're in the right place, right time with a great team. And it's some folks that we've worked with over the years that are just having a tremendous opportunity right now. I think there's close to 70 million square feet of warehouse space. going up in the next 12 to 14 months here in the Indianapolis marketplace. We have ventured a little bit outside of the Indianapolis marketplace on commercial real estate with some of these firms. Obviously, Amazon's not throwing all the takes into one basket here in Indianapolis. So it's been a nice opportunity for us to take some long-term connections and taking advantage of the market. Gotcha. That's helpful perspective. Actually, ironically, I was in Indianapolis last week and I saw that Amazon operation that you're talking about. It is quite impressive. So I'm sorry, FedEx operation. So relative to the Series B deals, B and C deals that you mentioned you were contemplating, is this incremental to the. investments you've made through private equity funds? You're referring to additional opportunities, just to be clear? Yeah. Some of them we're still working with private equity funds, and some we're going direct into the companies ourselves. In fact, we're working on what we call today the First ID Venture Sub or something of that nature that, I mean, we're not going to go crazy with it, but there are just a lot of really good companies coming up out here right now. and opportunity to get in on the ground floor, we're going to take advantage of that. Okay. And then finally, just so I fully appreciate the buyback that you are looking at, that is really a result of the valuation opportunity that you see. That is in no way, shape, or form related to any diminishment of M&A opportunities that you are considering or could pursue. Is that a reasonable conclusion? You hit the nail on the head, George. That's exactly right. Exactly right. I've always been grow first, buy back second. So we're still looking at the acquisition market extremely heavily. Perfect. Thanks, guys. Appreciate it. Thank you. Thanks, George. Again, if you have a question, please press star, then 1. Our next question will come from Nathan Race with Piper Sandler. Please go ahead. Yep. Hi, guys. Good afternoon. Hi, Nathan. Going back to the acquisition discussion, obviously with the stocks still trading below tangible book, it's difficult to use your currency, I'd imagine. So I guess within that context, how should we be thinking about potential earn-back periods on tangible books? solution and so forth, as you guys consider complete acquisitions and so forth, and not just partnerships per se. The ones we're looking at at the current time, Nate, are cash deals. It is not an equity situation, so the really only delusion would be if there's any goodwill in the deal, but it's coming out of cash. We're obviously trading at, I guess we're close to the I don't know where we're exactly at today, but yesterday we were 90% of bucks. That's still not good currency to buy anything with, so we're looking at cash opportunities. And would the earn back period on those potential deals be south of three years, or how are you guys going to think about just the tangible book value dilution associated with acquisitions near term? Yeah, we're... We're using the three year as kind of the play, you know, a month or two shorter, a month or two longer. Doesn't really excite us, but yeah, we're focusing on a three year return. Okay, great. And then maybe changing gears and thinking about balance sheet size and securities book. You know, there's been some quarterly fluctuations just between the average and end of period balances in the securities portfolio over the last couple quarters. How should we be thinking about the size of the securities book as you guys, you know, have a pretty strong loan pipeline? particularly with Apple Pie coming on board. Does the securities book kind of hold steady here over the next few quarters, Ken, or does it kind of shrink to also support the expanding outlook on them? Yeah, I think that probably the way to look at that is kind of a secondary support on that. Obviously, we want to take our cash and fund loans first. And as we've said on this numerous times, I think we feel really, really great about the pipelines we have in front of us. Of course, sometimes you can't always control timing. But I would say that on average, you know, you'd probably expect the securities balance to drift down, you know, over from where it's at today. We did, you know, if you remember earlier in the year, in June, we did take a lot of our cash balances were well north of $500 million and We put a lot of cash into the securities portfolio then with the expectation that we wouldn't need to put much in there and just let cash balances fund loan growth. I don't expect cash or securities balances to go up from here and would expect them to drift down over the next 12 months, but as I said, depending on loan Loan timing, we may put some money away into the securities portfolio. And sometimes we buy mortgage backs for CRA purposes. But that's really probably all the activity you would see in that area over the next six months minimum. Yeah, one of the things that's happening in the marketplace too, Nate, as Ken said in his comments today, we picked up three points this past quarter on the securities portfolio. A lot of it is mortgage-backed product that we've had on the books over quite some time, and obviously, as refis slow down and repayments on those things slow down, that's going to help, one, boost the yield on the securities portfolio and also slow down the payback. So it won't run off quite as fast as it has been, and particularly if there's real solid indication that the Fed's gonna bump up rates a little bit. Repies, I think, are down over like 62% on a year-over-year basis. So that has impact on our mortgage side, which kind of hurts us, but on the other side, it helps us because it really slows down some of the paybacks on those securities and the premiums that we have to write down. So double-edged sword, but it should be pretty stable for the balance of the year in 2022. Okay, that's helpful. I appreciate all the color. Thank you, guys. Thank you. This concludes our question and answer session. I would like to turn the conference back over to David Becker for any closing remarks. Please go ahead, sir. Thank you, Chuck. And I'd like to thank all of you for joining us today. We had a tremendous quarter. We're happy to share it with you. We hope you have a great day and continued success. Thank you very much. The conference has now concluded. Thank you for attending today's presentation. You may now disconnect.