[
    {
        "date": "2021-07-22T12:00:00-04:00"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good day, everyone, and welcome to the first Internet Bankor earnings conference call for the second quarter of 2021. All participants will be in listen-only mode. Should you need assistance, please signal a conference specialist by pressing the star key followed by zero. And please note today's event is being recorded. I would now like to turn the conference over to Larry Clark from Financial Profiles, Inc. Please go ahead, Mr. Clark."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Sarah. Good day, everyone, and thank you for joining us to discuss First Internet Bancorp's financial results for the second quarter of 2021. The company issued its earnings press release yesterday afternoon, and it's available on the company's website. In addition, the company has included a slide presentation that you can refer to during the call. You can also access these slides on the website. Joining us today from the management team are Chairman and CEO David Becker. and Executive Vice President and CFO, Ken Levick. David will provide an overview and a company update, and Ken will discuss the financial results. Then we'll open up the call to your questions. Before we begin, I'd like to remind you that this conference call contains forward-looking statements with respect to the future performance and financial condition of First Internet Bank Corp. that involve risks and uncertainties. Various factors could cause actual results to be materially different from any future results expressed or implied by such forward-looking statements. These factors are discussed in the company's SEC filings, which are available on the company's website. The company disclaims any obligation to update any forward-looking statements made during the call. Additionally, management may refer to non-GAAP measures, which are intended to supplement but not substitute the most directly comparable GAAP measures. The press release available on the website contains the financial and other quantitative information to be discussed today, as well as the reconciliation of the GAAP to non-GAAP measures. At this time, I'd like to turn the call over to David."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Larry, and good afternoon, everyone, and thanks for joining us today. We produced strong operating results for the second quarter of 2021, driven by net interest margin expansion and disciplined expense management. Reported net income was a record $13.1 million, and diluted earnings per share was a record $131. Included in our results for the quarter was a $2.5 million pre-tax gain on the sale of our corporate headquarters. Excluding this amount, adjusted net income was $11.1 million, which would still be our highest quarterly results ever, and adjusted earnings per share was $1.11 million, a penny shy of our quarterly record. The strong performance enabled us to generate an adjusted return on average assets of 1.06%, demonstrating continuous improvement from the beginning of the pandemic crisis. And we increased our tangible common equity to tangible assets ratio by 31 basis points to just over 8.4%. Compared to the second quarter of 2020, performance has increased significantly due to the strong growth in net interest income and net interest margin, as well as from the investments we have made in our fee revenue lines of business. Using the adjusted earnings results, both net income and earnings per share are up 182% and 178%, respectively, while adjusted total revenue is up 45%. Our national SBA platform gained momentum during the quarter, producing $3 million of gain-on-sale revenue, up significantly from the first quarter. Due to the disruption in the small business lending market earlier in the year and the time it took to rebuild pipelines, our level of forecasted originations for the year has bounced slightly from our prior forecast. Loan pipelines have recovered. We are actively engaged and meeting strong demand for the traditional SBA 7A loans as the economic recovery accelerates. Therefore, we still feel very confident in the growth of our SBA business with expected gain on sale revenue between $13 to $14 million for the full year. Looking at the lending activity for the second quarter, total loan balances were down just over $100 million as prepayment activity remained elevated in the healthcare finance and single-tenant leasing financing portfolios. Looking forward, though, loan pipelines across other commercial lines of business began to grow significantly during the second quarter. For example, the single-tenant lease financing pipeline is at its highest level in 15 months as relationship borrowers are increasingly coming to us to finance additional opportunities. In total, our commercial pipeline is up over 20% from the end of the first quarter. Another area of focus for us has been increasing our presence in construction lending. Funding balances are up over 50% from one year ago, and our team is actively sourcing new projects. Moreover, as of June 30th, unfunded commitments in our construction line of business total $159 million. an increase of 39% over the balance at the end of the first quarter. With regard to healthcare finance, balances were down over $50 million from the first quarter, driven by elevated prepayment activity and a very low level of new originations. New origination activity during 2021 has been light as a low interest rate environment and heightened competition drove pricing well below the floors we have in place. Additionally, in June, our partner in this line of business, Provide, formerly known as Lendeavor, announced that it was going to be acquired by Fifth Third Bank, who already had an ownership stake in the company. Going forward, we expect that Fifth Third will retain most, if not all, of Provide's new origination activity. However, we continue to explore new lines of business and partnerships. For example, during the second quarter, we finalized a partnership with a fintech-oriented specialty lender that focuses on high-quality loans to the franchise industry, and we will fill the gap created by the decline in health care finance balances. So this relationship, we expect to begin funding portfolio loans with attractive yields during the third quarter and have committed to fund up to $100 million of originations over the next 12 months. This relationship will also provide SBA 7a lending opportunities to supplement our own origination activities. On the lending front overall, we feel really good about how pipelines increased during the second quarter. Lehman is well-positioned to deploy the elevated levels of cash on the balance sheet and capitalize on loan growth opportunities in the second half of 2021. Our credit quality, meanwhile, remains among the best in the industry. During the quarter, non-performing loans declined 5.4 million, or 37%. and non-performing assets declined 4.1 million, or 28%, due primarily to positive developments on a single-tenant lease financing relationship and a commercial and industrial relationship, both of which were previously classified as non-accrual. At quarter end, the ratio of non-performing loans to total loans had declined to 31%, and the ratio of non-performing assets to total assets has declined to 25 basis points. Additionally, delinquencies dropped significantly during the quarter, representing only seven basis points of the total loan balances. We are especially proud of the fact that as of June 30th, we had no delinquencies in our originated consumer loan portfolio. Turning now to the consumer and small business banking, demand for digital banking services is at an all-time high. We have leveraged our customer-focused products, which include the nation's best checking account for small business, as awarded by Newsweek magazine, and expertise in digital service delivery. We have 22 years of experience in providing not just a robust customer-facing interface, but also the processes behind the scenes to support a seamless experience. During the first half of 2021, we have grown our small business checking relationships by more than 25%. And to continue to win and retain these relationships, we are close to being able to announce several collaborative partnerships with fintech companies. We look forward to sharing with you in a future call more details about our next generation customer experience that will also power internal efficiencies. In summary, we generated excellent results for our shareholders in the second quarter. We are in great financial position to serve our customers and help fuel the broader economy as the country emerges from the pandemic. Before I turn it over to Ken, I would like to thank the entire First Internet team for the diligent efforts in delivering record earnings this quarter. We continue to challenge ourselves to imagine more, and First Internet Bank has fostered a workplace culture that promotes innovation, collaboration, and customer focus, which is reflected in being named one of the top workplaces in Indiana for the eighth consecutive year. We are confident in the strength of our franchise and the momentum we have built heading into the back half of 2021. With that, I'd like to turn the call over to Ken to discuss our financial results for the quarter."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, David. As David mentioned, it was a strong quarter with record net income of $13.1 million and $1.31 diluted earnings per share, which included a $2.5 million pre-tax gain on the sale of our corporate headquarters. After taking into account this one-time item, Adjusted net income came in at $11.1 million, and adjusted diluted earnings per share was $1.11, increases of 6.2% and 5.7% respectively from the first quarter. Profitability continued to improve with fully taxable equivalent net interest margin increasing seven basis points sequentially to 2.25%, and adjusted return on average assets of 1.06%. and an adjusted return on average tangible common equity of 12.79%. Looking at slide four, related to revenue and drivers of revenue growth, we have outperformed a peer group of similarly sized institutions on a year-over-year basis, and we expect this trend to continue once each of the peer institutions have reported results for the second quarter. Turning to slide six, total loans at the end of the second quarter were $3 billion, a 3.3% decline from the first quarter and relatively comparable to June 30th of 2020. The decline in loan balances from the first quarter was driven largely by net payoffs in our healthcare finance, single-tenant lease financing, and public finance portfolios, as balances were down 54.3 million, 28.2 million, and $25.5 million respectively. Additionally, small business lending balances were down $9.2 million, largely due to $16.2 million of PPP loan forgiveness, but partially offset by new production. Increases of $24.4 million in commercial and industrial and $14 million in investor commercial real estate loan balances partially offset the overall decrease in the loan portfolio. Consumer loans decreased modestly compared to the first quarter due primarily to continued prepayment activity in the residential mortgage portfolio. We did, however, see an increase in origination activity within our specialty consumer lending business with trailer balances increasing $5.3 million or 3.7% from the first quarter. Moving on to deposits on slide seven. Overall deposit balances were down slightly from the end of the first quarter, and again we saw improvement in the composition of our deposit base. During the quarter, CDs and broker deposits decreased $75.5 million, or 5.1% on a combined basis, while non-time deposit balances increased $64.1 million, or 3.7% on a combined basis. CDs and broker deposit balances continued to decline as higher cost CD maturities were either funded with on-balance sheet liquidity or replaced with much more attractively priced money market accounts, checking accounts, and lower rate CDs. This deposit migration lowered our cost of interest-bearing deposits 13 basis points in the quarter, and we expect to experience continued reductions in deposit costs throughout the second half of the year. Compared to the first half of 2020, we've realized $16.6 million of deposit interest expense savings to date and expect to realize around $26 million for the full year based on the current deposit pricing environment. Turning to slides eight and nine, despite loan balances declining over the quarter, net interest income and net interest margin on both a gap and fully taxable equivalent basis continued to increase compared to last quarter. As you can see from the net interest margin bridge on slide nine, deposit pricing had the largest effect on margin during the quarter with a positive impact of 11 basis points. Although loan yields were up three basis points from the prior quarter, the all-in effect of the loan portfolio was a negative impact of six basis points driven by volume as average loan balances were down $62.8 million or 2% from the first quarter. The average balance of interest earning assets was relatively flat compared to the first quarter, but a shift in the mix of interest earning assets resulted in a five basis point decrease in the yield. The decrease in the average balance of loans was essentially offset by growth in average cash balances, which increased $69.2 million from the prior quarter. As cash balances continued to increase during the quarter, We deployed about $200 million of liquidity into 15- and 20-year agency mortgage-backed securities in mid-June, which should have a positive impact on the earning asset mix in the near term. Looking ahead to the second half of 2021, we project our yield on interest-earning assets to remain relatively stable as we expect to deploy liquidity to fund new loan originations as pipelines continue to build. Overall, we are pleased to have delivered a seven basis point improvement in our fully taxable equivalent net interest margin during the quarter and expect the upward trend to continue throughout the second half of the year. Turning to non-interest income on slide 10, non-interest income for the quarter was $9 million, up from $8.4 million in the first quarter. However, as mentioned earlier, included in those results was one-time pre-tax gain of $2.5 million due to the sale of the company's corporate headquarters. Adjusted for that sale, non-interest income was $6.4 million, down $1.9 million from the prior quarter. The decrease was driven primarily by lower revenues from mortgage banking activities, but was partially offset by an increase in gain on sale of loans. Mortgage banking revenue totaled $2.7 million for the second quarter, down $3.1 million from the prior quarter. Interest rate lock and origination volumes during the quarter were off the record high levels we saw in the past few quarters, mostly due to lower refinance activity, as well as limited housing inventory in the marketplace. Furthermore, competition has intensified, which has put significant pressure on our margins. Although there may be volatility in mortgage banking revenue, we expect it to stabilize during the second half of the year. Gain on sale of loans totaled $3 million for the quarter, up $1.3 million, or 75% from the first quarter, as we sold a larger amount of the U.S. Small Business Administration 7A guaranteed loans at higher premiums. With respect to non-interest expenses shown on slide 11, The decrease on a linked quarter basis was driven primarily by a decline in salaries and employee benefits and deposit insurance premium, which was partially offset by increases in marketing, advertising, and promotion expense. The decrease in salaries and employee benefits was due mainly to a decrease in medical claims expense during the quarter, while the decrease in deposit insurance premium was due to the decline in total assets year over year. The increase in marketing expenses was due to higher mortgage lead generation costs, and increased sponsorship initiatives. Now let's turn to asset quality on slide 12. Credit quality improved during the quarter, mainly due to the resolution of a number of legacy nonperforming loans. Nonperforming loans declined $5.4 million, or 37%, compared to the linked quarter, due primarily to positive developments related to a single-tenant lease financing relationship and a commercial and industrial relationship. both of which had been classified as non-accrual. The single-tenant lease financing relationship included two loans, one of which was paid off at net book value and the other was transferred to other real estate owners. The commercial and industrial relationship included four loans, two of which paid off during the quarter. As a result, non-performing loans now represent 31 basis points of total loans down from 48 basis points in the prior quarter. In addition, we eliminated $2.9 million of specific reserves related to these loans. Net charge-offs increased by $2.5 million in the quarter, and net charge-offs, the total to average loans, increased to 35 basis points from two basis points in the first quarter. The increase in net charge-off would due primarily to the single-tenant lease financing relationship that was resolved as the loan payoff and the transfer to other real estate-owned were recorded at net book value, which consisted of unpaid principal balance, less specific reserves. The provision for loan losses in the second quarter was $21,000, compared to $1.3 million for the prior quarter. The decrease was due primarily to the $101.1 million decrease in loan balances, but was partially offset by continued upward adjustments to certain qualitative factors in the allowance model. Although the economic outlook continues to improve and we have seen positive credit quality trends within our portfolio, we recognize that certain aspects of the economy have yet to fully recover and the potential still exists for future pandemic-related disruption. Because of this, we felt it was important to continue to maintain a larger qualitative reserve until there is a greater consensus on the overall health and direction of the economy. I would like to point out that had we not made these further adjustments to the qualitative factors in our model, we would have recorded a negative provision of about $800,000 for the quarter. Overall, the allowance for loan losses decreased $2.6 million during the quarter, and the ratio of the allowance to total loans decreased to 95 basis points from 1% as of the prior quarter. Excluding PPP loans, which totaled $39.7 million at quarter end, the allowance coverage ratio was 96 basis points, down six basis points from the linked quarter. The decline in the allowance was driven primarily by the removal of the specific reserves discussed earlier, as well as the decrease in total loan balances, which included declines in certain commercial loan portfolios with higher allowance coverage ratios. These items were partially offset by the upward adjustments to the qualitative factors in the model, which resulted in a six basis point increase to the allowance coverage ratio related to the general reserve on the company's commercial loan portfolio. With respect to liquidity and capital, as shown on slide 13, our overall capital levels improved and remained healthy at both the company and the bank. With the strong earnings performance this quarter, our tangible common equity to tangible assets ratio increased 31 basis points to 8.43% from 8.12% in the first quarter. Additionally, tangible book value per share increased to $35.92, up from $34.60 in the first quarter, and just over 16% higher than one year ago. I would like to wrap up my comments with a few thoughts on the balance sheet and revenue initiatives we have implemented over the last several quarters that position us much better to perform well in a variety of interest rate environments, as shown on slide 14. First, as compared to the last time interest rates began to consistently increase, we have significantly improved the composition of our deposit base. Our efforts to drive growth in small business and consumer money market and checking accounts have reduced the need to fund loan growth with CDs, which experienced much higher pricing betas in the last rate tightening cycle. Second, we have made a substantial investment in building a sustainable SBA lending platform that has grown and diversified our non-interest income and should provide a level of stability to overall revenue in times of interest rate volatility that may compress net interest income. And third, we have increased our focus on building lines of business with higher yielding variable rate and shorter duration loan originations. Retained SBA 7A balances priced at healthy spreads over the prime rate and our growing construction line of business are examples of these efforts and are expected to become larger components of our loan portfolio. Overall, we believe that our balance sheet and sources of fee revenue are in a much better position than they were several years ago, and we will continue to build off the improvements made over the last several quarters to create a franchise that will deliver high performance regardless of the interest rate environment. With that, I will turn it back to the operator so we can take your questions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. We will now begin the question and answer session. To ask a question, you may press star, then 1 on your touchtone phone. If you're using a speakerphone, please pick up your handset before pressing the keys. To withdraw your question, please press star, then 2. At this time, we will pause momentarily to assemble our roster. Our first question comes from Michael Perito with KBW. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, good afternoon, guys. Thanks for taking my questions. Good afternoon, Mike. Hey, Mike. Dave, I'm sure that you're limited in what you can say in terms of some of those fintech partnerships you alluded to coming in the near future here. But I was just curious if maybe you can give us some more structure behind that in terms of, you know, what type of opportunities we should expect to see financially. Are they primarily financial? Lending opportunities where you're using your balance sheet or deposit opportunities where you're offering insured checking accounts or just any color there would be helpful just so we know how you guys are thinking about those opportunities broadly moving forward."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, technically from the partnerships discussed there, that's really internal software and infrastructure cleanups in the small business category. So it should provide both. Like I said, we've had great growth. since the first of the year with commercial checking accounts going up 25%. But we think we're going to add some additional features on the back end, make smoother access, faster performance that will help both on the lending and the savings side of things and deposit base. So that is technically infrastructure updates, but obviously with the FinTech companies that we're partnering with, they also bring opportunity to the table and channels for delivery. But the real focus of the first push here, Michael, is going to be on the small business community and making a better service and better feature for them."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Helpful. Thanks, Dave. And then on the SBA side, I guess, can you comment maybe a little bit more specifically about what the margins you're seeing in the secondary market there are, and, and, you know, you guys maintain the 13 to 14 million for the full year is, is the volume, you know, driving that similar or is it, you know, stronger margins to get you there? Or just can you explain the dynamics a little bit in that market right now? And, and, you know, what gives you guys the confidence of hitting the, the, the revenue print?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I'll take the first stab and then let Ken back me up here. The, margins that we're making or the gain on sale, we've actually hit a couple loans in the 15% to 16% level. We're averaging probably about a 113 on gain on sale. As we say, gross volume of loans will be down, but the fact that we're selling 90% versus 75% and the margins, when we say 113, 114, we have to give half of it over 10% to the SBA. So it's a little smaller figure, but we're up probably at least 3% on the margin and selling 90 versus 75. Even though volume is going to be down, we'll be very close to what we projected for total earnings for the year a year ago."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it helpful. And then just lastly for me, looking at the balance sheet, right, you guys, $4.2 billion. TCE ratio's got a handle on it. You got some capacity on a lower deposit ratio. You're obviously a much different, you know, position than a few years ago. Should we be expecting some balance sheet growth from here now? I mean, it sounds like you guys are working to add some new lending partnerships and verticals. You know, pipelines are in decent shape. You know what I mean? The balance sheet's been flat for the better part of, you know, 10 quarters now? I mean, are we close to reaching an inflection there? Or do you think there's still more remixing that can happen behind the scenes and more capital building that needs to happen before that switch is kind of turned?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Mike, you know, I think we've obviously been pretty pleased with how capital is built and can certainly support growth. And as David talked about in his comments, we feel pretty good about pipelines and starting to see, you know, pipelines build. So I think we should expect to see loan growth between now and the end of the year. I think in terms of the total balance sheet, what probably offsets that a bit is we still have a lot of excess cash in the balance sheet. So we continue to remix the deposit composition, which in this quarter was kind of a wash and didn't really produce much growth. But we have that, you know, I guess the cushion there with the excess cash to redeploy the excess liquidity on the balance sheet. So while it's probably maybe like what we've talked about in the past, we may see a higher percentage of loan growth, you know, between now and the end of the year, but not a lot of overall balance sheet growth. And I would also say probably the little bit of the wild card to offset that would be what prepayment activity is going to look like in the second half of the year. It was elevated in single tenant and health care certainly in the second quarter. But right now I'd say at least quarter to date, which we're really not that far into the quarter, but prepayment activity seems to have slowed in single tenant and seems to have slowed a bit in health care as well. So that would be the only kind of the offset to overall loan growth would be the estimated prepayment activity."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Let me ask you the question a little bit differently. I guess, you know, there's clearly still some dynamics in the market, right, that are impacting the balance sheet size, and as you alluded to, Tim, but as we look to next year, I mean... would you guys be surprised if kind of flat balance you've been operating with, you know, holds further or you have much more appetite for growth than maybe you did 18 months ago?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "We have a higher appetite without question, Mike. Okay."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And we're looking at partnerships. Oops, sorry."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I was going to say we're looking at partnerships internally and externally to help push that up. As Ken said, we're, Still, there's a lot of market forces, as you pointed out, too, that are kind of beating on us right now. But we're open to offset that with some external partnerships that will help drive volume. Even though our existing channels are getting better, we're still looking for other opportunities, too, that should come to fruition between now and year end. So we do anticipate growth next year. Helpful."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you guys for taking my question. Appreciate it, Mike. Thank you. Thanks, Mike."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our next question comes from Brett Rabattin. We've helped degroup. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, good afternoon, guys. Hey, good afternoon. Hey, Brett. I wanted to first ask, you just mentioned your strong capital ratios and, you know, obviously the outlook for the balance sheet. Why not, given where the stock is here, why not do a buyback at these levels? It would seem like it'd be a pretty good use of capital at these prices."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "As I've stated on many, many occasions, I would much rather put it to work to buy something and acquire something and gather more opportunities. We have a couple of fairly solid opportunities that we're looking at that could gain leaks between now and year-end. But I'll tell you, Brett, if it doesn't happen and the share price stays where it is, obviously, trading in the 31-32 range with a book value of almost 36, it wouldn't make a lot of sense to... buy back some shares. And we do have capital capacity for the first time in a long time to do that. So we want to play out a couple opportunities we're looking at, but if they don't come to fruition, we will do a buyback somewhere year-end, early 2022. Okay."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And then I wanted to follow up on the points you made about the payoffs decreasing so far, at least this quarter. I mean, it seems like There are some large regionals out there that are, you know, doing some pretty aggressive fixed rate stuff in the healthcare business. And, you know, I guess I'm just trying to make sure I understand the dynamics of your expectations for pipelines and single tenant leasing. to maybe offset any additional pressure you might see in the other portfolios, particularly, you know, health care, public finance. What kind of gives you the confidence that those payoffs are going to abate, or I guess they have this quarter, but what visibility do you have in that?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, I think, you know, certainly in the first half of the year, you know, when rates, even the longer end of the curve, was still, you know, down very low, you know, I mean, there was quite a bit of competition across all areas of our business, whether it's single-tenant finance or healthcare finance, C&I lending, and we've had floors in place and really made the decision not to chase rates down to the bottom. So that certainly impacted loan growth and pipelines here in the first quarter and certainly in the second quarter. I think as rates have come up a bit, the economy has Phil Kleisler- improved somewhat we've just seen more activity in single tenant, for example, the you know the you've had the. Phil Kleisler- You know kind of the back end of the curve come up a little bit on the rate side which which helps our pricing and gets pricing on new deals more in line with you know at least where our floors are if not higher. We've seen a lot more activity in the space as well. We've seen, you know, borrowers, you know, customers already who had new opportunities come to approach us with new opportunities. And we've just kind of seen what our sweet spot is in that space in terms of just more transactional, like kind of smaller dollar levels, kind of in that, you know, million to a million five range. come into play. So in single tenant, as David said in his comments, that pipeline's the highest it's been in 15 months. And then also on the other side, the new partnership we talked about in the franchise space, we've got a pipeline building there that, again, over the next 12 months could provide up to $100 million of new loan volume. And even in public finance, we've seen some payoffs there, too, just scheduled maturities and some prepayments there. We continue to look at limited opportunities in that space, trying to keep the duration short. There is a ton of competition in that vertical. You do have large regionals who compete in public finance who've driven. You know, we see kind of what the final rates are on deals in the Our team goes in and tries to look at it at a reasonable rate, and we're getting outbid by sometimes hundreds of basis points there. So the competition is there, but I think the backup in rates and kind of the reopening of the economy, things have kind of moved a little bit towards where we feel comfortable doing deals from a pricing perspective."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "One big plus for us, Brad, on the single-tenant side of things, About 95% of those loans have some kind of 1031 exchange involved in it. And with what's going on in Congress and discussion about changing capital gains, maybe eliminating 1031, an awful lot of people are reevaluating their portfolios and selling and moving and doing a lot of transactions in anticipation of possibly a negative impact from Congress. So that's really driving pipelines. They're getting better on a day-in and day-out basis. It's an interesting time in the marketplace. We had the change in the Fannie Freddie penalties come out on the mortgage side, the extra 50 basis points, and locks have jumped up in the mortgage side, double, triple what they were two weeks ago. Even though the economy, I think, is very stable, very strong, it's also very chaotic in a whole lot of different places. One day something's hot, the next day it's something else, but Overall, as Ken has said, the second half of the year we think will be very strong in loan origination."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. One last quick one. Just the sale of the headquarters, I thought that was – I guess I wasn't expecting that. Can you maybe talk about that transaction?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah. We've been in a building here for about five years that we acquired – We're really in the middle of the crisis when the markets were going kind of nuts, and we are tapped out on space. We're kind of thankful in some respects that the pandemic came along because we got about 25 to 30% of our people working remotely because we don't have space here in the building. We are building a new facility in downtown Fishers. It should come online either at the very end of this year or early next year. We did a partnership with the city on some land cost abatements from the city as well as a parking garage attuned to it. So it should be online at the end of the year. We're a 23-, 22-, 23-year-old company. We've made six moves during that time, and the size that we're at today is A move estimated is going to cost us about a million bucks to do it. So we built a little more space than we need. We're going to sub-lace part of the building and should be a facility that will last us for 10 to 15 years into the future."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, great. Thanks for showing the color. Thank you. Thanks, Brett."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our next question comes from Nathan Race with Piper Sandler. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yep. Hi, guys. Afternoon. Not to beat a dead horse on the balance sheet and capital discussion, but it sounds like, you know, with the health care book likely running off, just given the sale of that platform recently, you know, that's going to be somewhat of a growth headwind going forward. But it also sounds like from a capital deployment perspective, there's the opportunity to maybe add another production platform to offset some of that runoff on top of the other growth. that you'll be seeing it across the other parts of the portfolio, and that's kind of the reason why a buyback is maybe less of a possibility in your term. Is that the right thinking, David? Correct. Yeah. Okay. Gotcha. Great. And then just maybe kind of changing gears a little bit and thinking about just where the reserve can project to over the next few quarters here. It sounds like the charge-offs here in the second quarter were somewhat of an anomaly. How are you guys thinking about providing for some expectations for net growth, just given where the reserve stands today?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I mean, obviously, from a dollar amount, the reason why the allowance came down was just the removal of the specific reserves. associated with the positive developments on the single-tenant lease financing relationship. And those were big dollars. Those were in excess of $2.5 million. So the dollar amount went down. The overall coverage ratio went down, but I think as we pointed out in the release and in the note, we continued to bump up the qualitative factors. I would say that if loan growth and loan opportunities come in, and the stuff that we've been talking about here on the call come in where we believe them to do, that coverage ratio is going to migrate upwards. Because what we're talking about are commercial-oriented businesses that have allowance coverage ratios in excess of 1% to begin with. So it's kind of like the rate-volume thing. If we have a higher rate on new volume, the overall allowance itself is just going to migrate upwards and back towards the 1% and in excess of 1% depending on how strong the growth is in those categories."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And Nate, again, just to reinforce as Ken talked in his comments and earlier, the loss that we had this quarter really goes back to a loan that went sideways back in 2019. The The principal we see of the buildings filed bankruptcy, closed down. I think we put them into non-accrual status in the middle of 19. So we've gone through foreclosure. One building is sold. We have two other proposals out there to buy the second building. It should hopefully clear up here into this quarter, very early fourth quarter. So that goes back from a long term. The portfolio as a whole is rock solid. We have absolutely no delinquency. and the portfolio as it exists out there today. So you hit the nail on the head. This is kind of an abnormal number for us, and we do have a potential to recover some dollars on that loss as well, but we're being kind of conservative, flushing it out, and then we're going to go after the sponsors. Got it."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "That's a great color. And maybe just the last one on the expense run rate from here. It's great to see it flat sequentially. How are you guys thinking about the run rate going forward? It sounds like maybe there's a little bit of pressure from the headquarter relocation and so forth as that's built out going forward. But just any kind of high-level thoughts on the run rate going forward and expectations for expense growth in 2022 as well would be helpful."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I think probably over the course of the remainder of this year, we'd expect to see expenses probably tick up a little bit from where they are right now. We have continued to add to our headcount in certain areas across the bank, continue to add folks in SBA as well as certain areas. So we probably should expect to see A bit of the headcount go up a bit, and as kind of mortgage comes back a little bit and SBA continues to ramp up, we'll probably see overall commissions continue to increase a little bit as well. You know, and certainly in the next year or two, we'll see a little bit of a pickup having to do with the new building coming online."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "We also have some activity going on on the software side of things and some of these new programs and pieces we're putting in. A lot of that is incremental. It's a SAS model, so we're paying for it as we use it. It won't have tremendous impact, but there will be a little stuff kind of latter part of fourth quarter. We think, as Ken said, that the cost should stay very stable through the course, and then actually once it all gets installed and up and running, we'll actually see a savings over some of the expenses we have out there today. So I think the net play with a lot of the kind of FinTech tools we're looking at are actually going to help the bottom line on the ongoing expense. And we're getting fairly stable. We're still adding to the BDO component on the SBA side and the support staff for them, but that's stabilizing. As Ken said, we're adding a few bodies in other areas that commercial real estate is picking up, etc. We don't want to have a service fault here as things start to kick back into gear, but it should be very stable for this year. Once we get our arms around the building and final numbers, we'll give you indications next quarter as to what impact that will have for 2022."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, perfect. I appreciate all the callers. Thank you, guys."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our next question comes from George Sutton with Craig Howland. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. David, you referred to two to three opportunities by year end that could be areas of capital use. And I just wanted to confirm, these are the same two to three opportunities that you had discussed last quarter. And my sense at that time was these could be new verticals or expanded vertical opportunities for you. Is that correct?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "That's correct. One is one we talked about last quarter that's moving along, and the other is a new one that's presented. I guess the second one, if you want to refer to that, that we talked about last quarter, we couldn't come to terms on the price. One is a continuation that we've been talking to for a while, and one is relatively new."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, and just to make sure I'm not conflating other things, you last quarter mentioned 40 CTO projects already. that were occurring, and now you're talking about collaborative partnerships. Are those related? Those would be the – that's why that's more of an internal improvement focus?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah. Yeah, we have two external actual acquisition opportunities, and then we have just a whole lot of activity, and we'll have a sheet we'll try and release probably during the fourth quarter – showing all the different components of the internal pieces of software and things we've been working on through the pandemic and pulling the stuff together that will come into play probably early on in 2022. So it's both channels, external acquisitions and new verticals, as well as internal and software to run those businesses, as well as internal improvements and back office operation feature functionality due to some of the fintech partners that we're working with."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Finally, I want to make sure I understood the change with Provide. I understand what happened there, and you are now backfilling with a new partnership that you've made some commitments to. Can you just give us a sense of the strength of that partner relative to the Provide relationship?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, we're pretty excited about it. It's a specialty lender focused in the franchise finance space who's got a really good track record. They're helping franchisees finance both new locations and existing locations in retail franchise space. Think quick service restaurants, things like gyms, salons, things of that nature. The volume... You know, we've committed to funding up to $100 million over the next 12 months. What we like about this space, too, is in the franchise space, pricing is a little bit more attractive. So relative to health care finance, you know, we might not see the volume, you know, because health care finance was such a strong growth engine last year. We won't match that volume exactly, but what we will see are much higher yields. So I think it's a pretty good tradeoff, a pretty good opportunity to backfill some of that growth we've had in the past and feel pretty optimistic about the partnership we've entered into with them."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Gotcha. Helpful color. All right. Thanks, guys. Thanks, George."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our next question comes from John Rodas with Danny. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good afternoon, guys. Hey, John, how are you? I'm good. How are you doing, David? Doing good. Most of my questions have been asked and answered, but, Ken, I just wanted to make sure I heard you say, did you say that mortgage, I guess mortgage revenues you expected to sort of stabilize in the second half of the year, so I guess stabilize with the second quarter?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I think, you know, second quarter, obviously it was down quite a bit. I mean, I think in the, you know, in the second and third quarters, Excuse me, in the third and fourth quarters, I mean, I think we probably feel comfortable with, you know, probably somewhere in the three to three and a half million range of revenue. So up, you know, up from where we were and up a little bit from the second quarter, it's kind of the market has stabilized a bit."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. So it sounds like, I think in your press release, you said, it sounded like, I guess, towards the back half of the quarter or back end of the quarter, the trends were better in mortgage, I guess."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "It jumped all over, John, during the course of the quarter. Probably our weakest month was actually May in activity. We're Overall volume is pretty solid on a year-over-year basis, but our margins, if we go back to second quarter of last year, and I know everybody calculates margins on a different level, and Ken tells me not to talk about this because I'll confuse everybody, but we kind of look at a net gain on the mortgages, and we were somewhere around 3.4% to 3.5% per loan. And during the second quarter, we were at a 1.48%. So the margins were cut by over half. Volume is still fairly strong, but it's kind of the same game that happened back in 2013, a little bit in 2016, as the refi game slows down. The independent brokers, they just give the shop away to try and maintain their staff and keep their volume up and keep their mortgage folks happy. So that is what we're starting to see stabilize. Pricing is getting a little more consistent. I mean, we could see swings in the market of 25, 30 basis points a day, up or down. And it's starting to stabilize a little bit. I think some of the folks are realizing that the new normal is going to be probably 50% to 60% new construction and 40% on the refi gains. So a change, obviously, from what it was last year."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yep. Ken, just on the provision, you know, I think you said it could have been negative this quarter. Do you think going forward it's more close, similar to, I guess, the first quarter, or could we still see some reserve release?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, yeah, I don't know if I'd classify what we did this quarter as reserve release because we had resolution on specific reserves. And we offset that with continued increases to qualitative factors. And the general kind of the reserve, the allowance coverage ratio related to the unallocated part of the portfolio continued to go up. I mean, I think, I don't think, I really don't expect us to have a negative provision. I think we'll continue to adjust qualitative factors. And again, if we hit the growth, in these loan portfolios. I mean, if you think single-tenant, you have growth there, we're reserving in excess of 100 basis points there. This franchise finance opportunity is going to be in excess of 100 basis points. Any growth in any commercial line of business outside of public finance is going to have a coverage ratio in excess of 1%. So the provision... as an expense piece, will really be dictated by loan growth and then secondarily by additional adjustments to qualitative factors going forward. Okay."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Makes sense. And then just, Ken, one other question. The securities portfolio, you talked about the growth in the quarter. Do you sort of expect it to, I guess, level out here if you do see the loan growth play out?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, the growth in the securities portfolio was really just kind of, I don't want to say a one-time thing, but we were sitting on a lot of cash, and that cash balance was continuing to build throughout the quarter. I mean, we were in excess of $500 million, $550 million, and put the cash to work in basically plain vanilla mortgage-backed securities that have strong cash flow characteristics. relatively short duration. And the portfolio as a whole is going to spit out over $100 million of cash over the next 12 months anyway. So really, we don't expect the portfolio to grow from this perspective, that securities level to grow. It was really just putting cash to work here in the near term to help give earning asset yields a boost while not really tying up cash over the long term. We continue to buy securities here and there for things like CRA purposes, etc., but I wouldn't expect the securities balance to grow from here or be flat. It's going to decline more than anything else."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. Makes sense. Thank you, guys. Thanks, sir."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our next question is a follow-up from Michael Perito with KBW. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, guys. Sorry to probably make you repeat yourselves here, but I was just scanning my notes, and I apologize that I missed it. But, Ken, do you mind just offering some consolidated thoughts on where the NIM, I think you provided some high-level commentary, but where the NIM might move near-term here, and do you still think there's some legs for some multi-quarter expansion as long as rates remain where they are?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, most definitely. I think our outlook on net interest margin is very similar to what it was last quarter. I think, you know, probably in a quarter-over-quarter basis between now and the end of the year, we're probably still looking at, you know, anywhere from maybe a 5 to 10 basis point increase. Going to be impacted by things such as prepayment levels and or loan growth opportunities. But I think we still feel good in targeting that kind of somewhere in the range of 2.4% on a fully taxable equivalent basis in the fourth quarter. So we still feel good about those numbers. And I think next year as well, there's still going to be some ability to to generate NIM growth next year as well. And again, some of that is going to be dictated by, you know, how well some of these loan opportunities continue to develop over the course of 2022. But I think there's still an opportunity to expand NIM next year."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Michael, to carry that one at just a little different angle, we have over the next 12 months, we don't run past 12 months in our internal projections, but we have over $750 million in CDs that will either runoff or reprice. Now, the rate has dropped geometrically from what it was, you know, 18 months ago, but there's still average cost of about a 145, and the new stuff coming on the books today ranges from 39 to 41 basis points. So, there's still a big pickup on the CDs on rollover and pricing, as well as bringing in the checking account balances and the small business accounts that are much lower cost to us than our traditional costs. So, savings on the interest side and as well as Ken pointed out, hopefully some pickup on the loan side too."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Helpful, guys. Thank you for taking the call. Appreciate it."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "This concludes our question and answer session. I would like to turn the conference back over to David Becker for any closing remarks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Sarah, and I'd like to thank all of you for joining us today. This was a great Q&A session. We hope you have a A great balance of the day and continued success. Thank you very much."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "The conference is now concluded. Thank you for attending today's presentation. You may now disconnect."
    }
]