[
    {
        "date": "2021-04-22T12:00:00-04:00"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good day, everyone, and welcome to the first Internet Bancorp earnings conference call for the first quarter of 2021. All participants will be in listen-only mode. Should you need assistance, please signal a conference specialist by pressing the star key followed by zero. After today's presentation, there will be an opportunity to ask questions. To ask a question, you may press star, then one on your touchtone phone. To withdraw your question, please press star, then two. And please note that today's event is being recorded. I would now like to turn the conference over to Larry Clark from Financial Profiles, Inc. Please go ahead, Mr. Clark."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Carrie. Good day, everyone, and thank you for joining us to discuss First Internet Bancorp's financial results for the first quarter of 2021. The company issued its earnings press release yesterday afternoon, and it's available on the company's website at www.firstinternetbancorp.com. In addition, the company has included a slide presentation that you can refer to during the call. You can also access these slides on the website. Joining us today from the management team are Chairman, President, and CEO David Becker, and Executive Vice President and CFO Ken Levick. David will provide a company update, and Ken will discuss the financial results. Then we'll open the call up to your questions. Before we begin, I'd like to remind you that this conference call contains forward-looking statements with respect to the future performance and financial condition of First Internet Bank Corp. that involve risks and uncertainties. Various factors could cause actual results to be materially different from any future results expressed or implied by such forward-looking statements. These factors are discussed in the company's SEC filings, which are available on the company's website. The company disclaims any obligation to update any forward-looking statements made during the call. Additionally, management may refer to non-GAAP measures, which are intended to supplement but not substitute the most directly comparable GAAP measures. The press release, available on the website, contains the financial and other quantitative information to be discussed today, as well as the reconciliation of the GAAP to non-GAAP measures. At this time, I'd like to turn the call over to David."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Larry, and good afternoon, everyone. Thanks for joining us today. We are very pleased with the first quarter financial performance. We produced strong earnings, solid momentum to start 2021. driven by net interest margin expansion, continued healthy production in our direct-to-consumer mortgage business, and strong credit performance. Growth in net interest income combined with our strategies to build sustainable fee revenue paid off as we generated an average return on assets of 1.02% for the second straight quarter and strengthened our capital base, increasing our tangible common equity to tangible assets ratio by 43 basis points to just over 8%. We deliver these solid results while the pandemic continues to impact certain sectors of the economy. Families and businesses are gradually returning to the routine, and in many cases, to a new normal way of life. Our unique workplace culture promotes innovation, collaboration, and customer focus, collectively guiding us forward. Our technology-enabled workforce was uniquely positioned to adapt to the changes of the past year while maintaining operations at the highest level, serving our customers and supporting one another. Despite the historically low interest rate environment, we generated a significantly improved net interest margin. This was the key highlight of the quarter. We did this through a combination of higher-than-average loan yields and low average deposit costs. The higher yields would do in part to our ongoing pricing discipline. The benefits of having diversified loan origination channels is that we do not have to chase rates down while we are at the bottom of the interest rate cycle. We do continue to look for growth opportunities to capitalize on. However, any new opportunities we explore must provide a strong risk-adjusted return that enhances profitability and earnings. As you know, we have been proactively managing our deposit costs lower as we allow higher cost CDs and broker deposit balances to decline. We're placing them with much more attractively priced money market accounts and lower rate CDs. Revenue for the first quarter totaled $28.9 million, up 36% from the first quarter of 2020, as we continue to benefit from a more diversified revenue stream, an important strategic goal for us. Our SBA team is a big part of this. The team is fully engaged, and we are well on our way to building a leading national platform. Not only are we assisting clients with the new PPP loans as part of the most recent phase of that program, but we also continue to meet the demand for traditional SBA 7A loans. These loans are the bread and butter of our SBA program. While 7A volumes were lighter in January and February, we maintained our competitive position as the overall SBA market was slower to start the year. However, SBA 7A activity began to pick up in March, and the pipeline is building daily. Despite the lighter volume in the quarter, we are still targeting SBA originations in the range of $200 million plus for 2021, and they are expected to produce a gain on sale revenue between $14 to $15 million for the full year. We have the infrastructure in place to continue to ramp up this important part of our business and look forward to a strong year providing financing for the entrepreneurs and small businesses that drive job creation across the country. Our direct-to-consumer mortgage business continues to produce solid results as well. We are capitalizing on the ongoing demand fueled by low interest rates and a strong nationwide housing market. We are winning new business with our unwavering commitment to exceptional service and the enhanced customer experience that our technology-driven online mortgage application process provides. Our credit quality remains among the best in the industry. We have a strong credit culture, disciplined approach to underwriting, and a focus on specialty lending lines that target lower risk asset classes. Unlike many banks that have reported so far, we continue to build the allowance for loan losses during the quarter, even as net charge-offs remain low. We expect to maintain and perhaps even continue to build our allowance coverage ratio and do not foresee releasing any reserves in the near term. We did experience an uptick in non-performing loans during the quarter due primarily to one C&I relationship. We recorded a specific reserve of $600,000 against this relationship and believe we are well collateralized on the remaining exposure. Even with the increase in non-performing loan levels to total loans and non-performing assets to total assets remain relatively low, at a 0.46 and a 0.34 respectively. Additionally, remaining loans on deferral programs are relatively low at this point, representing just 20 basis points of total loans at the end of the quarter. As we look forward to the remainder of 2021 and beyond, we will continue to focus on some key areas of value creation. One, continue to scale our SBA business to take advantage of the operational infrastructure we put in place. Two, look for new, innovative, technology-driven partners to enhance our existing lines of business or to capitalize on opportunities to further diversify revenue in a capital-efficient manner. Three, continue to improve the efficiency of our business while enhancing the customer experience for both existing and prospective clients. We have been successful at doing this in the past via collaborative partnerships with FinTech companies that have helped us in our direct-to-consumer mortgage business, as well as in our consumer and small business deposit gathering and account opening efforts. Four, I would like to take a moment to recognize that today, April 22nd, is the 51st anniversary of Earth Day. At First Internet Bank, we are working to develop an ESG strategy that incorporates our existing commitment to the environment and the communities and stakeholders we serve, as well as advances the diversity, equity, and inclusion initiatives within the organization. Supporting our community is a high priority at First Internet, and during the first quarter, we made a $250,000 contribution to a local foundation that supports not-for-profits and community-based initiatives in the marketplace. In summary, we are pleased with the first quarter performance, which was driven by the consistently excellent work of the entire First Internet team. and we're excited about the year ahead of us. We are in great financial shape and well positioned to serve our customers as the country emerges from the pandemic and businesses work to fully reopen. As always, I want to thank all of our employees for their efforts in once again delivering on our goals. A high level of commitment throughout the organization remains the key to our ongoing success. We are confident in the strength of our franchise and the potential for ongoing growth in the year ahead. With that, I'd like to turn the call over to Ken to discuss our financial results for the quarter."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, David. As David mentioned, we were very happy with our performance for the first quarter, delivering near record revenue, net income, and earnings per share. We generated these strong results with a relatively stable balance sheet during the quarter, which is consistent with our focus on improving profitability through net interest margin expansion, diversified fee income, and deploying capital in an efficient manner. Our financial results for the quarter continue to reflect solid execution of this plan. Now let's turn to the details of our results for the first quarter. We reported diluted earnings per share of $1.05, down 6% from our record fourth quarter results, but up 69% from the first quarter of 2020. Profitability was strong with fully tax-equivalent net interest margin increasing 27 basis points sequentially to 2.18%, a return on average assets of 1.02% for the second quarter in a row, and a return on average tangible common equity of 12.61%. We have been able to successfully navigate the low-rate environment and challenges created by the pandemic to deliver outstanding results, including a significantly improved net interest margin through lower deposit pricing and stabilized asset yields, strong revenue growth, and excellent credit quality. Looking at slide four, we saw these trends continue in the first quarter, and when all results are reported, we believe our performance relative to similarly sized institutions will once again compare favorably. Looking at slide six, Total portfolio loans at the end of the first quarter were $3.1 billion, relatively consistent with December 31 of 2020, and an increase of $167 million, or 5.8%, compared to March 31, 2020. During the quarter, commercial loans increased slightly due primarily to production in public finance, construction, and small business lending. This growth was partially offset by lower single-tenant lease financing and healthcare finance balances due mostly to elevated prepayment activity. Consumer loans decreased slightly compared to the fourth quarter due primarily to increased prepayment activity across the RV and trailer portfolios. Moving on to deposits on slide seven, while overall deposit balances were down 2% from the end of the fourth quarter, we again saw improvement in the composition of the deposit base. During the quarter, CDs and broker deposits decreased $110 million, or 6.9%, on a combined basis, while total non-time deposits increased $56 million, or 3.4%, on a combined basis. CDs and broker deposit balances declined as higher-cost CD maturities were either funded with on-balance sheet liquidity or replaced with much more attractively priced money market accounts and lower rate CDs. This lowered our cost of interest-bearing deposits at 17 basis points in the quarter, and we see further opportunity to reduce deposit costs over the remainder of 2021. Compared to the first quarter of 2020, deposit costs were down $8.6 million, essentially cut in half, And we continue to expect interest expense savings of approximately $25 million for 2021 based on the current deposit pricing environment. Turning to net interest income and net interest margin on slides eight and nine, net interest income and net interest margin on both a GAAP and a fully taxable equivalent basis once again showed strong improvement compared to last quarter. And net interest income was up in excess of 30% compared to the first quarter of 2020. As you can see from the net interest margin bridge on slide nine, deposits and loans continued to have a positive impact on margin during the quarter. While the average balance of interest earning assets was down 3.4% from the fourth quarter, interest income from earning assets was down only 1.1% due mostly to a 14 basis point increase in the yield on those assets. The yield on interest earning assets for the first quarter of 2021 increased to 3.31% from 3.17% in the prior quarter due primarily to changes in the composition of interest-earning assets, supplemented by prepayment fees. Average loan balances were down $25 million, or just under 1%, from the fourth quarter due mainly to lower average balances in single-tenant lease financing, public finance, and small business lending, but partially offset by an increase in the average balances of construction lending and healthcare finance. As we've mentioned before, we continue to expect our yield on interest earning assets to remain relatively stable during 2021 as we deploy liquidity to fund new loan originations. Overall, we are very pleased to have delivered a 27 basis point improvement in our full tax equivalent net interest margin during the quarter and expect the upward trend to continue throughout 2021 though likely at a slower pace. Turning to non-interest income on slide 10, non-interest income for the quarter was $8.4 million, down from the record $12.7 million in the fourth quarter. The decrease was primarily driven by lower revenues from mortgage banking activities and a decrease in gain on sale of loans. Mortgage banking revenue totaled $5.8 million for the first quarter, down $2.2 million from the prior quarter due primarily to a decrease in interest rate lock volume and a decrease in margins as competition in the market increased. Gain on sale of loans totaled $1.7 million for the quarter, decreasing $2 million compared to the prior quarter due to a lower amount of U.S. Small Business Administration 7 guaranteed loan sales in the quarter. David covered the market factors impacting SBA revenue for the quarter, but reaffirmed that our outlook remains optimistic in this important and growing line of business. With respect to non-interest expenses shown on slide 11, the increase on a linked quarter basis was driven primarily by an increase in salaries and employee benefits, marketing, advertising, and promotion expense, and consulting and professional fees. The increase in salaries and employee benefits was due mainly to higher medical claims experience, share-based compensation, and seasonal resets of employee benefits and payroll taxes. The increase in marketing expenses was due to higher mortgage lead generation costs and increased digital marketing initiatives. The increase in consulting and professional fees included seasonally higher legal expenses related to year-end reporting and the preparation of materials for our annual meeting of shareholders. Additionally, David also mentioned the $250,000 contribution we made to a local community-based foundation that was recognized in the first quarter's expenses. Now let's turn to asset quality on slide 12. The allowance for loan losses increased $1.2 million from the fourth quarter to $30.6 million, resulting in the allowance to total loans increasing to 1% or 1.02% excluding PPP loans. up four basis points from the linked quarter. While the balance of total loans was relatively flat compared to the prior quarter, we continued to make additional adjustments to qualitative factors in our allowance model and recorded specific reserves on two commercial relationships totaling $1.1 million in the aggregate. These increases to the allowance were partially offset by loan portfolio composition changes that included declines in certain portfolios with higher coverage ratios, and growth in portfolios with lower coverage ratios. As a result of the continued reserve build, we recognized a loan loss provision of $1.3 million for the first quarter. As David mentioned earlier, overall credit quality remained strong during the quarter as non-performing loans to total loans 0.46% at quarter end, and net charge-offs remain low at $100,000, resulting in net charge-offs to average loans of two basis points. As shown on slide 13, our overall capital levels improved and remain healthy at both the company and bank levels. With the solid earnings performance for the quarter, our tangible common equity to tangible assets ratio increased 43 basis points to 8.12%, from 7.69% in the fourth quarter and is well on track to exceed our forecast from earlier in the year. Additionally, we continued our trend of consistently growing tangible book value per share, which increased to $34.60, up from $33.29 in the fourth quarter, and up nearly 13% from one year ago. To summarize some of the key points mentioned on this call, We remain confident that we're well positioned for the current low interest rate environment and continue to expect approximately $25 million of annual deposit interest expense savings compared to 2020. When combining this interest expense savings and our expectation that earning asset yield should remain relatively stable, this should drive consistent growth in net interest income and further expansion in net interest margin. In terms of non-interest income, Although SBA 7A originations and sales came in lighter than expected for the first quarter, we remain confident in our previous guidance of $14 million to $15 million of SBA gain on sale revenue for 2021. Additionally, we're optimistic that mortgage banking revenue will remain solid and above historical levels, but likely down from the record revenue recognized during 2020 as refinance activity is beginning to slow and housing inventory remains tight. Consistent with our view about credit last quarter, we continue to be vigilant in our monitoring and underwriting procedures and do not see elevated credit losses on the horizon at this time. As a result, we remain confident in our ability to generate a quarterly return on average in the range of 1% throughout 2021. And finally, we are forecasting increased capital levels with tangible common equity to tangible assets in the range of 8.6% to 8.9% by the end of 2021. With that, I will turn it back to the operator so we can take your questions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "We will now begin the question and answer session. To ask a question, you may press star, then 1 on your touchtone phone. If you are using a speakerphone, please pick up your handset before pressing the keys. To withdraw your question, please press star, then two. At this time, we will pause momentarily to assemble our roster. The first question will be from John Rodas with Jannie. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, guys. Good morning. Hi, John. How are you? Good morning, John. Not too bad. I'm not used to being first on the call usually. The comments on the mortgage business, obviously, you know, you sort of changed the language from strong in the near term to solid. And I guess my question is, either David or Ken, do you think, I get mortgage being down year over year, but do you think the first quarter is going to be the highest quarter for the year? Or do you think you might see some, you know, seasonally a little bit stronger in the second quarter?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I think it'll run its normal seasonal patterns done. I think second quarter and third quarter should be high. Fourth quarter, we could go back to the real seasonal pattern of kind of falling off between Thanksgiving and Christmas. The real issue out here right now is just availability of housing. A couple weeks ago, there was an article put out that there are more real estate agents in the United States than there are houses for sale. I mean, it's just unbelievable. And one of our finance guys here that's backing us up for the call, he scrambled for three months to try and find a house and had to actually find a house that was not on the market yet from a realtor to be able to buy it. So it's really a focus of the market. As Ken and I both stated, I think the refi game is down, new homes, activity is up and actually permits. We track it kind of here in our local community, not on a national basis, but I think permits here in central Indiana, new housing permits were up 33% over what they were at this time last year. So it really is a supply-demand issue right now that's impacting the market."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. Makes sense. Thanks, David. And then, Ken, one other question on the tax rate. It dipped back down to about 15% this quarter. How should we think about that going forward?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, there were a couple of factors there. First of all, it was just, you know, pre-tax income was down quarter over quarter. And, you know, probably one of the factors that drove it up at the end of last year was obviously the strong mortgage revenue and the strong SBA revenue, you know, which carry a fully baked tax rate on that. Those numbers were down a bit. And we've made some adjustments to our state tax accrual as well. the rate for state taxes. So I think probably a good number with SBA coming back in mortgage remaining solid is probably somewhere in that 15 to 17% range. 15 to 17. Okay. Yeah. Okay."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, guys. Nice quarter. Appreciate it. Thanks, Sam."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "The next question is from Michael Perito of KBW."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, guys. How are you? Mike, how are you? Doing well. Thank you. Thanks for taking my questions. I wanted to just start. I was wondering, Ken, if maybe I appreciate the kind of the broader guidance comments on margin and the ROA. And obviously, we can figure some of the numbers out ourselves. But I was just wondering if you had a better sense of where kind of the exit NIM was at the end of the first quarter in March, maybe just to kind of give us a sense of the direction that we could possibly be seeing near term here."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I'll tell you, in March it was really strong, but I will say we did have a fairly high amount of prepayment fees in there as well. So it was probably a little bit higher than kind of what a run rate would look like. But I think by fourth quarter, I think we feel pretty good that we'll probably be in the range of, say, $240 on net interest margin. And I think you're probably looking at a 5 to 10 basis point increase on a quarterly basis throughout the end of the year."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. So certainly that makes the target of staying above 100 on the RLA a lot easier to achieve. Yeah, absolutely."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Obviously improving NIM combined again with just the enhanced fee revenue you know, creates a very easy pathway for us to maintain that one ROA. Got it."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And then a couple bigger picture questions. You know, I think, you know, we've always been asking you guys about the plan to build capital for the last two, three years now. And, you know, I'm glad to ask this question differently now. I mean, you know, as you get towards 9% on the TCE, I guess where is kind of the dam or the break point where maybe the capital is posture changes a little bit whether that's you know maybe being open to a little balance sheet growth or maybe looking at other items like for purchases or what have you i mean how do you guys think about this evolving capital store and clearly you guys are are really making a nice movement here to build and i'm just curious how you think about that and and at what point do we think should we maybe be thinking about you guys doing things a little bit differently versus kind of the capital preservation mode you've been in for the last couple years here"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Everybody's looking at me here, Michael. I would tell you we're looking at stuff on a daily basis. And right opportunities come along, we definitely take advantage of them. In the last couple of calls, there's been some question about repurchasing shares. That's not on the horizon. The game plan would be to put the excess capital to work. And we've got a couple, two or three opportunities. We're working on that. We can do that seriously between here and year end. So we want to stay, and we've always tried to stay above that 7% range. I think we're getting a little more comfortable trying to hold it in to 8 or thereabouts. But, yeah, definitely we get up to 9 to 10, so we're going to put it to work."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And when you say opportunities, is that hiring people that would drive more balance sheet growth?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Balance sheet growth. We're pretty well set internally. We still have some things to do with the SBA team, but the rest of the organization, we, we staffed up in the latter half of 2020. So we're pretty solid across the line with a couple more additions in the SBA team."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. And then, you know, obviously the, you know, the first quarter I think was, was, you know, from a valuation perspective, one of the better quarters you guys have seen in some time now and, As we think about trying to keep this momentum going here, I feel like the digital disruption in the banking sector continues to be elevated. I imagine you guys are spending time thinking about how to keep your customers engaged, especially your consumer deposit customers engaged in your mobile app and what have you. Is there any thought or resources being spent to expand the product roadmap on the mobile banking side? I mean, when you see some of these other kind of digital disruption business models, you know, adding things like robo-advisors or nest egg or stuff like that. I mean, is there any kind of thoughts you're willing to share about how you're thinking about the product roadmap on the consumer deposit banking side at this point?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, we're quite honestly looking at all of that stuff. We have some internal things that we're working on, some external partners that we have conversations with on a daily basis. Our roadmap, if you could get a hold of our CTO, he would tell you he's got 40 more projects than he can handle in the next 12 months, but it keeps him busy and keeps him out of trouble. So we're looking at both the consumer side of things as well as small business. There's a lot of things we still think we can do to make our small business product even more attractive than it is today. So we're spending a lot of time and money looking at both sides of that equation."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Really helpful, guys. Thank you for taking my questions, as always. I appreciate it."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Appreciate it. Thanks, Mike. Thanks, Mike."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Next question is from Nathan Race with Piper Sandler."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, guys. Good afternoon."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good afternoon, Nate."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Going back to the kind of outlook for the balance sheet growth over the near term, I understand that's kind of the main avenue you guys are looking to deploy excess capital to some extent. over the next few quarters. So just kind of thinking about the margin outlook expanding further from here, how should we kind of think about just the overall earning asset base size? And should we just expect, you know, the average balances of excess equity to continue to come down over the next few quarters and just see that mixed improvement to also support the margin? Or how should we kind of just be thinking about loan growth and the size of the securities portfolio going forward?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, I think probably from an overall perspective, you probably see mid-single-digit type balance sheet growth. But again, if you look at the balance sheet, you'll see that we have quite a bit of cash on hand. I know a lot of other banks are experiencing the same issue as us. But really, I think we can grow the loan portfolio without necessarily growing the balance sheet at a higher-than-average rate. It's just putting... putting cash to work, whether it's cash on hand or the securities portfolio continues to spit off a fair amount of cash. So I think we'll continue to see earning asset growth. I would say the one wild card on that is just the level of prepayment activity. Sometimes that's a little bit hard to project. But as longer rates start to go up a bit, we may see that kind of pull back a little bit. But I think it's a matter of You know, the loan portfolio continuing to increase and maybe the composition in there changing a little bit. Maybe you'll see more, a little bit higher rate of growth in the construction portfolio, which has been an area of emphasis for us. We have quite a bit of unfunded commitments in there. And obviously, we expect small business to start picking back up here over the remainder of the year. But really, it's going to be putting liquidity to use and kind of, you know, a little bit of a shift in the mix and the composition of the loan book."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "One of the things out here, Nate, as we talked and just mentioned, a lot of liquidity in the marketplace. A lot of banks are getting squeezed. A lot of banks are doing some pretty silly things. For example, in the health care finance area, two big competitors out there are financing 10-year deals on five-year pricings. And we're just not going to chase it down to keep a volume and a stat up. So there's opportunities for us in different markets. And we've stayed true to the pricing, which has enabled us to, as Ken stated earlier, to keep expanding them on both sides to lower cost of funds and solid interest on the loan side. We're going to continue to stick with that. I think as the year wears on and COVID goes away and there's more activity in the marketplace, everybody will go back to a little more of a reasonable approach. basis and how they're pricing and the covenant structure, et cetera, on loans and get back to what banks should be doing. So probably, as Ken said, for a lot of reasons, and particularly cash on balance sheet, not a lot of growth in the first half of the year, but we could have some pretty solid growth in the second half."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, and on the other side of the balance sheet, too, I know you were talking about earning asset growth and loans, but always keep in mind as well that You know, excess liquidity can also be put to use just by funding, you know, CDs that don't mature. And by not renewing some of those CDs and having some of the, you know, historical kind of seasoned higher rate institutional and public fund CDs roll off and not renewed, that's a lift to margin as well through continued lower deposit costs."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yep, absolutely. Makes sense. I appreciate all that color, guys. Maybe changing gears and just thinking about the expense growth for this year. I think in the past we've kind of talked about mid to high signal digits. I guess just as we kind of think about and extrapolate the 1Q run rate, is that still kind of a good target to think about with some of the work that's left on the SBA front that you guys want to accomplish over the next quarter or two?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, it's probably a good run rate. It might pick up a little bit. Obviously, in the first quarter, we have some costs that are seasonal. Those will probably be replaced by continuing to add to some headcount in SBA. And we continue to grow in other areas of the bank as well. So there may be a little bit of offset there. But I think, yeah, that first quarter would probably maybe a little bit of growth here and there between, you know, depending on what quarter it is, but that's probably a good run rate to look at with maybe, again, a little bit of growth off of that for the full year."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, great. That's all I have. I'll step back for now. Thank you. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Once again, if you have a question, please press star, then 1. The next question is from George Sutton of Craig Howam."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey guys, I wanted to focus a little more on the SBA side. You defined your goal here to become a leading national platform. That's not something I've heard you specifically say in the past, so I wondered if you could give a little bit more of a vision there. And then you also mentioned on the demand side, you know, things started slow in the quarter. I believe they picked up a bit by the end of the quarter, and you're still very encouraged by what you're seeing. I wondered if you could just give us a little bit better sense of what you're seeing to give you that confidence."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure, George. The SBA runs the physical year closed out on 9-30 last year. We were number 40 in the country in originations in the 7A category. We're still in that space. I think as of today or yesterday, we're like number 41. So we're We've kind of kept our position. We're not growing as fast as the SBA game because of the advent of PPP3 and all the stuff that came out at the beginning of the year, the chaos and confusion there about forms and process, et cetera, just kind of brought SBA and somewhat the marketplace a little bit of a grinding halt, what they're going to be. We had a lot of folks hold up deals because they thought they were going to get another six months of free payments, so they didn't. move them into closing until March when the payment amounts got cut back. So there's a lot of confusion in the program. Solid pop in March. Strong pipelines out here today and new activity coming on. Also, fourth quarter kind of blooms up because of physical year-end at 930. That pushed the numbers up as anybody does when they're kind of year-end closing. So all of that was sold into secondary market in the fourth quarter. We hope to get to a point where we're in the top 10 producers of 7A loans in the country, which would be pretty much a double down on the volume that we did last year. We still think we can hit the $200 million mark. We'd like to see that over time go to the $350 million, $400 million range. We want to be a big player in both SBA, but just the small business industry as a whole. It's been a tremendous opportunity for us over the past year in growth of savings and checking accounts at very low-cost funds for us. We've got some new things we're going to be adding to that platform to make it a more comprehensive product. We've got the Newsweek pitch towards the end of the year at the best small business checking account in America. We're working on some credit card pieces for them. I've read a half a dozen places in the last couple weeks that the last six months of 2020 and the first three months of this year There are more new companies formed than there's been in almost the last two decades. Small business is really springing to life. A lot of folks are probably not going to show up when they get the call to come back to the office because they started something else. We think with our platform, we learned an awful lot in the second half of the year how to better service that small business marketplace. Again, I think we made the comments on the last call that we're one of the banks that really benefited from the pandemic. Millions of small businesses and consumers that would have never gone to online banking in their lifetime had to because they had no choice. Branches were closed and they were shut down. And they realized that, one, they could do without the branch, and two, that there are better products and better opportunities out there. So we think there's just a tremendous opportunity for us to really make this a keystone part of our organization."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "One other thing for me, you mentioned putting the excess capital to work, two or three opportunities to do that by year end. I know you don't want to go into any specific details, but I'm just curious, are we talking about vertical additions or are we talking about these would be within your current specific areas of focus? Just curious from that perspective."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "A little bit of both. Some new channels in areas that we're already in and a couple verticals that we're not in."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Gotcha. Great. Thanks, guys."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Appreciate it. Thanks, George. Thanks, George."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "The next question is from Brett Rabaton of Hovde Group."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, guys. Good afternoon."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, Brett. Hi, Brett."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I wanted just to follow up on the SBA. You know, we had talked about the SBA rule changes that are temporary, and, you know, I've been hearing that some players were indicating that the rule change was really driving increased demand. You know, I'm curious if that's changed at all for you guys and if you anticipate that being a part of the opportunity here in the next few months in particular."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Oh, it's definitely a part of the opportunity, the – I think within the SBA organization, and getting us back to all the chaos last summer, they did more PPP loans in a matter of 45, 60 days, and they've done total loans in the last 15 years. So I think SBA itself has a little different mindset. They've plugged in some new technologies that make things a little easier to play in their field, and I think some of the technologies that we've plugged into place One of the biggest issues in a small business person working with the SBA is the timing from the request so the loan can actually close. And we're doing a lot of things with automation and tools to make the underwriting, the processing through the SBA system much faster, more efficient. And I think, yeah, I think there's going to be really, really strong demand for the SBA products out here, particularly as businesses change. start to come out of the pandemic and reopen, you know, the restaurant industry. There's a lot of grants and gifts coming from a federal and a state level to help them get back on their feet. So as things reopen in the second half of the year, I think we're going to see a pretty good size."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, that's helpful. And then the other thing I'm just curious about was, you know, we look at the FinTech space in particular and the valuations are a lot different than where you guys are, and I'm sure that puts somewhat of a chip on your shoulder. I'm curious, as your capital builds, is there any conceptual thought to maybe pairing up with a FinTech partner, adding one on to the platform, any kind of partnerships that you might do that would be FinTech-oriented that would maybe improve the valuation?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, and with the comment we made earlier, we're continually looking at opportunities out here. A lot of the FinTech play, obviously the organizations that are out there with the huge multiples, you're right. The only time I'm happy about our stock price is the last day of the month when our employee purchase plan buys shares. It's tough to think about what we've done and kind of the position we're in is really probably the first true FinTech in financial space to not get the valuations they are. We look at them consistently. We've looked at several opportunities to be a service provider to them, kind of banking as a service. When it gets down to the bottom line, the return on it, in that space there's a lot of volume and there's a lot of activity. When you have 35,000 accounts with a balance of $300, that doesn't really gain you a lot. A lot of overhead, a lot of expense, a lot of headaches. and it's real hard to justify on the bottom line. So we're judiciously looking at opportunities. You know, every week something crosses the path with us, and we'll find one or two or more, no question asked. And we're also looking, as Ken pointed out, we're working with a lot of fintechs to improve our services and programs internally. We just made an investment in kind of a bank-backed VC fund that is going to work with fintech startups and kind of early stage seed capital all across the country. So we'll get first crack at not only being an investment, but a first crack at looking at their software or their products and services and see how they might apply to our banks. So, yeah, we're focused on it continually."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. And then I'm curious, just lastly for me, you can add the 1% ROA target and just given the path that you're on, I'm just curious if there's any reason you didn't want to update that or give maybe a longer term goal. It seems like you're going to be able to easily be above that level for the foreseeable future."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, you know, longer term, our goal is to be well above 1 and be a 110 or a 115. Hard to tell what the long term was going to be without knowing what the long term tax rate is going to be. But I certainly, and we all foresee the ability to provide, produce an ROA above 1. over the long term as we, again, continue to build out the SBA. And as David talked about, the aspiration to be a nationwide platform in SBA, and you think about just the revenue lift between just, say, going from $50 million to $100 million of originations to $200 million and beyond that, the revenue and the profitability lift from that certainly provides a clear pathway to a solid one-plus ROA. So that is our goal, and we feel that that's achievable. Okay. We're still investing a lot."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I was going to say, just to back that one up on Ken's part, we're still investing a lot to get to that level. So investments we make today will definitely start. We'll see some hopefully pop towards the end of this year, definitely in the first half of next year."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, great. Thanks for all the color. Appreciate it. Thank you, Brett."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And this concludes our question and answer session. I would now like to turn the conference back over to David Becker for any closing remarks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, guys. We appreciate all of you joining us today. We hope you have a nice day. Some parts of the country have jumped back into winter instead of springtime and summer here, but stay safe and enjoy it, and we'll continue to push the success forward here in 2021. Thank you very much for your time."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. The conference is now concluded. Thank you all for attending today's presentation. You may now disconnect your lines. Have a great day."
    }
]