[
    {
        "date": "2022-10-20T12:00:00-04:00"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good day, everyone, and welcome to the first Internet Bancorp earnings conference call for the third quarter of 2022. My name's Drew, and I'll be coordinating your call today. During today's presentation, if you would like to ask a question, you may do so by pressing star followed by one on your telephone keypad. If you change your mind, please press star followed by two. And please note that today's event is being recorded. I would now like to turn the conference over to Larry Clark from Financial Profiles, Inc. Please go ahead, Mr. Clark."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Drew. Good day, everyone, and thank you for joining us to discuss First Internet Bancorp's financial results for the third quarter of 2022. The company issued its earnings press release yesterday afternoon, and it's available on the company's website at www.firstinternetbancorp.com. In addition, the company's included a slide presentation that you can refer to during the call. You can also access these slides on the website. Joining us today from the management team are Chairman and CEO David Becker and Executive Vice President and CFO Ken Levick. David will provide an overview and Ken will discuss the financial results. Then we'll open the call up to your questions. Before we begin, I'd like to remind you that this conference call contains forward-looking statements with respect to the future performance and financial condition of First Internet Bancorp that involve risks and uncertainties. Various factors could cause actual results to be materially different from any future results expressed or implied by such forward-looking statements. These factors are discussed in the company's SEC filings, which are available on the company's website. The company disclaims any obligation to update any forward-looking statements made during the call. Additionally, management may refer to non-GAAP measures, which are intended to supplement but not substitute the most directly comparable GAAP measures. The press release available on the website, contains the financial and other quantitative information to be discussed today, as well as the reconciliation of the gap to non-gap measures. At this time, I'd like to turn the call over to David."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Larry. Good afternoon, everyone, and thanks for joining us today. For the third quarter of 2022, we reported net income of $8.4 million and earnings per share of $0.89. Excluding non-recurring expenses, adjusted net income for the third quarter was $8.5 million, and adjusted diluted earnings per share were $0.90. Adjusted for the non-recurring item, we produced a return on average assets of 0.83% for the third quarter and a return on tangible common equity of 9.24%. As a fellow shareholder of First Internet Bank Corp., I'm disappointed in these results. I would like to use this opportunity to speak openly about what went well in the third quarter, where we were challenged, and what to expect from us in the future periods. To begin, capital levels continued to remain strong. Ending the quarter with a tangible common equity ratio of 8.36% leaves us very well positioned going forward. Additionally, through repurchase activity during the third quarter, we were able to offset the effect of AOCI and maintain a consistent tangible book value per share. which many other banks have not been able to do in the current environment. Loan production was one of the highlights of the quarter. Total loan balances increased to $174 million. This is nearly 6% growth from the prior quarter, puts our loan balances at an all-time high of almost $3.3 billion. Loan originations for the quarter, including unfunded commitments, were $491.3 million. That's a 47% increase of origination volume in the second quarter. New funded originations total 272.5 million, up 9% over volumes in the prior quarter. Our construction lending team had a tremendous quarter, sourcing almost 190 million in new originations. While very little of this new production funded during the quarter, we expect it to draw down over the next 12 to 18 months and the vast majority is variable rate. At the end of the third quarter, unfunded commitments and construction lending totaled $367 million, up over 74% compared to June 30th, 2022, positioning as well to add variable rate assets in the fourth quarter and throughout 2023. Our small business lending team continued its strong performance in the third quarter, with origination volume up 51% over the second quarter. The team at First Internet Bank finished the SBA fiscal year as the 27th most active 7A lender amid a field of over 1,600 lenders. As the second half of the year is seasonally stronger for small business lending, our pipeline is continuing to grow, and we expect originations to increase in the fourth quarter. We anticipate total originations for the year to be in line with our revised expectations in the range of 165 million. However, we have seen lower gain on sale premiums in the second and third quarters of 2022 compared to the previous two years. There are several reasons for this. First, government programs that temporarily increase the guarantee from 75% to 90% have expired. Loans with a 90% guarantee have consistently fetched higher gains on sale than those with 75%. Additionally, rising rates also increase prepayment expectations driving secondary market prices lower. With lower expectations on premium, we are forecasting SBA gain on sale revenue to be in the range of $10.5 to $11 million for the year. Our partnership with Apple Pie Capital, a FinTech-oriented specialty lender that focuses on lending to the franchise industry, was another standout performer in the second quarter. Together, we are providing credit to proven entrepreneurs throughout the country. We funded over $60 million of franchise loans with pricing north of 6% during the quarter and now hold $225 million in this portfolio. Overall, our commercial loan businesses are performing extremely well. Additionally, we also continue to win new business in our consumer lending lines and our horse trailer, recreational vehicles, and other consumer loan portfolios. We originated over $40 million of new loans at yields north of 6%. The limiting factor here has been inventory of new models, which are, like passenger vehicles, challenged by the current chip shortages. As you have come to expect from us, ongoing strong credit quality was a key contributor to our third quarter performance. Our total non-performing assets remain low at 14 basis points of total assets. Net charge-offs to average loans were just two basis points, and delinquencies 30 days or more were just six basis points of total loans, consistent with the prior quarter. Understanding that we are in an uncertain economic environment, we continue to review our loan portfolios for any areas of potential weakness. While we are diligent and thorough in our review, we take comfort in the fact that we have never wavered from our consistent underwriting standards. No matter where we may find ourselves in the credit cycle, As a result, our credit quality has remained strong over the long term, and we expect that trend to continue. Turning to where we saw the most disruption during the third quarter, our earnings were impacted by higher funding costs. In our forecast for 2022, we had anticipated rising rates. We have shared with you the strategies we undertook over the past several years to better position our balance sheet for a rising rate environment. One of those initiatives was to improve the composition of our deposits moving toward non-maturity deposits. We have been winning small business and commercial checking account relationships throughout 2022. Account volume is up by about 10%. DDAs make up 15% of our deposits as of September 30th compared to just 8% when we entered the last rising rate cycle. As we look at savings balances, we do see a trend where consumers and business owners are taking down some of their savings after building up account balances during the depths of the pandemic. Average savings balances are down slightly on a year-to-date basis. Additionally, the competitive environment has made it challenging to grow deposits. As reported by the Wall Street Journal in mid-September, there was a record outflow of $370 billion in deposits from the banking system in the second quarter, the first decline since 2018. This intensified the competition for deposits in the third quarter. We have seen an escalation in rates being offered by digital direct banks, local banks in our market, and in the banking as a service and wholesale deposit markets. First Internet Bank does not offer teaser rates or other incentives to new customers that are not available to existing customers, and we have not negotiated rates with individual customers. We believe openness, transparency, and fair pricing for all are key to maintaining strong relationships and a loyal customer base. As a result of acute deposit competition, our cost of interest-bearing deposits increased 56 basis points from the second quarter to 1.41%. An increase in earning asset yields of 26 basis points was a partial offset. Our fully taxable equivalent net interest margin for the third quarter was 2.53%, down 21 basis points from the second quarter. We believe deposit rates will continue to increase through the fourth quarter as the September CPI report leads us to conclude that Fed will continue on its path to a target Fed funds rate of 450 to 475 in an effort to beat down inflation. Throughout 2022, we have increased rates on new loan originations. We will apply even more pricing discipline in the fourth quarter to mitigate the pressure on our net interest margin. Our third quarter funded loan origination yields were up 52 basis points from the second quarter and on a year-to-date basis are up 87 basis points higher than they were for the same period in 2021, setting the stage for higher average loan yields in future periods. The other area where we believe we can meaningfully improve our results is through banking as a service partnerships. We have entered into a partnership with the established platform Treasury Prime, which has placed numerous FinTech relationships across its network of 15 financial institutions. We are currently working through the implementation and are expecting to onboard our first relationship in early 2023. We are discussing both deposit programs with attractive funding costs as well as payment programs, which would be accretive to non-interest income. Additionally, We are in a pilot phase with a vast platform and program manager called Increase. We will be working through the balance of the year to get three programs from pilot to full production. This partnership is expected to drive primarily non-interest income payment programs with significant upside potential. One of the opportunities that we are currently piloting has a projected $1 billion in payment volume over the next 12 months. We expect to announce more on this relationship during our next earnings call. We have carefully curated a pipeline of a dozen or so additional opportunities to include only opportunities that closely align with our high standards for compliance and risk management. We have kissed a lot of frogs over the past two years, but we have a robust pipeline of high quality deposit, payment, and lending opportunities. As we work through the pilot stage and move increase into full production, We expect the throughput of that pipeline to increase exponentially in the coming quarters. Wrapping up my remarks in the quarter, while we were disappointed in the net interest income and net interest margin performance for the quarter, we are very pleased with the growth of our construction lending business, continued strides we are making in SBA lending, both of which will add asset sensitivity to our loan portfolio going forward. Credit quality remains strong. and our capital ratios provide the flexibility to support the balance sheet as well as allocate capital to continue to share repurchases when we believe there is a valuation disconnect in our stock price. To that end, I am pleased to announce that our board of directors this past Monday approved an extension to the current authorized program, including an additional $5 million of repurchase authority. As I outlined above, we have some very exciting things going on with our FinTech and Banking as a Service partnerships that should provide long-term, scalable growth in revenue and lower-cost deposits. While there may be some short-term volatility in earnings until rates stabilize, we believe the strategies and projects we are working on today will provide a far more resilient balance sheet and earnings profile over the long term. Before I turn it over to Ken, I would like to thank the entire First Internet team for the dedication to our customers and our success on behalf of investors. We excel because of innovation and collaboration, and our workplace culture celebrates, develops, and promotes the people who embody these strengths. It's why we were named once again one of the best banks to work for by American Banker for the ninth year in a row. Our team's talent and commitment to constant improvement give me great confidence and the future of First Internet and our long runway of opportunities ahead as a premier technology-forward, growth-oriented digital financial services provider. With that, I'd like to turn it over to Ken to discuss our financial results for the quarter."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, David. If we move to slide four on the presentation, total loans at the end of the third quarter were $3.3 billion, up 5.6 percent from the second quarter and up 10.9 percent from the from September 30th of 2021. We are pleased with the growth in franchise finance, small business lending, and consumer, as well as the strong origination activity in our construction business. We also saw growth in our single tenant lease financing portfolio as the team had another nice quarter of origination. This activity was offset by the continued decrease in healthcare finance, which has been running off for several quarters now and will continue to do so. Moving on to deposits on slide five, overall deposit balances were up modestly from the end of the second quarter. Both non-maturity deposits and CDs declined, offset by an increase in broker deposits. The decline in non-maturity deposits was due primarily to lower BAS deposits at quarter end, and the decline in CDs reflects the impact of our continued strategy to avoid the price competition in the CD market which is even more intense than for money market balances. Price competition in the digital checking and money market space, combined with the secular trend of overall deposits leaving the banking system, has made it challenging to grow deposits. Furthermore, as you can see on the deposit table in the earnings release, we experienced a significant decline in vast deposits. We expected some volatility in these deposits, As we noted last quarter, the FinTech space has been experiencing some upheaval. We are seeing a rational return in focus to long-term viability and profitability as opposed to simply customer or revenue growth. While we applaud the common sense approach, changes to FinTechs in particular this quarter impacted our pipeline. In the first case, the pace of withdrawals in an existing FinTech deposit relationship increased dramatically throughout the quarter. As a result, we had to access the wholesale deposit and funding markets to supplement our own deposit generation efforts. We expect further decline on this relationship in the fourth quarter. Another FinTech opportunity that was looking like a done deal dissipated on us entirely. But our pipeline of FinTech opportunities continues to build, and we have confidence the programs we have in pilot now will be in full production in the fourth quarter. As David noted earlier, the cost of interest-bearing deposits increased 56 basis points. Competitive factors drove deposit betas far above those experienced during the second quarter. In both the digital bank and small business markets, we saw peer betas ranging from 75% to 115%. While we were by no means a price leader in these spaces, we did have to increase pricing in order to maintain balances. including the Fed rate increase in late September, our current pricing on money market products results in a cycle-to-date beta of about 60%. In terms of how this pricing impacted results, actual price increases beyond expected deposit betas impacted the third quarter's deposit costs by 10 basis points and the fully taxable equivalent net interest margin by 7 basis points. Furthermore, the incremental effect of higher pricing in the wholesale funding market affected deposit costs by four basis points and fully taxable equivalent net interest margin by three basis points. And while BAS deposits declined from one quarter end to the next, the overall average balance was up from the second quarter. As pricing on the BAS deposits is tied to Fed funds, the increase in the cost of these deposits also contributed to overall higher deposit costs. Returning to slide 6 and 7, net interest income for the quarter was $24 million and $25.3 million on a fully taxable equivalent basis, both down around 6.5% from the second quarter. The yield on average interest earning assets increased to 3.91% from 3.65% in the second quarter, due primarily to a 22 basis point increase in the yield earned on securities. and 167 basis point increase in the yield earned on other assets. The reported yield on average loans was up two basis points from the second quarter. The increase in new origination yields experienced during the quarter were offset by a number of factors. Over 50% of loan balances funded during the quarter occurred during September. Average balances in certain higher yielding portfolios were lower than expected. loan growth composition, and prepayment fees declining by almost $800,000. While we did not expect those to remain elevated given the interest rate environment, actual fees came in well below expectations. Another factor that impacted loan portfolio yields is the fixed rate nature of certain larger portfolios and the lagging impact of the higher origination yields on the portfolio, which are expected to increase over time. In total, we estimate that these factors impacted the total loan yield for the quarter by about 14 basis points and the fully taxable equivalent net interest margin by 11 basis points. As David noted, we recorded a net interest margin of 2.40% in the third quarter, a decrease of 20 basis points from the second quarter. And fully taxable equivalent net interest margin was down 21 basis points to 2.53% for the quarter. The net interest margin roll forward on slide seven highlights the pressure we experienced on both sides of the balance sheet as the positive impact from the loan portfolio, which came in below expectations, was not nearly enough to offset the effect of increased price competition and higher pricing in the wholesale funding markets. As demonstrated on the graph on slide seven, the impact of deposits leaving the banking system and the effect on price competition and wholesale deposit costs drove our monthly deposit costs higher throughout the quarter. As far as top line interest income goes for the fourth quarter and into 2023, we continue to feel confident that the combination of new loan originations priced at higher levels, variable rate assets repricing higher, and draws on the significantly increased construction commitments will drive strong growth in total interest income. Currently, we expect the yield on the loan portfolio to be up around 40 to 45 basis points for the fourth quarter, with loan interest income up in the range of 16 to 17 percent compared to the third quarter. On the funding side, with higher forward rate expectations based on the Federal Reserve's aggressive language regarding rates and inflation, we do expect deposit costs to increase as well. The pace of increases will depend heavily on price competition, and the magnitude of Fed rate increases throughout the quarter. Across various scenarios, we expect the cost of deposit funding to increase anywhere from 75 to 95 basis points, with total interest expense up in the range of 50 to 60 percent. In terms of what effect this has on fully taxable equivalent net interest margin, we expect the continued rise in deposit costs to compress margin further. anywhere from 35 basis points in a more aggressive rate scenario to 25 basis points in a less competitive environment. Turning to non-interest income on slide 8, non-interest income for the quarter was $4.3 million, consistent with the second quarter. Gain on sale of loans totaled $2.7 million for the quarter, up $800,000. and it consisted entirely of gain on sales of U.S. Small Business Administration 7 guaranteed loans, which activity and market premium commentary were covered earlier. Mortgage banking revenues were down this quarter due to a decrease in interest rate locks in sold loan volume, as well as gain on sale margins, again driven by the higher rate environment and its impact on both the purchase and refinance markets. As far as expectations go for the fourth quarter, We expect non-interest income to be up as gain on sale of SBA loans should be comparable to the third quarter results, and other income will benefit from planned distributions related to fund investments. The near-term outlook for mortgage remains challenging, but our team has been exploring new channels to increase origination activity that should help to maintain revenue consistent with the third quarter. Moving to slide 9, non-interest expense for the third quarter was $18 million, consistent with the second quarter. Salaries and employee benefits and consulting and professional fees declined from the linked quarter, while loan expenses and premises and equipment costs were higher. The lower salaries and employee benefits expense was due mainly to non-recurring items incurred in the second quarter, partially offset by increased headcount, and higher incentive compensation in small business and construction lending. The decrease in consulting and professional fees was due to seasonality around the timing of third-party loan review and stress testing. The increase in loan expenses was driven primarily by fees associated with growth in our franchise finance portfolio, while the increase in premises and equipment costs was impacted by a non-recurring 125,000 write-down on a software license we discontinued. Now let's turn to asset quality on slide 10. Credit quality remains excellent as non-performing loans and non-performing asset ratios remain extremely low. Net charge-offs of $179,000 were recognized during the third quarter, resulting in net charge-offs to average loans of two basis points. The provision for loan losses in the third quarter was $892,000 compared to $1.2 million for the second quarter. The linked quarter change was driven primarily by reductions in specific reserves related to positive developments on certain monitored loans, partially offset by growth in the loan portfolio. The allowance for loan losses increased $713,000, or 2.4%, to $29.9 million as of September 30th, and the ratio of the allowance to total loans decreased three basis points to 0.92%. The decline in the coverage ratio was driven by the changes in portfolio composition and reflects growth in certain portfolios with lower coverage ratios, as well as the continued decline in healthcare finance balances that have a higher coverage ratio. With respect to capital, as shown on slide 11, Our overall capital levels at both the company and the bank remain strong. Our tangible common equity to tangible assets ratio was 8.36%, down from the second quarter due primarily to the increase in accumulated other comprehensive loss. But while many banks continue to experience a decline in tangible book value per share, ours remained stable during the third quarter at $38.34 per share. During the third quarter, we repurchased 120,000 shares of our common stock at an average price of $36.56 per share as part of our authorized stock repurchase program. Including shares repurchased during the fourth quarter of 2021, we have now repurchased $25.1 million of stock under the total upsized authorization of $35 million. With capital ratios as strong as they are, it provides the flexibility to support balance sheet initiatives while also allowing us to remain in the market for our stock, supporting our shareholders when the price is not reflective of our franchise value. With that, I will turn it back to the operator so we can take your questions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. We will now start today's Q&A session. If you would like to ask a question, please press star followed by one on your telephone keypad now. If you change your mind, please press star followed by two. Our first question today is from George Sutton from Craig Hallam. Your line is now open."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, guys. Thanks for all the detail provided. So I really have one key question, and it's related to the BAS deposits. So we anticipated with these relationships that the rates would be relatively low to non-existent. They moved very quickly in the quarter, and you mentioned they were tied to Fed funds rate. Can you just walk through that specific dynamic a little bit more?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, I think what we've seen in the BAS space is that we've seen the pricing on BAS opportunities increase as well. And that specific opportunity that we had That was in partnership with another bank that was working with the FinTech directly And in all honesty that the FinTech partnership there was it was it was a FinTech depository that kind of had a constantly changing business model and with the increase in market rates throughout the court really throughout the year and the program bank we worked with kind of had to change pricing on it with that and move towards more of a market rate. So that's what impacted the pricing there. I will say in some of the other opportunities with the platform partners we're working with, those deposit opportunities are priced much lower than this particular opportunity. So I think our expectation on deposit opportunities in the BAS space and with FinTech partners going forward will be priced at a lower level than what we witnessed with this particular partnership."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "In the FinTech space, George, the only deposits today that we're seeing, at least at this current point, that are totally free are the settlement accounts for the payment services, which can be hundreds of thousands of dollars, potentially approaching a million on large payment servicers, but the FinTech world Obviously, they're scrambling for earnings. They need to make money, and they know there is value in that deposit base. So six months ago, they were free. Today, they have a charge. As Ken said, not all of them are at Fed funds rate, but the idea of just the fintech world providing billions of dollars of free money, that's really not out there today. As they are having to prove a path to profitability, to continue to get funding, they're looking for earnings wherever they can, and some of that comes, obviously, in selling off their cash. So it's still opportunities, and we're seeing some very good ones at much lower costs than Fed funds rate, but it's not a totally free game like it was two or three years ago."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I understand."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks for the clarity. Appreciate it. Thanks, sir."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our next question today comes from Michael Perito from KBW. Your line is now open."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, guys. Good afternoon. I guess just maybe a big-picture question. With the stock where it is today, I mean, where do you guys kind of see yourself proceeding from here, right? I mean, it doesn't seem like it. It pays to grow the consumer books and fund it with higher cost money market deposits. You know, I mean, you guys mentioned the buyback and it seems like that's in play here. But just we'd love a comment and just overall, maybe, David, about how you're thinking about what the priority should be as you budget for next year, just given this quarter and maybe a little bit of a slower rollout here on the bass side, at least from a lower cost funding perspective."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, Michael, we pulled back. We're pricing any loans that we're doing today on a 4% cost of funds, which obviously we're not even remotely close to that yet. But anticipation of the Fed pushes through to 450, 475, early 2023, we're going to be there by the end of the year, depending on how long they hold that rate in place. So we're not focused on growth. We're focused on good, solid margins. We're focused on variable rate product, replacing some of the fixed term stuff that is rolling off. Our portfolios are large enough in the repayment structure that we're funding a lot of the new loan activity with cash coming back. That was in the 4% or 5% range. Now we're rolling out the door in a 6%, 7%, 8% range. So, yeah, you're spot on. We're not totally done. We've done a lot of calculations for 2023, but We're not anticipating tremendous growth of any kind in any fashion until rates stabilize and we get a handle on where the marketplace is going. I guess a little bit of maybe a good indication with the 10-year starting to rise, maybe the market's thinking that things are stabilizing a little bit, but with an inverted yield curve when an awful lot of our product is priced off 10-year, it doesn't make sense. We've literally shut down it. A couple of the verticals in total where we just can't get competitive pricing."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And then – thanks, David. And then on the – maybe, Ken, on the margin. So, I mean, it sounds like you guys are going to drift down to where you were at the beginning of 2021, give or take. You know, obviously, there's some range on that. But, you know, I mean – What about after that? I realize that's a loaded, hard question, but, you know, I mean, is this, with the Fed on the trajectory it is, I mean, is this a NIM with this balance sheet now that likely heads back down towards two? Or, you know, I hear David saying about maintaining kind of good margin, but, you know, it's a challenging curve for your book of business that's currently constructed. So just wondering structurally if you guys think, if you still think there's room for that margin to kind of trough in the cycle much, much higher than where it had in the prior rate cycle on a relative basis."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I think that's an accurate observation. I think, you know, between this quarter, the third quarter, the fourth quarter, and probably into the first quarter a bit is probably where we'll feel the biggest impact of these rate increases. If you think about it, you know, we're kind of modeling – As we said earlier, we're modeling towards the Fed hitting 475. And if you assume we got a 75 basis point rate height coming up here in a couple weeks and perhaps anywhere from 25 to 75 on top of that, we're getting to that. We've already felt the full brunt of that. So we'll kind of see those deposit costs continue to model upward. But as David said, on the loan side, it's a lot, as opposed to where we were sitting maybe three months ago, six months ago, there was a lot of loan growth in front of us. Today, it's going to be much more measured loan growth, priced very rationally, priced on the higher end, lower growth. So probably looking forward to next year and not giving any credit to any vast deposits or any cheaper deposits that come in the door, but just kind of looking at the deposit mix as it is today. I mean, we're probably looking next year, you know, for the full year, a margin of probably anywhere from, say, call it 210 to 220. Yeah, 210 to 220. you know, with taking the kind of the hits up front and then over the course of the year kind of, you know, stabilizing and hopefully bringing it kind of back kind of slowly upward near the end of the year."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And again, Michael, we just had a conversation about the vast deposits. There are a couple opportunities out here that could really put significant money on board. quickly and one of the reasons that we didn't chase kind of the institutional CD game. One, it's a 130 to 140 basis points higher than the consumer, but some of the money market opportunities that we've opened up, we can step down pretty quickly and get out of that if we do land one of the whales that can drop several hundred million in low-cost deposits on this. And they're still out there. We're working with a couple. But we're not building that in the forecast until we have it in hand. So I agree with Ken. I think we're going to get crunched here in the fourth quarter. We'll get crunched probably a little bit in the first quarter. But with some of the pipeline, and believe me, you guys will be the first to know, if we can land a couple of these, we could see a significant change through the second or third quarter of 2023. We got a good shot at pulling it back in pretty quickly."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, and I think David hit on a key point there with that. We have the ability, you know, if we do have those opportunities, we have the ability to scale back and exit some of the higher cost deposit funding that we have in our balance sheet. It wouldn't take a terribly long time to move a lot of that off the balance sheet should we have an opportunity you know, in the BAS or other fintech space or other deposit verticals opportunities we're looking at. So we can reposition very quickly."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. Thanks for spending a minute on that. And then just lastly for me, just to kind of pull this all together, just on the, I mean, so you're at a little over $4.2 billion today on total assets. I mean, is it fair to think that that probably does not grow much as long as this kind of margin dynamic is ongoing so maybe call it into the early part of next year that the balance sheet size likely doesn't change a whole lot is that a fair generally fair assumption yeah i i think so uh michael if anything it'll shrink a little bit so yeah we're not going to do growth for the sake of growth by any means okay uh thank you guys appreciate the taking my questions thank you all right thanks mike"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our next question today comes from Nathan Race from Piper Sandler. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah. Hi, guys. Good afternoon. I appreciate you taking the questions. Just kind of drilling into the balance sheet and loan growth outlook, it sounds like you guys are going to be much more selective in terms of what you guys add to the balance sheet going forward. So I was wondering if you could just help kind of frame that up. Are we thinking kind of more low single-digit or mid-single-digit loan growth from here or Any kind of parameters around how you guys are thinking about the loan growth opportunities in terms of what you want to put on the balance sheet going forward in the context of the rate environment and what you guys are having to do on the deposit pricing side of things?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, from the loan perspective, a lot of it is really just repositioning the loan book and letting some of the lower-yielding assets, just lower-yielding books that were really not going to be originating new product and roll off. Again, we expect SBA to do well in the fourth quarter. In SBA, the unguaranteed balances we retain are priced. After another rate hike, those are going to have a nine in front of them. Construction balances, as we talked about, our construction team had a great year. So there's going to be a lot of draw activity over the next 12 to 18 to 24 months. And those rates, again, with another rate hike on top of those, I mean, those are priced at, you know, prime plus or silver plus type spread. So you're going to have eights and nines in front of those. You know, in the franchise finance, those new deals are being priced with eights in front of those. So it's really just, and even in the consumer space, those rates have moved up as well in the RVs and the horse trailers and are going to be mid-high sevens, probably moving towards eights there. So some of it is just repositioning the balance sheet a bit. They're repositioning the loan portfolio. Could be a little bit of growth, but as we talked about, it's really just letting some of the other portfolios cash flow and just replacing lower-yielding stuff maturing with higher-yielding originations."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "If the Fed stops at $450 to $475, we'll see almost overnight stabilization on the deposit side from our end and we'll revisit kind of what the lending opportunities are at that point, particularly if 10 years starts to climb and we get out of the inverted curve, our opportunities will change tremendously. Part of our fear, obviously, to date, they haven't had tremendous success in shutting down or lowering the CPI. So if 450, 475 doesn't get there, and God forbid they decide they're going to move it up again into the five range, we don't want to be kind of hung out to dry by doing a lot of activity now that's not adjustable rate and movable with the Fed activities. So it's kind of a... safety net precaution on our side that if the Fed overshoots their target, we're not going to get crushed by it. So we'll sit on the sidelines and kind of let the dust settle here and then kind of reevaluate. Hopefully at year end, if they send out a message that they're done, it would be fantastic. But we'll wait and see what they're up to."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. Super helpful. And perhaps kind of within that context, and Ken, I appreciate your margin thoughts for next year. And I guess just thinking if in terms of the Fed potentially cutting rates at some point next year, how elastic do you think your deposit pricing can be in that type of scenario? Or does the kind of outflows of liquidity industry-wide perhaps result in the competitive environment remaining pretty fierce? from a deposit pricing perspective, even if the Fed were to cut rates at some point middle, late next year?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I think from the deposit side, it'll move as fast as it did this time around. I don't think they're going to be dumb enough to drop us back down to zero, but if they cut rates, our peers are in the same position we are, particularly the folks, if you caught it yesterday, Citizens Bank jumped money market rates to the consumers up to 3%. They've been in the 220, 225 with the rest of us, and for a lot of different reasons. I can understand why they did what they probably did, but everybody would be as anxious as we are to bring it back down. So I think if the Fed has overshot the runway and they realize that and they start backing off early in 2023, we'll be able to almost get it penny for penny. So They drop a quarter, I think we can get that quarter back."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, great. And then just in terms of thinking about the expense run rate, lastly, any thoughts on just how you're kind of thinking about the timing of additional investments just given the margin environment that we find ourselves in today into the fourth quarter into 2023 as well?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I think if you, you know, probably look at what we had here for the fourth quarter, you know, you take that and maybe, you know, run rate that and maybe add high single digit growth to that, you know, kind of probably ramping up over the course of the year. I mean, the one thing, you know, obviously, I think a lot of our costs probably don't fully reflect true inflationary costs yet. And obviously there's, you know, as we've been talking about here, there's, you know, we, over the course of the year, we have, again, continued to add to our staff, continued to build out small business lending. We've had to add folks in risk management to help with the BASC side of things and the FinTech initiatives and just kind of bolstered some groups around the bank. So we have had some headcount increase and, you know, there's probably going to be some inflationary effects there as well. We're going to try to do our best to keep overall costs under a double-digit increase for next year."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Actually, carrying that just one step further, guys, the growth in staff numbers, I think we're, as Ken said, we're kind of settling down. We're getting a very robust SBA team. with a great capacity and opportunities. We've repositioned some folks internally in areas that we have growth and we have activity and compliance and wherever from the mortgage area. So we're trying to keep existing employees employed, maybe in different positions they have been historically. One thing that is going to hit us, and I think it's hitting everybody in the industry, we're not going to get away with a 3%, 3.5% increase on salaries. for next year with COLA and Social Security being 8.2%. We're not going to match that, but I would tell you we're probably looking instead of a three, three and a half, somewhere in that six, seven percent average salary increase. So that will be more impactful than it's been in past years, but with the fight for good quality employees on a national basis with people having the ability to work for virtually any company in the U.S. from home, we are going to have to put in a pretty significant bump on base salaries through 2022, or 2023, I'm sorry. Got it. Very helpful."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I appreciate you guys taking the questions. Thank you. Thanks, sir. Thanks, Nate."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Just to reiterate, if you would like to ask a question on today's call, please press star followed by one on your telephone keypad now. If you change your mind, please press star followed by two. Our next question today is from Brett Rabattin from Hove Group. Your line is now open."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, guys. Good afternoon. Hey, Brett. Hey, Brett. Wanted to just go back to the FinTechs for a second and maybe start with Treasury Prime. As I understand it, it's more of a middleware and ledger that kind of integrates FinTechs into the core and allows the bank to hold a single account for each FinTech client versus plugging the FinTech directly into the core. Can you maybe explain a little bit more the scope of the opportunity as it relates to Treasury Prime and then these others that you're looking at what size range we might be talking about and then relative to the current cost of the FinTechs, if that improves. I'm not sure if I'm entirely clear on if you're expecting relative improvement in the betas related to the FinTechs."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, you nailed it, Brett. Treasury Prime is the long-term season veteran in that kind of third-party integration. The FinTech connects to them. They have a single source connection to us. So the overhead is minimal on our side. Return is much greater, higher than going direct. They have been around for a very long time. They have a tremendous reputation. FinTech companies that might have started with another provider that's not as strong and they're growing and outgrow the capacity of somebody else. These guys are the seasoned veteran. They get the best deals, the largest deals, and the largest opportunities. So we've chatted with them off and on for months. It took us time to get established. We are technically linked with Treasury Prime. We're finishing the testing of the credit card, debit card connection with them. They have half a dozen... very solid, very large FinTechs in their queue that they're working on integrating with that will need a banking partner. So we're now one of the 15 banks that are part of their organization. So where a lot of the other kind of middleware services, they do serve as FinTech organizations, but they're getting smaller. If you're a credible FinTech and you have capital and you have a a real product, they'll go to Treasury Prime first. So it's taken us time to get that interface done and ready to go, but we think there's tremendous opportunity there. Increase on the other side is a relatively new, but Dara, the gentleman that runs Increase was like employee number three out of Stripe, the large unicorn credit card company. As I've mentioned in meetings before, conversations, there's kind of a FinTech 2.0 coming and Dara's background and what he helped create at Stripe. The next wave of companies coming on board is who he's getting a shot at. So between these two connections, we should get the hottest, newest FinTech 2.0 opportunities and we should also get some very stable larger opportunities that maybe the current situation is not working for them anymore. So we think these two connections, it's been a long time coming. It's taken some work on our part and their part to get things lined up, but we think we have a really, really strong future. The three we have in process with increase should all be live at Two will definitely be live. We're in real testing stages now, but third should come live first quarter next year. That one is deposit lending. It's the full gamut of services. He has a queue behind that of another seven to eight opportunities for us to look at. So as I mentioned time and again, we've looked at an awful lot of opportunities. We've looked at a lot of third-party providers, but we think we really – honed in on two of the best in the industry that we can now really start to produce some results in the not too distant future."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. That's really helpful. And then I guess I just need to make sure I'm clear on the opportunity to improve the relative deposit beta on these fintechs. Is that in play or is it more just managing the relative opportunities for the FinTech growth on the deposit side?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "It's a little bit of both. I think we can, as we talked, as Ken mentioned a while ago and I did too, that some of the beefed up deposits that we have now, we can unwind pretty quickly. So if we truly do get a FinTech opportunity that's several hundred million dollars at low to no cost, as George stated, and we are chatting with a couple that have that potential. But I can't give you a number at this point. We thought, as I talked last time, that we had a lending opportunity that would have been a tremendous fee income producer for us here in the fourth quarter, and it just literally evaporated. It walked away. So we're not forecasting anything at the current time, but if we get one running that is significant, believe me, we'll We'll put out a press release and let you guys know just as soon as it's queued up. But there are, without question, some opportunities in the pipeline today that could have significant impact on our cost of funds."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. I appreciate that. And then the other question I had was just around the loan growth and the production originations in the quarter. $190 million, I think you mentioned. And obviously... a lot of the growth this quarter was in the franchise finance portfolio. How much of the originations was in construction, and is that, if I understand correctly, going to be the brunt of the growth in maybe the next quarter or two, or maybe can you walk through a little bit of that piece as well?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, the $190 you referenced, that was the amount of... unfunded originations, well I guess a little bit of it funded, but for the most part that was the origination activity from our construction team. And that added to what we already had in unfunded commitments. Basically, unfunded commitments right now are as of the end of the third quarter roughly $365 million. So that is going to be a significant part of true funded originations over the next 12 to 18 months and longer. That's obviously something we're happy with and want to fund because the vast majority of that activity is all variable rate construction priced at higher yields in the environment that we're in. Um, so yes, that's, that's going to be a big piece of the growth of the, well, let's not say growth. It's going to be part of what you would see a change in the composition of the loan portfolio. You're going to see other portfolios perhaps decline, but you're going to see construction balances. You know, again, uh, we don't hard to always predict the time in quarter to quarter of draws, but over the course of the year, we feel confident that we're going to have significant draw activity. And again, as we said, very nice high rate variable rate activity."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. And then just lastly for me on expenses and kind of the run rate you mentioned for 23, is the compliance and back office fully built out for the FinTech platform or do you need to have some additional hires from that perspective?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "At the current time, we actually just completed our safety soundness exam. And one of the things they focused on is, you've probably seen in the press, a couple of banks have gotten in trouble for not having good compliance programs in place for their VAS operations. And we passed with flying colors. So yeah, we've got a significant team structured today. You know, if we get a couple whales, we might add a body or two that they'll be paid for. But the crew to get us off the ground, get us up and established with everything we have in the pipeline is with us today. So, yeah, that's already all built in."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. Great. Appreciate all the color, guys. Thank you, sir. Thanks, Brett."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "We lastly have a follow-up question from Michael Perito from KBW. Your line is now open."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, guys. Yeah, thanks. I just wanted to make sure I heard, because you guys were mentioning a couple different individual growth rates, but overall you had said low double-digit growth on non-interest expense next year, correct? Yeah, correct. Okay, thank you. And then just, Ken, secondly, just last stupid question, obviously the earnings kind of mix and the growth, it's all shifting quite a bit these next few quarters. Just any initial thought on kind of where the tax rate might shake out just, I guess, you know, near term, but also as you budget ahead for next year, any range that we should be thinking of?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I think, you know, we'll probably migrate down a little bit. I mean, I think we are, you know, roughly 10 and a half or so this quarter. You know, that's probably, you know, I would say probably 10 to 11% over the next, you know, probably over the next several quarters is the right way to look at it."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Thanks, guys, for the follow-up. Yep."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Mike."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "There are no further questions at this time, so I'll hand you back over to David Becker for closing remarks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Drew. Well, obviously, guys, this is a very historic rising rate environment. Believe me, we are using all the discipline and tools at our disposal to preserve earnings. We remain intently focused on driving higher levels of return for the shareholders, and we appreciate your time and conversation today. Thank you for joining us."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "That does conclude today's call. You may now disconnect your line."
    }
]