[
    {
        "date": "2023-07-27T14:00:00-04:00"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good day, everyone, and welcome to the first Internet Bancorp Earnings Conference call for the second quarter of 2023. Be advised that all participant lines have been muted to prevent any background noise. After the presentation, we will conduct a question and answer session. And please note that today's conference is being recorded. I will now turn the conference over to Larry Clark from Financial Profiles, Inc. Please go ahead, Mr. Clark."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Sylvie. Good day, everyone, and thank you for joining us to discuss First Internet Bancorp's financial results for the second quarter of 2023. The company issued its earnings press release yesterday afternoon, and it's available on the company's website at www.firstinternetbancorp.com. In addition, the company has included a slide presentation that you can refer to during this call. You can also access these slides on the website. Joining us today from the management team are Chairman and CEO David Becker and Executive Vice President and CFO Ken Levick. David will provide an overview and Ken will discuss the financial results. Then we'll open up the call to your questions. Before we begin, I'd like to remind you that this conference call contains forward-looking statements with respect to the future performance and financial condition of First Internet Bancorp that involve risks and uncertainties. Various factors could cause actual results to be materially different from any future results expressed or implied by such forward-looking statements. These factors are discussed in the company's SEC filings, which are available on the company's website. The company disclaims any obligation to update any forward-looking statements made during the call. Additionally, management may refer to non-GAAP measures, which are intended to supplement but not substitute for the most directly comparable GAAP measures. The press release available on the website contains the financial and other quantitative information to be discussed today, as well as the reconciliation of the GAAP to the non-GAAP measures. At this time, I'd like to turn the call over to David."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Larry. Good afternoon, everyone, and thanks for joining us today as we discuss our second quarter 2023 results. Starting with the highlights on slide three, I would like to take a few minutes to discuss some of the key themes for the quarter. Following events that occurred in March, we responded quickly to further enhance our balance sheet liquidity. We produced strong deposit growth during the quarter, which far outpaced loan growth and drove our loan-to-deposit ratio down to below 95%. While these actions resulted in higher deposit costs and cash balances, which impacted net interest margin during the quarter, the pace of increase in deposit costs slowed to its lowest point in four quarters. and loan portfolio yields continue to rise. The yield on the new loan originations increased to 8.42% during the quarter, up 66 basis points from the first quarter. We continue to execute our strategy of optimizing loan portfolio composition through funding growth in higher yielding and variable rate lines of business with cash flows from longer term fixed rate portfolios. A notable highlight of the quarter was the performance of our SBA team which posted its highest level of quarterly gain on sale revenue to date, up 20% over the prior quarter. The team is firing on all cylinders as year-to-date originations are up 216% over the same period of 2022. For the SBA's 2023 fiscal year to date, we remain a top 10 7 program lender. The combination of repositioning the loan portfolio and delivering consistently higher revenue from our SBA business provides a foundation for us to achieve stronger earnings and profitability once deposit costs stabilize. Our capital levels remain solid with tangible common equity to tangible assets of 7.07 and a common equity tier one capital ratio of 10.10%. While we are in a much better position than many other banks related to the impact of unrealized security losses on tangible common equity, it does have an effect on the ratio. Furthermore, carrying above average cash balances, essentially an inflated balance sheet, also affects the tangible common equity ratio with no real impact to most regulatory capital ratios. Tangible common equity was also affected by our share repurchase activity as we purchased over 200,000 shares during the quarter, which allowed us to once again deliver an increase in our tangible book value per share. And finally, related to credit, I would like to remind everyone that our exposure to the office commercial real estate market is less than 1% of our total loan balances. This extremely small amount does not include any central business district exposure and is limited to suburban and medical office space. Now turning to our financial and operating results for the second quarter of 2023, we reported net income of 3.9 million and diluted earnings per share of 44 cents. Despite higher funding costs, total revenue was 24 million, down modestly from 25 million in the first quarter as the growth in SBA revenue helped to offset a decline in net interest income. Additionally, operating expenses were relatively in line with our expectations given the strong origination activity in SBA, and you can see the impact of the cost savings from existing mortgage from exiting mortgage as non-interest expense to average assets declined to 1.52%. Overall loan growth was relatively modest as growth in construction, small business lending, and consumer was offset by declines in public finance, healthcare, and single-tenant lease financing. Our construction team had another excellent quarter, originating over $115 million in new commitments and growth of over $34 million in funded balances. At quarter end, total unfunded commitments rose to $450 million, leaving us well-positioned to continue optimizing the composition of the loan portfolio. Consumer lending team also had a great quarter as the trailers, recreational vehicles, and consumer loans portfolio were up, On a combined basis, almost $14 million. We remain focused on the super prime market and have increased rates with new production coming in well above 8%. Delinquency in these portfolios remains very low as well at just four basis points. Overall credit quality remains strong as non-performing loans to total loans declined to 17 basis points. Non-performing loans declined 3 million in the second quarter due primarily to the resolution of the CNI participation loan that was partially charged off in the first quarter. In late May, we received a payoff of our remaining balance and recognized a recovery of about $200,000. With a decline in non-performing loans, non-performing assets to total assets improved to 13 basis points down from 20 basis points last quarter. Additionally, delinquencies 30 days or more were just nine basis points of total loans down from 13 basis points in March 31. Lastly, I want to provide an update on our Banking as a Service and FinDebt partnership initiatives. We are encouraged by the growth we are seeing from our existing programs. Total deposits from our Banking as a Service partners were up 86% from the first quarter and totaled $154.5 million at quarter end. Additionally, these partners generated almost $3 billion in payments volume which was just about triple the volume we processed in the first quarter. From a revenue perspective, total banking as a service fees were up 34% quarter over quarter. But more importantly, the revenue channel is becoming more durable with reoccurring revenue from oversight and transaction fees up almost 180% from the prior quarter. Our banking as a service channel is more than a promising opportunity for diversified revenue streams. We view our FinTech relationships as a vital resource for expanding our capabilities for our consumer and small business banking customers. In the second quarter, we began testing payments through the RTP network from the regional clearing house. And this month, First Internet Bank was proud to participate in the first ever transactions process through the long awaited FedNow service. These are just the latest evidence of our 25 year commitment to delivering leading edge financial solutions. Our capabilities and our entrepreneurial spirit ensure we will continue to be the bank of choice for consumers, small business, and fintech partners alike. To recap my prepared comments, there were several good things about the quarter that leave us very optimistic regarding the outlook for First Internet. From a safety and soundness perspective, liquidity is very robust, credit quality remains strong, and capital levels are solid. With the pace of the Federal Reserve rate hikes declining and perhaps nearing the terminal rate, we experienced a corresponding decline in the pace of the increase of deposit costs. This, combined with the strong and still growing performance of our SBA team and the continued improvement in our loan portfolio composition, leave us feeling very confident that once the Federal Reserve hits its terminal rate, revenue will rebound. with growth and profitability accelerating quickly once interest rates start coming down. With that, I'd like to turn the call over to Ken for more details of our financial results for the quarter."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, David. Now turning to slide four, David covered the highlights for the quarter from a lending perspective, so I will just add some additional color. Consistent with our focus on higher yielding asset classes, We were pleased to see that our second quarter funded portfolio loan origination yields continued to increase from the first quarter. Because of the fixed rate nature of some of our larger portfolios, there is a lagging impact of the higher origination yields on the overall portfolio. However, these originations should have a positive impact on the loan yield in future periods. Our SBA, construction, and franchise finance channels continue to have very strong pipelines. Similar to what we accomplished in the second quarter, our goal is to fund the majority of this production using cash flows from other portfolios as we continue to rebalance and optimize the composition of the total loan portfolio. Moving on to deposits on slides five through seven, for the quarter, our deposit balances were up $232 million, or 6.4% from the end of the first quarter. The majority of the deposit growth during the quarter came from CDs where strong demand led by consumers resumed across the board. We originated $417 million in new production and renewals during the quarter at an average cost of 4.93% and a weighted average term of 15 months. These were partially offset by maturities of $177 million with an average cost of 2.41%. Looking forward, we have $180 million of CDs maturing in the third quarter with an average cost of 3.07%, and $263 million maturing in the fourth quarter with an average cost of 4.32%. Additionally, broker deposits increased $36 million from the end of the first quarter as we brought in some funding early in the period to supplement on-balance sheet liquidity. Non-maturity deposits were essentially flat quarter over quarter, as declines in non-interest-bearing checking and money market balances were offset by an increase in interest-bearing demand balances, primarily related to banking as a service. With the strong deposit growth during the quarter and a high level of on-balance sheet liquidity, we were able to rationalize the deposit base and lower overall deposit costs by returning over $160 million in deposits priced at premiums to Fed funds. As a result of all the deposit and interest rate activity during the second quarter, the cost of our interest-bearing deposits increased by 51 basis points from the first quarter, which, as David mentioned, is the slowest pace of growth over the last four quarters. Looking at slide six, at quarter end, we estimate that our uninsured deposit balances were $938 million, or 24 percent of total deposits, down from 26% at the end of the first quarter. The decrease was driven primarily by the decline in money market balances, conversions to reciprocal deposits, and drawdowns on construction-related non-interest-bearing balances. As a reminder, included in the uninsured balance total are Indiana-based municipal deposits, which are insured by the Indiana Board for Depositories, and neither require collateral nor are reported as preferred deposits on the bank's call report. There are also certain larger balance accounts under contractual agreements that only allow withdrawal under certain conditions. After adjusting for these types of deposits, our adjusted uninsured balances dropped to $685 million, or 18% of total deposits, comparing favorably relative to the rest of the industry. Moving to slide seven, at quarter end, we had total liquidity of $1.2 billion, including cash and unused borrowing capacity. With the deposit growth over the course of the quarter, cash balances increased over $160 million. Furthermore, our loans to deposit ratio declined to 94.6%. At quarter end, our cash and unused borrowing capacity represents 127% of total uninsured deposits, and 174% of adjusted uninsured deposits. While it appears that the worst of the crisis is behind us, we continue to feel comfortable that we have the ability to meet any future customer liquidity needs if they arise. Turning to slides eight and nine, net interest income for the quarter was $18.1 million and $19.5 million on a fully taxable equivalent basis. down 7.3% and 7% respectively from the first quarter. The yield on average interest earning assets increased to 4.89% from 4.69% in the linked quarter, due primarily to a 19 basis point increase in the average loan yield, a 49 basis point increase in the yield earned on other earning assets, and a 7 basis point increase in the yield earned on securities. The higher yields on interest-earning assets combined with growth in average loan and cash balances produced strong top-line growth in interest income, increasing almost 12 percent compared to the linked quarter. As David mentioned earlier, while deposit costs continued to rise, the pace of increase was the slowest in the past four quarters, and as a result, net interest income contraction was lower and in line with our expectations. We recorded a net interest margin of 1.53 percent in the second quarter, a decrease of 23 basis points from the first quarter. Fully taxable equivalent net interest margin for the quarter was 1.64 percent, down 25 basis points from the prior quarter. As David mentioned in his comments, we carried higher cash balances during the quarter given the volatility in the banking industry, which we estimate to have negatively impacted net interest margin by six to seven basis points. The net interest margin roll forward on slide nine highlights the drivers of change in fully taxable equivalent net interest margin during the quarter. Similar to this quarter, with higher price new loan originations and variable rate assets repricing higher, we believe that we will deliver another increase in total interest income for the third quarter. Currently, we expect the yield on the loan portfolio to be up around another 15 to 20 basis points for the third quarter. Based on yesterday's Federal Reserve rate increase, and perhaps another one later in the year, we also expect deposit costs to increase in the third quarter, although at a much slower pace than what we saw in the second quarter. Given these expectations, as well as the impact of carrying higher on-balance sheet liquidity, we anticipate the net interest margin and net interest income will contract further in the third quarter, although again, not nearly at the same pace as prior quarters. Assuming the Federal Reserve hits its terminal rate later in the third quarter, deposit costs are expected to stabilize, allowing net interest income and net interest expense to begin rebounding or net interest margin to begin rebounding upward in the fourth quarter. Turning to non-interest income on slide 10, non-interest income for the quarter was $5.9 million, up $400,000 from the first quarter. Gain on sale of loans totaled $4.9 million for the quarter, up 20% over the first quarter, and consisted entirely of gain on sales of U.S. Small Business Administration 7 guaranteed loans. Our SBA team continued its track record of growth as sold loan volume increased 16% quarter over quarter, while net premiums continued to improve and were up 40 basis points. Looking at the bar chart of quarterly non-interest income, An item that I want to point out was that with the growth in our SBA business over the last several quarters, we have been able to backfill and even exceed any potential gap in revenue due to exiting the mortgage business. Moving to slide 11, non-interest expense for the quarter was $18.7 million, down $2.3 million from the first quarter. Excluding $3.1 million of mortgage operation and exit costs recognized in the first quarter, Non-interest expense on a comparable basis increased $800,000 in the second quarter. The majority of the increase was in salaries and employee benefits due primarily to higher SBA incentive compensation related to the increased origination activity. Deposit insurance premium increased as well due to year-over-year asset growth and changes in the composition of the loan portfolio. These increases were partially offset by declines in several other expense categories. Now let's turn to asset quality on slide 12. David covered the major components of asset quality for the quarter in his comments. I'll just add some color around the provision and the allowance for credit losses. The provision for credit losses in the second quarter was $1.7 million, compared to $9.4 million in the first quarter, which included the partial charge-off of the large C&I participation loan. The provision for the second quarter reflects net charge-off activity during the quarter, and an increase in the reserve for unfunded commitments, partially offset by the positive impact of economic forecasts on quantitative factors related to the allowance for credit losses on certain portfolios. The allowance for credit losses as a percentage of total loans was 99 basis points as of June 30, compared to 102 basis points as of March 31. The decrease in the allowance for credit losses reflects the positive impact of economic data on forecasted loss rates on certain portfolios mentioned earlier, partially offset by higher coverage ratios in the CNI and SBA portfolios. Excluding the public finance portfolio, the allowance for credit losses represented 1.12 percent of loan balances. With respect to capital, as shown on slide 13, Our overall capital levels at both the company and the bank remain solid. The tangible common equity ratio declined 37 basis points to 7.07% due to the combination of an increase in the accumulated other comprehensive loss as interest rates ticked a little higher at quarter end and share repurchase activity partially offset by net income for the quarter. As David mentioned earlier, the tangible common equity ratio was also impacted by deposit growth during the quarter and maintaining higher cash balances. If you exclude the accumulated other comprehensive loss and adjust for normalized cash balances of $300 million, the adjusted tangible common equity ratio was 8.01%. From a regulatory capital perspective, the common equity tier one capital ratio remained very strong at 10.10%. During the quarter, we repurchased 203,000 shares of our common stock at an average price of $13.52 per share as part of our authorized stock repurchase program. In total, we have repurchased $38.9 million of stock under our authorized programs since November 2021. As a result of share repurchase activity, tangible book value per share increased to $39.85 at quarter end up almost 4% year over year. Before I wrap up my comments, I would like to provide some additional comments on components of forward earnings. With regard to non-interest income, as our SBA team continues to grow and deliver consistently higher origination activity, we expect non-interest income to be in the range of $6 million to $7 million in the third and fourth quarters, which equates to a range of $23.5 million to $25.5 million for the full year 2023, above our previous guidance. In connection with the increased level of SBA originations, we do expect compensation expense to increase as well. Therefore, we now expect total non-interest expense to be in the range of $18.5 million to $19.5 million for the third and fourth quarters. This equates to a range of approximately $73.5 million to $75.5 million for the full year, which excludes approximately $3 million of mortgage-related costs recognized in the first quarter. Looking forward to 2024, we are extremely optimistic about the ability to generate strong revenue growth. Even if the Federal Reserve stays higher for longer, continued improvement in the composition of the loan portfolio combined with stable deposit costs should produce growth in net interest income and an improved net interest margin. Furthermore, non-interest income should continue an upward trend as SBA and banking as a service fees increase. When adding a mid-single-digit percentage growth in operating expenses, we are currently forecasting 2024 earnings per share to be north of $3 per share. With that, I will turn it back to the operator so we can take your questions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, sir. Ladies and gentlemen, if you would like to ask a question, please press star followed by 1 on your touchtone phone. You will then hear a three-tone prompt acknowledging your request. And if you would like to withdraw from the question queue, please press star followed by 2. And if you're using a speakerphone, you will need to lift the handset before pressing any keys. Please go ahead and press star 1 now if you have any questions. And your first question will be from Michael Perito at KBW. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey guys, thanks for taking my questions. Good afternoon. Ken, sorry. I was kind of just like furiously scribbling there at the end. And I just, did you give any colored the $3 EPS for 24? What are some of the KPIs behind that around like name and credit assumptions? I heard the mid single digit expense growth, I think off of the, you know, 19, 18 to five to 19 five, I guess. But, but what were some of the, did you communicate anything else or if not, can you?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "No, I'll give you a little bit more color. I mean, I think, you know, once the Fed gets to its terminal rate, deposit costs are going to stabilize. I mean, in terms of the cost of funds and dollar costs. So any dollars of interest expense would just be in line with balance sheet growth. And it's really, you know, getting net interest income growth is really, you know, as deposit costs are stable, we're going to drive higher growth out of the loan book because we're going to continue to remix the portfolio. I guess to point to the example of that, we talked about, you know, David mentioned we have 450 million of unfunded commitments in our construction business, and the vast majority of that's all priced at SOFR plus three. So as we kind of let some of the longer-term fixed-rate portfolios continue to pay down, I mean, like, for example, healthcare, we're not originating anything new that's going to pay down. The inverted yield curve is making business difficult in other lines of business. It's really just continuing to remix that with growth in construction, growth in SBA, growth in franchise. We will probably expect continued modest growth in the consumer verticals as well. So it's just really driving more loan income while deposit costs remain flat to drive, you know, kind of get NII and net interest margin rebounded in 24. And again, on the fee side as well, you can, you know, look, the past couple quarters, that's extremely well. They're going to continue to grow. And we're picking up an increased amount of BAS fees. So we do expect growth in non-interest income as well."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I mean, that's got to assume, what, like a two and a quarter to 250 NIM, right? I mean, just ballpark, like you get to that level."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Fourth quarter, Michael, we'll be back in the 190 range, pretty close to two."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I mean for 24."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, 24. That's what I'm saying. By fourth quarter, 24, we'll be sitting about somewhere in the 190 to 195 range."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. And that's coming off, it sounds like, I mean, you guys are going to trough around maybe 150, 155 next quarter based on what you see today in the hike last night?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, it kind of depends on how the rest of the market responds to it. But right now, nobody seems to be going crazy on, bumping up the rates. So if we can stay in that 10, 15 basis point move, we'll be, yeah, that'd be pretty good."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And Mike, we're taking, I think we're taking a pretty, you know, we're assuming in those numbers we talked about that the Fed is higher for longer as well. So we're trying to take a very, I think, conservative approach to that. And I think if, you know, let's just say they start cutting rates next year, that's just gravy on top."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I gotcha. All right. Very good. And, um, on the SBA piece, you know, it's, it's the first half of this year was great. Um, it sounds like the pipelines are good. Are you actively adding more talent there still is, and, and, you know, I guess, are you starting to kind of formulate any niches or, or areas of strength, like on a more granular level, or is there still pretty broad based general seven a lending and, Just would love some more color as that group becomes a bigger contributor here."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Let's see. As far as a niche, Michael, probably 60% to 70% of the deals we're doing are business acquisitions. They're not startups. So we're helping either generational transfer of wealth or employees taking over for a founder that's leaving the company. So we're not doing a tremendous amount of brand-new startups. It's not a husband-wife team getting a Papa John's franchise or something of that nature. It is very diversified all across the country. We've been very fortunate in getting some very solid BDOs from other organizations that have kind of pulled back on lending in general. So it's, you know, the pipeline's the strongest it's ever been, great quality, getting good margins, and the future is really, really bright on the SBA side."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And you guys have been, what are the margins you've been selling at generally at this point? Has it been in the 6% range, or where have you guys been?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "No, Mike, we've been higher than that. In fact, for the quarter, our net premium, which is, you know, gross premiums were $109.50, and after you net out some of the costs, our net premium was closer to a $108."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, and most of that's variable rate production, or...?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "It's all very great, yeah."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. And then just lastly on the credit side, it was good to see some recovery in – not recovery, but just some normalization or rebound, whatever word you want to use, in the credit costs. And just curious, it didn't seem like it based on the prepared remarks, but have you done any – um has anything else popped up as an area of concern or have you guys run any recent like third-party stress tests or anything like that around any of the commercial real estate book and just curious if you can give us any more um color kind of recently on any analysis you've done on the strength of that loan portfolio i would say on the single tenant side we actually did a review of every one of those loans about 60 days ago went through and and finding no cracks no"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "kinks in the armor. We just completed a review with, I can't remember, was it RMS? RSM. RSM. I keep getting the letters turned around. They just came in and did an external review, Michael, of probably about 60 to 70% of our total commercial, both single tenant, commercial real estate, CNI, et cetera. And they had no degradation of any of the loans. No questions, comments, issues on anything out there. Obviously, as the volume has fallen off on single-tenant public finance and stuff we're spending. Both teams are very active, talking to clients, staying on top. If there are any issues, we're making sure everything's up-to-date on financials and tax returns, et cetera, et cetera. So the book's probably as solid as it's ever been, and the quality of it, obviously, with the repayment activity going on, I think our average loan-to-value on single-tenant now is approaching $45 So, yeah, we're not seeing anything. I will tell you the SBA world, obviously, some of the smaller loans from individuals that, you know, bought four or five years ago or something, kind of halfway through it and have run their business for five years with a 5% interest rate now paying soon to be almost 11%. That's put some squeeze on them, but the SBA has a lot of programs and deferral services and things available to those folks. As Ken said earlier, if the Fed just stops moving the needle, I think everything will settle down in the SBA space as well as our general business and activity. We're not seeing anything whatsoever out there that's causing concern."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Thank you, guys, for taking my questions for the color. Appreciate it. All right. Appreciate it, Mike. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Next question will be from Brett Rabbitton at Hoverdy Group. Please go ahead, sir."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, guys. Good afternoon. Thanks for the questions. One of the first, Ken, I didn't quite get what you were intimating on the third quarter in terms of the margin relative to the dollars of NII. If I heard you correctly, it was you're expecting the margin of 15 to 20, but I thought I heard that you're expecting the NII to be a little lower and 3Q and then building back in 4Q? Was that the implication?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, let me clarify. We expect like loan yields, the overall loan portfolio yield to continue going up in the range of 15 to 20 basis points. But, you know, given the rate hike yesterday from the Fed and perhaps another one here on the horizon, we do expect deposit costs to continue to go up as well. You know, you look back in prior quarters and the pace of deposit costs is, you know, obviously it's outpaced the increase in loan and securities and cash income. And we expect that gap to narrow significantly in the third quarter. We still expect a little bit of compression on net interest margin and net interest income. And again, some of that is also just being driven by just carrying higher cash balance as well. But the pace of, I guess, decrease in NIM, the pace of increase in deposit costs will be down significantly from what we even saw in the second quarter."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. That makes more sense. And then wanted to ask on the fee income guidance, are you basically assuming that SBA is kind of flattish in the back half of the year? Because I know we had discussed, as you just mentioned, the payments. possibly adding fee income on the fintech side. Is there any guidance for the fintech fee income in the back half of the year?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I think we'll continue to see it increase. The dollar amount on a quarterly basis isn't huge yet, but it is growing. As we talked about As David mentioned, the recurring fees were up significantly quarter over quarter, and that is growing. It's going to be a much more meaningful contributor next year. On the SBA side, you know, I think we'll probably see a little bit higher than what we averaged here in the, or what we recorded in the second quarter, up a little bit there in both quarters. So I don't, does that help you?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, that's helpful. And then maybe just last one for me on the FinTech front still. I know we've talked about up to a billion-dollar deposit opportunity with FinTech relationships. Any update on that and kind of where you see the FinTech relationships playing out in the next year in terms of maybe both deposits and loans?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, on that side, the billion-dollar opportunity is still out here. One of the issues we're trying to negotiate on is the pricing for those deposits. As we're sitting here now, as Ken said, we sent over $100 million back in the last quarter, and we're sitting here since quarter end. Our cash balance has already increased almost $200 million since the end of the quarter. So all of a sudden, we're phenomenally cash-flush. So I don't want to make a commit on the other side taking a billion that's up at the Fed funds rate if we don't need to. So we're negotiating a little bit on price there, and we have other opportunities. We do have a couple of very, very strong lending programs that we're working on. One is heavy, heavy into due diligence that could come together by hopefully we're targeting have it through all the processes and ready to go by the end of August. The other one we're just kind of getting started on. It'll come on in the fourth quarter, but we hope early on in the fourth quarter to have a couple of really kind of brand name unicorn type opportunities that we can announce. One of the issues we have in the BAS game is we've got about seven or eight companies that were over the finish line. They're in testing and they're doing their work on their side. I think a couple of them have slowed down the launch, maybe in hesitation about their capital stack and how they can make it, or they're kind of readjusting the business side a little bit to make sure they don't fire something up and run out of cash. But we've got probably four or five startups that we've been setting on for several months that all kind of seem to be getting excited and some movement going on. intriguing part probably in the last 30 to 45 days we've seen by far and again the largest opportunities that have ever been presented to us some of them are individuals that are working with other financial institutions that they're afraid they're going to run into some regulatory issues or servicing issues that are looking for a new home we have a number of folks that are backing themselves up that are working with other banks and they want to kind of spread the risk so they're not in a situation if one institution gets sideways with a regulator, they're cut off overnight. I think the activity we've done with RTP and the FedNow program has kind of put a little bit of a spotlight on us for some of the real-time payment processing services that are coming. Big opportunity, and just had one presented to me Tuesday of this week that could really, really be intriguing, a new company coming up that's trying to get into tokenization on the UCC stuff. They're coming through the door on a weekly basis. Probably our biggest issue is trying to decide who to work with and who to pursue. But a lot of them are either bigger established programs or phenomenally well-funded unicorns that are coming out that are getting ready to launch. So the third and fourth quarter here is going to be a lot of fun on the BAS side."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. That's great. Appreciate the update there, and thanks for all the color."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Next question will be from Nathan Race at Piper Sandler. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yes. Hi, everyone. Good afternoon. Appreciate you taking the questions. Just curious in terms of kind of the margin expectations that you laid out for the balance of this year and kind of getting them back up to 190 by the fourth quarter of next year, what kind of deposit growth expectations are you layering into that outlook? And is the goal just to kind of keep the low deposit ratio kind of near the 2Q level, or do you guys anticipate kind of slowing growth and really stepping up on the deposit gathering side of things just to continue to bring down the net ratio?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I would tell you we're trying to actually kind of run a match book. Like I say, we're a little overflush on cash right now. But ideally with new deposits coming in, as I'm telling everybody, we have to have somewhere to put that out. And if we can get it out at, you know, if it's coming through the door, it was under 5. With the Fed bumping again, we'll get closer to that 5% range. If we can put it back out in the 8.5% to 9% range, we'll continue to do that. Nate, we're not going to, we're not, growing the balance sheet for the sake of growth by any means. We also have a lot of capacity with monthly repayments on the municipal and single tenant and stuff. We've got millions of dollars coming back in on a month-to-month basis that are probably yielding an average of 4% that we're putting back out in that 8-9 range. So we're semi-flat kind of from year end and looking through 24 on the overall asset side, but we're definitely changing up the mix internally. So, you know, we'll definitely be over $5 billion before the end of the year and probably stay somewhere in that $200 to $300 million in growth over the course of next year."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, great. And, Ken, I think you had mentioned that you have $100 million some in deposits or, I'm sorry, CDs maturing in the third quarter."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, 180 in the third quarter and over 260 million in the fourth."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. And I guess any color just in terms of the replacement costs of those CDs based on maybe your June spot rate or anything along those lines?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, the third quarter going out the door, Nate, the renewal and that, they're at a cost of 307 and it's coming in right now just right at 5%. And then the fourth quarter, the big note at 263, that's at 432, and it'll be covered with the CD in the range of that 495%. So that's another reason where our margins get a little bit better. Our CD book for probably the last 18, 24 months has been predominantly probably about a 10 to 11 month maturity rate. So as that number is now up we're sitting at 432 is going to be replaced by five versus the past quarter where we had 240 replaced by 480. that spread between them is getting thinner and thinner so that's what helps the overall our cost of funds won't increase at the rate that the loan yield is increasing so that's helping that margin turn around for us in the fourth quarter and early next year gotcha that's very helpful um"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Maybe one last one for me on just kind of the outlook for share repurchases. Obviously, you remained active in the quarter. Are there any kind of like guideposts that we should be thinking about in terms of kind of the appetite to remain active and just in light of what's remaining on the authorization?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I would tell you, yeah, we've got about 16 million or so left on the authorization side of things. One of the targets that we've kind of got internally, just to appease the marketplace, I guess, more so than anything else, is to try and keep the tangible common equity around that 7% figure. So to do that, there's a lot of things we can do. We can shrink the balance sheet. We can pull back on the cash. We can stop the share repurchase. I would tell you the appetite this past quarter where We bought 200,000 shares at an average cost of $1,352. If we were at that price, we'd be doing that all day, every day. When we're getting back into the 20s, and if we get back up towards the mid-20s, then we'll think twice about the amount that we're putting out and maybe hang on to a little bit, slow it down a hair to maintain capital. We don't want to I guess we just kind of have a soft target. And obviously, AOCI plays into that. There's a lot of factors that come into play on what it is. As Ken said, if we normalize cash and we did not have the AOCI charge against it, our TCE would be 8% plus. So it's one we're playing with internally. We still have powder, obviously. And if for some reason the shares start going south again, then we'll get back heavy into the market. I would guess we'll slow down this quarter over what we bought last quarter."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, that's great, Tyler. And just one last one. Any thoughts on the tax rate going forward?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, you know, I think right now with where earnings are, you know, we put into our forecasts, you know, maybe a 4% or 5% tax rate. But, you You know, as you look over, at least this quarter is a good example, right? We get a very strong benefit from the public finance portfolio. So probably while, you know, if earnings are kind of in the range where they are here for, you know, maybe, you know, this quarter, next quarter, you know, that tax rate is going to be low, if not a benefit. You know, looking forward to next year when we see rates rebound, you know, when we see earnings and revenue and earnings rebounding, you know, you're migrating back to closer to probably a 10 to 12 rate. But here in the near term, it's going to remain low, if not a benefit."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. That's very helpful. I appreciate all the color. Thank you, guys. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "The next question will be from John Rodas at Cheney. Please go ahead, sir."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good afternoon, guys."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, John."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, John. Hey. Ken, just back to your comment on the tax rate. So when you're talking about you threw out a $3 number for next year, are you using a 10% to 12% tax rate? Yeah, on that one we are, yes. Okay. And then... Again, sticking to the $3 for next year, what sort of, I know you said, David, you said $16 million remaining under their buyback, but what sort of share count or buyback activity are you assuming with that $3 number?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "None. None? None. In 2024. Okay. You can't have a book value by then, John, right?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "David, I own some stock personally, so that would be great. I would be very happy. We're both bucking for that one. Ken, on your comment about fee income for the second half of the year, $6 to $7 million. So kind of back of the envelope, I guess that would imply SBA for the year, maybe $19 to $20 million for this year. Where do you, you know, what sort of growth rate or, you know, where do you see that for next year, for 24?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, I think we're probably looking at, you know, overall, maybe overall non-interest income growth in the, you know, call it 15 to 20% with some of that coming from some growth in the BAS fees as well as growth in SBA."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, so... As far as if we look at non-interest income to total revenues, this quarter it was around 23%, give or take. So I would think if you're doing that sort of growth and given what the margin's doing and so forth, the income to total revenue is probably going to be, what, 25% to 30%, give or take, mid-20s to 30%?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "It's probably closer to mid to higher 20s. I mean, look, just repositioning the loan book with no increase in deposit costs is going to produce a nice increase in NII. I mean, we're forecasting NII to have some nice solid growth there. So that percentage probably ticks up a few percentage points, but it doesn't go to like 35%. Yeah. Okay."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. And then one other thing you said, I think on expenses for next year, you sort of said mid single digit growth, again, kind of getting towards that $3 number. yes okay we're next year yes yeah okay and then just circling back guys overall big picture credit quality you know you saw you know you you had the one issue last quarter this quarter looks you know more like what you guys have done in the past um any major concerns from a credit quality perspective i mean obviously for most banks still pretty much as good as it because as good as things can get but you know overall it looks like credit's pretty good for you guys"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, John, like I say, we might have a little bit of dust showing up in some of the older SBA loans, but they're small size, nothing huge. And on the commercial side of things, our portfolio is solid out there right now. We're not really seeing anything at all."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. And the single tenant lease portfolio, still feel good about that?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "That one's pristine. There's no delinquency. I think we only have... two units or three units that are dark and all of them have new tenants coming, it's been phenomenal. It's performing tremendously."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. Thank you, guys. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "The next question will be from George Sutton at Craig Hallam. Please go ahead, sir."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. David, you provided good perspective on your BAS plans going forward in terms of some of the new potential partnerships. With the success you've seen in the growth quarter over quarter, can you just talk about some of your existing partnerships, where that strength was coming from?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "The majority of it is coming to us through Increase, who is in the Treasury Prime area. We're doing a lot of activity with Dara and his team. We are bringing, we have officially finished testing and whatever, we have our first Treasury Prime client coming forward. Honestly, the one we talked about a couple months ago, real, real activity, we're fully engaged with RAMP on their payment services at the current time. And in the early stages, when we first signed with RAMP, we were doing a small number of states for them across the U.S., but we are now, I think, nationwide, and that volume is just going through the ceiling. So, by far, the biggest player that we have is the RAMP credit card program."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Super. And relative to FedNow, can you just walk through how this will wash through your business model as it rolls out?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, it's going to be interesting, George, to see how that comes about. We happened, they didn't want to send it out in a press release, but we actually wound up doing the very, very first transaction with FedNow with a credit union. Right now it's incoming only. They haven't opened the kind of payment side yet. That's to be done here very shortly. It'll be interesting to see how the Fed now competes with RTP or the real-time processing too. We actually have that channel up and running, and we are using that with a couple of our FinTech clients are testing that with us to do instantaneous payments. And they'll kind of compete with each other. It'll be interesting to see if the – logo of the Fed carries weight over RTP. You have to be determined. But the Fed's throwing a lot of muscle at it. They kept it on time. It's the first thing in my 20 years of trying to deal with the Federal Reserve, particularly in the tech space, that they got something to the finish line on time. So they don't want to get left behind by the rest of the world. So if they really throw some marketing muscle at it, it could be a really interesting program. And obviously everybody wants their money now. And if you can move money seamlessly between individuals and companies on a real-time basis and have it basically guaranteed, you've eliminated really the need for wire services on a day-to-day basis. So it's got a lot of just huge potential. And obviously the economics of it versus wires and play are much, much easier to work with as well."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great and one last question, and I will be the only analyst to hold to one last question when I say that very simple one. Ken what what percentage of your loan book is variable rate."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Today it's probably we're getting close to 15% today."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Perfect."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And as we grow, look, we're trying to get that closer to 25% and higher as we kind of remix the loan book."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, guys."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, George. Nice talking to you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. At this time, I would like to turn the call back over to Mr. Becker for closing remarks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Thank you, Sylvie. James Rattling Leafs, As I just like to thank you all for joining us today on the call we're looking forward to finishing up the rest of the year and going into 2024. James Rattling Leafs, We probably gave you a little more forward guidance than we have traditionally and I would like to say that is guidance for 2024 what you have. James Rattling Leafs, forecasted for us here in the third and fourth quarter is kind of we're laying in almost exactly on top of what you have out there, a couple are a little high couple little low but. your averages when we put you together, third and fourth quarter, we're going to be pretty close to what you have in the queue for us. And it really starts, if the Fed does call it quits here with one more raise after this one, we really start to see daylight at the end of the tunnel. So we're really excited about what the future has to offer us. Our balance sheet positioning combined with our expansion in the small business and the banking as a service will drive greater revenue growth combined with stabilized deposit costs next year. And that obviously comes to the bottom line in stronger earnings. So as fellow shareholders, John, we appreciate you being out there with us. We remain very committed to driving improved profitability and enhanced shareholder value. We thank you for your time and have a good afternoon."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, sir. Ladies and gentlemen, this does indeed conclude your conference call for today. Once again, thank you for attending. And at this time, would you ask that you please"
    }
]