[
    {
        "date": "2023-10-26T14:00:00-04:00"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good day, ladies and gentlemen, and welcome to the first Internet Bancorp Third Quarter 2023 earnings conference call. At this time, all lines are in listen-only mode. Following the presentation, we will conduct a question and answer session. If at any time during this call you require immediate assistance, please press star zero for the operator. This call is being recorded today, October 26, 2023. I will now like to turn the conference over to Larry Clark from Financial Profile, Inc. Please go ahead, Mr. Clark."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Sergio. Good day, everyone, and thank you for joining us to discuss First Internet Bank Corp's financial results for the third quarter of 2023. The company issued its earnings press release yesterday afternoon, and it's available on the company's website. In addition, the company has included a slide presentation that you can refer to during the call. You can also access these slides on the website. Joining us today from the management team are Chairman and CEO David Becker, and Executive Vice President and CFO, Ken Levin. David will provide an overview and Ken will discuss the financial results. Then we'll open up the call to your questions. Before we begin, I'd like to remind you that this conference call contains four looking statements with respect to the future performance and financial condition of First Internet Bank Corp that involve risks and uncertainties. Various factors could cause actual results to materially be different from any future results expressed or implied by such forward-looking statements. These factors are discussed in the company's SEC filings, which are available on the company's website. The company disclaims any obligation to update any forward-looking statements made during the call. Additionally, management may refer to non-GAAP measures, which are intended to supplement but not substitute for the most directly comparable GAAP measures. The press release, available on the website, contains the financial and other quantitative information to be discussed today, as well as the reconciliation of the GAAP to non-GAAP measures. This time, I'd like to turn the call over to David."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Larry. Good afternoon, everyone, and thanks for joining us today as we discuss our third quarter 2023 results. Starting with the highlights on slide three, I would like to discuss some key themes for the quarter. We generated strong deposit growth during the quarter, bolstering our liquidity profile and driving down our loan to deposit ratio below 92%. We also continued to transition the composition of our loan portfolio and optimize our overall balance sheet mix. As new origination yields were up 50 basis points from the second quarter to 8.92%, and they're up over 360 basis points from the third quarter of 2022. At the same time, both the pace of deposit cost increases and the rate of compression in our net interest margin were the slowest they've been in five quarters. Moreover, while one month does not make a trend, we were encouraged by the month-over-month increase in our net interest margin in September. Recognizing that macroeconomic and geopolitical factors remain outside of our control, we continue to believe that our net interest margin and overall net interest income have likely bottomed out and will follow an upward path from here. Another highlight for the quarter was our SBA team's continued outstanding performance. The team again posted its highest level of quarterly gain on sale revenue to date, which was up over 14% from the second quarter, driven primarily by a strong increase in the sold loan volume. Following our exit from the consumer mortgage business earlier this year, our mix in non-interest revenue has shifted from what was an over-reliance on the cyclicality of the low multiple mortgage business to what we believe is a more consistent, reliable, and growth-oriented revenue stream regardless of the interest rate environment in SBA. Our nationwide SBA team is doing a great job of providing growth capital to entrepreneurs and small business owners across the country. With year-to-date originations up 165%, over the first nine months of 2022. I am especially proud to announce that for the SBA's physical year ended September 30th, 2023, we were the ninth largest 7 program lender in the country. This is a notable increase from our ranking of 27th position in the prior physical year. We believe that the combination of our continued loan portfolio repositioning and consistent revenue growth from our SBA business positions as well for higher earnings and profitability as deposit costs stabilize. Our overall credit quality remains strong as non-performing loans to total loans declined to 16 basis points and non-performing assets to total assets declined to 12 basis points. Additionally, delinquencies 30 days or more were 22 basis points of total loans, while net charge-offs to average loans remained low at 16 basis points. And again, I would like to remind everyone that our exposure to office commercial real estate is less than 1% of our total loan balance and does not include any central business district exposure. Our capital levels remain sound with a common equity tier one capital ratio of 9.59% at quarter end. Our deposit growth resulted in carrying above average cash balances, which we think is prudent to do in the current environment. The impact of higher interest rates also contributed to an increase in the accumulated other comprehensive loss that runs through equity. These factors weighed on the tangible common equity ratio. However, our regulatory capital ratios at both the company and bank levels remain well above minimum requirements. Tangible common equity was also affected by our share repurchase activity, as we repurchased nearly 100,000 shares during the quarter. at an average price equating to less than half of our tangible book value per share. I would also like to point out that the prudent, conservative management of our investment portfolio and overall balance sheet has resulted in First Internet being among the few banks to have grown tangible book value per share, a key measure of shareholder value creation from the start of this historic cycle of interest rate hikes at the beginning of last year through the end of the most recent quarter. Now turning to our financial and operating results for the third quarter of 2023, we reported net income of $3.4 million and diluted earnings per share of 39 cents. Despite higher funding costs, total revenue was $24.8 million, up from $24 million in the second quarter as the growth in SBA revenue helped to offset a decline in net interest income. Additionally, operating expenses were in line, With our expectations, given the strong origination and activity at SBA, and our non-interest expense to average assets was relatively flat at 1.53%. We produced a healthy 9.6% annualized rate of overall loan growth, with gains in franchise finance, construction, small business lending, and consumer. These were offset partially by declines in public finance, health care finance, single tenant lease financing, and investor commercial real estate. As a reminder, the shift in loan mix is the result of a strategic initiative to focus on variable rate, higher yielding products during a historic, rapidly rising interest rate. Our construction team had another strong quarter, originating almost 180 million in new commitments and producing growth of nearly 60 million in funded balances. At quarter end, total non-unfunded commitments in our construction line of business increased to $527 million, leaving us well-positioned to continue shifting the composition of the loan portfolio towards higher-yielding variable rate loans. Our consumer lending team also had another solid quarter as the trailers, recreational vehicles, and other consumer loan portfolios were up on a combined basis over $17 million. We remain focused on high-quality borrowers and continue to obtain rates on new production in the mid-8% range. The in these portfolios remain low, as well, at just one basis point. And lastly, I want to provide an update on our banking as a service and FinTech partnership initiatives. In the third quarter, we announced a new relationship with JARIS, a leading financial technology provider of fully managed commercial financial solutions for small businesses. Initially, we will provide loan origination services for a large portion of their short-term working capital lending product offered to the client base. We are very impressed with the JARIS team and excited about the opportunity. This partnership will enable us to further increase our goal of providing small business owners and entrepreneurs access to capital while maintaining the highest compliance and credit quality standards. It is emblematic of the potential we see for banks and fintechs to partner for positive customer outcomes. In conclusion, our third quarter results provide us with optimism regarding the outlook for our business. From a safety and soundness perspective, liquidity and credit quality remain very strong and capital levels are sound. With the Federal Reserve rate hikes likely nearing an end, we expect to see a continued decline in the pace of deposit cost increases and eventually stabilization. This, combined with the strong performance of our SBA team and the continued improvement in our loan product portfolio composition, leaves us well positioned to achieve higher earnings and profitability as we look to 2024 and beyond. With that, I'd like to turn the call over to Ken for more details of our financial results for the quarter."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, David. Now turning to slide four, David covered the highlights for the quarter from a lending perspective, so I will just provide some additional color. Consistent with our focus on variable rate and higher yielding asset classes, we were pleased that our third quarter funded portfolio origination yields continued to increase from the second quarter. Because of the fixed rate nature of some of our larger portfolios, there is a lagging impact of the higher origination yields on the overall loan portfolio. However, as new origination yields have been consistently higher throughout 2023, we expect the overall loan yield to continue to increase in future periods. Our SBA, construction, and franchise finance channels continue to have very strong pipelines. There is one caveat to our outlook on loan pipelines that I will speak to in a little more detail later, that being the possibility of a government shutdown in November and the potential impact on the SBA pipeline. As David just said moments ago, some macroeconomic and geopolitical factors remain outside of our control. If we avert a shutdown, and similar to what we accomplished in the second and third quarters, our goal is to fund a portion of this production using cash flows from other portfolios as we continue to rebalance and optimize the composition of the total loan portfolio. Moving on to deposits on slides five through seven, deposit balances continue to increase and we're up $229 million or 6% from the end of the second quarter. The majority of the deposit growth during the quarter came from CDs with strong demand from consumers and small business. We originated $428 million in new production and renewals during the quarter at an average cost of 5.14% and a weighted average term of 15 months. These were partially offset by maturities of $180 million with an average cost of 3.07%. Looking forward, we have $276 million of CDs maturing in the fourth quarter with an average cost of 4.34% and $459 million maturing in the first quarter of 2024 with an average cost of 4.62%. So you can see the repricing gap between the cost of new CDs and the cost of maturing CDs is closing, which will contribute significantly to the continued pace of slowing deposit costs. Non-maturity deposits were down slightly at quarter end as declines in interest bearing checking and money market balances were offset by an increase in banking as a service deposits driven by higher payments volume. Deposits from our banking as a service partners were up 5% from the second quarter and totaled $162 million at quarter end. Additionally, these partners generated over $3.4 billion in payments volume, which was up 16% from the volume we processed in the second quarter. From a revenue perspective, total banking as a service fees were up 24% quarter over quarter, with the large majority of the increase consisting of recurring oversight and transaction fees. Additionally, broker deposits decreased $12 million from the end of the second quarter as a contractual relationship matured early in the quarter, and we continued to reduce higher cost portions of our deposit base. As a result of all the deposit and interest rate activity during the third quarter, the cost of our interest-bearing deposits increased by 34 basis points from the second quarter, which, as David mentioned, is the slowest pace of growth over the last five quarters. In addition to the large volume of CDs maturing over the next two quarters, we also have about $75 million of broker deposits maturing in the fourth quarter with a weighted average cost of almost 5%. Part of our strategy in driving deposit growth earlier in the third quarter was to get in front of the July Fed rate hike and lock in lower costs to replace the outflows from maturing deposits while still maintaining more than adequate liquidity. As I mentioned earlier, the weighted cost of new CDs during the third quarter was 5.14%, whereas the market is now pricing 12- to 24-month CDs between 5.6% and 6%. While we expect a certain percentage of maturing consumer and small business CDs to renew, we are not competitive in pricing in the institutional and public funds markets. When combined with the broker deposit maturities, We do expect deposit and cash balances to be lower at the end of the year, which should have the added benefit of relieving some pressure on both our capital ratios and our net interest margin. Looking at slide six, at quarter end, we estimate that our uninsured deposit balances were $948 million, or 23% of total deposits, down slightly from 24% at the end of the second quarter. The decrease was driven primarily by the new CD production, which generally consisted of balances below the insured limit. As a reminder, included in the uninsured balance total are Indiana-based municipal deposits, which are insured by the Indiana Board for Depositories and neither require collateral nor are reported as preferred deposits on the bank's call report. as well as certain larger balance accounts under contractual agreements that only allow withdrawal under certain conditions. After adjusting for these types of deposits, our adjusted uninsured balances dropped to $704 million, or 17% of total deposits, comparing favorably relative to the rest of the industry. Moving to slide seven, at quarter end, total liquidity remains very strong as we had cash and unused borrowing capacity of $1.7 billion. Our unused borrowing capacity increased during the quarter as we pledged additional collateral to the Federal Reserve. With the deposit growth over the course of the quarter, cash balances increased over $55 million. Furthermore, our loans to deposits ratio declined to 91.5%. At quarter end, our cash and unused borrowing capacity represents 182% of total uninsured deposits and 244% of adjusted uninsured deposits. Turning to slides eight and nine, net interest income for the quarter was $17.4 million and $18.6 million on a fully taxable equivalent basis, down 4.2% and 4.4% respectively from the second quarter. The yield on average interest earning assets increased to 5.02% from 4.89% in the linked quarter due primarily to a 29 basis point increase in the yield earned on other earning assets, a nine basis point increase in the average loan yield, and a 20 basis point increase in the yield earned on securities. The higher yields on interest earning assets combined with growth in average loan and cash balances produce strong top line growth in interest income, increasing over 8% compared to the linked quarter. While deposit costs continue to rise, Again, the pace of increase was the slowest in the past five quarters, and as a result, net interest income contraction was also the lowest in the past five quarters and in line with our expectations. We reported a net interest margin of 1.39 percent in the third quarter, a decrease of 14 basis points from the second quarter. Fully taxable equivalent net interest margin for the quarter was 1.49 percent, down 15 basis points from the prior quarter. We estimate the higher cash balances we carry during the quarter negatively impacted net interest margin by 10 to 12 basis points. The net interest margin roll forward on slide nine highlights the drivers of change in fully taxable equivalent net interest margin during the quarter. Similar to this quarter, with higher price new loan originations and variable rate assets repriced higher for an entire quarter, we believe that we will deliver another increase in total interest income for the quarter. Currently, we expect the yield on the loan portfolio to be up around 20 to 25 basis points for the fourth quarter. Furthermore, with short-term interest rates stabilizing and the repricing gap in CDs expected to narrow, we anticipate only a modest increase in interest-bearing deposit costs. With these expectations combined with our forecast for a smaller balance sheet by year end, and with the acknowledgement that some macroeconomic factors remain outside of our control, we continue to believe that the third quarter will represent the inflection point for net interest income and net interest margin, consistent with our comments from last quarter's call. Turning to non-interest income on slide 10, non-interest income for the quarter was $7.4 million, up $1.5 million from the second quarter. Gain on sale of loans totaled $5.6 million for the quarter, up 14% over the second quarter, and consisted entirely of gain on sales of U.S. Small Business Administration 7A guaranteed loans. Our SBA team continued its track record of growth as sold loan volume increased 22% quarter over quarter, which was partially offset as net premiums were down 38 basis points. Furthermore, the growth in our SBA business has resulted in a servicing portfolio approaching $500 million, which produced $800,000 of net servicing revenue during the quarter. Additionally, other income was up $500,000 from the linked quarter due primarily to distributions from fund investments. Looking at the bar chart of quarterly non-interest income, you can see that with the growth in our SBA business over the last several quarters, we have effectively backfilled and even exceeded any potential gap in revenue from exiting the mortgage business. Moving to slide 11, non-interest expense for the quarter was $19.8 million, up $1.1 million from the second quarter. The majority of the increase was in salaries and employee benefits due primarily to higher benefit plan costs, as well as higher incentive compensation related to SBA and construction lending. Loan expenses were up due mostly to higher third-party loan servicing fees and other miscellaneous lending costs. Data processing costs increased primarily because of variable deposit account opening costs driven by the significant deposit growth earlier in the quarter. These increases were partially offset by declines in several other expense categories. Turning to asset quality on slide 12. David covered the major components of asset quality for the quarter in his comments. I will just add some color around the provision and the allowance for credit losses. The provision for credit losses in the third quarter was $1.9 million compared to $1.7 million in the second quarter. The provision for the third quarter reflects net charge-off activity during the quarter, additional specific reserves, and an increase in the reserve for unfunded commitments partially offset by the positive impact of economic forecasts on loss rates and qualitative factors related to the allowance for credit losses for certain portfolios. The allowance for credit losses as a percentage of total loans was 98 basis points as of September 30th compared to 99 basis points as of June 30th. The decrease in the allowance for credit losses reflects the impact of certain economic data on forecasted loss rates and adjustments to qualitative factors on certain portfolios mentioned earlier, partially offset by higher coverage ratios in the CNI and SBA portfolios and additional specific reserves. If you exclude the balances and reserves on our public finance and residential mortgage portfolios, which have modest coverage ratios given their lower inherent risk, the allowance for credit losses represented 1.17 percent of loan balances. Additionally, with minimal office exposure, we do not have the excess reserves around that asset class that many other banks have. With respect to capital, as shown on slide 13, our overall capital levels at both the company and the bank remain solid. The tangible common equity ratio declined 43 basis points to 6.64 percent. This was due to a combination of factors. First, like many other banks have experienced this quarter, our accumulated other comprehensive loss grew as interest rates increased at quarter end. Second, we continued to repurchase shares throughout the quarter. And third, as David mentioned earlier, the tangible common equity ratio was impacted by deposit growth during the quarter and maintaining elevated cash balances. If you exclude accumulated other comprehensive loss and adjust for normalized cash balances of $300 million, The adjusted tangible common equity ratio would be 7.77%. However, we do expect the balance sheet to shrink in the fourth quarter due to a decline in deposits and cash, which will have a beneficial impact on the tangible common equity ratio. From a regulatory capital perspective, the common equity Tier 1 capital ratio remains solid at 9.59%. During the quarter, we repurchased over 97,000 shares of our common stock at an average price of $18.29 per share as part of our authorized stock repurchase program. In total, we have repurchased almost $41 million of stock under our authorized programs since November of 2021. At quarter end, tangible book value per share was $39.57, which is up over 3% on a year-over-year basis. Before I wrap up my comments, I'd like to provide some additional comments on components of forward earnings. With regard to non-interest income, as our SBA team continues to grow and deliver consistently higher origination activity, we expect non-interest income to be in the range of $6.5 million to $7 million in the fourth quarter. However, two factors may affect our forecast. First, if the government shuts down in mid-November for an extended period of time, sales of SBA loans and the origination of new SBA loans will be halted. And second, if we see a continued softening and gain on sale premiums, it may make economic sense to hold a loan yielding 11% or more versus selling for a premium far below the annual spread income we would earn. In connection with the continued increase in the level of SBA originations and additional back office personnel to support the increase, We do expect compensation expense to increase as well. Therefore, we now expect total non-interest expense to be in the range of $20 million to $21 million for the fourth quarter. Looking toward the future, it is undeniable that there are macroeconomic and geopolitical forces beyond our control. Yet we maintain confidence in our stalwart foundation remains firmly intact. Overall asset quality is sound. Our capital position is strong. Our teams are focused. We believe we are well positioned to improve our earnings and profitability profile as funding costs stabilize. With that, I'll turn it back to the operator so we can take your questions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Ladies and gentlemen, we will now begin the question and answer session. Should you have a question, please press star 1. If you want to withdraw your question, please press star 2. Your questions will be pulled in the order they are received. If you are using a speakerphone, please lift the handset before pressing any keys. One moment, please, for your first question. Your first question comes from Nathan Reyes from Piper Sandler. Please go ahead. Nathan Reyes Yes."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, guys. Good afternoon. Thank you for taking the questions. I want to clarify the margin outlook for the fourth quarter. I appreciate the guidance for loan yields. I think it was 20, 25 basis points versus the third quarter. But it sounds like, you know, the margin pressure is going to continue, but should slow versus the pace of pressure from two Q into three Q. And then, you know, with the Fed remain on pause, hopefully we get some stability, if not expansion starting early next year. Is that the right way to think about the trajectory?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yes. I mean, as I said, we think the inflection point is the third quarter. We continue to optimize the loan book and pick up more yield there. I think with regards to deposit costs, especially with the CD repricing gap narrowing, and frankly, a lot of our deposits really tied to direct moves in Fed funds. I mean, we do not forecast you know, deposit costs really increasing all that significantly in the fourth quarter. And again, notwithstanding forces outside our control, we expect, you know, net interest income, net interest margin to be up in the fourth quarter."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, you're spot on, Nate, if the Fed, and that is predicated on the Fed not bumping anything here in November, which indications are they're going to stay the course. So, We got a shot. If you go back, as Ken made the comment, the excess cash on the balance sheet, as that rolls off here this quarter, we think that will get us back in that positive vein. If we had not had the excess cash in the third quarter, we'd only had a compression on them of three hundredths of a point, so three basis points. So I think I agree with Ken. I think we've hit rock bottom on that compression and should start to see it expand here in the fourth quarter."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And within that context, it sounds like, you know, the pipelines are in pretty good shape, you know, and loan growth should pick up in the fourth quarter. I apologize if you guys alluded to this earlier, but just in terms of what are loan growth expectations for the fourth quarter and perhaps even looking out to 2024 as well."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I mean, I think we'll probably continue to see loan growth in the fourth quarter similar to what we saw in the third quarter, maybe a little bit more. And, you know, again, to remind folks that we are, some of our longer term fixed rate portfolios, we're kind of letting some of those really cash flow off and just replacing the, just replacing those balances with SBA franchise construction. So we're obviously going to be able to pick up yield and optimize the portfolio. But fourth quarter, probably similar to a bit more than the third quarter. And looking into next year, some of the loan growth within individual line items will be pretty strong. But again, those will be offset by declines in others. So it could be mid single digit growth or mid to high single digit growth next year."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "The one caveat that could change that, as we were just talking a minute ago, Nate, is if the SBA either stops and we're prohibited from selling, we do have a strong pipeline of loans here in the queue that will get closed here in the fourth quarter. If we put those on the balance sheet, then that growth percentage is going to blow up pretty quickly. But as Ken said, we're probably looking at 2% to 3% per quarter of loan growth going forward for the fourth quarter here as well as per quarter through 2024."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And that's not annualized growth per quarter?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Annualized would be at about 9 to 10 percent."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah. Right, right, right."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Two to three per quarter annualized around 10."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. Yeah. Just clarifying there. And the expectation, obviously you guys did a great job of growing deposits in the third quarter. Is the expectation that based on what you're seeing in terms of new client wins and just where your pricing is across your products that deposit growth can largely keep pace with loans going forward?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, we think it'll keep pace with loans. We'll actually see a little shrinkage here when some of the CDs roll off. One of the things we didn't talk about in the call, but During the third quarter in particular, we rolled out some really nice features as add-ons to our small business checking accounts. We now have a forward-looking cash forecast for them built into the product, as well as automated cash sweeps that they want to keep ex-balance in a checking account to move the rest to a money market. It'll move both ways. They just set a balance at the end of the day. We're really getting some good traction on that small business checking account. We won an award last year of being one of the best in the country. And with the new features, we got a really nice new automated tool on the front end to help with the opening process. So, yeah, that volume is picking up and that's by far the cheapest funds that we have in the institution. So, yeah, continued growth there. We're doing real well with the consumer. you know, kind of post-COVID small businesses and consumers learn that they really don't need to have that traditional bank. And our pricing and products are much better than the normal community banks. So we're seeing nice pickup without a real ton of advertising and expense to go with it. And it's really worked well for us."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Gotcha. If I could just ask a couple last questions on credit quality. You know, particularly curious on the franchise growth. I mean, that's been, you know, really impressive over the last year or so, you know, balances up, you know, around 100%. Just curious, you know, in terms of underlying credit quality there, you know, we've seen some issues within the franchise space thus far in earnings season. So just curious what you guys are seeing there in terms of any criticized migration and just kind of how comfortable you guys are growing that portfolio to a certain level going forward."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I mean, historically, I mean, to date, we've had 300,000 of charge-offs to date. We've had pretty good credit quality. I think, you know, it'll probably over time, there probably will be some charge-offs there. But so far, I mean, to date, delinquencies have been very low. Continue to stay on top of it and monitor the portfolio. But I think probably like small business, there may be some"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Pop-ups here and there but I don't think there's any you know from our perspective There's no systemic real issues with the franchise to date I actually set in on the credit committee meeting this morning and our we had one account that was over 30 days and We got to check in this morning that took them off the delinquency list if it clears we should end the month here with absolutely no delinquency in that portfolio so as Ken said in historically Apple Pie has been around 10, 12, 13 years. Historically, they haven't had about a 1.6% loss ratio. But so far, we're doing well."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. Great to hear. And then just lastly, in terms of the charge officer's court, how much of it was related to the, I think it was a Bank Alliance loan that we've been talking about the last couple quarters versus just kind of the small number of SBA loans that were called out in the press release?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "You know what, the Bank Alliance deal was a couple quarters ago. We did have really, really the charge offs can be boiled down into two components. One piece of it being, you know, a handful of smaller SBA loans. And then we did have the, we did charge off, we were a participant in a deal and the lead bank put the loan, pooled it as part of a larger pool of loan sales And we worked with them on that, but we had to take a small charge as the sale price was less than the carrying value. Got it."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So the C&I loan charge also in the third quarter was separate?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, but it was not, to be clear, it had nothing to do with the Bank Alliance deal from earlier this year."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got you. from what you're seeing across portfolio today, imagine it's fair to maybe expect some moderation charge-off levels going forward?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, it's an intriguing time. The bump up in interest rates, particularly on some of the older SBA loans that when we bought that first Colorado portfolio, again, we discussed two or three in credit this morning that are getting deferments from the sba world that'll hopefully help them through the crunch but we have people there that were at three percent from the beginning days of their loan that are now paying 11 and a half to 12 and it is just putting the squeeze on them but uh nothing systemic no uh particular vertical uh in the lending area that's a problem and i think we'll continue to see some of these one-off things but stabilization and bumping the rates will help immensely No question about it. And if at some point in 24 we start to see them go down, we'll be in great shape. The SBA does have a lot of tools to help some of these smaller guys to go to an interest-only basis to actually give a total payment deferment for 60, 90 days up to six months in some cases. So we're playing by the rules. And as I said, credit committee this morning, numbers are still down over what we finished at quarter end. looking good, but who knows what might pop out."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. Makes sense. I appreciate the color. Thank you, guys. I'll step back."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Nate."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Your next question comes from Mike Burrito from KBW. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi. This is Mike's associate, Andrew, filling in. Thanks for taking my questions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I just wanted to start off here. I was wondering if you could give some more color on the BAS space. I know you commented on that new partnership you launched. I was just kind of wondering what's the appetite look like for new partnerships and like what kind of maybe revenue expectations can we see from some of the new partners you've on board in the last few quarters?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, I was actually at the Money 2020 on Tuesday. I heard that's where Mike's out there kind of running around as well. We had great meetings out there with all of our partners from Increase to Treasury Prime. We saw actually probably half a dozen of the fintech companies that we're working with most importantly spent a fair amount of time with Jairus. So it's looking good. Everything takes always a little longer than you think it's going to to get things up and live. But as Ken said in his comments, we had a nice boost up in deposits. The payment services side, we're processing over a billion dollars a month in payments and still continuing to grow quite significantly month over month. JARIS, I was hoping to have them live here kind of mid-month in October. We've got a couple T's to cross and I's to dot. We should be live by month end, early November at the latest. So everything's positive. We have a number of folks that we've been completing due diligence that are live and to pilot programs and are actually opening real accounts with real customer, ANSA, ALSA. So it's First quarter next year, it should be really, really strong. And hopefully, we'll get a couple over the finish line and turn up some volume here in December. Obviously, the credit card world shuts down, I think, this year. The blackout date is November 10th. So we're pressing real hard to get a couple through final due diligence in order to get their credit card systems moved and repointed in our direction. before November 10th. So if that doesn't happen, then it goes into mid-January before they reopen. But not a tremendous amount of impact here in the fourth quarter, but I think first quarter next year will make as much as we did in the whole calendar year here of 2023. Great."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "That sounds amazing. I appreciate the update. Maybe just jumping around a bit here. Could you provide a little color, maybe around the ROA, kind of what's a reasonable target there for 2024 or kind of what the expectation is as some of these initiatives kind of pull through?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I mean, I think as we, you know, look into, I mean, I think we feel good about what next quarter looks like. And I think over the quarter of, over the course of next year, in terms of like NII, we should continue to see gradual improvement quarter by quarter in terms of NIM improvement and NII improvement. We expect the SBA team to continue to grow next year as well. David talked about the BAS initiatives and the revenue opportunities there. So, I mean, I think we're You know, look, it'll be a little bit lighter in the front end of the year, probably similar to fourth quarter, probably a little bit better than fourth quarter, maybe, you know, in the mid-40 basis point of ROA. But I think by the end of the year, by fourth quarter, we're looking to be back up north of 80 and perhaps closer to 90 basis points."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Appreciate that. And then just last question for me, and then I'll hop back. Any room for buybacks to accelerate here? I know there's some good activity there in the third quarter, but maybe just is there any acceleration here in fourth quarter and then into 24?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "One of the things that we're focused on, and we know the outside world pays a lot of attention to it, is the TCE. We fell under seven. Our goal is to get us back above seven. At the current time, at the price, we really can't be out of the market. on share repurchase, but we're diligently paying attention to that 7%. If by chance the Fed does nothing and the long-term rates come back and ALCI drops down, yeah, we'll stay in actively purchasing. I think we'll do something. I doubt that we're going to expand much over what we did last quarter, particularly hopefully the share price continues to climb as well as our numbers are getting better. But when we're trading 30, 40, 50% above, we can't afford not to purchase shares back. But it'll be a balancing act, really kind of keeping an eye on TCE as well as the price of the shares. So we're in the market. We'll stay in the market. But it won't be probably as aggressive as we were in the first half of the year. But we'll stay out there."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great, thank you. That's all for me. I appreciate all the color."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great, thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Your next question comes from George Sutton from Tech Column. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. David, you mentioned in your script that you've grown to be the ninth largest SBA player. What is your goal? What is the governor to your growth? How much more can you expand in that area?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "George, we really don't have any limitation out here. I think we're going to finish this year at about 380. My guys will be beating on me here, but we haven't forecasted for 440, 450. I think they got a real shot at 500 next year. And you're going to be hearing phones drop all over the office here, the folks that are listening in on the call. But I wouldn't be surprised to see us get pretty close to 500 million next year. As long as we're selling 75%, the insured portion, and getting a good return on that, we're in great shape. I would say we could run up to probably a billion on our internal portfolio, and 25 cents on the dollar, that gives us a lot, a lot of room for new production. So if we start bucking them and holding them on the balance sheet, that could slow down the gross number a little bit, but it's As Ken said a couple minutes ago, we're getting an 11.5%, 12% yield versus a 5% or something on the purchase side. It makes sense to hang on the balance sheet. But anything less than a billion, we have no qualms whatsoever in keeping it going."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And I wanted to make sure that I understood the 11% opportunity in terms of what Because you were couching it in the sense that the government could shut down and I think therefore would hold more. Was I hearing that correctly? Or what would motivate you to increase the amount that you're holding?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "If the government closes, we'll hold the assets because we can't sell them in the secondary market if the government's not there to make the transfer. So we'll hang on to them. That could reopen. If they're down for a couple days, it'll reopen in a week to 10 days at to get the machine oiled and back running. If they're down for 24 hours, they're going to come right back. So might put a little lag in there. The return, as Ken said, and I'm going to blow this up, so you can go back and fact check me, but we grew the sales by 20%, but the actual sales yield we got was down 30% over the last quarter. If that continues to decline, if the market is saturated, A lot of banks across the country are not buying assets or boosting their balance sheet. So if the market falls off and I can only get a 5% or 6% purchase price, why would I sell an 11.5%, 12% asset? Because I'll make that back up in 12 months. So it's really two focuses. Government shutdown could slow it down, as well as if the yields in the secondary market continues to soften. We'll just keep them on the balance sheet."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Perfect. That's it for me. Thanks, sir."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Nice to hear from you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Your next question comes from Joan Rodis from Janie. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "That was close. Hey, good afternoon, guys. Hey, John. Hi, John. How are you, buddy? Good. Good. Good, David. Ken, maybe just circling back to the margin. I think last quarter you talked about by the fourth quarter of next year, the margin could sort of be 190 to 195. Do you still think that's possible?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I think there's a pathway there. I mean, certainly into the 180-ish range and the upper bound of that. But yeah, I think we still feel good about that outlook."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, okay. And again, you feel like the third quarter was sort of the inflection for the margin and net interest income dollars."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "That's how we feel right now. Again, you know, the caveat of things that are out of our control. But right now, at least with our forecasts and what we saw, I think, as David said in his comments, we were – We probably hit bottom in July and August in terms on a monthly basis. And in September, we had a nice, nice rebound there. So the trajectory is already going up."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Interest expense actually dropped September over August by over $400,000. In portion, some higher cost funds walked out and we shrunk cash just a little bit. But we really are leveling off in this. When our peers are out here at 30, 40 basis points on CDs, having to buy in today's market for 400 plus, as Ken said, our CD average out here now, what's coming up for renewal is in a 440, 450 range. And if we pick them up at 490 at 30 basis point move to us, it's going to be non-existent. So we really, really do think we've hit the bottom of the barrel on NIM compression."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, good. Ken, maybe just two other things. On expenses, you upped the target $20 to $21 million. Would you still expect for next year sort of mid-single-digit growth off of, I guess, the fourth quarter level?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, that's about right."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And then also on the fee income side, I think last quarter you talked about growth of 15% to 20% next year, is that still sort of a good ballpark figure?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "If they hit my $500 million number I just threw out, it's going to be better than that."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I'd rather see you under-promise than over-deliver, David."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Then book in the 440 that they're telling me, and you'll be okay."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I think you're okay with that assumption, John."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, guys, thank you. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Appreciate it. John, sorry I missed your show, buddy. I had a conflict I couldn't get out of, but I'm sure Ken and Nicole did a great job. No problem at all. All right. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Your next question comes from Brett Raviting from Havdi Group. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, guys. Good afternoon. Thanks for the questions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "One is a good question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Wanted to go back to the loan yields, and you talked about 20 to 25 basis points of improvement in the fourth quarter. They were up nine basis points in 3Q. Can you talk about the loans that matured, 3Q versus 4Q, and then maybe if you have a maturity schedule for 24 out of the fixed bucket?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I think the loan yield, some of it is just timing of funding. You know, the opportunity for us on the loan book is, again, we continue to let some of the lower stuff come off. And we did have, we had good quarter over quarter growth in construction, but the timing of that was probably a little bit more weighted on the back end of the quarter. So that impacted the yields a little bit. in terms of for the quarter. And then we had good production in franchise for the quarter. That sets us up for a good starting point for the fourth quarter. And obviously the SBA balances were up as well. So I just think with some of the production perhaps being a little bit more weighted in the back end of the third quarter, it sets us up really good for the fourth quarter in terms of loan yield improvement. You know, I guess looking over the course of the next, let's just call it the next 18 months, in terms of, you know, our variable rate loans are about 20% of our loan portfolio today. And then when you take into account what's going to mature and also pay down in our fixed loan portfolio, I mean, we're probably looking at almost, you know, $1.1 billion or so, about 30% of the loan book that's going to turn over between now and the end of 2024. So that's, you know, that's, you know, for us, a lot of the loans aren't necessarily renewals. They just mature and they're replaced with new loans or new borrowers. But as we as we remix and optimize the competition, we're going to see a lot of good loan repricing and and loan replacement, if you will, over the next 15 months."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "A lot of our municipal portfolio also, Brett, has semiannual payments on it, so we get a big bump in June, and we also get a big bump in December. We've got, I think, this quarter, 20 million plus in repayment on the municipal loans, and that's the 2.5%, 3.5%, 4% paper, so that'll help as well."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, that's helpful. And then you guys talk about some of the CDs that are coming off the books, and those rates versus the market CD rates that you're seeing, you know, obviously in the five handle 5.6%, where are you guys pricing CDs today? And how does that contrast to the CDs that are rolling off the book here in the fourth quarter?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Right now we're priced in that six to 12 month range in the upper fours. And what's going to be rolling off is going to be, uh, on the commercial side, it's going to be about five and a half. And, uh, On the consumer side, it's about 512, 514. So we should pick up 40, 50 basis points. And plus, we hope to reduce the outstanding cash. A lot of that's going to roll during December. We have over 157 million, I think, coming up for maturity in the month of December. And we'll probably see about half of that go away. So it's late in the quarter, but it should still have an impact on our interest expense."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. And then just lastly, the DDA growth this quarter, can you talk about that and if that's the start of a trend or if that was a function of particular clients or business?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, most of that growth in interest-bearing demand is actually BAS deposits, which we've been continuing to grow. you know, obviously over the last, you know, two to three quarters. But most of that growth is bass within that category."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. What about the non-interest bearing piece, Ken?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "The non-interest, you know, non-interest bearing, sometimes that can be a little bit volatile. Some of the, there can be some big balances that impact that because a lot of times in our construction business, You know, when the sponsor, the borrower, puts equity into the deal up front, they'll put that into a non-interest bearing balance here, and then that gets drawn down. But as we do more construction, it'll go up. So that's probably the biggest piece of any quarter-to-quarter movement in that line item."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "We also have some municipal states that, like the city of Fishers here, come mid-November, they'll have a big pop when they get property taxes in. And that'll set in a non-interest account for 30, 60 days until they get it reallocated. So there's some seasonality in some of our municipal deposits."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. All really helpful. Thanks so much."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Appreciate it, sir. Thank you. See you next week."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "See you next week. That's right."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "There are no further questions at this time. I'll hand it back to David Becker for closing remarks. Mr. Becker, you may proceed."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Sergio, and thanks, everybody, for joining us on today's call. As we look forward to 24 and beyond, we remain extremely excited about the future and the opportunities here. Strong performance in the commercial and consumer lending teams, including our growth in the small business construction lending and further growth opportunities with the FinTech partnerships and banking as a service are expected to drive greater revenue growth, which combined with stabilized deposit costs, we believe will translate into the stronger earnings and the increased NIM over the course of the next year. As fellow shareholders, we remain committed to driving improved profitability and enhanced shareholder value, and we certainly thank you for your time today and have a good afternoon. We appreciate it. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Ladies and gentlemen, this concludes your conference call for today. We thank you for participating and ask that you please disconnect your lines. Thank you."
    }
]