[
    {
        "date": "2022-04-21T12:00:00-04:00"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hello, all, and a warm welcome to the first Internet Bank Corp conference call for the first quarter of 2022. If you'd like to ask a question at the end of the presentation, you may do so by pressing star followed by one on your telephone keypad. Please note that today's event is being recorded. I would now like to turn the conference over to Larry Clark from Financial Profiles, Inc. Please go ahead, Mr. Clark."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Lydia. Good day, everyone, and thank you for joining us to discuss First Internet Bancorp's financial results for the first quarter of 2022. The company issued its earnings press release yesterday afternoon, and it's available on the company's website at www.firstinternetbancorp.com. In addition, the company's included a slide presentation that you can refer to during the call. You can also access these slides on the website. Joining us today from the management team are Chairman and CEO David Becker and Executive Vice President and CFO Ken Lovick. David will provide an overview and Ken will discuss the financial results. Then we'll open up the call to your questions. Before we begin, I'd like to remind you that this call contains forward-looking statements with respect to the future performance and financial condition of First Internet Bancorp that involve risks and uncertainties. Various factors could cause actual results to be materially different from any future results expressed or implied by such forward-looking statements. These factors are discussed in the company's SEC filings, which are available on the company's website. The company disclaims any obligation to update any forward-looking statements made during the call. Additionally, management may refer to non-GAAP measures, which are intended to supplement but not substitute the most directly comparable GAAP measures. The press release available on the website contains the financial and other quantitative information to be discussed today, as well as the reconciliation of the GAAP to non-GAAP measures. At this time, I'd like to turn the call over to David."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Larry. Good afternoon, everyone, and thanks for joining us today. We are off to a strong start in 2022, but before I get into the details of our results from this past quarter, I would like to provide an update on our strategic initiatives that we expect will have a meaningful impact on our future results. We are still waiting on certain regulatory approvals required to complete the acquisition of First Century that we announced on November 2nd. We hope that closing can occur next month. We are in discussions with First Century to extend our outside date to close the transactions. Over the past quarter, we began delivering on our objective to provide banking as a service to FinTech companies. We expect those relationships to translate into a combination of low-cost deposits and non-interest income for us. In the first quarter, we entered into a relationship that has thus far generated $50 million of new deposits at a fixed cost of only 20 basis points, which is well below our average cost of funds. The FinTech channel has special appeal to us primarily because as a branchless bank launched pre-2000, we see ourselves as an early fintech, and we support the spirit of innovation and disruption. Moreover, banks who offer banking as a service partnerships with fintechs are growing quicker and more efficiently than the overall industry. We believe there are strong secular tailwinds to this demand, providing us with a long runway as a provider in this sector. We have been... Selective and intentional in our FinTech partner rollout, we are planning to announce a second partnership here in the second quarter, and we have a pipeline of opportunities under review. Now I will turn to our operating results for the first quarter. We reported net income of $11.2 million, up 7% from a year earlier, and diluted earnings per share of $1.14, up nearly 9%. we recorded adjusted net income of $12 million, or $1.22 per diluted share, when excluding non-reoccurring consulting fees and acquisition-related expenses. These solid results helped us to generate an adjusted return on average assets of 1.16%, and an adjusted return on average tangible common equity at 12.98%. Loan balances were relatively flat from the prior quarter, as robust growth in key lending areas such as franchise finance and construction were offset by payoffs in healthcare, demands, owner-occupied commercial real estate, and public finance. Our partnership with Apple Pie Capital, a fintech-oriented specialty lender that focuses on lending to the franchise industry, continued to drive meaningful growth in the first quarter. In our third quarter of working together, we funded $28 million in loans, now hold over $100 million in this portfolio. We still anticipate originations for the year to be in the range of $150 million and could exceed that amount if the growth-oriented brands Apple Pie works with achieve their targets. As we have discussed in the past, construction lending is another area of focus. Our team continues to successfully source new opportunities during the quarter within the commercial and residential housing market. At the close of the first quarter, unfunded commitments in our construction line of business totaled $183 million, which was down slightly from the start of the year, but we were pleased with the dry activity and expect outstanding balances to continue growing throughout the rest of the year. Pipe lines across other commercial lines of business, including our national SBA operations, are also very strong. Given that SBA originations are historically lighter, In the first part of the year, we are extremely pleased with where the pipeline stands today. Our consumer lines of business also started the year on a very positive note. In addition to growth in portfolio residential mortgage balances, we were especially pleased with growth in recreational vehicles, trailers, and other consumer lines. As new originations exceeded $25 million for the quarter, despite continued inventory shortages and elevated inflation. Total consumer loan balances rose 4% on a late quarter basis. In addition to our existing loan pipeline, we are actively involved in multiple discussions that can provide additional asset generation capabilities to supplement our existing lines of business. The opportunities involve strategic partnerships that cover a range of asset classes, from specialty commercial lending to consumer lending to residential mortgages. We are very excited about the growth and potential each could provide. Our credit quality, meanwhile, remains excellent and among the industry's leaders. During the quarter, our ratio of non-performing loans to total loans declined to 0.25%, and our ratio of non-performing assets to total assets declined to 0.17%. Highlighting the quarter was the recovery on a single tenant lease financing relationship that previously had been charged off with the remaining balance transferred to other real estate owned. In total, we received net proceeds of $1.2 million in excess of the carrying value of the other real estate owned balance, which, excluding tax refunds, advanced loan activity resulted in net recoveries to average loans of 16 basis points. In 2022, we will continue to leverage our customer-focused products, expertise in digital service delivery, to deepen banking relationships with existing and new customers. We will further invest in our digital capabilities, prioritize recruiting and talent development, and build additional collaborative partnerships with fintech companies. And of course, we plan to integrate First Century and expand our emphasis on banking as a service capability to further position us as a premier technology-forward digital financial services provider. In summary, We are in great financial shape to continue producing strong results for our shareholders while improving our capabilities to serve our growing base of customers. Before I turn it over to Ken, I would like to thank the entire First Internet team for their tireless work throughout the quarter ensuring a smooth integration process while never losing focus on our hallmark customer service. Our team's unwavering commitment fuels our confidence in the strength of our franchise and ability to seize potential growth opportunities ahead. I'm proud of what we've accomplished to date through the compassion and innovation ideas from our team members. On behalf of each of them, I'd like to share a sincere thanks to our shareholders for their continued support. With that, I'd like to turn the call over to Ken to discuss our financial results for the quarter."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, David. As David mentioned, we posted strong earnings to start the year with first quarter income of $11.2 million and diluted earnings per share of $1.14, which included about $1 million of additional pre-tax expense related to certain non-recurring items. After factoring in these items, adjusted net income was $12 million and adjusted diluted earnings per share were $1.22, a decrease of 7.3% and 5.3%. 7% respectively from the fourth quarter of 2021, but up 15.2% and 16.5% respectively from the first quarter of 2021. Profitability continued to be solid with adjusted return on average assets of 1.16% and adjusted return on average tangible common equity of 12.98%. As you can see from the earnings release, we participated in first century's tax refund advanced lending activity, which added some additional new moving parts to the financial results for the quarter. If you remove this activity from our results, which included program fees that are classified as net interest income for GAAP accounting purposes, the related provision for loan losses, and a servicing fee that we paid first century, the impact was relatively immaterial and increased net income by less than $100,000. Our intent in participating in the tax-free fund advanced lending business was not to maximize profitability, but rather to provide balance sheet support to our partner and ensure that they had efficient access to funding for the thousands of loans originated during the quarter. Looking at slide four, total loans at the end of the first quarter were $2.9 billion, down slightly from the fourth quarter and down 5.8% from March 31 to 2021. David covered the highlights for the quarter from a lending perspective, including the growth in franchise finance, construction, and consumer lending. This activity was offset by net payoffs in our health care finance, small business lending, which included PPP repayment, as well as some prepayments and sales of season loans, owner-occupied commercial real estate, and public finance portfolios. Also contributing to the slight decrease in loan balances was the sale of $14 million of single-tenant lease financing loans, with a gross weighted average coupon of 3.51% that were sold at a gain of approximately $400,000. Moving on to deposits on slide 5, overall deposit balances were up modestly from the end of the fourth quarter and we continue to see improvement in the composition of our deposit base. During the quarter, non-maturity deposits increased by $136.6 million due primarily to approximately $100 million in deposits with a contractual term of five years and a fixed rate of 1.15%, pursuant to a new customer relationship. Additionally, as David discussed earlier, we generated $50 million of new banking-as-a-service deposits during the quarter at a cost of 20 basis points. CDs and broker deposits continued their downward trend, decreasing $97.7 million, or 7.7%, as higher cost CD and broker deposit maturities were either funded with on-balance sheet liquidity or replaced with much lower deposit costs. In total, the cost of interest-bearing deposits declined by three basis points during the quarter. Turning to slides six and seven, net interest income for the quarter was $25.8 million, an increase of $2.3 million, or 9.6%, compared to the fourth quarter. On a fully taxable equivalent basis, net interest income was $27.1 million, up $2.2 million, or 8.9% from the fourth quarter. The yield on interest-earning assets improved to 3.58% in the first quarter, up 24 basis points from 3.34% in the linked quarter, due primarily to the recognition of $2.9 million of income from tax-refund advanced loans, which contributed 30 basis points to the increase in average loan yields. partially offset by significantly lower loan fees. In addition, we experienced the 25 basis point increase in the yield on securities, mostly related to a decrease in prepayment activity in the mortgage-backed securities portfolio. We recorded a net interest margin of 2.56% in the first quarter, an increase of 26 basis points from 2.3% in the fourth quarter, Fully taxable equivalent net interest margin also increased 26 basis points from 2.43% for the fourth quarter to 2.69% for the first quarter. As you can see on slide 7, the 26 basis point improvement was driven primarily by a 21 basis point contribution from loans, mostly due to income from tax-refund advanced loans, partially offset by the impact of lower loan fees. In addition, we experienced higher yields in our securities portfolio, which provided a benefit of three basis points, as well as lower deposit costs, which provided a further benefit of two basis points. Excluding the income from the tax refund advance loans, fully taxable equivalent net interest margin was 2.41%, which was a two basis point decline from the prior quarter, but was on the higher end of our forecast. As a reminder, we received a fairly high amount of prepayment fees last quarter, which translated into the strong net interest margin expansion we sought in the fourth quarter. Looking ahead to the remainder of this year, we expect our yield on interest earning assets in the second quarter to revert closer to our results in the fourth quarter of 2021, but increase steadily as we deploy on-balance sheet liquidity into commercial and consumer loan growth. In terms of deposits, we expect deposit costs to remain relatively stable for most of 2022. Given the significant on-balance sheet liquidity across the industry, we don't believe increases in market interest rates will have a significant impact on our deposit pricing in the near term. We will also be bringing approximately $300 million of low-cost deposits onto the balance sheet following the close of the first century Bancorp acquisitions. Furthermore, with regard to the new banking as a service relationship that provided $50 million in deposits, we expect that balance to grow and be in the range of $150 million by year end, and we continue to explore additional deposit opportunities through the banking as a service platform. Turning to non-interest income on slide eight, non-interest income for the quarter was $6.8 million, down from $7.7 million in the fourth quarter. The decrease was a result of lower revenues from mortgage banking activities and a decrease in gain on sale of loans. Mortgage banking revenue totaled $1.9 million for the quarter, down $900,000 from the prior quarter due to a decrease in interest rate locks, sold loan volume, and margins. Gain on sale of loans totaled $3.8 million for the quarter, up $300,000 from the fourth quarter, and included $3.5 million of gains on the sale of SBA loans, as well as the gain on the sale of single-tenant lease financing loans mentioned earlier. We are revising our outlook for mortgage revenue for the remainder of the year, given the rapid rise in mortgage rates and the ongoing limited supply of new and existing homes for sale across most major markets. We now expect mortgage revenue to be in the range of $8 to $9 million for the full year 2022. With regard to SBA gain on sale revenue, we continue to forecast that to be in the range of $13.5 to $14.5 million for the year. Moving to slide nine, non-interest expense for the first quarter was $18.8 million. The $1.8 million increase from the fourth quarter was due primarily to higher loan expenses. consulting and professional fees, premises and equipment, and other expense, partially offset by a decrease in salaries and employee benefits. The increase in loan expenses was driven primarily by the servicing fees related to the tax refund advance loans that I mentioned earlier, which totaled $900,000. The increase in consulting and professional fees was due primarily to $875,000 of non-recurring consulting fees, and $170,000 of acquisition-related expenses, partially offset by lower third-party loan review fees. The increase of premises and equipment is primarily related to costs associated with our new corporate headquarters, partially offset by the $475,000 IT termination fee incurred in the fourth quarter. Salaries and employee benefits expense came in lower than expected due mainly to lower incentive compensation in the small business lending and mortgage banking divisions and lower medical claims expense, partially offset by higher employee benefit costs due to annual resets. Now let's turn to asset quality on slide 10. As David mentioned earlier, credit quality was strong again during the quarter as non-performing loans and non-performing asset ratios continued to decline. Our provision for loan losses and net charge-offs were both relatively modest on a reported basis, but were also impacted by tax refund advanced lending. Net charge-offs of $381,000 were recognized during the first quarter, resulting in net charge-offs to average loans of approximately five basis points. Excluding $1.5 million of net charge-offs related to tax refund advanced loans, Net recoveries of $1.1 million were recognized during the first quarter, resulting in net recoveries to average loans of 16 basis points. The provision for loan losses in the first quarter was $791,000, compared to a benefit of $238,000 for the fourth quarter. The linked quarter change was driven by the provision related to tax refund advance loans, which totaled $1.8 million and to a lesser extent, adjustments to qualitative factors that increase the overall allowance as a percentage of loans. This was partially offset by the $1.2 million recovery that David mentioned earlier. Excluding the provision related to tax refund advance loans, the company recognized the benefit of $1.1 million for the first quarter. The allowance for loan losses as a percentage of total loans was 98 basis points at the end of the first quarter, which represents a two basis point increase from the fourth quarter. With respect to capital, as shown on slide 11, our overall capital levels remain solid at both the company and the bank. Our tangible common equity to tangible assets ratio decreased modestly to 8.77%, down 16 basis points from the fourth quarter. This was due primarily to an increase in accumulated other comprehensive loss resulting from a decline in the value of the available for sale securities portfolio arising from the rapid rise in interest rates during the quarter as well as stock repurchase activity. This was partially offset by the net income earned as well as an increase in the fair value of interest rate swaps classified as cash flow hedges. As a result, tangible book value per share decreased slightly to $38.21, down from $38.51 in the fourth quarter, but approximately 10% higher than one year ago. During the first quarter, we repurchased 103,700 shares of our common stock at an average price of $49.35 per share as part of our authorized stock repurchase program. including shares repurchased in the fourth quarter of 2021, we have repurchased 203,703 shares at an average price of $46.90 per share through March 31. Furthermore, thus far in the second quarter, we have purchased an additional 43,628 shares at an average price of $41.62 per share. In total, we have repurchased 11 million shares of stock under the total authorization of $30 million. And turning to slide 12, we feel we are much better positioned for a rising rate environment than we were at the beginning of the last rate tightening cycle. Over the last several quarters, We have improved our deposit composition with a larger percentage of non-maturity deposits, which we believe will only get better as our FinTech and banking as a service initiatives grow. We've also increased our focus on higher yielding variable rate and short duration loans, notably through both SBA and construction lending. Furthermore, while mortgage revenue is expected to pull back from the historic highs we have seen over the last two years, Our investment in SBA lending has added greater diversity to non-interest income, which we expect will be further diversified as we onboard FinTech and banking-as-a-service partnerships, providing stability regardless of the interest rate environment. Overall, we had another solid quarter and continue to position ourselves well for success in future periods. With that, I will turn it back to the operator so we can take your questions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. If you'd like to ask a question, please press star followed by one on your telephone keypad now. To withdraw your question, please press star followed by two. Our first question today comes from Rhett Rabaton of Hoved Group. Your line is open. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, guys. Good morning. Good morning. I wanted to first ask, you know if you could provide some detail on you know fintech relationships from here on the lending side you know i know it's still early but you know i think one of the one of the questions people have is you're obviously having initiatives to grow loans at a faster pace but you're still having payoffs affect you know the net balances can you give us some color on what we might expect in the back half of the year from fintech and other initiatives from the loan growth perspective and um you know any any color on potential payoffs would be helpful in the three portfolios that are obviously having some atrophy."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I'll tell you what, Brett. I'll address the payoff side of it first. I think obviously the healthcare finance is going to continue to pay down. I think it's been relatively consistent and it will probably continue to show that kind of same level of payoffs. Eventually, we'll probably get to a point where the refi incentive may not be there for some of the borrowers as long rates have gone up, but that portfolio will still continue to decline. I think on the single tenant side, while balances were down a bit, if you do the math on it, you could say that the decline was due almost entirely to the loan sale that we conducted during the quarter. Originations, new funded originations in single tenant were very strong, but there was still a little bit of elevated prepayment activity. I think what we saw in that activity in that portfolio this quarter was you had a lot of borrowers out there, existing borrowers and new borrowers who were trying to gauge and trying to play the rate game. Some people fell out of the process that were trying to look at new properties and others raced to get their rates locked in. So I think there was a bit of a shuffle there with somewhat elevated prepayment activity, but again, strong origination activity. And I think looking out over the course of the year, Our pricing is, with the long rates moving up, it kind of moves more into our wheelhouse on pricing, and we will see originations and balances continue to grow there over the course of the remainder of the year. And again, as we've talked about a number of times with Apple Pie, we continue to feel good about 150 million of originations for the year there, and You know, with normal portfolio amortization, that probably leaves us in the range of, say, $240 million at year end on balances there. And that could go higher because some of the brands that Apple Pie is working with are, you know, growth-oriented, very popular. You know, we're seeing... Actually, even through the limited amount of time from the end of the quarter through now, we've seen some very strong origination activity there. Overall, I think the portfolio we have, we do have growth forecasted in our consumer and our commercial loan portfolios. Some of the strategic partnerships that we're looking at have a lot of excitement and a lot of potential growth activity well beyond that."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Rob, we can't really pitch out names to you on the FinTech opportunities we're taking a look at, but it's a nice mix. There's some consumer-oriented products. There's commercial products. Not much in the line of real estate opportunities, but it's a nice mix, and as Ken said, some of those are potentially hundreds of millions of dollars in opportunity on an annualized basis. We've got a lot of good activity in the much more conducive for us to sell the SBA portfolio in the secondary market due to the fees we're receiving. But as interest rates continue to climb, there's potential that the Fed does everything that they're talking about by year end. It would be more conducive for us to hang on to those on the balance sheet versus selling. We're real confident we're going to hit the year-end forecasted targets on the loan side. And as Ken said, it's going to be a whole combination of a lot of different moving parts, but we've got great confidence in seeing good, solid asset growth over the course of the year."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, that's helpful. And then I wanted to talk about the margin. Obviously, a lot of moving parts this quarter in 2Q are as well it would seem like with the first century transaction you know in the improving deposit funding mix that the margin could actually stay at the present level versus kind of that core 240-ish level um this quarter do you guys have any thoughts you could share on your margin expectations for for 2q and and you know how much more you think cds could run off and you know what sort of the mix looks like um, you know, going forward."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I think, you know, as we look out, let's, let's just back out per century for a minute. Let's just think about the existing first internet franchise, you know, looking over, you know, again, with, with a lot of cash on the balance sheet rates moving up. I mean, I think by the fourth quarter, you know, if you say our, you know, X, the tax business margin was two 41. Um, which I think, as I said in the prepared comments, came in on the higher end of our range. And as we forecast out over the course of the year with some of the asset deployment, putting cash to work, and some optionality on the liability side of the balance sheet, I think by fourth quarter, we're probably, I'm going to say 20 to 30 basis points of expansion, but let's just split it and just say 25 basis points of margin expansion by the fourth quarter. you know, kind of incrementally from now until then. I think on the liability side is, again, we do have optionality. We do have, you know, we got a limited amount of, you know, what I'd call traditional historical wire house brokered CDs maturing. We got one coming up here in a few weeks, not a big dollar amount, about $10 million, but that's expensive. We have some of that later in the year. And I think we also have some optionality on the FHLB side as well as far as prepaying. With rates coming up, the prepayment penalties aren't quite as onerous as they were three, six months ago. And some of those are higher costs that, from a margin perspective, have kind of a dual impact. You're removing a lot of expense dollars and reducing your earning asset balance. And then on the CD side, you know, we do, you know, over the course of the next 12 months, about call it two-thirds of our CD portfolio, what's remaining, does mature. A lot of those were shorter duration. So you've seen the cost of those come down, but I would say with the remix of deposits, more banking as a service deposits, continued growth in small business, money markets and checking accounts that the improvement, the composition of that changes and allows us to pick up there as well. So I think we feel good about the different levers we have to improve net interest margin throughout the course of the year."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, great. Appreciate all the color. Thanks, Brett."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Our next question today comes from Michael Perito of KBW. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, good afternoon, guys. I wanted to start on the $50 million Banking as a Service deposit relationship that you guys brought on. I guess just a couple questions around that. I guess one, was that brought in through the Sync Terra partnership or was that sourced through your own? efforts, and then two, can you just repeat, the capacity to grow to $150 million, was that by year end, and is that with this one relationship, or is that assumed that other relationships are added over the span of the time frame? Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "No, Mike, that's one relationship. We had $50 million at the end of the quarter, and we expect that one relationship to expand to $150 million on its own. So, again, we're still, again, as David talked about, we have a lot of opportunities under review that would be additional deposit opportunities on top of that."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And this is a relationship, Mike, that we brought on by ourselves. It's not through St. Tara or outside. It's a relationship we developed."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. And what was the time frame on that $150 million, Ken? Did you say that, or is it just over the intermediate?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "It'll be spread evenly over the remaining course of the year."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "It could potentially expand. A minimum of $150 by year-end coming in, as Ken said, in equal amounts at the beginning of the month between now and end of year."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And is... Is it fair to say that the deposit relationship pipeline, you know, is that additive to kind of the margin story, Ken, that you just laid out for the legacy first internet here, or is that taken into account in some of the budgeting that you guys have done around the margin in the current environment?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "No, I mean, we're taking that. that into account when thinking about the, you know, again, remixing the deposit composition."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Mike, one thing about we're sitting here today staring at potentially another 50 basis points bump up in the Fed. Overnight funding jumped up the full 25 basis points last time. If it does it again, it's going to go from 33 basis points to 83. And we felt no pressure to move the money market accounts. You see article after article, day by day, that banks are still very flush with cash. If we get a 50 basis point spread and we don't have or feel pressure to move our money market funds for the first time in the history of the bank, we'll be paying 50 basis points on money market and yielding 83 on overnight deposits. I mean, that's an experience we haven't had in 23 years. That is not factored in. But that just gives you an idea of some of the moving pieces out here, what impact it might have on us. We're setting very flush in cash without including the first century monies. We're still $300 million plus on our balance sheet in cash. So unless somebody does something really wacky in the marketplace, which it appears that the banks learned a lesson the last time, we got an opportunity to – I think Ken's number is probably a little bit conservative on the margin increase by year end, but there is a whole lot of leverage that can be pulled here over the next couple months."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "That's helpful. And then just two more quick ones for me. One, just on the OPEX line, I mean... Ken, as we look kind of towards the back half of the year when theoretically the cost of deals closed, cost savings are baked in, we have some inflation, do you think kind of a mid-20s all-in blended number is still within the range of outcomes, or do you think there could be upward pressure on that just given some of the inflationary environmental stuff?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I think the initial assumption is fine. There probably could be some I think maybe what might impact that more is just the ability, you know, what we've been doing on our own in terms of sourcing new partnerships and, you know, making new technologies. I mean, I think there could be upward pressure, but it's because we're seeing new opportunities and need to make new investments. but it's kind of hard to forecast those right now. So I think I just, your, your initial assumption I think is, is still valid. Okay."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And then just, just lastly, um, regarding the first century deal, you know, when we think about when the deal was announced today, you know, the rate environment expectations have changed dramatically and, and obviously they had their, their tax product lending revenues that flowed through in the first quarter, which, which, um, you know, on the fee side, which you guys didn't capture because the deal didn't close. Just curious if you think the balance sheet impact or any of the marks or anything could change relative to what was initially communicated that we should be mindful of."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I would say not really. You know, when you think about traditional M&A, you know, one of your bigger marks is going to be on your – on your loan portfolio, but they're not really a lender. I mean, I think the portfolio is down to the range of $20 million, and it's priced pretty well, so I don't expect any significant kind of mark there. You know, we'll probably do some restructuring with the securities portfolio. I mean, their portfolio has been beat up like everybody else's. And on the deposit side, I mean, there probably could be some adjustment to the rate mark on that, but to me, I don't think it really moves the needle significantly in terms of all of the purchase accounting adjustments."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Thank you, guys, for taking my questions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Appreciate it. Thanks, Mike."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Our next question today comes from Nathan Race of Piper Sandler. Please go ahead, Nathan."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, guys. Good afternoon. Clarifying question just to Mike's last one on the impact from FCB, just from a tangible book value perspective and goodwill. Just given that the deal hasn't closed yet and FCB, you know, recognized a good chunk of revenue and earnings in the first quarter from their tax anticipation lending segment. Is it fair to assume that the goodwill number should be lower because the retained earnings and equity components will be higher for them once the deal ultimately closes, though?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "You know what? They did book all the revenue. They had a good tax season. But in terms of the way that the GAAP accounting and the purchase accounting, if you think about what I alluded to earlier is that the their securities portfolio has been beat up like everybody else's. So I would say kind of net-net, we're probably in the same position as we were. It's just that the tax revenue is a little bit higher, but you have an offset with the larger negative mark on the securities portfolio. So we're not going to see – there's not going to be a meaningful change from our initial assumptions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "We're still modeling going forward at the same cost that it was."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Understood. Makes sense. And then just maybe thinking a little further out about the impact from FCB, from an income statement perspective, would be curious to get some color on kind of how their volumes turned in the first quarter. I appreciate all the details in the deck in terms of the income statement impact from your kind of flow arrangement that you had with them. here in the first quarter. When I look back at their call report data, it seems like the tax credit business in the first quarter has been anywhere between a $12 million to $9 million figure for these guys. Is that kind of a good starting point to think about kind of revenue impact for you guys in the first quarter of next year?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "You know, it's probably a good start. I think what in our discussions and daily discussions with them on this business, I think they saw a good bump from last year's activities, probably more comparable to 2019. I think the one thing that we've always talked about, it was part of the thesis on the merger and the opportunity to begin with, is that just the partnership of us bringing the larger balance sheet brings more opportunities. I think it's probably a good conservative baseline to start with. We are, you know, and they are actively engaged in looking at new additional partners to add. And then as, you know, for those of you who do follow that business, there's another aspect to the revenue stream there that First Century has not capitalized on in the past, and that's the payment side of it. So we're looking at providing those services as well to the partners that they work with. I think we all feel between everybody here at First Internet and everybody on the First Century side is that the combination of us with them brings a lot more opportunity to expand that business."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Understood. That's helpful. Thanks, Ken. And then maybe just one last one, and going back to Brett's question earlier, just trying to kind of fine-tune the loan growth outlook for this year. I think last quarter you guys were thinking low double digits. Obviously, there's some moving pieces across a number of portfolios. Is it more kind of maybe a high single-digit trajectory for this year based on kind of what was described earlier or how you guys just generally think about overall loan growth for this year today?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "No, I think we still feel good about the low double-digit number. Like I said, we had, you know, we did, even though prepayment activity was down relative to fourth quarter, it still was fairly strong. But I think as we, you know, we'll probably see elevated prepayment activity waning. And, again, we've been really, really pleased with, on the consumer side, with the originations there and the RVs and the horse trailers. And, obviously, you know, as we talk about Apple Pie and single tenant all look really good. Construction is... you know, fundings are, you know, those balances are forecasted to, you know, funded balances to increase substantially over the course of the year. So I think we still feel good about, you know, kind of being in the double-digit range on loan growth by the end of the year. And again, that's not really factoring in any of the opportunities that David talked about earlier."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. Understood. If I could just ask one last one, just, again, going back to FCB. Does the kind of delayed timing with closing that acquisition, does that change the timeline in terms of when you guys intend to bring over a lot of the core deposits, which was a core component to the transaction in terms of moving the balance sheet to at least a neutral, if not slightly asset sensitive position going forward?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Let me kind of address that one. Ken can fill in specifics on it. I think that the bottom line to think forward, as Ken mentioned earlier, and the discussion we've had all along in your comment, too, here, the first quarter is the big quarter for first century. That's when all the tax revenue and income historically, the last nine months of the year, they've been pretty much revenue neutral. We hope that changes and they actually make a profit over the remaining nine months of the year, but we're going forward with or without that number in there. We're confident that we're going to hit the 472 forecast for this year. As we've discussed here for the last 45 minutes, there are so many moving parts and pieces out here to give you guys a clear thought. We've got model after model we've been playing with. We adjust them every day based on what's current in the news. As long as World War III doesn't start, we think we've got the 472 locked. And timing on the first century is somewhat irrelevant. And we think we're just in a great position for 2022. And a lot of the movement in the marketplace outside of mortgage is really coming our way. And we think the dust will settle on that as rates settle. I can tell you if We are forecasting that if 30-year first mortgages pop 6% or top 6%, that mortgage market is going to dry up very, very, very quickly. But shy of that, and again, we're confident, as Ken said, with those moving parts, that we have other pieces that could come along and cover the mortgage shortfall. So we're locked in on the 472. and we think that's a rock-solid number in the 2023 forecast you guys have out here for us. Again, unless World War III starts up, we think we're in great shape for those numbers as well. So we're phenomenally excited about what's going on in the organization and just the new opportunities that are coming in on a daily basis."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I share in that excitement as well, David. I appreciate all the color guys. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Appreciate it."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Dave."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. As a reminder, if you'd like to ask a question, please press star followed by one on your telephone keypad now. We have a question from John McRodis of Janine Montgomery Scott. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, good afternoon, guys."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, John."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hope everybody's doing well. David, just quickly back to your comment on the $4.72 for this year. Does that reflect the $1.14 in the first quarter, or does that reflect the operating number of $1.22?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "That actually goes back to the forecast that you guys had of the $1.04 and that we haven't adjusted it. We got second quarter 114, third quarter 126, and fourth quarter 128. We were just totaling up and hadn't necessarily adjusted for the real play. And these numbers, guys, as you well know, mortgage could soften up. SBA could take off some of the other stuff. I don't know that we're looking at a 114 here for second quarter. I think that's very achievable. But it might be higher. But I can assure you when the four quarters come together for us, The 472 is a locked number, and we'd like to be a little more clear with you, John, but from interest rates, everything's moving so rapidly out here. Ken and his guys are adjusting numbers on a daily basis, but we're confident. Take the 114 and roll that forward for first quarter. We'll hit the 472. Got you, David. That's fine."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Um, I understand a lot of moving parts. Hey, Ken, just, just back to, um, expenses real quick. I think last quarter you talked about mid teens growth on, on, on the legacy first internet without FCB. Is that, is that still what you're thinking? Kind of 15 to 17%, I think you said."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah. Yeah. That's, that's still, that's still good. Again, it's, you know, the, the, the, The delta may come back to mortgage because if mortgage continues to decline, you're going to see lower headcount costs. You're going to see lower salaries and employee benefits because of lower commissions there and probably some lower variable expenses. But I think the initial assumption is still a valid one to go with."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. Okay. Thank you, guys."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Appreciate it."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And our next question today comes from George Sutton, Craig Hallam. Please proceed."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. David, you mentioned last quarter three to four potential partnerships. You didn't really give a number this quarter, but you did mention you're being very selective. And I'm just curious if you could walk through the competitive landscape as you see it. How many of these are opting for other opportunities? How many of these are you opting out of? Just curious from that perspective."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Give you kind of a feel on that one, George. I would say in the last six months, fourth quarter, first quarter, we've probably looked at a dozen deals. We've got three that are really coming, hopefully, to fruition here very quickly. The other nine we walked away from. We have not lost one to competitive forces, I guess you could call it. Some of it we need to secure a relationship. Some of it we do independently in work. So it's really been our selection process, not really the outside market. And I will tell you, I can't tell you how many inquiries that we've had that come in almost daily at the current time that are just not baked enough that we even take the call. We've dedicated a full team. We have four people that their daily charge is to look at in-tech opportunities. They've all come on board, and we've set this committee up here in the last six months. We didn't have it prior, and they're getting phone calls on a daily basis. But we had 12 that we actually did due diligence on. Three made the cut. Three are still in the hopper. And the other nine, we opted not to provide services."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "That is super detailed. One other thing, you mentioned you were making further investments in your digital capabilities. Could you just give us a sense of what you mean by that?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, we're looking at it. We've got a new front end coming for the internet banking that's really focused on the small business side of things. That's still a little rough around the edges. New account opening, it's a 15-20 minute process. There's not a good smooth ability to plug in documents. There's no auto-approval process in it. All of that's being revamped and is in testing now, hopefully live before the end of the quarter. There's new accounting controls in it on bill pay leverages. There's a great front-end API to turn on third-party packages so you can If you're using QuickBooks or you're using AutoPay, there's a whole lot of third-party services that interfaces are already there. So as a small business owner, you can come to the first IB account and literally take care of all your business practices. You can do payroll. You can do accounting. You can do bill payment services. Ultimately, we want to add insurance products and other tools to it. But it really is a revamped front end. The growth of our SBA business is just Small business in general, 2021, we were listed as the best small business account in America. We just got to 2022, the best savings account program for small businesses in America. We think we really have an opportunity to take that market by storm. One of the things we've been working on for a long time, all of you guys can appreciate. Traditional C&I lenders don't want to see a $350,000 loan. You just can't make any money off it. It's the story I've heard for 20 years. We think we're close to cracking that and coming up with a system where we can automate a lot of the processes and really, truly take care of small business through smaller loans, credit card services, and really get into a market that banks historically have just shied away from. So a lot of neat, neat things going on on the software side. Quite as crazy as my days 20 years ago in the software business, but we got a lot of activity. Most of it is all third-party. We're doing some API activity on our own, but these are third-party. We're searching the marketplace, finding best of breed, and pinning them onto our system. So it's an exciting time. It's a lot of fun."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Ken mentioned RVs, horse trailers, and apple pie driving at a low volume. I say, God bless America."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "She just replayed that. That's the first thought that flashed through my mind. If we had GM in there, we'd have had a whip."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "It's great."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. We have no further questions in the queue, so I'll hand the call back over to David Becker for closing remarks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, everyone, we want to thank you for joining us today. As you can tell by our comments, we're off to a great start at 22, looking for even a better finish. We hope you have a great day. Look forward to speaking with all of you again soon. Appreciate it. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "This concludes today's call. Thank you for joining."
    }
]