Good afternoon and welcome to Indy Semiconductors' fourth quarter and year-end 2022 earnings call. At this time, all participants are in a listen-only mode. A question and answer session will follow the phone presentation. As a reminder, this conference call is being recorded. I'll now turn the call over to Ashish Gupta, Investor Relations. Mr. Gupta, please go ahead. Thank you, Operator. Good afternoon and welcome to Indy Semiconductors. fourth quarter and year-end 2022 earnings call. Joining me today are Don McClymont, Indy's co-founder and CEO, and Tom Schiller, Indy's CFO and EVP of strategy. Donald will provide opening remarks and discuss business highlights, followed by Tom's review of Indy's Q4 and first quarter outlook. Please note that we will be making forward-looking statements based on current expectations and assumptions, which are subject to risks and uncertainties. These statements reflect our views only as of today and should not be relied upon as representative about views of any subsequent date. These statements are subject to a variety of risks and uncertainties that could cause actual results to differ materially from expectations. For discussion of the strategic backlog formulation methodology, please refer to our safe harbor statement on our Q3 earnings press release. For material risks and other important factors that can affect our financial results, please review our risk factors in our annual report on Form 10-K for the fiscal year ended December 31, 2021, as well as other public reports filed with the SEC. Finally, the results and guidance discussed today are based on certain non-GAAP financial measures. For a complete reconciliation to GAAP, please see our Q4 earnings press release, which was issued in advance of this call and can be found on our website at www.indisemi.com. I'll now turn the call over to Donald. Thanks, Ashish, and welcome, everybody. Indy delivered another quarter of record revenue and gross margin performance in Q4, once again ahead of expectations and capping off a second consecutive year in which we more than doubled our top line. Our sustained outperformance reflects the strength of our highly innovative Autotech products, backed by an extensive global patent portfolio developed by Indy's team of over 600 dedicated employees around the world. Specifically, during the fourth quarter, we significantly outpaced our addressable markets and grew revenue 74% year-over-year and 10% sequentially to just over $33 million. We expanded gross margin to 52% and gained further design wind momentum spanning ADAS, user experience, and electrification applications. Of note, during the period, we ramped our user experience portfolio across leading North American automotive OEMs, exceeded 200 million unit cumulative shipments, closed a convertible debt offering of 160 million in support of our acquisition plans, launched a board-authorized 50 million share and warrant repurchase program, and more recently, we captured a motor control design for e-vehicle battery cooling systems, entered a key partnership with Seeing Machines targeting driver and vehicle occupant monitoring, demonstrated innovative power delivery, wireless charging, lighting, and ADAS solutions at CES, including our Surya Coherent LiDAR SoC, and announced our intent to acquire Geo Semiconductor. On a full year 2022 basis, we delivered $111 million in revenue and improved gross margin to nearly 50%, while substantially increasing our strategic backlog to 4.3 billion as of November 2022, up from 2.6 billion in 2021, and 2 billion at the time of our launch in 2020, setting the stage for sustained outsized growth through the balance of this decade as design wins translate into program ramps and ultimately revenue and free cash flow generation. Within ADAS, we are approaching a new era of sensor fusion, merging multiple disparate technologies to gather and process information, employing radars, lidars, ultrasound, and computer vision. We believe that following our sensor agnostic approach, INDI is the best position to auto-tech semiconductor and software pure play to capitalize on this strategic megatrend. First of all, radar represents a fundamental ADAS building block technology. Today, radar is widely deployed for automatic emergency braking, adaptive cruise control, lane change assist, and blind spot detection applications. In the near future, it will also enable the high-volume cross-traffic detection application, making it an extremely critical sensor. Recall, we significantly scaled our radar initiative through internal investments and the acquisitions of Analog Devices Radar Division and Onsemi's radar team. The successful integration of these assets was critical to accelerating our product development, leading to our largest design win to date for the top four automotive radar system supplier. Secondly, given LiDAR's impressive resolution, range, and depth perception capabilities, we can deliver this rapidly emerging sensor technology to enhance safety systems within mass market vehicles far sooner than the anticipated rollout of fully autonomous driving use cases. To date, addressing the complex and compute-intensive demands of coherent LiDAR systems has been achieved by using very high-end field-programmable gate arrays. FPGAs are ideal for prototyping, and offer high levels of flexibility and versatility, especially beneficial for nascent applications. But FPGAs are also expensive, power-hungry, they require complex PCBs and additional discrete components that add significant cost, size, they generate thermal problems, and excessive power consumption. This makes any migration to mass market LiDAR impractical, where automakers are seeking a sub-$500 price point with less than 30 watts of power dissipation for long-range LiDAR. Enter Indy's Surya LiDAR SoC, the world's first merchant market coherent LiDAR solution, allowing our customers to implement a highly integrated, high-performance, software-defined data acquisition and signal processing system. Surya integrates all the necessary multi-channel high-speed analog to digital converters, hardware and software digital signal processing, together with the system control interfaces needed for an efficient and cost-effective LiDAR system. When coupled with our differentiated Teraxion lasers, Surya can absolutely catalyze the LiDAR market. Third, ultrasound is increasingly deployed to provide practical, low spatial resolution and short-range sensing use cases up to a few meters, such as park assist systems. A key benefit of ultrasonic sensors is that they are particularly effective due to their resilience in most weather conditions and are relatively low cost. We are still in the early innings of our own ultrasound product ramp, supporting Hyundai's Smart Park feature set, amongst others. And last, and far from least, computer vision. Image processing systems provide the main sensing function in both ADAS and autonomous applications, requiring up to 20 cameras in next-generation vehicles. Many different functions are enabled by computer vision, ranging from simple backup cameras, e-mirrors, and surround view systems, to object and lane detection, night vision, and driver and occupant monitoring. Collectively, these functions can realize use cases such as lane change assist, highway pilot, traffic jam pilot, occupant safety, automated parking, and other levels of driver automation. In fact, given the increasing attach rate of cameras around the vehicle, IHS is forecasting 265 million camera ECUs will be needed to support the global automotive market in 2023, growing to 430 million units by 2028, and thus creating an $8.5 billion total addressable semiconductor market. To accelerate our market entry and capitalize on this opportunity, last week we announced our intent to acquire Jio Semiconductor. It's rare that an acquisition target is a perfect fit, but this is indeed the case with Jio. Underpinned by 100 global patents, Jio's industry-leading camera-based sensing and viewing capabilities are shipping today to some of the world's largest automotive OEMs, including Honda, Hyundai, Kia, Nissan, and Toyota. With design wins across more than 20 Tier 1s, GEO has programs with every major image sensor supplier in the world and is engaged in multiple key vehicle programs. GEO's products comprise three generations of application-specific camera video processors, including those focused on viewing, where video is projected on a display and viewed by the driver, and sensing, where video is processed using advanced computer vision and machine learning algorithms to assist the driver. The unique ability to support both of these key categories will allow Indy to deliver short-term solutions for today's use cases while providing a technology platform to provide fully autonomous features for the vehicles of tomorrow. GEO is complementary in terms of products, customers, and global sales channels, while at the same time highly synergistic operationally with massive cross-selling opportunities. Upcoming regulations and OEM's need for differentiation will require a significant increase in camera resolution and the number of image processors per car. These requirements will demand both sensing and viewing features. GEO's camera processing technology will allow the tailored processing of image for display and machine vision applications, resulting in a high fidelity image delivery to the display and a contrast enhanced image going to the machine vision system for object detection, low latency, and superior time to collision performance. at ultra-low power. INDI's differentiated sensing technologies combined with GEO's camera processing know-how and IP will uniquely position us to accelerate the adaptation of camera-based sensing technology across the vehicle spectrum. More importantly, GEO is enabling INDI to complete our sensor mosaic spanning radar, LIDAR, ultrasound, and computer vision with scale across each, now underpinned by a total of 370 patents and applications Our next step will be to fuse all sensing methods into integrated platforms to provide our customers with the most optimized and highest performing systems bar none. Switching gears, during the fourth quarter, we also continue to ramp our user experience portfolio across leading global automakers, as OEMs prioritize a best-in-class cabin experience more than ever. This focus towards creating a unique cockpit environment where communication, entertainment, and information sharing has become paramount, and indeed is a much greater customer differentiation than traditional torque, horsepower, and zero to 60 metrics. Providing the ultimate user experience throughout the entire cabin is the new standard. In particular, seamless mobile device integration within the automotive environment is increasingly a way OEMs are differentiating their cars, which means implementing systems such as Apple CarPlay and Android Auto that enable drivers to safely make calls, send and receive messages, and enjoy their favorite music without taking their eyes off the road. This key feature is set as everything for teen drivers and even more important for their nervous parents. Similarly, vehicle lighting is gaining in importance as it is a strong generator of brand recognition. Illuminating a car's interior and exterior creates an emotional ambience that drives a unique connection. Car manufacturers understand the significance of this dynamic and are striving to perfect the integration of lighting conditions for a more harmonious driving experience. Finally, in the EV area, we're seeing the start of a long-term secular tailwind as OEMs, led by consumer demand, shift towards electrification. According to Cox Automotive, EV sales were up 66% versus the prior year in the US, and the EV share of the total market nearly doubled to around 6%. While penetration of EVs has increased considerably, there still lies an enormous blue-sky opportunity ahead. And India remains especially well-positioned here, given our strong relationships with an increasing number of leading OEMs around the world who are seeking more highly integrated and power-efficient semiconductors to continually shorten charging times and extend vehicle range. I will now turn the call over to Tom for a discussion of our Q4 results and Q1 outlook. Thanks, Donald. Indy delivered a solid fourth quarter, once again outpacing top-line and gross margin expectations. In fact, Q4 represents our seventh consecutive quarter of beating or at least meeting our revenue and gross margin targets post-Indy's IPO. Revenue for the period was up 74% year-over-year and up 10% sequentially to $33 million. Gross profit was $17.2 million, translating into a 52.2% gross margin up 590 basis points year over year and 180 basis points sequentially, better than our 51% guidance. To put this performance in context, at the time of our IPO announcement in the fourth quarter of 2020, Indy was at quarterly revenue of just $6.7 million, with a gross margin of 35.4%. In the two years since, and despite the challenging supply chain environment, We've effectively 5X-ed our revenue base while expanding gross margin by nearly 1,700 basis points. Turning back to our Q4 results, R&D was $24.9 million in support of accelerated product development with SG&A of $7.4 million, reflecting continued investments to extend Indy's sales reach plus the implementation of a highly scalable ERP system. In turn, our Q4 operating loss was $15.1 million, slightly better than our guidance. Below the line, interest income was $.7 million versus our guidance for $.8 million, stemming from incremental convertible debt interest we hadn't contemplated in our original forecast 90 days ago. We also bought back 1.1 million shares last quarter, ending the period at 151.1 million shares against our guidance for 152 million shares. As a result, our net loss was 14.4 million, and we posted a 10-cent loss per share in the fourth quarter, with the delta between our guidance and results tied to the slightly lower level of interest income and reduced share base. Turning to the balance sheet, We exited the year with $321.9 million of cash, up $171.1 million from Q3, including $154.7 million of net proceeds from our convertible debt offering and $41.9 million from our WUSHI subsidiaries' capital rates. These increases were partially offset by $14.9 million of net cash used in operating activities, $4.3 million in capex for expanded lab and IT equipment, as well as $7.4 million in share repurchases. Looking forward, based on the depth of our new product pipeline, multiple program ramps, and the planned addition of GEO later this quarter, we plan to deliver accelerating topline growth throughout 2023. For the first quarter, we plan to scale to a $160 million annualized revenue run rate, including the stub portion of GEO revenue, with non-GAAP gross margin in the 52% range. We are also planning $29 million in R&D and 8 million of SG&A on a consolidated basis for the quarter. Below the line, we anticipate 0.4 million of net interest income and no taxes. Assuming 156 million shares outstanding, including approximately 4 million shares for GEO on a weighted average basis, we expect a 10 cent net loss per share. Further, and perhaps most importantly, We believe the combination of Indy's steeper growth trajectory, sustained gross margin expansion, particularly post-geosynergies, and planned operating expense leverage will enable us to reach profitability in the back half of this year, representing another key milestone towards realizing our 60% gross and 30% operating margin target model. On that note, I'll turn the call back to Donald for his closing comments. Thanks, Tom. In conclusion, we posted solid Q4 and 2022 results and are executing to our ambitious growth plans. And although we've made substantial progress since our IPO in extending our support of car brands like Audi, BMW, BYD, Daimler, Ford, General Motors, Hyundai, Nissan, Porsche, Stellantis, and Volkswagen, Indy is now just getting started. Our acquisition of GEO immediately rounds out our sensor offering by accelerating our computer vision product portfolio with field proven differentiated solutions, enabling us to capitalize on the rapid proliferation of automotive image processors around the vehicle. This acquisition effectively fast forwards our ability to provide a highly differentiated and true sensor fusion platform to our customers. In this way, we will vastly simplify sensing architectures and thus democratize access to higher level autonomous and ADAS features bringing us a massive step towards realizing our strategic vision of enabling the uncrashable car, becoming an autotech powerhouse, and in the process, creating extraordinary shareholder value. That concludes our prepared remarks. Operator, let's open the call for questions. Thank you. At this time, we will be conducting a question and answer session. If you'd like to ask a question, please press star 1 on your telephone keypad. A confirmation tone will indicate your line is in the question queue. You may press star two if you would like to remove your question from the queue. For participants using speaker equipment, it may be necessary to pick up your handset before pressing the star keys. We also ask that all participants to please limit yourselves to only one question and one follow-up question. One moment, please, while we poll for questions. Our first question comes from the line of Suji Da Silva with Roth. Please proceed with your questions. Hi, Donald. Hi, Tom. Congratulations on a strong finish to 22 and even really, it sounds like a better outlook for 23. So great job, guys. Thank you. So yeah, no problem. Yeah, you got it. So maybe a financial question first on the backlog growth, very strong growth there. Very impressive, the 4.3 billion. Can you give us some way of understanding how much of that might cover the next 12 or 24 months near term versus longer term? And what's the realistic expectation for how that backlog grows over the next few years? Because it's having really strong growth here. Is that kind of growth sustainable or just how to think about that? Thanks. Well, kind of going in reverse order, I mean, for sure, we're still accelerating into the market. We've only been a public company for a little over 18 months and still the positive effect that that has with our customers hasn't really been fully harvested yet. So, no, I do anticipate that we'll be able to pull in some very large projects, and those will be added to the strategic backlog and due course, as you know, Suji, on an annual basis. So in terms of what our expectation is for the next 12 months, I mean, we've been very clear our absolute target, our absolute mandate, my mandate to the entire team is that we hit profitability in the second half of this year, and you can draw a line between that from where we are now and where we have to get to in revenue in order to realize that. And I think over time, if you consider just making an easy math, a 10-year run for some of these projects, then you can approximately divide by 10 to get to the run rate at the midpoint of that area. So in terms of where we are, We're very much on track to meet the plan that we originally set out when we came to the market and IPO-ed. We're very confident about that, and we've delivered on it in the first 18 months or so, and we'll continue to do such. That's great. It's very helpful color and perspective there, Donald. And then one question perhaps on the GeoSemi acquisition. I'm noticing clearly that there is strong success there geographically in the Japan-Korea region. Yeah. Wondering if that came through a particular partnership or just a focus there, and how would you take that and expand that success geographically through the combined geo vision queue effort? Is there something you need to do, additional partnerships? Thanks. Well, you know, as we've discussed before, we decided to enter particularly the Japan market latest or last in our evolution program. just simply because the market is quite conservative over there and takes a long time. And so one of the things that attracted us to Jio was in fact that they had a great presence in the Japanese market, very strong representation there with all the name brands, OEMs, with a bunch of the tier ones. They have a very good supply chain through into that market. So that was basically just a huge opportunity for us to enable cross-selling into a new market for our products. And conversely also where they are less strong, in the other parts of the world where we've built up a, you know, a great reputation and a great footprint, we have the ability really in the short term to deploy their products into, into our customers. And, you know, we really expect that there'll be a very good, um, short term cross selling opportunity, which will reflect itself on the top line, um, pretty quickly. Um, how they did that, um, it was largely focused, some key relationships, um, but, uh, Just more than anything, a testament to their great IP, their great products, and their exceptionally hard work in executing that. Thanks, Donald. Thanks, Tom. And as a reminder, if you have any questions, you may press star 1, and also we do ask to please limit yourselves to only one question and one follow-up. Our next question comes from the line of Anthony Stoss with Craig Hallam. Please proceed with your questions. Hi, guys. Mike, congrats as well on the GEO acquisition, and I also wanted to follow up on that a little bit, Donald. Help us understand maybe the design timeframe, the length of it for what GEO does, and under your company now, the scale, the cash you have, how quickly can you accelerate that growth? Maybe give us a sense also what GEO's growth rate had been in the past. Then I had a follow-up. Sure. So... I mean, effectively, as we said in the prepared remarks, they serve exactly the same market as we do. So it's prototypically identical to how we go to market. Certain geographies are a little faster. Certain Asian geographies are a little faster to market. Certain are a little slower, mostly Europe and perhaps Japan, actually, you could include. But, you know, of course, there are opportunities where, given the fact that the products are mature in many cases, that we can deploy into certain areas where there are opportunities that we could see ahead of the acquisition. So, effectively, part of our analysis was that we knew we could make hay with this. And then in terms of their growth from the past, do you want to take that? Yeah, historically, they've been on a pretty good growth path. A couple years ago, they were in the $20 million neighborhood. They effectively doubled last year. And so we're looking to, of course, take that business now to the next level. They've been hindered in the past by their own balance sheet. And in some ways, the way Indy was, and so I think that's one of the huge synergies here to really explode out their business. Yeah, I mean, exactly. I mean, they're in a similar situation to what we were before we became public, and I think the fact that they're now part of us will release a lot of potential in their product deployment, and you should see a similar growth curve to the one that we were able to realize since we came out. Perfect. Then as a follow-up, I want to circle back to – Your radar went from some time ago. I know it's your biggest in the company stream with a top four. What's the feedback been from other potential customers? Are you shipping samples, trialing? I mean, just give us a sense of what the opportunities might still look like outside of your first big win. Well, I mean, we're not giving a lot of detail about that product. development at the moment, and typically we don't generally in any of our product developments. We're on track with it. It's in a good place to meet the time plan that we set out. Generally speaking, having really a one-stop shop of sensor technologies in the market is going to generate all sorts of opportunities for us with all sorts of customers, and we'll report on those opportunities turning into reality as the time becomes appropriate. Thanks, Donald. Our next question comes from the line of Ross Seymour with Deutsche Bank. Please proceed with your question. Hi, guys. Thanks for letting me ask a question. Two NGO, one technology, and then the follow-up will be on the financial side. So first on the technology side, Donald, you talked a little bit about it in your preamble But I just wanted to better understand how this business is complementary to or, you know, potentially some substitution for your preexisting vision portfolio. How do we look at what they bring versus the vision queue you guys had beforehand? Well, I mean, the. the fact that you is they had mature products in certain areas where there were certain pieces of IP that we might have had to to reinvent in order to to access the market so really the key in this was was accelerating our time to market with the division Q activities that we have ongoing the way that our roadmaps work there will be a lot of opportunity for us to take their IP and our IP and join them into something even better as a step beyond the parts that they have available today. Also, in that respect, there are some synergies in the roadmap which we'll take advantage of and we'll ripple through our P&L as we mature that. Ultimately, where we see the The key benefit in what they bring relative to our whole portfolio is bringing sensor fusion together. It's the next topic that we're going to cut into. We see massive opportunities for that in the market, combining the different sensor modalities and the processing thereof into single platforms. And really that's where we're going to see it have the most traction in the portfolio as we bind them in. Got it. Thanks for that. And I guess this one might be more for Tom. On the GEO side, you said there was a stub in your first quarter guide. Any sizing on that and just kind of the linearity of how that $40 million you guys talked about in the deal announcement folds in? Yes, sure. So we're expecting to close this quarter. We're just modeling in a couple million from GEO in terms of contribution. And then from there, it's similar to what we guided for Indy overall. It's accelerating growth, sequential growth. throughout the year. And when you said accelerating, you mean year-over-year accelerating or the sequentials, quarter-over-quarters are accelerating or maybe both? Actually, coincidentally, it's both. Great. Thank you. Okay. Our next question comes from the line of Craig Ellis with B Riley Securities. Please proceed with your question. Yeah, thanks for taking the question. I will... I join the long-hit parade and ask a geo-related question to start. Donald, as you look at geo, and this really does look like one of those one-in-a-hundred deals from a revenue synergy standpoint, but if we're looking at a business that's $40 million now, as you look out two to three years and think about what's possible with cross-selling and with your vision of where Centrifusion goes, How big do you think this business can be in the two to three-year timeframe? Well, in the short term, as I said before, you know, I expected to take the same profile as Indy did when we came out to the market. Basically, it's kind of a little subset of us now, if you can view it that way. In terms of perhaps the longer term, you know, we're seeing extremely high dollar opportunities and extremely high volume growing as a long-term result of that, which, you know, will result in design winds in the future of similar size to the radar design wind that we've talked so much about over the last few quarters. Got it. And then, Tom, so it sounds like with a few million of geo in the outlook, you're just counting on a couple of weeks at most, and then you would go to a full quarter, obviously, and two Qs. That's right. And this business, do you think it sustains the pacing that it had last year as we go through 2023 and 2024? We do. We see it actually, in fact, more than anything else, we see an enormous top-line synergy opportunity here. As Donald mentioned, the cross-selling opportunities are fairly enormous. So those conversations have already started, so we could see some benefit from that. even in the back half of this year. That's not contemplated in the guidance we put forth last week in terms of expecting to see at least 40 million incrementally from GEO this year. And then, of course, that sets the stage thereafter for 24 and 25. Yes, got it. And if I could sneak in one last one. Tom, just any color on what drove the gross margin upside in the fourth quarter? It was a nice combination of things. Our mix just continues to improve. New program ramps layering in. Scale is, of course, a big dynamic here. And then, in general, the supply chain is loosening up a little bit. And so that was also helpful. So all those dynamics are contributing to, you know, have certainly contributed of late to the gross margin expansion we've demonstrated. And we see that continuing, those very dynamics continuing on our way to 60%. Congratulations on all the progress, guys. Great momentum. Thanks, Craig. And our next question comes from the line of Cody Crewe with Benchmark. Can you proceed with your question? Yeah, thank you. And let me add, Mike, congratulations to the group. Did you talk, Tom, about your backlog, give a number? I had to step off the call for just a second, but did you give an absolute backlog increase? Not this cycle. Stay tuned on that. We generally provide that in the November conference call. Along the way, of course, we'll provide program wins and updates and such, but we want to make that an annual event. Did that number increase sequentially? We just haven't. We've won some programs, certainly, since November, but we just haven't publicly sized them yet. Okay, great. And then one for Gino. What is the contribution margin that you're expecting near term, and then how does that grow with the contribution? Oh, you're saying the incremental contribution margins? Yeah, what is GEO's base gross margin increase? Is that additive or diluted to what you've got today? Sure, sure. So initially in the current quarter, it's slightly dilutive below our average, but we'll take some steps and fairly quickly here to get their margins at parity with our expansion. And then thereafter, in fact, I think when we moved to 24 and 25, it's actually enhancing our gross margin. And a lot of that, candidly, is they've just been subscale. And we've got some supply chain relationships we can work there to bring their margins more in line with us. This is the one quarter, in fact, I was going to add, this is the one quarter, you know, given that between... The announcement and closing, we're not going to have that much time to really implement the synergies. Those really come into focus in the back half of this year. Okay. And then lastly, just the folding in of the machine visioning or the video processing from Jio into your total ADAS offering. When do you expect to be marketing those programs as a portfolio of offerings of solutions? And what do you expect that traction to look like? Well, from the get-go, we'll begin to incorporate their portfolio into ours. Of course, we did our homework before the acquisition and we're very well aware about the market demand for the potential of the combination of the technologies that they have and that we have. We do expect that the resonance for this is going to be pretty immediate. Excellent. Thank you, guys. Congrats. Thank you, Cody. And we have reached the end of the question and answer session. I'll now turn the call over to management for closing remarks. Well, thanks for joining us, everybody. Look forward to seeing you at the upcoming investor conferences and see you next quarter. This concludes today's conference and you may disconnect your line at this time. Thank you for your participation.