Good afternoon, and welcome to Indy Semiconductor's second quarter 2024 earnings call. At this time, all participants are in a listen-only mode. A question-and-answer session will follow the formal presentation. As a reminder, this conference call is being recorded. I will now turn the call over to Ashish Gupta, Investor Relations. Mr. Gupta, please go ahead. Thank you, operator. Good afternoon and welcome to Indy Semiconductor's second quarter 2024 earnings call. Joining me today are Dalma Kleinman, Indy's co-founder and CEO, Raja Bal, Indy's acting CFO and chief accounting officer, and Mark Tindall, head of corporate development and investor relations. As a reminder, our CFO, Tom Schiller, is currently recuperating while on medical leave of absence. That will provide opening remarks and discuss business highlights, followed by Roger's review of Indy's Q2 results and Q3 outlook. Please note that we will be making forward-looking statements based on current expectations and assumptions which are subject to risks and uncertainties. These statements reflect our views only as of today and should not be relied upon as representative about views as of any subsequent date. These statements are subject to a variety of risks and uncertainties that could cause actual results to differ materially from expectations. For material risks and other important factors that can affect our financial results, please review our risk factors in our annual report on the Form 10-K for the fiscal year ended December 31, 2023, as well as other public reports filed with the SEC. Finally, the results and guidance discussed today are based on consolidated non-GAAP financial measures, such as non-GAAP gross margin, non-GAAP operating income loss, non-GAAP net income loss, and non-GAAP EBITDA. These metrics may exclude from its corresponding gap measures certain or the following items. Depreciation and amortization, surface compensation, acquisition-related expenses, gain or loss from change in fair values, non-cash interest expense, and income tax benefits or expenses. For complete reconciliation of the gap and the definition for the above items, please see our Q2 earnings press release, which was issued in advance of this call and can be found on our website at www.indiesemmy.com. I'm now turning the call over to Donald. Thanks, Ashish, and welcome, everybody. I want to start by welcoming Mark Tindall, our new Head of Corporate Development and Investor Relations to Indy. Mark is looking forward to meeting all of you over the next months. Let me first briefly cover our revenue performance in the context of the overall automotive market environment. before focusing on the technical and business achievements. During the second quarter of 2024, Indy achieved total revenue of $52.4 million, coming in flat from Q1 at the lower end of our previous outlook. Our results were generally in line with the automotive market, where unfavorable global macroeconomic conditions impacted vehicle production, with consensus forecasts currently projecting approximately 88 million units for 2024, in comparison to just over 90 million units in 2023. Additionally, given lower consumer pricing thresholds for vehicle purchases and reduced global electric vehicle stimulus programs, automotive OEMs have been prioritizing de-featured vehicles, which has led to reduced semiconductor content. These factors, coupled with ongoing inventory consumption, which persisted in the second quarter, negatively impacted our revenue against our prior outlook, We now anticipate this trend will spill over into the second half of 2024, as reflected in most recent analyst estimates, which project essentially flat to low single-digit negative growth for the automotive semiconductor industry in 2024. Despite these headwinds, we believe that with our new product launches and current customer status, Indy is poised to deliver modest growth in the third quarter growing above the market to reach outsized growth levels as we move through the second half of 2024 and into 2025. Now, looking closely at our business progress in the second quarter, in the ADAS sector, I want to point out that Indy is unique and differentiates itself from its competitors as being the only chip vendor offering all four of the key ADAS sensors, radar, vision, lidar, and ultrasounds. which gives us the unique ability to offer any combination of these sensors. This will enable the scalable ADAS processing architectures that car makers are demanding for deployment across their portfolio. This gives us the ability to fuse multiple modalities into a single chipset solution. We are now in discussions with key OEMs to define the specifications for our next generation AI-centric sensor fusion products. I will continue to keep you updated in upcoming quarters as we progress. Starting with our flagship 77 gigahertz radar program, since sampling our millimeter wave and DSP products to our lead customer, I'm extremely happy to now share that we have achieved the important milestone of full functional verification in our labs, including the all-important range Doppler performance, which surpasses current industry benchmarks. This technical evaluation has also been completed by our lead customer, and the radar is currently being tested in live automotive application environments. which is the final stage of testing before volume production. I want to stress here these advancements keep INDIE firmly on track to bring this radar program to production within the 2025 timescales previously communicated. Furthermore, samples of our 120 GHz radar front-end IC developed for high-resolution in-cabin vital signs monitoring and vehicle dynamics sensing have been received in our labs, and I'm delighted that functionality for this challenging RF application has also been validated. This demonstrates Indy's clear leadership in the market for next generation radar solutions, which is a cornerstone of Indy's high growth trajectory for 2025 and beyond. Moving on, vision-based sensing in particular has received key industry focus recently as a result of two major regulatory directives, which will play nicely in Indy's favor. First, in the U.S., the road safety regulator, the National Highways Traffic Safety Administration, or NHTSA, announced that automatic emergency braking, or AEB, would become mandatory for all passenger cars and light trucks in 2029. While many new vehicles today are already equipped with AEB, the progressive aspect of NHTSA's mandate is that it is the first global regulator to stipulate that pedestrian AEB requirements be extended to nighttime conditions. This is significant because none of today's commercial radar or camera sensors have the required performance to deliver such features. Long and mid-range radar sensors operating at 77 gigahertz lack the required resolution and performance for reliable pedestrian detection. And the image sensors and image signal processing deployed in today's camera systems exhibit insufficient low light sensing capability. These sensor shortcomings, particularly the vision sensors, accelerate an exciting and significant opportunity for our recently launched computer vision solution, the IND880, which features our newest proprietary image signal processing and can perfectly address NHTSA's requirements. Last quarter, we shared that we were preparing to sample the SOC to customers, and I am excited to now confirm that the IND880 has not only been sampled to key customers with extremely positive feedback, It has also been selected for high-volume production programs by a number of global OEMs scheduled to ramp in late 2025. Some of these wins for the INDI 880 include applications as diverse as OMS, occupancy monitoring systems, additionally a demanding non-passenger vehicle application which will use up to 36 cameras per vehicle, leveraging to the maximum the multi-channel ISP and high dynamic range capabilities of the INDI 880, And finally, the IND 880's high performance but low power and tiny footprint is also proving the perfect solution for surround view and e-mirror applications, with the first design win successes at two major European OEMs achieved also in the second quarter. These wins, so quickly after the availability of the IND 880, are a clear indication of the potential of this product as a major revenue contributor for IND going forward. The second impactful regulatory initiative is the European Union's Intelligence Speed Assist requirement, ISA, which is now mandatory in all new European cars as of July this year. Studies have indicated that ISA may reduce road fatalities by up to 20%. In combination with GPS for positioning, ISA leverages the vehicle's front view camera for speed sign detection to warn a driver of exceeding local speed limits. This European ISA mandate further underscores the need for superior low-light vision sensing capabilities, and we are seeing a strong pull-through impetus for Indy's latest generation computer vision systems, including the IND880. Our design wind momentum for our previous generation GW5 family of vision SOCs also continues unabated, particularly for driver monitoring applications. In the second quarter, we started volume shipments for two mass production programs at the Hyundai Kia Group, Additionally, in the second half of this year, we expect to begin volume production shipments to multiple Chinese OEMs, including Geely, BYD, NIO, Cherry, and Audi China. Turning to in-cabin user experience, or UX, our discussions with OEMs globally reveal a consistent request for SOC solutions or custom ASIC solutions that can deliver more. More wired and wireless charging power delivery for personal devices, more bandwidth and improved signal integrity for reliable networking and multi-screen video delivery, and lighting solutions that can deliver more light output and thermal stability under changing environmental conditions. These OEM requirements are incredibly difficult to deliver in cost, power, and BOM-efficient SOC implementations, and they're often underserved by our competitors with limited ASIC capability. In contrast, This is an area of mixed signal design where Indy excels and continues to expand our customer design wind pipeline. For example, in Q2, we secured major new lighting design winds with two of North America's largest OEMs for in-cabin lighting applications, such as overhead console, doors, and dashboards. These programs will commence volume production later this year and ramp quickly as these OEMs launch multiple models in quick succession. Additionally, we continue to solidify our lighting leadership position at practically all Chinese OEMs, and we have also secured multiple new design wins with multiple Korean brands that will begin shipping early in 2025. For UX, we continue to see strong OEM demand to enable the latest standards for in-cabin wired and wireless charging to meet the insatiable consumer demand for higher power and faster charging of personal devices. Here, I'm pleased to share that the wireless charging OEM win in India we alluded to last quarter leveraging our systems capability was for Volkswagen, and will be delivered through their local tier one for a 2025 production round. There have been multiple similar examples this year where our systems design prowess has allowed India to shorten the typical long design-in cycle. I'm also pleased to announce that we recently achieved the significant milestone of shipping 400 million chips cumulatively to our broad and global customer base. This is an achievement that I am incredibly proud of, which clearly reflects the differentiation that our products bring to our customers, as well as the tireless innovation and dedication of the Indy Global team. In summary, despite the current muted automotive environment, the actual mid- to long-term opportunity remains bright with S&P Global projecting total automotive semiconductor value to exceed an incredible $100 billion in 2026 and surpass $130 billion in 2029. India remains extremely well positioned to capitalize on these trends, with the strategy we are currently executing for the three automotive megatrends not only in product development, but also in securing key design wins and partnerships with the major global OEMs. This together with the progress we have made in our key 2025 radar and vision programs just outlined makes me confident that we will deliver sequential quarterly growth in the second half of 2024, accelerating into 2025 when we anticipate a return to an industry-leading growth trajectory. While India has experienced some temporary short-term delays to the start of production of some programs, created as a knock-on effect of the overall macro conditions, I want to stress across the portfolio that we have not lost any designs. And in fact, our growth trajectory has simply shifted modestly. I'll now turn the call over to Raja for discussion of our Q2 results and Q3 outlook. Thanks, Donald. Revenue for the second quarter of 2024 was roughly flat year over year at $52.4 million, coming in at the low end of our outlook, as Donald outlined. Non-GAAP gross profit was $26.3 million, translating into a 50.3% gross margin, which was slightly below plan, resulting primarily from an unfavorable product mix. R&D was $32.8 million, while SG&A was $10.7 million, bringing total operating expenses to $43.5 million, consistent with our forecast. As a result, our second quarter non-GAAP operating loss was $17.2 million. With net interest expense of $800,000, our net loss was $18 million, and net loss per share was 9 cents on a base of 191.1 million shares. Turning to the balance sheet, during the quarter, we incurred total cash usage of $19.7 million through operating activities and $3.7 million in cap exit expansion, exiting the quarter with $122.6 million of total cash. Moving to our outlook, for the third quarter of 2024, we expect to deliver modest quarter-over-quarter revenue growth within the range of 0% to 5% or 2.5% at the midpoint, outpacing the projected automotive industry. At the same time, we expect gross margins of approximately 50% and op-ex of $44 million. Below the line, we anticipate $1 million in net interest expense and no taxes. Assuming the midpoint of the revenue range, and with 199.5 million shares outstanding, we expect $0.09 net loss per share for the third quarter. Looking further ahead, based on the production ramp plans for our radar and vision programs, we anticipate a return to our industry-leading growth trajectory in 2025 and beyond. With that, I'll turn the call back to Donald for his closing comments. Thanks, Roger. In closing, While industry headwinds for the automotive market have persisted, Indy's strategic outlook continues to strengthen, driven by our design wind momentum. Our focus on innovation, customer engagement, and operational excellence is distinguishing us in the market. With cutting-edge solutions spanning ADAS, user experience, and electrification, Indy remains at the forefront of the automotive industry's transformative megatrends. We're excited about our future and remain ideally positioned to capitalize on market opportunities as conditions improve. continuing our journey to build the next automotive powerhouse global semiconductor company. That concludes our prepared remarks. Operator, please open the line for questions. Thank you. Ladies and gentlemen, we will now begin the question and answer session. To ask a question, you may press the star key, then one on your touchtone phone. If you are using a speakerphone, please pick up your handset before pressing the keys. To withdraw your question, please press the start key, then two. One moment, please, for your first question. The first question comes from Suji Da Silva. Please go ahead. Hi, Donald. Hi, Roger. So maybe I can start with the overall auto demand environment in the second half. Donald, can you characterize where we are in the auto inventory digestion cycle as we look at 3Q and then 4Q qualitatively and, you know, by early 2025, any changes? call for when they may be worked through or whether it already is, any color there would be helpful. Thank you. So as we said in the prepared remarks, I mean, we are seeing the inventory situation significantly improving. That was certainly the case through Q2. It did persevere a little longer than we expected. But at this point, we're seeing general recovery from the inventory situation. And we do expect that that will allow us a little more flexibility going forward into the second half of the year. Okay. Thanks. And then looking at the 25 and the lead radar program along with other programs, I guess, do you have any sense of the timing in the 25 timeframe we would start to see that revenue contribution? And if, you know, what factors, you know, can impact the commencement of that program if it's relatively fixed in place with model years or whether there's some variability there, any color there would be helpful as well. Thanks. Well, this is a very large program. So it entails ramping through our key lead customer multiple OEMs. So it will be something that takes some, let's say, significant amount of time to get to full volume. But we are very confident now about the situation that we find ourselves in I mean, the parts are back, as we mentioned in the prepared remarks also. They've been very successful in testing. We've made super fast progress to get through that whole process. So we feel that a lot of the execution risk is really out of that. We won't comment on exact timing because there's a certain amount of confidentiality that we have with our lead customer and who's getting what when. But we feel generally really positive about the situation. I'd add also the vision ramps that we're expecting to happen through the second half of this year and into next year in the sense that, again, the engineering risk is out for those programs. The products are mature, and it really is a question of the deployment really within our end customer, which has been running reasonably well, I would say. The next question comes from Ross Seymour. Please go ahead. Hey, Donald. Just a question on the certainty, and it kind of follows up Suji's question to a certain extent. But 90 days ago when you talked to us, everybody thought that market would get a bit better in the back half, and that hasn't happened as much as we hoped. I get that part. But you also talked about a lot of the growth you were confident in being driven by company-specific ramps. So I guess what happened to those company-specific ramps? And more importantly than that, If they didn't happen to some degree, what gives you confidence or the willingness to commit to the radar side of things, given the uncertainty that seems to be hitting today? I mean, so nothing is missing from our backlog. There was no programs lost. We are very confident that everything that we talked about before will happen. We have seen some delays in programs. You've probably read a lot about some of the restructuring at the major automotive companies where people are missing from certain programs who are not there anymore, and that's caused a certain amount of delay for us in the market, also coupled with the fact that they're also consuming a certain amount of inventory from older generation products, which causes a little delay. But generally speaking, they are on track. They will ramp. Any of the delays are, let's say, more organic in nature rather than some conscious large decision to delay a program or cancel anything. That's not been the case. So we feel good about that. And really, in this case, it's just a knock-on effect of the macro that's caused this slight delay. So nothing lost, and we're feeling super excited about what's coming. We've also seen a lot of momentum and design wins through the course of this quarter, which should drive our future even higher as we move forward. Thanks for that, Culler. And then I guess as my follow-up, either probably for you and Raja, getting into the profitability side and the gross margin specifically, we've heard from some of your other auto semi-exposed peers about the tier ones and others burning inventory down to ridiculously, well, let me say significantly lower levels than people had expected, returning to kind of past behavior despite the shortage issue that they all complained about in the middle of the pandemic. So one, are you seeing that? And two, is there any pricing follow-on? And that would kind of lead to the gross margin trajectory for next year. Yeah, we do see that. I mean, we're for sure back to just in time in spite of what happened during the allocation situation. No material pricing impact for us as yet that we can see. Next question comes from Anthony Stoss. Please go ahead. Thanks. I just want to start with offering Tom my best wishes. Hopefully, he'll be back in short order. Donald, I want to follow up on Ross's question. I think you kind of dodged it to some degree. In the past, you've talked about half a dozen, a dozen new programs launching between Q3, Q4, this calendar year. On the call, you said there's delays in some production ramps. Can you maybe equate to ask the wins that you thought were going to go live aren't going to go live, they're going to shift a quarter, just any more detail on you're saying you haven't lost them. I'm just trying to figure out where the shift is. Yeah, I mean, it's just a knock-on effect of the macro situation. We have seen certain product verticals which are a little more impacted than others. Some have indeed ramped, and that's been in some cases in the last quarter at least offset by some additional inventory consumption. So some of them have already happened, and that's nice because once you start, then you're opening the spigot and it will begin to ramp through. So from our perspective, again, nothing's lost. There's some slight delays in these programs. And, you know, we expect that the second half will begin to pick up and drive strongly through 2025. Okay. And then on top of the first, excuse me, major radar win, I think you in the past talked about wins with Bosch and FACASA. Are those still on track? Or, you know, just any update you can provide on those two would be helpful. Yeah, those are very much still on track. They're slated to ramp next year, and we're really happy with the progress on those programs. The next question comes from Craig Ellis. Go ahead, sir. Yeah, thanks for taking that question, Donald. I'll just start with a follow-up to Tony's question there on RadarBOSH and FACASA. Can you give us some sense for when you'd expect each of those programs to ramp during the year, are they all kicking off in the first quarter, or will it be more phased as we go 1 through 4Q? No, they're phased. I mean, we won't give specific ramp dates for customer programs, but they are indeed phased throughout the whole year. Got it. And then, Roger, I wanted to cycle back to the gross margin guide for the third quarter. So I'm You know, why would it be with revenues up that we're down a little bit quarter on quarter? Can you just talk through some of the gives and takes in gross margin? Thank you. So we're not expecting gross margin to erode next quarter. We had a slight downtick in Q3, and that was primarily the result of some unfavorable product mix that we saw in the quarter. The next question comes from John Tanwantang. Please go ahead. Hi. I was wondering if you could go through the decontenting trend and when you think that might reverse and how that's impacting, I guess, your forecast or your backlog is how you think of it. Are the indicated volumes that your customers are telling you they want lower than they were before, and especially as they go into 2025? I mean, there's some short-term puts and takes that we see. We don't really see a shift in 2025 because the forecasts for those areas are I would say reasonably fixed at this point. I mean, obviously that can change, but at this point we don't see a big impact from that. And next year, it's really more of a short-term issue that we've seen where just really due to consumer appetite to buy lower-priced cars increasing versus higher-priced cars, and that is generally bad for the semiconductor content overall. It's not specific to us. It's a general market trend. Okay, got it. And then as we look into Q3 and possibly into Q4, you know, flat to up revenue, I assume that incorporates, you know, some of the new launches that you're doing. Is it fair to imply that, you know, the existing products you had heading into Q3 are declining as a result? Not declining, no, but there is still some inventory burn off in certain spot areas of our product portfolio, which It is now largely alleviated compared to what we went through in the last couple of quarters, but still something that we need to manage. It has been offset by new program ramps. But, yeah, I mean, we hope we're guiding conservatively. Next question comes from Cody Acree. Please go ahead, sir. Yeah, thanks for answering my questions and my best to Tom and his recovery. Thanks, Cody. Absolutely. Could we maybe talk a bit about your mix between product revenue and contract revenue? We don't usually talk a lot about that mix with contracting typically pretty consistent, but with it being down 50% and your product revenue being up 8%, there seemed to be a dichotomy this quarter. Yeah, so that's a good point. So our total NRE contract revenue as a percentage of total has come down this quarter, as well as it did last quarter, as you pointed out. And we expect that trend to continue. In fact, over time, we're going to see more of a shift towards ASSPs as opposed to custom ASICs in our business. And so that, over the long term, we expect will come down over time. So your expectations for the September and December periods are for contract versus product fairly flat to where we are today. Ladies and gentlemen, there are no more questions at this time. The conference has now concluded. Thank you for attending today's presentation. You may now disconnect.