Good afternoon, everyone, and welcome to Indy Semiconductor's Third Quarter 2021 Earnings Call. This call is being recorded. At this time, I will turn the call over to Pilar Borregas, Head of Global Corporate Communications for Indy. Ms. Borregas, please go ahead. Thank you, operator. Good afternoon, everyone, and welcome to Indy Semiconductor's Third Quarter 2021 Earnings Call. Joining me today are Donald McClymont, Indy's co-founder and CEO, and Tom Schiller, Indy CFO and EVP of Strategy. Donald will provide opening remarks and discuss business highlights from the quarter, followed by Tom's review of Indy's third quarter results and fourth quarter outlook. Please note that we will be making forward-looking statements based on current expectations and assumptions, which are subject to risks and uncertainties. These statements reflect our views only as of today, and should not be relied upon as representative about views as of any subsequent date. These statements are subject to a variety of risks and uncertainties that could cause actual results to differ materially from expectations. For further discussion of the material risks and other important factors that could affect our financial results, please refer to our risk factors in our recent registration statement on Form S-1 and our other public reports filed with the SEC. Additionally, the results and guidance discussed today are based on certain non-GAAP financial measures. For a complete reconciliation to GAAP, please see our Q3 earnings press release, which was issued in advance of this call and can be found on our website at IndySemi.com. With that, I'll turn the call over to Donald. Thanks, Pilar, and welcome, everyone. I'm pleased to report our strong quarterly results and discuss the strategic initiatives we have completed in the few short months since our debut as a public company in June of this year. For the third quarter of 2021, INDI exceeded both top and bottom line expectations, as well as made significant strides towards realizing our vision of becoming the semiconductor and software solutions provider across Autotech. Specifically, during the quarter, we outpaced our addressable markets and grew revenue sequentially and year-over-year to a record 12 million. We expanded gross margin in a challenging supply chain environment, doubled down in key strategic product investment areas, exited the quarter with $324 million in cash and virtually no debt, and updated our strategic backlog to $2.6 billion, up from $2 billion last year. At a higher level, Indy is clearly at the center of several powerful industry megatrends. Automakers are in the early stages of large-scale investments in next-generation vehicles that will usher in increased safety features and enhance the user experience towards widespread electrification and autonomy. As a result, semiconductor content per car is anticipated to reach up to $4,000 per vehicle, an 8x increase from the average level today. According to IHS, the global automotive semiconductor market is on pace to reach $36 billion in 2021 and is expected to exceed $62 billion by 2026, growing at a compound annual growth rate of 12%. Meanwhile, Indy's served addressable market represents $19 billion over this time in 2021 and is expected to grow to $40 billion over this same timeframe, or about 15% per year. In particular, Sales of advanced driver assistance systems are expected to rapidly cascade down from flagship models today to entry-level vehicles, as park assists, early warning systems, and collision avoidance functions increasingly become standard features as mandated by regulatory agencies. Additionally, wireless charging, ambient lighting, in-cabin connectivity, telematics and data integration products, spaces where Indy is already active, are seeing strengthening demands. All of these factors will drive dramatic changes to vehicles' electronic architectures going forward. The future of electrification and autonomous vehicles are expected to create enormous opportunities for the automotive semiconductor industry, and Indy in particular, as these applications require the latest in highly integrated mixed signal semiconductors and embedded software. Today, Indy's advanced technologies are directly answering intensifying market needs for a step function increase in electronic performance and integration required by our customers. Our third quarter outperformance demonstrates how we are in the early innings of capitalizing on this opportunity. Further, to that end, during Q3, we ramped production of ultrasound devices for ADAS and park assist systems, captured next generation sockets with a global automotive connectivity and power delivery leader, secured advanced lighting designs with a premier provider of electric vehicles and expanded our footprint of the German automotive supplier for user experience applications. At the same time, we are strategically adding innovative design teams and capabilities to augment our technical breadth, accelerate Indy's product roadmaps, extend our market reach, and substantially bolster our IP portfolio. First, we executed a purchase agreement and subsequently closed our acquisition of Teraxion, adding complementary LiDAR laser solutions for ADAS and autonomous vehicle applications. Given the critical role LiDAR plays in achieving maximum levels of safety for assisted and self-driving cars, we are excited to leverage Teraxion's leadership laser technologies that, when optimized together with our SOC solutions, will facilitate order-of-magnitude improvements in both system performance and cost, and in turn position Indy to accelerate mass market deployment of LiDAR platforms. Second, we recently announced our intent to acquire analog devices' Simeo radar division. Simeo's industry-leading sensor technology, underpinned by 120 radar-related global patents and applications, enables real-time position detection and velocity measurement for high-precision radar solutions. Upon closing, which we anticipate to be in Q1 2022, this transaction will accelerate our entry into the large and growing automotive radar market, as well as further augment our software and system level expertise in support of ADAS and autonomous vehicle applications. And third, we have acquihired a radar design team of highly skilled engineers in Haifa, Israel and Phoenix, Arizona, who bring strong domain and millimeter wave technology along with 65 radar patents and applications. Bringing together the latter two teams with incredibly strong and complementary expertise, significantly expands our sensor modality capability and confirms our commitment to this market. With the global automotive radar TAM expected to reach 7.6 billion by 2026, we are thrilled to welcome both design teams. Finally, we announced the formation of the dedicated VisionQ business unit led by proven industry veterans to expand our edge compute and perception-enabled vision processing capabilities. This team has already demonstrated extraordinary success in bringing millions of silicon software and system solutions to the vision processing market over the last two decades. We plan to leverage their experience to create high-quality, differentiated devices with the best performance at the lowest cost, power, and footprint, redefining perception-based vision processing. As a result, Indy is now even better equipped to capitalize on the Autotech opportunity as we create a one-stop shop for all sensor modalities, including LiDAR, radar, ultrasound, and vision, while continuing to drive advanced roadmaps of our existing product lines and expanding our geographic design and development footprint to uniquely serve our customers' needs. I'll now turn the call over to Tom for discussion of our Q3 results and Q4 outlook. Thanks, Donald. Indy delivered strong top and bottom line performance in the third quarter, once again posting results ahead of analysts' expectations. Revenue was up 60% year-over-year and 32% sequentially to a record $12.2 million, driven by ramps of our innovative ADOS, user experience, and connectivity solutions. Gross profit was $5.2 million, translating into a 43% gross margin, up 90 basis points from the June quarter. Operating expenses were $16.8 versus $13.4 million in the prior quarter as we increased our R&D investments to $12.3 million to accelerate product development. Likewise, we increased our SG&A spending to $4.5 million to expand our marketing capabilities and implement public company infrastructure. Operating loss was $11.5 million versus the analyst consensus estimate for a $14.9 million loss. Interest, other expenses, and taxes were near zero, yielding a net loss of $11.6 million and loss per share of $0.09. Turning to the balance sheet, during the quarter we settled our remaining merger-related accrued liabilities and exited Q3 with $324 million in cash and virtually no debt. Now to our Q4 2021 outlook. Given the dynamics Donald outlined, Indy is capitalizing on strong global demand for our auto tech solutions and set to deliver record fourth quarter revenue. We anticipate sustained top line out performance with revenue up 50% sequentially and up more than 170% year over year. With this guidance, which includes a partial quarter of our recently closed Teraxian acquisition, Indy is now approaching a $75 million annualized revenue run rate, and is on pace to more than double total revenue in 2021. We further anticipate a 200 basis point gross margin expansion to 45%, with approximately 21.5 million in operating expenses for the fourth quarter, comprised of 16 million in R&D and 5.5 million of SG&A, as we increase our product development investment in response to pent-up customer demand and extend our sales and marketing reach. Accordingly, assuming no other net expense or taxes below the line and approximately 147 million shares outstanding, which includes 7.3 million shares from the Teraxian acquisition, plus 5 million earn-out shares given our stock price performance, we expect a net loss of approximately $0.09 per share. Finally, and perhaps most importantly, Based on our business momentum and strategic backlog, Indy is well positioned to maintain this steep growth trajectory over the coming years, expand gross margin to our 60% target model, demonstrate operating leverage, and in turn create long-term shareholder value. On that note, I'll turn it back to Donald for his closing comments. Thanks, Tom. To summarize, Indy is at the forefront of disruptive changes taking place across the auto tech sector. We are taking major steps toward realizing our vision of becoming the leading semiconductor and software level solutions provider for multiple sensor modalities and will continue to make the necessary investments required to best capitalize on the enormous opportunities ahead of us. We're laser focused on addressing our customers' needs and creating differentiated platforms, enabling solutions that will help unleash next generation driver assistance systems and ultimately enable true autonomous driving while simultaneously advancing user interfaces to enhance the in-cabin experience. In short, our comprehensive, highly integrated, and cost-effective architectures are enabling our customers to fulfill the promise of tomorrow's vehicles today. That concludes our prepared remarks. Operator, let's open the call for Q&A. Thank you. To ask a question, please press star 1 on your telephone keypad. A confirmation tone will indicate your line is in the question queue. You may press star 2 if you'd like to remove your question from the queue. For participants using speaker equipment, it may be necessary to pick up your handset before pressing the star keys. We ask that you limit yourself to one question and one follow-up. And your first question comes from Craig Ellis with B. Riley. Your line is open. Please go ahead. Yeah, thanks for taking the question, and congratulations on the strong performance and output, guys. Donald, I wanted to direct the first question to you. And it's really a higher level question regarding the interaction that you're having with customers after announcing the two acquisitions, Terraxion and Simeo. How is that impacting, one, the opportunity they see with you and really the breadth of opportunities that you see across your customer base for things in the ADAS realm? Thanks, Craig. The feedback's been overwhelmingly positive. In the case of Teraxion, the combination of their laser technologies and our mixed signal SOC technologies is something that's opened the eyes and excited customers who were already excited with what we had beforehand, but now the fact that we're able to offer more of the bill of materials to them in more of a sort of one-stop shop type environment I mean, the velocity of the engagements has simply increased. With Simeo and the addition of the additional RF microwave designers, certainly that opens a kind of greenfield market for us where, as we mentioned in the remarks, it's an extremely large market. It's extremely hungry for new technologies and new entrants at this point. So, yeah, we're really excited, and I believe our customers are very excited, too. And the press release, I believe, spoke to an expansion in the long-term backlog. Can you talk more about that? Where are you seeing that expansion and what specifically drove that in the quarter? Well, actually, I mean, the backlog is a culmination of almost a year's worth of time passing since we last gave an update, which was around the time of our announcement of the SPAC culmination. So really it's a culmination of a large amount of work across many design winds which are fairly evenly spread across our three areas of focus and the ADAS sensing to enable autonomous driving, user experience and indeed in electrification. If I could call out three things which are clear, the lighting wind that we talked about in the prepared remarks here is one of the key drivers. the e-vehicle platform design win, which we talked about in last quarter's earnings, and, of course, the addition of the Teraxion revenue, which speaks to the LIDAR in the future. Thank you. Our next question comes from the line of Ross Seymour with Deutsche Bank. Your line is open. Please go ahead. Hi, guys. I wanted to echo the congratulations. Donald, you guys are doing a great job. You guys are doing a great job, not only in executing in your business, but also in the M&A front with the deals that you announced, the long list of them. I just wondered from a high level, do you think you have the pieces of the puzzle necessary to really address the vast majority of the TAM you really want to go after? Or do you think Indy is going to remain pretty acquisitive for the foreseeable future? Well, I mean, we're very happy with the constellation that we have in place right now, and that's more than adequate to execute our plans and then some. I mean, there are many opportunities out there for groups that are interesting. We like to add areas of new technology which can add new strength to our bow and indeed to to augment our ability to address the markets that we're already in. So, yeah, I think the answer fundamentally, the answer to your question is both. Got it. Well, my follow-up will be another high-level question for Donald, I would guess. Supply shortages are a big question mark in the auto industry, as you guys well know. You guys have been navigating them very successfully by hitting your numbers and guiding strongly, etc., But when you look at the supply situation, is it in any way either directly or indirectly impacting your revenue growth, or are you able to actually navigate it well and take some share where other people are running into bigger problems than you? So generally, how are you seeing that environment? Is it hurting you, and do you think it loosens up going forward? Well, first and foremost, as we've shown so far, we've been able to navigate it pretty well. We've met our numbers on a pretty steep growth trajectory in spite of everything. I mean, fundamentally, of course, it would be churlish to say that it hasn't limited us because the number of cars sold this year was down on that respect. On the other hand, that means that there's a huge amount of pent-up demand which should basically release once the Allocation situation wears off through the course of 2022. So I mean people still want to buy cars I mean if you go try and buy a car off a lot today, you can't find one And and that will fundamentally change once the allocation situation changes How we see that going forward, I mean it's going to be extremely tight and we're going to need to continue The the good management process that we've had recently at least through the next two quarters maybe into the middle of 2022 and I would say the demand for automotive semiconductors won't relent. If anything, we should see strength in that. If anything relieves the pressure valve, at least, I would imagine it would be in other areas such as consumer, which would in turn then allow a little more space and fabs to be made available for automotive guys like us. Thank you. That concludes the Q&A session. I will now turn the call over to Donald McClymont. Well, thanks, everybody. Look forward to seeing you at our upcoming investor meetings, and see you next quarter. This concludes today's conference, and you may disconnect your lines at this time. Thank you for your participation, and have a wonderful day.