Good afternoon and welcome to Indy Semiconductor's first quarter 2023 earnings call. At this time, all participants are in a listen-only mode. A question and answer session will follow the formal presentation. As a reminder, this conference is being recorded. I will now turn the call over to Ashish Gupta, Investor Relations. Mr. Gupta, please go ahead. Thank you, operator. Good afternoon and welcome to Indy Semiconductor's first quarter 2023 earnings call. Joining me today are Donald McClimat, Indy's co-founder and CEO, and Rajabal, Indy's chief accounting officer. Tom Schiller, Indy's CFO and EVP of strategy, is out of the office with the passing of his mother just days ago. Donald will provide opening remarks and discuss business highlights, followed by Rajabal's review of Indy's Q1 results and second quarter outlook. Please note that we are making forward-looking statements based on current expectations and assumptions, which are subject to risks and uncertainties. These statements reflect our views only as of today and should not be relied upon as representative about views as of any subsequent date. These statements are subject to a variety of risks and uncertainties that could cause actual results in different materially from expectations. For discussion of strategic backlog formulation methodology, please refer to our safe harbor statement E3 2022 earnings press release. For material risks and other important factors that can affect our financial results, please review our risk factors in our annual report on Form 10-K for the fiscal year ended December 31, 2022, as well as other public reports filed with the SEC. Finally, the results and guidance discussed today are based on certain non-GAAP financial measures. For a complete reconciliation to GAAP, please see our Q1 earnings press release, which was issued in advance of this call, and can be found on our website at www.indiesetting.com. I'll now turn the call over to Donald. Thank you, Ashish, and welcome, everybody. I'm pleased to report that Indy delivered yet another above-plan record performance in the first quarter, reflecting robust demand for our highly innovative Autotake solutions and our unwavering commitment to achieving operational excellence. Once again, we substantially outpaced our industry peers driven by Indy's diverse and differentiated product set underpinned by over 400 global patents and applications. We're off to a strong start in 2023. Specifically, during the quarter, we grew revenue 84% year over year and 22% sequentially to $40.5 million and achieved a gross margin of just over 52%. Our deep R&D investments and targeted acquisitions are beginning to yield results, allowing Indy to sharply outpace our peer group and insulate us from isolated geographic customer and market weakness. As we'll review, we're gaining design win momentum across ADAS, user experience, and electrification applications, setting the stage for sustained outsized growth for years to come as these wins translate into program ramps and ultimately revenue and free cash flow generation. First, within the ADAS product area, we're enabling automotive OEMs and Tier 1 suppliers to meet the growing demand for advanced safety systems in next-generation vehicles. Importantly, we continue to follow a technology agnostic approach, supporting multiple sensor modalities such as radar, LIDAR, computer vision, and ultrasonic solutions, from which we will ultimately fuse the data created to provide a comprehensive and accurate perception of the vehicle's surroundings. We believe that a sensor fusion product roadmap, augmented and accelerated by our acquisition strategy, has truly differentiated Indy from the pack, including competitors who tend to cling to one modality, often with an extremely narrow customer base. Quite simply, we believe that no single sensing modality will dominate the application landscape, particularly given the diversity of ADAS use cases ranging from backup safety systems to lane assist to fully autonomous driving and everything in between. And to be clear, Indy's business plan isn't dependent on full autonomy. Our solutions support the evolution of today's safety systems from level two to what I like to call level two plus plus plus. In other words, we haven't even begun to address the opportunity presented by levels four and five, the definition of the complete driverless vehicle. But we certainly will when those markets begin to mature. In the meantime, I'm delighted to announce that during the quarter, we captured our first design win at General Motors in partnership with Sharp of Japan. While we can't elaborate upon this particular program, suffice it to say it's a material development for Indy and will initially encompass many of GM's forthcoming models, including its EV portfolio. We look forward to providing additional information upon the global rollouts next year. During the quarter, we also strengthened our position as a technology leader in automotive radar, with this acquisition of Silicon Radar, a company specializing in advanced, highly integrated, high frequency systems on chip. Silicon Radar had developed the industry's first volume production ready, highly integrated 120 gigahertz radar front end transceiver, including on chip integrated antennas. Silicon Radar had previously been a design partner to our own Munich, Germany based radar group. As vehicle safety standard initiatives, such as the European New Car Assessment Program, continue to expand globally. There is an increasing need for driver and occupant monitoring systems, making in-cabin sensing solutions as an essential component for ensuring overall safety. In fact, S&P Global Mobility predicts that the market for driver and occupant monitoring semiconductors will grow to over half a billion dollars by 2029 at a 34% compound annual growth rate. With Silicon Radar's world-class design team, we plan to lead the way. On the LiDAR front, During the quarter, we continue to make progress with our Surya SOC program, demonstrating our solution at multiple European automotive Tier 1s. Indy Surya LiDAR SOC is a game-changing product, enabling customers to implement a highly integrated and high-performance software-defined data acquisition and signal processing system. It is the world's first merchant market coherent LiDAR solution that integrates multi-channel high-speed analog to digital converters, hardware and software-based digital signal processing, together with the system control interfaces needed for an efficient and cost-effective FMCW LiDAR system. Specifically, we are targeting a $200 BOM, 80% less than current architectures. As a result, we believe INDI can uniquely drive this key three-dimensional imaging technology, which is now beginning to gain traction as a mainstream sensor. And finally, Computer vision systems are a crucial component of both ADAS and autonomous driving, serving as the primary sensing function, with next generation vehicles requiring up to 20 cameras for sensing functionality. Computer vision systems are diverse, enabling a wide range of applications, including backup cameras, surround view systems, object and lane detection, night vision, and driver and occupant monitoring. These functions collectively enable use cases such as lane change assist, highway pilot, traffic jam pilot, occupant safety, and automated parking, amongst others. During the quarter, we continue to expand our design wind pipeline, securing initial vision sockets at Panasonic in support of Honda. Next, turning to user experience, by background, OEMs have been increasingly prioritizing a best-in-class in-cabin experience as a point of differentiation, prioritizing communication, entertainment, and information sharing. With modern cars becoming more like temporary homes or workplaces, providing the ultimate user experience throughout the entire cabin is becoming the new standard. OEMs have increasingly highlighted the importance of interior lighting as it can drive an emotional connection with the driver and is a strong generator of brand recognition. Indy is redefining the future of in-cabin lighting with multicolor technologies for an enhanced user experience. The interior and exterior lighting of today's vehicles is rapidly evolving. With advanced dynamic lighting, it is possible to improve visibility and make it easier for drivers to see and be seen, which can help reduce the risk of accidents. Innovative lighting can also improve the comfort of the driver and occupants, creating an atmosphere suited to the context of the journey, style preference of the vehicle owner, and indeed the general mood. In these solutions, such as the recently announced LED matrix controller, are designed to address this growing demand for innovative and power-efficient LED lighting. Based on our power efficiency leadership, during the quarter, we captured additional advanced lighting wins at several leading EV OEMs, both North American and China-based, including BYD, NIO, and Li Auto. Similarly, mobile device integration and wireless charging are also top priorities for global automakers. This technology allows drivers to seamlessly link their mobile device into the vehicle's infotainment system safely making calls, sending and receiving messages, and enjoying their favorite music without diverting their attention from the road. To date, Apple and Android have provided compelling consumer experiences and have gained significant market share. In that process, India has played no small part in enabling this functionality. That said, our chipset is agnostic to whatever software layer is implemented, be it Apple CarPlay, Android Auto, or even in-house solutions. While some OEMs have recently announced plans to transition to internally developed architectures, Indy is in no way impacted by this development, particularly as we continue to sell data transport and power to connect the phone to the infotainment system within any configuration. At the same time, our strong relationships with Tier 1s, mobile car makers, and rapidly emerging EV OEMs have allowed us to expand our offerings into adjacent areas of user experience, such as wireless charging, USB PD controller, and other in-cabin solutions. And speaking of electric vehicles, we're seeing a market acceleration as EV sales continue to gain momentum. According to Kelley Blue Book, EV sales were up 45 percent versus the prior year in the U.S., and the EV share of the total market increased to over 7 percent. Additionally, as EV technology continues to improve, charging infrastructure expands and battery costs decrease. The potential for growth in the EV market is phenomenal. We expect global EV OEMs will seek more efficient and integrated semiconductor solutions and believe Indy is in a strong position to benefit from the growth, particularly given our strong relationships with an increasing number of leading EV OEMs around the globe. I'll now turn the call over to Raja for a discussion of our Q1 results and Q2 outlook. For those who haven't had the opportunity to meet Raja, he has been a valuable member of the Indy team for over three years and currently serves as our Chief Accounting Officer. Raja, over to you. Thanks, Donald. Indy delivered a strong first quarter, once again exceeding our top-line guidance and expectations. In fact, this represents our eighth consecutive quarter of beating or at least meeting our revenue and gross margin targets post-Indy's IPO. Specifically, revenue for the period was up 84% year-over-year and up 22% sequentially to $40.5 million, including a stub portion of revenue from our acquisition of Geo Semiconductor in March. On a non-GAAP basis, gross profit was $21.1 million, translating into 52.2% gross margin, up 484 basis points year-over-year, and slightly ahead of our 52% guidance. Total operating expenses for the quarter were $37.9 million, including $29.3 million in R&D and $8.6 million in SG&A, reflecting our continued investment in accelerated product development and expansion of our sales and marketing reach. In turn, our Q1 operating loss was $16.8 million. Below the line, net interest income was half a million dollars. As a result, our net loss was $16.3 million, and we posted a $0.10 loss per share on a base of 155.1 million shares in line with guidance. Turning to the balance sheet. We had significant one-time cash disbursements during the quarter, including $90 million related to the acquisition of Geo Semiconductor, $8.4 million related to the acquisition of Silicon Radar, and a $10 million repayment of the analog devices promissory note related to the acquisition of Simeo. We also invested $16.7 million in working capital, primarily to secure inventory in support of our back half growth plans. 3.2 million in capital expenditures for expanded internal testing capabilities and 3.9 million in other financing activities. Also during the quarter, we raised $34.2 million from the ATM and issued 3.3 million shares. These sources and uses of cash combined with our non-GAAP operating loss of 16.8 million resulted in 207.4 million of cash on hand exiting the quarter. Looking forward, Based on our order visibility and the depth of Indy's new product pipeline, we plan to demonstrably outperform the auto tech market over the forecast horizon. For the second quarter, we plan to scale to a $205 to $210 million annualized revenue run rate. Assuming the midpoint of this range at $51.9 million, we expect non-gap gross margin, again, in the 52% range, particularly as we work through lower margin pre-synergized geo-inventory. We are also planning $33 million in R&D and $9 million in SG&A, which includes the full quarterly impacts of both our recent acquisitions versus just one month in Q1. As a result, we plan to narrow our operating loss to approximately $15 million. Below the line, we anticipate $200,000 of net interest expense and no taxes. Assuming 164.3 million shares outstanding, we expect a $0.09 loss per share. Finally, and to reiterate, we believe the combination of Indy's accelerating growth trajectory, gross margin expansion, post-acquisition synergies, and planned operating expense leverage will enable us to reach profitability in the back half of this year. With that, I'll turn the call back to Donald for his closing comments. Thanks, Roger. In summary, Q1 was another solid quarter operationally, but we also remain in the early innings of what's possible at Indy, given the strength of our customer engagements, supplier partnerships, product portfolio, roadmaps, and our world-class design team. In the short term, our performance and outlook represent yet more proof points that we're effectively executing to our plan. In fact, we are now on pace to more than double our top line again this year, our third year in a row of doing so. Since we're in the middle of the NBA playoff season, that's Indy's version of a triple-double, representing another step towards realizing our vision of capitalizing on the $42 billion automotive semiconductor market opportunity and in the process, creating an Auditech powerhouse. That concludes our prepared remarks. Operator, let's open the call for questions. Thank you. We will now be conducting a question and answer session. If you would like to ask a question, please press star 1 on your telephone keypad. A confirmation tone will indicate your line is in the question queue. You may press star 2 if you would like to remove your question from the queue. For participants using speaker equipment, it may be necessary to pick up your handset before pressing the star keys. One moment please while we poll for questions. Thank you. Our first question comes from Suji Da Silva with Ross Capital. Please proceed with your question. And congrats on the progress here. First question, Indy's exposure, I just want to think about a framework, think about this. I guess I think about traditional versus new auto car companies, and I'm wondering, you know, is the exposure roughly half-half, or is there any kind of one that's stronger than the other? And, you know, I guess China EV, the question's been there around the demand, you said it remains strong. So just curious, your thoughts on the relative demand across China. traditional versus new auto companies. Thanks, Uji. I mean, from our subjective viewpoint, all of our products have extremely strong demand, as you can see from the results. So as far as we're concerned, the market remains particularly strong. We are very diversified across our products, geographies, customers and technologies, including the difference between e-vehicle and internal combustion engine. So we're not really beholden to any one of those factors. We're very diversified across all of those factors. There has been, of course, some noise in the market, I would say, with regard to weakness in China e-vehicles, where we do have representation, of course, as part of the broader portfolio. But from our perspective, they're scheduled to do 8 million e-vehicles in China this year, and that's a pretty strong performance. It's a huge percentage of the world's market for e-vehicle, and they've come from a very low base to basically a leadership position in a very short time. So our view on that generally is we only see strength in that particular market at this point also. Okay, great. And in the prepared remarks, you guys mentioned the Apple CarPlay in China. Can you just elaborate on the content opportunity there and what's happening in that market if it's diversifying from Apple CarPlay and how the opportunity scales out for you? Well, I mean, from our perspective, our hardware supports any software skin or user interface that's used on top of it. So whether it be Apple CarPlay, Android Auto, or some proprietary system which belongs to an OEM. And it makes really no difference to us as regards to what they do. So as far as our perspective goes, as long as there's continued growth and integration of the user's mobile device into the vehicle user experience, then there's potential for growth for us in those product areas. So it's still one of the strong parts of our business, and it continues to grow. Okay. I can sneak in one last quick question. For the in-cabin opportunity, what do you think are the two or three biggest revenue opportunities? It seems like there's a lot of different content there across safety and infotainment and all that. Maybe you could point out two or three that are really high growth opportunities in the next one to two years. I mean, it's spread across our whole portfolio, as we mentioned in the remarks. The ones that we called out in the remarks are really the ones that are the most immediate. But generally speaking, I mean, the cabin is becoming a place where people spend more time, and there are many more creature comforts which are desired and can be offered by the car manufacturer to increase brand recognition and to increase their share. So it's generally still a very, very strong growth area. I mean, much is talked about autonomous driving and e-vehicle and so on and so forth, but it's still going to be a great driver of semiconductor content as the future unfolds. Okay. Thanks, Donald. Thank you. Our next question comes from Anthony Stoss with Craig Hallam. Please proceed with your questions. Thanks. Hi, guys. Donald, I wanted to focus in on your GM ADAS win. I know you're not at liberty to probably divulge too much, but I'm just curious, did I hear you correctly that something may start next year, or any sense on when the revenues would start for you and then have a couple follow-ups? Yeah, I mean, in that time frame, it's a very positive announcement for us, and we are indeed very pleased about it. GM has been a sales through customer hours for many years, but this represents kind of a new product area for us that's launching. Is there any share or any number of models that you think you'll get that you'd care to share? We're not at the point where we're at liberty to disclose exact numbers and volumes and car models, but it's going to be significant for us, to say the least. Got it. And then following up on one of the earlier questions on China and your lighting woods that you disclosed, what percentage of revenue is China right now for you and where do you see that in the next couple of years? Sure, I'll take that, Donald. So China has been roughly, historically, roughly half of our revenues and that's pretty consistent with the current quarter and where we expect to be going forward. But to clarify that, China for us is, is kind of misleading in terms of the filings because much of the volume that's credited as being manufactured over there is generated through European and U.S. design wins. Yeah, that makes more sense. And the last question related to geo, I'm curious if you're now having conversations post the close on other automakers that were maybe a little shy in using geo because they're a private company and they're small. And when do you expect kind of new customer design wins now under the flag of Indy? Yeah, I mean, we announced a couple of wins in there that went across the line, perhaps, I would say, because of the girth of the combined companies now already, I mean, which were really just on the one-yard line. We gave it a final pushover. But, yeah, I mean, we've been super happy with the way that the sales teams have integrated We're working great together even after a very short time frame. And the amount of traction that we're seeing for their products through our sales channel and vice versa, indeed, for our products through their sales channel is enormous. So I do expect that over the course of the next while, we will make some announcements in that space. Thanks, Donald. Appreciate it. Thank you. Our next question comes from Ross Seymour with Deutsche Bank. Please proceed with your question. Hey, guys. Thanks for letting me ask a couple questions. I guess the first one, Donald, outside of China, to a certain extent, because you've already answered that one, but a lot of investor concern just about supply-demand dynamics in the automotive space. Any sort of changes in that from your perspective? Obviously, your numbers don't seem to show any big change one way or the other, but just wanted to get your thoughts. I mean, the situation has greatly alleviated itself from the situation of, let's say, the last 18 months or so. Much of the supply chain is back to normal. There are some isolated pockets that you can see which demand enhanced management to make sure that there's no slip, twixt, cup and lip. But other than that, it's becoming more alleviated. That being said... What we see is that the car volume per year is still below where it was at its peak in 2018. Still many cars didn't get manufactured during the course of that period, and we still see some pent-up demand to get the car's volume back to really where it was before. But generally speaking, we would see that the demand situation has improved, but still some work to do. Got it, thanks for that. And then a couple of GEO questions quickly. Was the ADAS design with General Motors in partnership with Sharp Japan? I noticed the word Japan in there. Was that something to do with the GEO side of things, or was that from kind of core Indy? Yeah, we're actually not detailing that at the moment, but we'll announce on that as time progresses and we can talk a little bit more about the applications. Gotcha. The last question would just be, now that you've had GEO in the fold for a bit of time, I think you said a couple million dollars was the stub in the prior quarter when you guided, and you expect a full quarter, and then $40 million for the year, roughly, if I remember correctly. Any changes to those numbers, or are those all still applicable? No, we're still tracking to plan. Great. Thank you. Thanks, folks. Thank you. Our next question comes from Cody, a career with Benchmark. Please proceed with your question. Yeah, thanks for taking my questions, guys, and please pass my sympathies along to my mother. Yeah, thank you very much. Don, can you just talk about your revenue mix by application? Can you give us some kind of color on how that breaks down for this quarter or this past quarter and in your guidance, and I have another follow-up. Well, I mean, we don't really segment our revenue by application or geography or anything at all, really, for that matter. Really, we're tracking to the plan that we put in place. I would say That, by and large, everything, even in the subsegments and the product areas that we pursue, are individually tracking to plan as well. So we're pretty happy with the outlook that we have for the next few quarters and the next few years. And I guess, then, if you look at your revenue another way, can you talk about the sensitivity of your revenue to new wins versus what might be just volume gains? sensitivity to the market. I guess what I'm saying is how much of your business is initial ramping of new products and new sockets and how much is dependent on the market's volume of vehicles? Well, the primary factor that affects our revenue profile is our own share gain. As you've seen from the results that we've posted over the last eight quarters, We've massively outgrown the market, and that's the primary factor that's going to influence us before anything else. Of course, that was generated by new business starts and new product deployments over the course of that period and will continue to do so. I wouldn't really characterize them as new wins any longer because these are wins that we made I mean, largely in terms of the revenue profile that we've produced to date, the wins were made largely when we were a private company. And the wins that we talk about when, you know, we do our earnings and make press releases and so forth when we announce new products and customer relationships are largely things that are going to build revenue sometime further out in the future, which is great because it gives us great visibility of, you know, where we've come from, where we are right now, and where we're going for the long term really through the end of this decade. So, again, we don't really subsegment out by category or by nature of design win, but just the nature of our business because of the long design cycles, we have a great deal of security and visibility into where the revenue is coming from on a quarterly and yearly and almost decade basis. And then lastly, Don, if I may, could you just talk about your gross margin trends beyond the June quarter? Just mix versus internal efficiencies, supply efficiencies? I mean, it'll be driven by a multitude of factors. Mix as higher technology products deploy, operating efficiencies as we increase in scale, maybe in the short term, operating efficiencies as we fully integrate the acquisitions that we recently made. And, you know, we remain on track to hit our 60% gross margin model, which we've talked about at length over the course of the last quarters. Okay. Thank you, guys. Thank you. Our next question comes from Craig Ellis with B. Reilly Securities. Please proceed with your question. Yeah, thanks for taking the question. Donald, I'll start with one that's more qualitative, but it relates to a point you made about the way you're scaling up the business both organically and inorganically. With the business where it is today at its significantly increased scale over the last few years, how is that changing the way customers come to Indy to try and engage both types of customers, size of customers, and maybe across different types of products that they may be interested in? I mean, that's an interesting question. You know, our progress has been largely consistent and steady. And so with every, let's say, small milestone that we made, our credibility improves with our customers and they are willing to give us access to larger programs. You know, I would say that there are days where you feel that there's somehow been a threshold crossed when, you know, some very large customer approaches us and calls out to us and says, hey, you know, we like what you're doing. We're really impressed. You know, we are looking for a vendor in this space. Looks like your technology is very differentiated. And that sort of pull from the market is something that, you know, is very gratifying to see as we've grown over the course of the last quarters and years, and we've begun to get that sort of, let's see, quality of reliability in the market that we can deliver, we can deliver on time to the right quality, and automotive is quite a conservative market in that sense, so track record matters. I mean, I would say generally speaking, I mean, it's been a, again, I'll repeat it, it's been a very gratifying experience to see our progress happening really linearly over the course of the last 14 years even. That's helpful. And then I'll ask a specific product question. So there's been a lot of inquiry around geo, so I'll stay away from that one. But on radar, which is one of the bigger opportunities the company has, can you just talk about how product development is going and customer engagement is going here and your confidence for that flip to revenues and the benefit that you get with the recent acquisition in that area too? Yeah, I mean, it remains fully on track. I mean, we don't talk about specific milestones in public, but yeah, we're very happy with the way it's executing. The resonance from the market, who's beginning to get an appreciation that it's coming, is becoming very strong because we do truly have a disruptive technology in that space that's going to make a difference. The addition of silicon radar also helps us in the in-cabin arena because of their 120 gigahertz technology. It's really the next step on the roadmap beyond what we have in development now. And they have a leadership position in that. They're really the only 120 gigahertz functioning front end available in the world today. So that's really going to take us to the next level beyond what we're developing right now. Got it. And then the last one, and I'll ask it to you, but it may be one for Raja. Just on the amount raised in the quarter of 34 million, I think It was conveyed that that was via ATM. Is there plans to raise similar this quarter, either by type or by amount? Thank you. Yeah, sure. Yeah, we did raise the $34 million via the ATM during Q1, and there are no plans currently to place additional shares, particularly at these share prices. Got it. Thanks, guys. Thank you. There are no further questions at this time. I would like to turn the floor back over to management for closing comments. Thanks, everybody, for attending and listening to our call. Hope to see you guys at the investor conferences in the coming weeks, and see you next quarter. This concludes today's teleconference. You may disconnect your lines at this time. Thank you for your participation.