[
    {
        "date": "2024-02-22T17:00:00-05:00"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good afternoon and welcome to Indy Semiconductor's fourth quarter and year-end 2023 earnings conference call. At this time, all participants are in a listen-only mode. A question-and-answer session will follow the formal presentation. As a reminder, this conference call is being recorded. I will now turn the call over to Ashish Gupta, Investor Relations. Mr. Gupta, please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, operator. Good afternoon and welcome to Indy Semiconductor's fourth quarter and year-end 2023 earnings call. Joining me today are Donald McClimat, Indy's co-founder and CEO, and Tom Schiller, Indy's CFO and EVP of Strategy. Donald will provide opening remarks and discuss business highlights, followed by Tom's review of Q4 and Indy's outlook. Please note that we'll be making forward-looking statements based on current expectations and assumptions, which are subject to risks and uncertainties. These statements reflect our views only as of today and should not be relied upon as representative about views as of any subsequent date. These statements are subject to a variety of risks and uncertainties that could cause actual results to differ materially from expectations. For material risks and other important factors that could affect our financial results, please review our risk factors in our annual report on Form 10-K for the fiscal year ended December 31, 2022, as well as other public reports with the SEC. Finally, the results and guidance discussed today are based on non-GAAP financial measures, such as non-GAAP gross margin, non-GAAP operating income loss, non-GAAP net income loss, and non-GAAP EBITDA. These metrics may exclude corresponding GAAP measures, certain of the following items. depreciation and amortization, share-based compensation, acquisition-related expenses, inventory cost realignments, gain or loss from change in fair values, non-cash interest expense, and income tax benefits or expenses. For a complete reconciliation to GAAP and the definition for the above items, please see our Q4 earnings press release, which was issued in advance of this call and can be found on our website at www.indysemi.com. I'll now turn the call over to Donald."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Ashish, and welcome, everybody."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "The Indy team delivered another quarter of solid revenue and gross margin performance, capping off a third consecutive year in which we've more than doubled our top line, once again massively outpacing our peer group and earning the unique distinction of being the fastest-growing semiconductor company in the world based on our last two years of revenue performance per Morgan Stanley. Despite the challenging macro backdrop, in Q4, we achieved record revenue, delivering sales growth of 112% year-over-year and 16% sequentially to just over $70 million, with 50 basis points of gross margin expansion on the year-over-year basis to 52.7%. We also substantially narrowed our operating loss to less than $1 million on an EBITDA basis. While we navigate automotive industry weakness in the short term, stemming from rising interest rates, slowing end-market car sales, decelerating consumer transition to semiconductor content-rich electric vehicles, and inventory rebalancing across the automotive industry, our design wind momentum has continued unabated and reinforces our confidence in Indy's business model. I'm proud of the Indy team's absolute relentlessness and the substantial progress we've made to date towards our financial goals in the face of these headwinds. Entering 2024, we expect these dynamics to persist, dampening Q1, but with a recovery in Q2 and return to strong growth by Q3 and Q4 of this year. As context, automotive markets are forecasted to slow after experiencing a strong 2023, According to an updated S&P Global assessment from last month, in 2022, light vehicle production totaled 83 million units, up 7% year over year, while 2023 was up 9% to 90 million vehicles. But S&P Global is now indicating the first signs of the market shrinking in this production year. In particular, we are seeing real-time weakness across the China e-vehicle market as their luxury vehicles are, or the seasonally adjusted annual rate, came in at 20.6 million for January, down versus 21.7 reported in December, marking the fifth consecutive month of declines. While the fundamental landscape for EVs over the medium and longer term remains robust, shorter-term EV vehicle industry trends have certainly deteriorated given reduced buyer incentives, concern over charging infrastructure, and the saturation of early adopters. The shift in our near-term outlook reflects the softness compounded by the cancellation of a high-profile North American OEM ADAS program, which you may recall was pushed out from last year through no fault of INDI. Despite the setback, it won't result in a permanent loss of revenue, as we fully expect to participate in their next equivalent project. Moreover, we've won substantial subsequent business with this OEM. leveraging the same Indy vision product line, which will more than offset this loss in the medium term. So while we are seeing this air pocket in broader industry demand, the strategic opportunity for Indy remains unchanged and is enormous, particularly as Indy is at the unique intersection of vehicle safety systems, sensor fusion, and with our newest product developments, artificial intelligence, towards realizing our vision of the uncrashable car. Accordingly, we will continue to prudently invest, remain aggressive on taping out new products as soon as possible, maintain our disciplined cost control approach, but balance that against addressing ever-increasing Tier 1 and OEM demand for our innovative Autotech solutions, including each of these exciting new technologies. And while incremental investments hamper profitability in the immediate term, they will enable us to maintain our steep growth trajectory over the long run, furthering Indy's technology leadership, and adding to our strategic backlog. To that end, during the quarter, we expanded our automotive camera video processor portfolio with the launch of a highly integrated system on chip that enables precision performance sensing capability at the vehicle's edge while supporting driver viewing. As government regulators, new car safety assessors, and consumers demand higher performance safety features, automakers are increasingly seeking camera-based ADAS solutions that support volume scalability across their vehicle classes. This requires a distributed processing approach to vision sensing with high levels of integration of low power consumption to meet the needs of mass market deployments. Again, according to S&P Global, Shipments of automotive electronic control units incorporating vision-based processing are expected to grow from 232 million units in 2022 to nearly 400 million units by 2027. And based on our current engagements, we intend to capture a disproportionate share of this market. We also continue to gain design wind traction by securing major in-cabin monitoring programs at leading automotive OEMs, including BMW, Ford, General Motors, and Toyota. As global safety initiatives continue to evolve, the demand for these monitoring systems is intensifying, positioning in-cabin sensing solutions as critical elements to enable future automation features. More recently, we entered into a strategic partnership with FECOSA, a leading Tier 1 supplier, to bring AI-based automotive camera solutions, initially supporting two of the top five car OEMs in the world, and aimed at significantly enhancing vehicle safety. Government regulators and new car safety assessment programs are increasingly seeking to specify protection for vulnerable road users, such as pedestrians and cyclists, often referred to as VRU, especially through backup and e-mirror applications. Euro NCAP implemented the VRU safety test protocol in 2020, and in the United States, the National Highway Transportation Safety Administration, or NHTSA, has this year proposed enhancements to the NCAP protocol to provide consumers with information about crash worthiness and pedestrian protection of new vehicles. As a result, automakers are demanding camera-based ADAS solutions that provide not just passive viewing capability, but also intelligent sensing to actively detect pedestrians via AI processing and take corresponding action. Indy's upcoming generation of vision solutions incorporate proprietary on-chip neural processing hardware and software to enable real-time data processing, such as object classification and detection at the vehicle's edge, thereby offloading the central ADAS compute processing requirements and alleviating the cost and power consumption of high-speed data transfer across the vehicle. Leveraging FICOSA's near decade-long expertise as a high-volume vision solution supplier and our field proven differentiated vision processing technology, together we can deliver breakthrough imaging and in-camera object detection, particularly for challenging edge sensing applications. Sampling for the first smart AI-based camera solutions is set to commence later this year with volume production slated for 2025. At the same time, and just as importantly, I'm pleased to report that we have successfully sampled our radar baseband and MIMIC to our lead customer, one of the largest contributors to our strategic backlog, and are on track for a 2025 program ramp. Shifting to user experience, during the quarter, we launched new products, adding to our interior lighting and power management portfolios at leading global automakers to support OEM's increasing prioritization of a captivating in-cabin environment. vehicles have become more than just a means of transportation, morphing into a sophisticated environment equipped with an array of electronic devices and systems. As a result, the need for reliable, efficient, and seamless power delivery has risen to the forefront. Similarly, OEMs are increasingly focusing on interior and exterior lighting solutions as it transcends just functionality within the modern vehicle, becoming a pivotal element of the user experience that shapes the cabin's ambiance and enhances visibility and safety. Finally, in the electric vehicle area, we have extended our footprint at the leading North American e-vehicle OEM, securing two significant design wins in support of their future model years. The two custom chipsets enable high-speed smart networking within the vehicle. In summary, despite the tactical market challenges, we're willing new programs and setting the stage for the next wave of above-market growth towards sustained profitability. I'll now turn the call over to Tom for discussion of our Q4 results and outlook."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Donald. Revenue for the fourth quarter was up 112% year-over-year and up 16% sequentially to a record $70.1 million at the lower end of our guidance band and indicative of the weak market environment, though still up more than tenfold within just three years. Q4 gross profit was $37 million, translating into a 52.7% gross margin, up 50 basis points year-over-year, and consistent with our guidance. Operating expenses were $39.4 million, with R&D sequentially lower to $29.4 million, reflecting a pause in tape-out activity, while SG&A was down slightly quarter-over-quarter to $10 million. In turn, our Q4 operating loss narrowed to $2.4 million versus a loss of $15.1 million in the year-ago period, driven by higher revenue, improving gross margin, and operating expense leverage. Adding back $1.4 million of depreciation, our EBITDA loss was less than $1 million. With net interest expense of $200,000, our net loss was $2.6 million, and we posted a $0.01 loss per share on a base of 181.6 million shares, again, in line with our guidance and consensus estimates. We exited the quarter with $151.7 million of cash and equivalents, down $9 million versus Q3, primarily related to increased AR and CapEx to expand our internal test capacity. partially offset by a decline in inventory. Turning to our outlook, for the first quarter of 2024, we expect Indy's revenue to be up 38% year over year, but down 20% sequentially, reflecting seasonality and current industry softness with gross margin in the 52% range. In terms of operating expenses, we are planning for $34 million in R&D, driven by accelerated product development activities and 10 million of SG&A. Below the line, we anticipate 400,000 of net interest expense and no taxes. Assuming 186 million shares outstanding, including the full 7.7 million shares related to the retirement of 27 million warrants that we closed in November, we expect an 8 cent net loss per share. From a full year 2024 perspective, we expect revenue to be in the $275 to $300 million range, up 29% at the midpoint. Based on our new program and DesignWin pipeline, we expect Q1 to represent a trough quarter, with top line recovery in Q2 and a resumption of outsized revenue growth in Q3 and Q4, yielding a profitability baseline on an EBITDA basis in the second half of this year, ahead of our significant 2025 radar and vision ramps. On that note, I'll turn the call back to Donald for his closing comments. Thanks, Tom."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "In conclusion, we posted record Q4 and 2023 results, demonstrating the strength of our business model through a challenging operating environment. Whilst we can't control the weather, our strategic focus remains unwavering. We're building an absolute auto tech powerhouse with innovative ADAS, user experience, and electric vehicle solutions, positioning us to effectively navigate current market conditions, capitalize on the $48 billion serviceable opportunity which is just ahead of us, and most importantly, to create great shareholder value."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "That concludes our prepared remarks. Operator, let's open the call for questions. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Ladies and gentlemen, we will now be conducting a question and answer session. If you would like to ask a question, please press star and 1 on your telephone keypad. A confirmation tone will indicate your line is in the question queue. You may press star and 2 if you would like to remove your question from the queue. For participants using speaker equipment, it may be necessary to pick up your handset before pressing the star keys. Ladies and gentlemen, we request you to restrict to one question and one follow-up question per participant. One moment, please, while we poll for questions. Our first question is from Suji De Silva with Roth MKM. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, Donald. Hi, Tom. So maybe you could provide some color on the demand weakness you're seeing, if that's broadly across all geographies, whether there's any geography color there and any specific color on sort of the programs or applications that maybe are being impacted, EV, non-EV, that kind of thought. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, we're seeing that the overwhelming reason for the majority of it is just the inventory digestion, which is broadly across the markets. We do see some specifics in the China e-vehicle market, which are kind of the vanguard of what we saw coming across the market. But generally speaking, it's really a broad inventory correction that we're seeing."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. And then to understand, follow up on that, you talked about a program push out, I believe, or canceled coming to the next program. Can you just kind of clarify that and talk about whether you're seeing kind of a broader trend of decisions and programs for maybe the model years 25, 26, 37 being delayed or pushed out, or whether those decisions are continuing to be made ahead of those model ramps?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "No. To answer the last part of your question first, absolutely not. This is one program out of 50 that we're working on, and it just happened to be a program where there was an ambitious goal set for it, and engineering execution on the customer side didn't pan out for their business goals. So it was a major program for them. In this case, I would say it's something that very rarely happens in the automotive industry at all. And even with us, with a relatively smaller customer base, it's still an extremely rare thing."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So it's for sure not a trend. Okay. Thanks, Donald. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our next question is from Craig Ellis with B Riley Securities. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, this is Ethan Wydell calling in for Craig Ellis. Thanks for taking my questions. You provided a nice view on the slope of demand as you see it. I was wondering if you could provide any color on how you're seeing the gross margin trajectory going forward."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, so we expect gross margin expansion from here. In fact, this is just an air pocket in terms of market demand. But as you've seen in the past, we've done a very good job sequentially expanding margin, and that just comes from improving mix and lowering costs, improving yields, et cetera. And that's going to continue. So we expect off the Q1 trough to begin to expand gross margin again towards 60%. Gotcha."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And similarly, are you thinking about any OPEX levers or would that similarly be something that we could expect to see grow out of second quarter?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "OPEX at this stage, we've reached critical mass. So we're making tactical investments here and there to accelerate product development. That's happening in the current quarter. But from there, it's a relatively flattish profile. And that creates the operating leverage to hit profitability in the back half of this year and then, of course, beyond that towards our 30% target model."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. That's much appreciated. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Our next question is from the line of Anthony Stoss with Craig Hallam Capital Group. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, guys. Maybe if you can give us some color on kind of expected new programs coming online, Q2, Q3, Q4, that gives you the confidence for kind of a steep ramp in Q3 and Q4. And then also as my follow-up, probably for you, Donald, again, I think the large radar win, your prior statements were Q4 or Q1 of 2025. Now you're saying 2025. Do you still expect it to be in Q1 2025, or is that getting pushed as well?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "No, that still remains on track. I mean, that's perhaps just the semantics of the notes that we made in the prepared remarks, so nothing has changed in that respect. In fact, we did announce that we had sampled these programs, and as you know from all your experience in this market, the back of the program is largely broken once you get to first silicon, and the rest of it is really execution. of maybe more the details of ramping into production. So we're pretty happy where that program is right now. And we do expect some material revenue from that to come on the schedule that we originally outlined. In terms of what we're ramping, we're ramping across the board. There are vision programs that are ramping. There are user experience programs that are ramping throughout this year. Not radar, of course. That will be late this year, early next year. But yeah, I mean, it's still... Fundamentally across the board and all of the the other project areas that were that were servicing right now Very good."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks guys Thank you Our next question is from Cody agree with the benchmark company."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Please go ahead Yeah, thanks guys for taking my questions. Um, I guess given the magnitude of the decline in q1 and what is giving you confidence that you're going to see a ramp to support your fiscal year outlook? I guess, what are you expecting sequentially as you push through the year?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I mean, we have programs ramping through the year, of course, which has been typical of us through our entire public existence. And, you know, as I just mentioned in answer to the previous question, for sure. We do expect the market to recover, and I think you will see that message coming from multiple companies in the same space as us that they are seeing through that period a recovery. I mean, in particular areas in the market, we did see what I would describe as fairly dramatic ear pockets. We've tried to be conservative in the way that we've guided Q1. And as a net result, we're pretty confident about a recovery in Q2 and a return to the plan in Q3, Q4."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And I guess, Donald, is that confidence backed by firm orders today? And I guess, what's the flexibility or cancelability of those orders? I guess, how much volatility are you building into your Q2 expectations?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, like I say, we've tried to build in as much conservatism as we possibly can. I mean, this has been a fairly, in certain segments, a fairly violent disturbance in the market. But we do expect that with the recovery that we're seeing, coupled with the conservatism that we've built in, we feel pretty confident about where we can get to in the second half and in Q2 indeed."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "All right. Thank you, guys. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our next question is from the line of John Tanwante with CEJS Securities. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, this is Justin on for John. Thanks for taking the questions. First, how does the updated outlook impact your expectations for cash flow and your capital needs?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, between now and what Donald just outlined in terms of the back half of the year, cash flow will probably will resemble our operating loss. So you can assume somewhere in the $35 to $40 million range of cash usage between now and then until we're beginning to generate cash, that is. And of course, we just exited with north of $150 million in cash. So that leaves us with ample cushion."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, that's helpful. I appreciate the color. And then if I get one more, can you talk about the scale of the winds that you had in Q4 and, you know, try to size them for us if any of them are, you know, significant?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, the one that we'd single out is the design wind for FECOSA, who are a European-based Tier 1 and, as such, supply with this particular program two of the largest European OEMs. It's a program that we've been working on for quite some time, and I wouldn't say it is the largest program that we've won in the history of the company, but certainly in the top five."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. Thanks a lot. I appreciate the question. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Ladies and gentlemen, as there are no further questions, That concludes the conference of Indy Semiconductor. Thank you for your participation. You may now disconnect your lines."
    }
]