[
    {
        "date": "2022-08-11T17:00:00-04:00"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good afternoon and welcome to Indy Semiconductor's second quarter 2022 earnings call. At this time, all participants are in a listen-only mode. A brief question and answer session will follow the formal presentation. In the interest of time, during questions, please only ask one question and one follow-up question. As a reminder, this conference call is being recorded. I'd now like to turn the call over to Ashish Gupta of Investor Relations."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Mr. Gupta, please."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, operator."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good afternoon, everyone, and welcome to Indy Semiconductors' second quarter 2022 earnings call. Joining me today are Dalma Kleinman, Indy's co-founder and CEO, and Tom Schiller, Indy's CFO and EVP of strategy. Dalma will provide opening remarks and discuss business highlights. followed by Tom's review of Indy's second quarter 2022 results, as well as our third quarter outlook. Please note that we'll be making forward-looking statements based on current expectations and assumptions, which are subject to risks and uncertainties. These statements reflect our views only as of today and should not be relied upon as representative about views of any subsequent date. These statements are subject to a variety of risks and uncertainties that could cause actual results to differ materially from expectations. For further discussion of the material risks and other important factors that can affect our financial results, please refer to our risk factors in our recent annual report on Form 10-K for the fiscal year ended December 31, 2021, and other public reports filed with the SEC. Additionally, the results and guidance discussed today are based on certain non-GAAP financial measures. For a complete reconciliation to GAAP, please see our Q2 earnings press release, which was issued in advance of this call and can be found on our website, at indiesemi.com. With that, I'll turn the call over to Donald."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Ashish, and welcome, everyone. I'm pleased to report that Indy exceeded top and bottom line expectations and delivered another record quarter in Q2, driven by robust, broad-based demand for our highly innovative auto tech solutions. Our outperformance versus the automotive industry reflects the strength of Indy's key Tier 1 and OEM partnerships. our differentiated product portfolio, underlying intellectual property, and our world-class organization. I'm especially proud of our team's operational resiliency and ability to scale above our commitments amid persistent global supply chain headwinds. Specifically, during the second quarter, we once again substantially outpaced our addressable markets and grew revenue 181% year over year and 17% sequentially, to a record $25.8 million, while expanding gross margin to be nearly 49%. As we'll outline, our design wind momentum is accelerating across ADAS, user experience, and electrification applications, setting the stage for the establishment of Indy Semiconductor as an autotech powerhouse. On the LiDAR front, we extended our Surya SoC development program and added additional customers during the quarter. In fact, we are now working closely with four partners for this design phase as we absorb their inputs and implement their suggestions. Surya is a truly unparalleled LiDAR solution, given the degree of system integration encompassing DSP, analog, mixed signal, and firmware functionality, augmented by Teraxion's world-class lasers and associated technology. Leveraging all of these capabilities, we are uniquely enabling a complete $200 BOM, 80% less than current discrete architectures. As a result, we believe INDI can catalyze this key three-dimensional imaging technology, which is pivotal to enabling the future of autonomous driving. At the same time, radar is gaining widespread market deployment for ADAS, ranging from adaptive cruise control to blind spot detection to lane monitoring to pedestrian detection applications. According to IHS, the semiconductor total addressable market opportunity for automotive radar is $1.8 billion this year, growing to $4.3 billion by 2027. Comparatively, LiDAR is expected to grow from $150 million to $630 million, respectively. To be clear, we are heavily investing and intend to gain share within both of these modalities in addition to ultrasound and computer vision. But it's worth recognizing that although LiDAR has received intense investor attention through high-profile listings of a dozen or so companies, it is a future growth factor, while radar is a large silicon opportunity today. As the radar IC market was over-consolidated over the past decade, our customers were seeking an alternative source with leading-edge multi-gigahertz RF precision analog, power management, and microcontroller-based digital capabilities, as well as scalability and strict adherence to all key quality standards. This encouragement formed the rationale for our recent acquisitions of OnSemi's radar design team and analog device, the Simeo division, bringing together field-proven radar solutions, over 250 million years of cumulative development, 205 related patents and applications, as well as world-class mixed signal SOC capabilities, ultimately enabling Indy to capture our largest strategic program win ever. Switching gears, within the user experience product area, during the quarter, we launched a dual-channel USB power delivery IC that reduces component count, simplifies designs, and enhances reliability of in-cabin vehicle charging systems. This breakthrough product becomes part of the next generation of enhanced user experience applications adjacent to our existing CarPlay products and is the automotive industry's most integrated USB PD firmware-based programmable controller. We commence sampling in Q2 and have already multiple customers staging high-volume production ramps for early next year. we announced the formal opening of our Dresden, Germany, engineering center of excellence. We now have over 100 engineers in the European region, the second largest vehicle market in the world, accounting for approximately 20% of global production. And we are similarly intensely focused on our expansion efforts in Asia. Recall we announced that we launched a strategic presence in both Japan and Korea 90 days ago. Subsequently, we were able to secure wireless charging, and advanced lighting design wins with major Japanese and Korean OEM brands, including Honda, Hyundai Kia, as well as Xiaopeng in China. These wins are significant, given we've historically not had any footholds at Honda, and we've been underrepresented at Hyundai Kia. Given the massive sales channels we've opened for Indy's current and future product offerings, We look forward to sharing our annual strategic backlog update next quarter and providing similar updates on new customer wins and product launches going forward. Finally, and at a higher level, the shift to electrification is accelerating amid the higher oil price environment and long-term transition to greener technologies. According to Cox Automotive, EV sales grew more than 75% in the first half of 2022 and while overall U.S. auto sales were down more than 17% over the same period. In fact, according to a recent AAA survey, 25% of Americans say they plan on buying an electric vehicle as their next car purchase. Further, data from Recurrent, an automotive market intelligence firm, has indicated that consumer interest in buying an electric vehicle has soared 70% since January, particularly for younger generations. With only 5% penetration of new vehicle sales in the U.S., the shift has only just begun, while Germany and the Netherlands are seeing significant increases in penetration, with fully electric vehicles now capturing 14% and 24% of respective new vehicle sales year-to-date through the end of June. The electrification megatrend benefits India in a few ways. First, we have strong relationships with an increasing number of strategic EV OEMs, and are gaining design wind traction there. Secondly, and more tangibly, we are supporting Vitesco, one of the largest European automotive Tier 1s, in an EV-specific application. And third, and more generally, our broader Autotec portfolio tends to gain a substantially higher attach rate to newly designed electric vehicles, given our degree of innovation and power efficiency, critical to maximizing vehicle range. Between our addressable ADAS, user experience, and electrification applications, IHS forecasts average content per vehicle to increase from $500 today to up to $7,000 in some luxury vehicles over the coming decade. And our customer base and our product portfolios are perfectly aligned to capitalize on this deep content growth trajectory. With that, I'll now turn the call over to Tom for a discussion of our results and outlook."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Donald. Indy delivered strong second quarter results, once again achieving the top end of our forecast range, exceeding analysts' expectations. In fact, Q2 represents our fifth consecutive quarter of outperformance versus plan post-Indy's IPO last summer. Revenue for the period was up 181% year-over-year and 17% sequentially to a record $25.8 million. Gross profit was $12.5 million, translating into a 48.6% gross margin, up 650 basis points year-over-year and 120 basis points sequentially and above our 48% guidance. Operating expenses were $29.5 million against our outlook for $30 million. R&D investments were $22 million as we accelerated product development, while SG&A of $7.5 million supported our expanded sales reach, and the last elements of public company infrastructure, including a global ERP system for enhanced scalability. As a result, our operating loss was $17 million. Interest and other expenses yielded $100,000, and taxes were negligible. In turn, our net loss was $16.9 million, with a loss per share of 11 cents, on a base of 148.7 million shares, a penny better than consensus estimates. Turning to the balance sheet, during the quarter we invested 4.9 million in working capital, including 2.2 million for inventory, to ensure supply and support of our stronger second half growth plan. And we licensed a key IP block for another 2.2 million. Our capital expenditures were 1.3 million for additional lab equipment and expanded IT infrastructure. Finally, we made $6 million in deferred acquisition-related payments to OnSemi and Citi Semiconductor, exiting the period with $164.1 million in cash. Looking forward, based on our strong order visibility from new products and customer ramps, we expect to continue to substantially outpace Indy's addressable markets. Specifically, For the third quarter of 2022, we anticipate top line growth on the order of 140 to 150% year over year. At the midpoint of this range, Indy will be on a roughly $120 million annualized revenue run rate. And for the first time, we plan to deliver gross margin in the 50% range. We are planning to moderate operating expenses with $23 million in R&D and $8 million of SG&A. Below the line, we anticipate a pickup of $300,000 of net interest income and no taxes. Assuming 149 million shares outstanding, we expect a net loss of $0.11 per share, once again $0.01 better than consensus expectations. More importantly, given the depth of our design wind pipeline, demonstrated scalability, and planned operating leverage as our revenue growth and gross margin expansion far outpace our cost structure, we are on track to reach profitability in the second half of next year, marking another key step towards achieving our target model of 60% gross and 30% operating margins by 2025. On that note, I'll turn the call back to Donald for his closing comments."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Tom. To summarize, Q2 was another solid quarter of performance for the Indy team. Even with leading automakers in the US, Europe, and Asia reporting down unit volumes during the first half of this year, we are delivering exceptional results and guidance, far outpacing industry peers, which we expect to continue over the planning horizon. Indeed, the next generation of automobiles are showcasing technologies focused on enhanced safety capabilities, better in-cabin features, as well as more environmentally friendly power trains with extended range. Our differentiated portfolio of semiconductor and software solutions are positioning Indy to gain a disproportionate share of what is fast becoming close to a $50 billion serviceable market opportunity for Indy. We look forward to updating you along the way. That concludes our prepared remarks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Operator, let's open the call for questions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, sir."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "At this time, we will be conducting a question and answer session. If you would like to ask a question, please press star and one on your telephone keypad. A confirmation tone will indicate your line is in the question queue. You may press star and two if you would like to remove your question from the queue. For participants using speaker equipment, it may be necessary for you to pick up your handset before pressing the star keys. And just a reminder, please only ask one question and one follow-up question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "One moment, please, while we poll for questions. The first question comes from Suji De Silva from Roth Capital."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Please proceed with your question, Suji."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hello, Donald. Hello, Tom. Congratulations on the progress here. Thanks. So I just want to kind of ask a general question. I know you covered a bit on the call, but the auto supply chain availability, what are you seeing here? Updated situation, easing, and just or not, and just what the impact on Indy is, or if Indy's kind of immune to that dynamic, if that makes sense."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, I mean, generally speaking, our progress is really defined by share gains and content increases in the automobile space. So, I mean, it's no secret that the unit volume is down, but I mean, we've been able to write that out and meet our planned numbers as we set out in front of us. We do see some spot areas in our supply chain, so the input to our business, if you like, easing, it's certainly easier than it was a year ago. In the output from our business, the supply chain of our end customers, there's still some disruption also. There's a so-called golden screw phenomenon, which is really the key thing, which is slowing the unit shipments from the OEMs. But as far as we can tell, there's still no shortage of demand. So nobody's immune to it, but I think we've ridden the bumps pretty well."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. No demand impact, great. And then, you know, I'm hearing from various sensor companies, some of your competitors perhaps, is it a focus on model year 26, which, you know, L2 plus, L3, which if we pull it back would be decisions being made? the second half of this year, next year, first half next year, and ramping in 24. What position, you know, what are you seeing for Indy's positioning among increasing sensing that would go into these L2 plus L3 models? What should we expect in terms of your traction and penetration there?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I mean, you know, you can assume it's extremely strong. We've made heavy investments in all sensor modalities, which will be required for the various levels of of autonomy and ADAS features. We take a view that we right-size our products for each individual application. So you'll find us in high-end cars and also you'll find us in high-volume cars where the features are deployed in sort of mid and lower tier models indeed. We've gone through a lot of the selection processes already in the business that we've talked about publicly. So, you know, we're on track to see those things deploy in the timeframes that we specified when we came out with the announcements."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And then maybe a question just, I know you saw a player press release on the CHIPS Act. Can you just kind of summarize what you think that might mean for Indy, you know, versus the world pre the CHIPS Act being signed by the government?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, I mean, it's a good tailwind for the whole industry and especially and also for ourselves. There are carve-outs who are, of course, the focus is manufacturing, but there are carve-outs which are focused on design also. And we expect that given that our focus is very heavily centered around one of the U.S.' 's key industries, we should be a good candidate to benefit from that. So, yeah, I mean, for us, we view it as a positive."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. The next question comes from Ross Seymour from Deutsche Bank."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Please go ahead, Ross."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, guys. Thanks for the asked question. Congrats on the strong results. Donald, I want to talk just about the comfort you have with getting to the break-even slash profitability in the back half of next year. You guys have long set that as your target. You've executed very, very strongly to it. I just want to see what are the primary bridges between here and there from the revenue side. It looks like the revenue has to basically double from your third quarter this year to your third quarter next year to get you in that ballpark range. What are some of the key drivers and your comfort behind those drivers to attain that growth?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I mean, you know, the results speak for themselves. We're still executing to our plan and every quarter we've made the correct amount of progress that we expected as we went and we have strong belief that that will continue to happen. We have very good visibility of our backlog and our outlook into 2023. And you're right. I mean, we have to double one more time. We've done it twice already. So there's nothing that I can see in front of us that would inhibit that happening for us. In terms of the products, It's very well diversified across basically the whole gamut of product portfolio that we brought to market. So within that environment, we're pretty well diversified. We're not depending on one customer or one product. And with that in mind, the risk is pretty well mitigated. So we feel pretty good about it."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Thanks for those details. I guess that's my one follow-up, one for you, Tom. The gross margin just keeps marching higher. I know that's part of the plan. But as we think about the ability to grow going forward, what's the pace we should think about there?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, it's pretty linear. You know, it's driven by, obviously, our mix just continues to improve. We're seeing better second- and third-generation pricing and product margins, and then also as these newer higher value programs layer in, we're benefiting from that as well. So all those dynamics get us there."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Perfect. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. The next question comes from Anthony Stoss from Craig Hellam."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Please proceed with your question, Anthony."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, guys. My congrats. Nice execution, particularly on the guide as well for September. Donald, I wanted to follow up on your comments about the new PowerIC USB PD controllers. You're lending customers pretty quickly. Can you maybe share or shed some more light on why it's a breakthrough and why you're winning these deals as quickly as you are, and then add a follow-up after that?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, it offers a level of performance which wasn't previously available in an integrated product. It's... coming together of our digital technology, our digital controllers, our firmware-based controllers, and embedded ARM subsystems together with some pretty extreme power management to go along with that. There's some very tricky problems to solve when you get to those power levels, so to charge up to 100 watts in some cases, and it's been a very successful development for us. Nobody's as integrated as we are, and we're seeing that bear out in the customer reaction, and and the backlog filling up."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. And then lastly, just in the press release and your prepared remarks, you talked about Hyundai, etc., and the lighting design and wireless charging. Can you discuss kind of what you expect time-wise and volume-related? I mean, you said there were big contracts. I'm just curious when they're going to start picking that up."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I mean, they will contribute in 2023. There'll be a ramp over period, of course, but what we're seeing in the market is in some cases some acceleration of the design wind flow, perhaps driven a little bit by some of the supply chain constraints. And so, yeah, we do see that that will be a faster time to revenue than we're typically used to."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "The next question comes from Cody Effery from Benchmark. Please proceed with your question, Cody."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "yeah thank you guys for taking my questions and congratulations on the progress um maybe just to follow up on the last question just the size or scale of the design wins that you're talking about uh winning here and ramping in 2023 is there any color you can provide to that i mean we typically don't release specific numbers but they are material"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And I guess also Chinese activity."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Can you just talk about what's happening there from your standpoint and what do you see happening in the overall China market?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I mean, the overall China market is very buoyant."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Of course, there's the foreign joint ventures, which we serve over there for companies such as Volkswagen, General Motors, et cetera. also the local companies. There's a very buoyant sort of portfolio, if you like, of e-vehicle companies who are extremely hungry for feature ads because in that market, the sort of bells and whistles are really key in order to drive sales for them. So we see it's very buoyant at the moment. We see a fair bit of backlog coming from that place across the board for a lot of our products."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And are you, from a backlog standpoint, constraints limiting your performance?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I mean, not as such. I mean, the management of our supply chain has been pretty good through, as I think you will recall from previous quarters, when things were super tight. We've managed to manage through that. It hasn't been an easy task. So we've had to be on top of our game in order to do that. You will have seen that we invested a little in inventory this quarter to mitigate some risk there. But at this point, I think we're doing pretty good."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "The next question comes from Craig Ellis from B. Reilly Securities. Please proceed with your question, Craig."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah. Thanks for taking the questions and congratulations on the momentum in the business, guys. Donald, I wanted to start following up on your comments that with Suria, you're now engaged with four partners. So the question is this. Given the color a quarter ago where you indicated that there was pretty broad interest in it, how were these four partners selected? Can you provide some color around the pace of advancement with each? And what's the company's capacity to take on additional partners beyond these initial four?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, I mean, we picked the most probable to provide us revenue, of course, and we did receive a large amount of interest in the product when it was launched, and we had to be selective about who we worked with. So basically, we chose what we considered to be the cream of the crop and would give us access to the largest volume design wins in the business when they come to fruition. We have an excellent team in place. We do like to focus on key execution as opposed to spreading ourselves pretty thin, but we can scale if we need to and if we find opportunities which are compelling."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "From what you see so far, and I know it's early days in terms of your engagement with customers, but how does engagement so far leave you feeling with the ability to start shipping for revenue in the 2025 time frame?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I mean, it's good. I mean, it's a growing market and it's developing as we go. But at this point, I think, I mean, really nothing has changed for us by way of the plan that we set out at the end of 2020. We're marching towards it. We haven't really had a lot of kind of surprises in that sense, at least from the negative perspective. that we're really worried about. So we're still marching to the same plan, same time plan that we set out two years ago, basically."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you very much, sir."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Ladies and gentlemen, we have reached the end of the question and answer session, and I would like to turn the call back to management for closing remarks. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, thanks, everyone. Look forward to seeing you at the upcoming investor events this quarter, and see you at the same time, same place in a quarter's time."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. This concludes today's conference call. You may disconnect your lines at this time, and thank you very much for your participation."
    }
]