[
    {
        "date": "2023-11-09T17:00:00-05:00"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good afternoon and welcome to Indy Semiconductor's third quarter of 2023 earnings call. At this time, all participants are in listen-only mode. A question and answer session will follow the formal presentation. As a reminder, this conference call is being recorded. I will now turn the call over to Ashish Gupta of Investor Relations. Mr. Gupta, please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Operator. Good afternoon and welcome to Indy Semiconductor's third quarter 2023 earnings call. Joining me today are Don McClimit, Indy's co-founder and CEO, and Tom Schiller, Indy's CFO and EVP of Strategy. Don will provide opening remarks and discuss business highlights, followed by Tom's review of Indy's Q3 results and Q4 outlook. Please note, we'll be making forward-looking statements based on current expectations and assumptions, which are subject to risks and uncertainties. These statements reflect our views only as of today and should not be relied upon as a representative about views of any subsequent date. These statements are subject to a variety of risks and uncertainties that could cause actual results to differ materially from expectations. For material risks and other important factors that could affect our financial results, please review our risk factors in our annual report on Form 10-K for the fiscal year ended December 31, 2022, as well as other public reports filed with the SEC. Finally, the results and guidance discussed today are based on non-GAAP financial measures such as non-GAAP gross margin, non-GAAP operating income loss, non-GAAP net income loss, and non-GAAP EBITDA. These metrics may exclude from its corresponding GAAP measures certain of the following items. Depreciation and amortization, share-based compensation, acquisition-related expenses, inventory cost realignments, gain or loss from change in fair values, non-cash interest expense, and income tax, benefits, or expenses. For a complete reconciliation to GAAP and the definition for the above items, please see our Q3 earnings press release, which was issued in advance of this call and can be found on our website at www.indiesemi.com. I'll now turn the call over to Donald."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Ashish, and welcome, everybody. I am pleased to report that Indy posted solid third-quarter results against a challenging macroeconomic backdrop with growth well above our addressable market, driven by increasing demand for our highly differentiated auto tech solutions. Specifically, during the quarter, we achieved all-time highs in revenue and gross margin, with our top line up 101% year-over-year and up 16% sequentially to $60.5 million, with gross margin expansion to 52.7%. Our outperformance of the automotive industry reflects Indy's world-class design team, extensive product portfolio, leadership customer base, including virtually every single automotive OEM in Tier 1, as well as our highly scalable supply chain, all augmented by our successful acquisition integrations. In fact, our commercial success has made Indy the fastest growing semiconductor company in the world, among 224 peers over the last two years, based on a recent assessment by Morgan Stanley. At the same time, and perhaps more importantly, Indy is the only semiconductor company from the 2021 IPO class that is expected to reach non-GAAP EBITDA break-even in the current quarter. Further, I'm delighted to report that our strategic backlog has increased to $6.3 billion, up from $4.3 billion last year and $2.6 billion in 2021. The $2 billion of incremental growth was led by computer vision, supported by our acquisition of GeoSemiconductor earlier this year, together with post-integration wins, including Bosch, which enabled the leading North American OEM, as well as Toyota. Combined with our radar wins, which should extend well beyond the CAT 10-year lifetime, the ADAS contribution alone is roughly $4.6 billion in total, with the balance heavily in user experience, followed by emerging electrification products. Importantly, all of these wins set the stage for Indy to exceed $1 billion in annual revenue by 2028. Our deepest investments have been and increasingly are within ADAS, as safety features have taken center stage within the automotive industry. As context, the AAA Foundation for Traffic Safety released a recent study that expects current ADAS technologies to prevent around 37 million crashes, 14 million injuries, and 250,000 deaths through 2050, translating to a 16% decline in both crashes and injuries and a 22% decline in fatalities. At Indy, we don't believe these statistics are anywhere near aggressive enough. Our mission is to empower automotive OEMs and Tier 1 suppliers with increasingly more sophisticated yet cost-effective safety semiconductors and software for the vehicles of tomorrow towards a truly uncrashable car and a day when we can ensure driver, passenger, and pedestrian safety. To that end, we are embarking on a unique sensor fusion strategy where we employ multiple modalities including radar, computer vision, lidar, and ultrasonic solutions to capture data in different environments and ranges and to enable a comprehensive and accurate perception of the car's surroundings. This multimodal approach creates redundancy and compensates for the limitations of individual sensors, enhancing system robustness and reliability, which is ideal for challenging driving scenarios where precision and timely response are critical for safety. For example, radar provides good sensing ability of objects crossing or coming into a vehicle's path across a range of weather conditions, but has limited depth precision and object recognition capability. Meanwhile, cameras are extremely capable for object recognition in the same way vision sensing is for humans, but have poor performance in adverse weather or lighting conditions. And while LiDAR excels in range and depth precision and is unaffected by poor lighting, it may be impeded by heavy rain or fog. We believe our sensor fusion approach, as opposed to today's discrete implementations, will yield significant advantages as no single technology will dominate the market due to the complexity and diversity of the ever-changing driving environment. In addition, sensor fusion can yield far greater power efficiency and cost savings by optimizing sensor configurations to achieve the requisite performance levels, enabling these technologies to rapidly scale down to entry-level vehicles. In short, we believe the potential for our sensor fusion product roadmap is enormous. When widely implemented, Level 3 autonomous driving will require over 40 sensors and cameras. But in the meantime, and this is important, because our business plan isn't dependent on autonomy, we expect rapid sensor and camera global proliferation in support of Level 2 and Level 2++ premium vehicles and cascading down to entry-level vehicles for teenage drivers. To this end, I'm proud to announce that during the quarter, we secured a key initial computer vision win via a directed buy from a leading North American automotive OEM. This program is set to wrap in 2025 and is a meaningful contributor to the increase in our strategic backlog. In addition, we expanded our automotive camera video processor portfolio with the commercial release of a highly integrated system on chip that enables both viewing and sensing capability simultaneously. As government regulators, new car safety assessors, and consumers demand higher performance safety features, automakers are increasingly seeking camera-based ADAS solutions that enable volume scalability across their vehicle classes. This demands a distributed intelligent architectural approach to sensing and high levels of integration coupled with low power consumption to meet the demands of mass market deployments. Our next generation camera solution was developed to address these challenging design requirements According to S&P Global, shipments of automotive ECUs incorporating vision-based processing are expected to grow from 232 million units in 2022 to nearly 400 million units by 2027, and we plan to capture a disproportionate share of this volume. Shifting gears to radar, during the quarter, I'm pleased to report that we sampled our first product to our lead customer, and leveraging our acquisition of silicon radar earlier this year, we launched the world's first commercially fully integrated 240 GHz radar front-end silicon transceiver, expanding our portfolio of short-range, high-precision and millimeter-wave radar solutions. As a complement to the well-deployed use of 76 to 81 GHz radar for long-range automotive sensing, recent safety initiatives such as the European New Car Assessment Program, or NCAP, are driving the use of higher-frequency radar for new and emerging vehicle dynamics and monitoring applications, including assessment and control of air-spring-based suspension settings, real-time road surface quality, and hazard assessment to dynamically adapt ride quality and even fine-grade monitoring of gas tank levels. On the LiDAR front, we continue to make progress with our Surya SOC, with direct OEM engagements including system demos, on-site technology workshops, and joint performance evaluation and exploration with a leading Japanese carmaker, amongst others. We also entered a development contract with a leading aerial mobility OEM. Being conservative, we have yet to record any LiDAR wins within our strategic backlog, but based on the degree of inbound design interest in Surya, we fully expect material contributions by this time next year to drive to a leadership position as a merchant LiDAR semiconductor supplier and scale dramatically throughout the back half of this decade. To accelerate this timeline, during the quarter, we acquired Exelos, a Swiss photonics company, specializing in the design of high performance optical semiconductors. Exelos super luminescent LEDs for fiber optic gyroscope and viewing applications such as head-up display, backed by 59 global patents, complement our laser and silicon photonics products. In addition, Exelos semiconductor optical amplifier capability meaningfully augments our FMCW LiDAR product line. We look forward to updating you on our progress with this highly innovative design team, particularly as we leverage their skill sets across our global customer base spanning ADAS and user experience applications. Speaking of user experience, during the quarter we further ramped our entire portfolio led by highly integrated lighting, motor control, and charging solutions at leading global automators as OEMs prioritize an immersive in-cabin experience. As vehicles transform into extensions of your personal living spaces, the emphasis on creating a seamless, intuitive, and comfortable passenger environment has never been greater. reflecting a paradigm shift in consumer preferences towards a holistic user experience. Such advancements underscore the importance of integrating technology with comfort, eliminating cumbersome cables, and promoting a clutter-free environment. I'm also pleased to report that we continue to ramp our advanced lighting solutions with OEMs around the world and captured an additional wireless charging solution win at a leading North American carmaker. Our Qi 2.0 solution boasts the highest level of integration available, merging MCU and flash with additional features like a boost DC-VT converter, wireless charging inverter, and associated power feds. Specifically, via our integration, we are enabling a more than 50% reduction overall wireless charging system boom and a roughly 50% smaller PCB area compared to previous solutions, and we are enhancing the charging efficiency and reliability as demanded by automotive requirements at the same time. Finally, in the electric vehicle area, despite headlines to the contrary, long-term secular tailwinds remain intact as EV sales increased for the 13th consecutive quarter. Electric vehicle sales volumes set another record in Q3, as total sales of battery-powered vehicles jumped past 300,000 for the first time in the U.S. market. Year-to-date EV sales through September reached just over 873,000, putting the market firmly on track to surpass the 1 million mark for the first time ever. likely later this month. In fact, in the third quarter, EV sales were up 50% versus the prior year in the U.S., with EV penetration rates nearly 8% of new vehicle sales. And per the Wall Street Journal, the share of U.S. consumers who say they are thinking about buying an EV is now above 50% versus just 38% in 2021. These impressive figures highlight the growing consumer preference for sustainable transportation supported by a wide range of available EV models and competitive pricing strategies. The potential for the EV sector is still massive, based on continuous advancements in technology, a rapidly expanding charging infrastructure, and the market elasticity generated as battery costs decline. Given Indy's customer engagements, spanning market leaders including Mio, Ford, Rivian, General Motors, BMW, Mercedes, Xiaopeng, BYD, Hyundai, Nissan, Li Auto, and Volkswagen, we are especially well-positioned to capitalize on this secular shift. I'll now turn the call over to Tom for a discussion of our Q3 results and Q4 outlook."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Donald. Indy delivered a solid third quarter, once again exceeding our top-line guidance. In fact, this represents our 10th consecutive quarter of beating or at least meeting such targets post-Indy's IPO. Specifically, revenue for the period was up 101% year-over-year and up 16% sequentially to $60.5 million. Gross profit was $31.8 million, translating into a 52.7% gross margin, up 226 basis points year-over-year and up 50 basis points sequentially. R&D was $34.7 million and up sequentially given multiple product tape-outs while SG&A was $10.2 million, reflecting extended international sales and marketing activity, bringing total operating expenses to $44.9 million. In turn, our operating loss was $13 million, a further narrowing versus $15.8 million during the same period last year and $16.3 million in the second quarter of 2023, driven by higher revenue, improving gross margin, and operating expense leverage. With net interest expense of $200,000, our net loss was $13.2 million, and we posted an $0.08 loss per share on a base of 168.6 million shares in line with our guidance. Turning to the balance sheet, during the quarter, we maintained our level of working capital and invested an additional $2 million in capital expenditures, primarily to expand our quality lab capabilities at our Dresden Center of Excellence. enabling us to exit the quarter with $160.6 million of cash and equivalents. Looking forward, given the strength of our order visibility and new product pipeline that Donald outlined, we plan to continue to far outpace our addressable markets over the long run. More specifically, for the fourth quarter of 2023, we anticipate accelerating top-line growth on the order of 112 to 127% year-over-year to $70 to $75 million. To put our growth trajectory in better perspective, when we announced our plans to become a public company just a few years ago, we were on track to deliver $6.7 million in Q4 2020 revenue versus in excess of $70 million today, a greater than 10x top-line growth in a relatively short amount of time. But back to Q4. At the midpoint of our revenue range, with 20% sequential sales growth to $72.5 million, we anticipate gross margin to expand 50 basis points on a year-over-year basis to 52.7%. In terms of operating expenses, we are planning for $30 million in R&D, reflecting a more normalized spending level post a number of product tape-outs in Q2 and Q3, with SG&A similarly down and back to Q2's $9.5 million level. And with the add-back of $1.3 million of depreciation and no material non-GAAP amortization, we plan to reach EBITDA break-even for the first time in Indy's history. Below the line, we anticipate $800,000 of net interest expense and no taxes. With 181 million shares outstanding, we expect a one cent net loss per share in the current quarter. Longer term, we are committed to delivering outsized top line growth and driving to our 60% growth and 30% operating margin target model. In fact, given our bullishness, we are pleased to announce the recent completion of our Warrant Exchange tender offer, which effectively retired potentially 27.4 million shares with just 7.7 million shares. In this way, we substantially reduced potential future dilution, removed a shareholder overhang, and simplified our capital structure. On that note, I'll turn the call back to Donald for his closing comments."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Tom. In summary, Q3 marked another quarter of record results for Indy within a challenging macro environment. The surge in our strategic backlog to $6.3 billion in the overall momentum is a testament to our diverse product and IP portfolio, deepening customer relationships, our scalable supply chain, synergistic acquisitions, highly innovative roadmaps, and last but not least, our world-class team. The stage is now set for Indy to turn the corner and enter into a new growth and profitability phase, particularly as we translate our strategic backlog into new program ramps, recurring revenue streams, and free cash flow. At a higher level, we're creating another tech powerhouse and have never been better positioned to capitalize on the $48 billion market opportunity and, most importantly, to create extraordinary shareholder value. That concludes our prepared remarks. Operator, let's open the call for questions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, sir. Ladies and gentlemen, we will now be conducting the question-and-answer session. If you would like to ask a question, please press star then 1 on your telephone keypad. Confirmation turn will indicate that Ilan is in the question queue. You may press star 2 to leave the question queue. We ask in the interest of time that you limit yourselves to one question with one follow-up. Our first question comes from Sujita Solber of Roth NKM. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, Donald. Hi, Tom. Congrats on the progress here and the break-even you're achieving. It's a good accomplishment. Thank you. So, yeah. So, Tom, last quarter you talked in the guidance about two OEM programs that we're pushing out. We'd love to get an update on those if those are still kind of on hold or whether they've come back and maybe kind of dovetail that into whether you're seeing more pushouts in this environment or, you know, if you're seeing resilient demand."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So, no update on those per se. We're still planning them late in the first half of next year. There have been no further pushouts that we can see. Our market demand is reasonably resilient in spite of everything, and really no other news to report on that front."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, Donald, thanks. That's helpful. And then on the backlog, you talked about the growth to $6.3 billion, very significant. Is there some notion of how much of that is next 12 months to get some sense of coverage of a revenue forecast, or is that... Yeah, I mean, it's one of the ways to think about, I guess, the timeframe of the backlog."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I mean, for the next 12 months, we're pretty much fully booked. I mean, that's pretty much the case of the automotive industry. In terms of giving you a kind of a rule of thumb, if you look back to when we came out at the end of 2020 and we announced our strategic backlog at $2.2 billion, if you assume that you divide that by 10, it gives you a look ahead view to where the revenue should be three years plus from that. So now we have the benefit of hindsight to prove that that was true. So when we announced 2.2 billion divided by 10 is 220 million, and that's approximately the revenue run rate that we'll have in 2023. So by the same rule of thumb, if you take the 6.3 billion divided by 10, that's approximately going to be the annual run rate in 2026."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Very formulaic. Thanks, Donald. Thanks, Tom."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, I am an engineer."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our next question comes from Ross Seymour of Deutsche Bank. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, guys. Congrats on the strong results. Donald, you mentioned the challenging environment. I think we all kind of in general know what you're pointing to there. But when you mentioned no push-outs and fully booked for next year, et cetera, what does the challenging environment mean to Indy?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, I mean, our comments in that space are really just an acknowledgement of the general macro environment. The primary factor that drives our revenue profile is our own market share ad and the growth of semiconductor contents per vehicle. Since we've came out in 2020, we haven't really enjoyed an up year in terms of vehicle volume really since 2018. 2019 and the last four years have been down and only thing that's changed has been the reason that's caused the downside. So going from COVID to allocation situation, golden screw, UAW strike twice, macroeconomic interest rates rising. And really, we see that as kind of flat. I mean, but from our perspective, our trajectory has hasn't been helped by that, but it's been relatively speaking unimpeded. We called our revenue in 2023 and 2020, and here we are. And we're going to continue to execute to the plan that we laid out. So what does it mean to us? For us, it's just about executing and running our own race. The macro aspects of it aren't necessarily helpful, but they're not stopping us either."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I guess one for Tom on the margin side of things, it's great to see the year-over-year increases, and you're pretty much in line with what you've guided. But you've kind of been at roughly the same level for a year, despite the revenues doubling. 4Q to 4Q, I guess you're up 50 basis points. So the move from year to 60 will obviously take a bit more than that. So I guess, one, the flatness year-over-year, what's the general cause of that? And then much more importantly... What are the key drivers that would get you from kind of the roughly 53 up to 60?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, I mean, let me interject first and take the last part of that question first. I mean, really what's going to drive us to 60% is the deployments of the ADAS products, which are coming later into our revenue profile as opposed to, you know, the products that took us over the line from private to public. So we're at that point where the mix of these products is going to make the biggest difference. And they are significantly higher ESP, which is typically proportional to the amount of gross margin that we can demand because the value of the product is simply higher."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "The only other thing I would add is the gross margin progression has actually been pretty impressive. You know, I mentioned the $6.7 million of revenue we did in 2020. That was at a 35% gross margin. And as you know, we've steadily increased expanded from there, you know, up now into the close to 53% range. So as Donald's mentioning, as the mix continues to improve from here and it increasingly moves to ADAS, which inherently is higher gross margin, that gets us to the 60% target. Great."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our next question comes from Anthony Stoss of Craig Hallam. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks. Kind of a follow-up to Ross's question, Tom, where do you expect to exit 2024 in terms of gross margins? And I had a couple of follow-ups for Donald."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure. We haven't really guided that specifically, but, you know, just given the momentum we're seeing and the mix moving more towards the ADAS side, 55% is a reasonable expectation. Okay."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Donald, thank you for breaking out in your prepared remarks the ADAS 4.6 out of the 6.3. And I think you guys did a pretty good job of laying out billion-dollar-plus win beginning late 2024. Of that 4.6, can you paint a picture how many of those customers will be live, say, by the end of 2025 or however you want to break it out?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, almost all of them will be at least beginning to ramp by that stage. We have a few wins, which are 26 and beyond, but most of that backlog will begin to ramp in 25."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Scott, let me squeeze one more in. Just the North American 8S win. What's the expected value of that one, the newest one?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "We're not breaking it out specifically, but it's a pretty meaningful win. Design win, it's with an existing customer where we have some significant volume in a similar space. I mean, you can assume, as we're calling out really as our headline win, that it's a pretty significant part of the backlog increase."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Very good. Thanks, Donald."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our next question comes from Craig Ellis of B. Reilly Securities. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, thanks for taking the question and congratulations on the two company milestones, the $6.3 billion backlog and the adjusted debit profitability. So yeah, you're welcome. I wanted to follow up on the latter, given that there's been some good attention on backlog. On profitability, is that something that you think the company can sustain as we go through 2024? Would there be any anything we need to look out for with respect to a resurgence in asset costs or anything else?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I mean, for 2024, we're committed to a full year of profitability given the momentum that we see. I mean, there'll be some fluctuations up and down in OPEX and so forth, but really we're, you know, given the sort of numbers, basically, That's the bottom line for us. We're committed to a full year of profitability."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, and to add to that, it's really a function of, as we've talked about in the past, OpEx from here will go up nominally in absolute dollars, but will continue to come down dramatically on a percent of sales basis. That drives the operating leverage and the enhanced profitability."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. Good to hear. And then going back to some of the things that are happening in the ADAS portfolio, Donald, Can you talk a little bit more about some of the developments in radar over the last three months? And then I have one more after that, if you'll take it."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, as you might recall, we announced our radar win, I guess, 18 months, almost two years ago now. And so we've been on a very intense development phase through that, which, as we mentioned, the prepared remarks now we're coming to the end of. which is a big milestone for us. In addition to that, the visibility that we have of OEMs beginning to commit more programs to that is only increasing as a factor of our increased confidence in our execution, which is now largely behind us, and what we can see happening in the market. In terms of the potential for that market additionally, All we see is more radars being deployed for more diverse functions. Again, as we mentioned in the prepared remarks, there's perhaps some somewhat unexpected applications, which we're seeing now for things like road quality, monitoring of air-based suspension systems, where the radars are really being deployed as multifunction sensors, not only for ADAS. And we expect fully that we'll participate in those markets. So our future is so bright in that one, we need to wear shades."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, very hip reference there. Thank you for that. And is it possible to quantify the customer breadth that you have in the backlog in the ADAS area? And if you can, then it'd be helpful to get that in the user experience area as well."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I mean, I would say... over the last 12 months, we kind of filled out any remaining gaps in customer portfolio that we had. I mean, we called that out in the prepared remarks also. I mean, we're really everywhere now. We really have some content at all OEMs and all tier ones. You know, some were significant than others, but it is very diverse. And what we're beginning to see over the last 12 months, perhaps really for the first time, is that the cross-selling within a single customer for our different product lines is gathering momentum. And that that has kind of a multiplicative effect on how we expect our revenue profile to grow in the future. So, I mean, couldn't be happier with where we are on that, actually."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "In fact, to kind of quantify that, we've got 12 unique product areas, 20 Tier 1s are within the backlog, and then, as we've mentioned, we're selling now to virtually every car OEM in the world. Got it. Thanks so much, guys."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Our next question comes from Cody Acree of the Benchmark Company. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, guys, thanks for taking my questions, and congrats on the progress. Thanks. Could you maybe, Donald, could you just speak a little bit to what makes up your billion dollars of visibility for 28? I guess if you can give us any kind of direction as to what constitutes that backlog."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, I mean, the way our backlog is constructed, it's measured over a period of time. And of course, one of the nice things about automotive, although it takes a long time to get revenue going, it tends to last for a long time after you start. So the run rate that I called out as a benchmark around 2026, you could assume as being in the bag two years after that. And then the remaining part of our our bridge to between there and the billion dollars in 2028 is based on a pipeline that we have in place, which is a number of multiples of larger than the strategic backlog that we declare. And when we say we have visibility, that means that we've been working with somebody for a long time. I mean, some of these sales cycles are extremely long, multiple years of jumping through hoops and jumping over hurdles and displaying technical capability to get these guys on board and bought into our technology, regardless of how good it may appear, they don't take much for granted in this industry. And so as a result of that, we got a lot of visibility in our pipeline of what's likely to convert over the next couple of years, which will get us into the position that we feel that we're going to be in 2028 around a billion dollars of revenue. So we feel pretty bullish about that. And hopefully, who knows, we can maybe even beat that a little bit."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great, thank you for that. Maybe if we can look at the UAW strike and any impact that you're seeing in your bookings or visibility."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I mean, a little. I mean, we have exposure to the big three, have been customers of ours for many years, but we are very geographically diversified now. We have a bigger customer base in China, Europe, non-unionized companies in the United States also for that matter, or even plants that belong to the big three who are not in the United States. So, I mean, it had an impact, but it was for us relatively manageable within the noise of what we manage on a regular quarterly basis. And any impact of that is now baked into the numbers that we just saw. We're very glad that they came to resolution. And I hope there's no longer lasting effect of that. I don't think so. But at this point, we're not really planning anything extraordinary to mitigate."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "All right. Great. Thank you, guys. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Ladies and gentlemen, we have reached the end of our question and answer session. I will now hand over to Donald MacFamot for closing remarks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, everybody. See you at the investor meetings and conferences over the next few weeks, and see you again next quarter."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Ladies and gentlemen, this concludes the Indy Semiconductor Conference call. Thank you for joining us, and even I'll disconnect your line."
    }
]