Thank you for standing by and welcome to EnterCure's fourth quarter 2022 earnings call. At this time, all participants are in a listen-only mode. After the speaker presentation, there will be a question and answer session. To ask a question during the session, you will need to press star 1-1 on your telephone. I would now like to hand the call over to Ori Mindelbaum, Investor Relations. Please go ahead. Thank you, Latif, and good afternoon, everyone, and welcome to Intercure's fourth quarter and full year 2022 results conference call and webcast. A copy of the company's earning press release is available on the news and events section of our website at intercure.com. With me on today's call are Alex Rabinovich, Intercure's chief executive officer, and Amos Cohen, the company's chief financial officer. Today we will review the highlights and financial results for the fourth quarter and full year-end of December 2022, as well as more recent developments. Following these formal remarks, we will be prepared to answer your questions. But before we begin, please let me remind you that during this conference call, Intel Truth Management may make forward-looking statements made within the meaning of applicable securities law. Forward-looking statements may include, but are not necessarily limited to, financial projections or other statements of the company's plan, objectives, expectations or intentions. These forward-looking statements are based on current expectations that are subject to a number of risks and uncertainties that may cause actual results to differ materially from those expressed or implied in such statements. Also, please note that unless otherwise indicated, all amounts discussed in this call and expressed today are in Canadian dollars or new Israeli shekels. Additionally, please note that the results mentioned pertain solely to the company's operation in the cannabis sector unless otherwise specified. And with that, I will turn over the call to Alex Rabinovitch, InterQ CEO. Alex, please go ahead. Thank you, Ori. Shalom, everyone, and thank you for joining us for our fourth quarter and full year 2022 Irving School. 2022 was another successful year for InterQ as we continue to solidify our position as the largest, fastest-growing and profitable cannabis company outside North America. In line with our profitable growth strategy, we executed well on all fronts, This resulted in strong financial and operating results while further positioning Intercure for continued growth. In 2022, our revenue exceeded $150 million with adjusted EBITDA of $32 million. A significant achievement considering pharmaceutical grant regulation was only introduced less than five years ago and our first GMP prescribed product was dispensed in a pharmacy only in late 2019. Our remarkable profitable growth is a proof of our team's ability to execute with strong dedication to excellence, as demonstrated by our successful implementation of key operational decisions, capital investments, and strategic legal and regulatory victories. I am very proud of our team's delivering continued solid performance. These strong results are especially impressive when you take into account the slowdown in new patient recruitment in Israel during the first half of 2022. This was mainly due to the loss of physicians responsible for more than 20,000 market prescriptions as Minister of Health halted their license to prescribe medical cannabis. In the early days, we chose to focus first on leading the Israeli market, as we believe that any global leader has to dominate its whole market before expanding internationally. Although Israel is well known for its medical cannabis research, it's also developed and implemented the most advanced medical cannabis regulation to become today the biggest and most advanced pharmaceutical-grade market globally, with about 45,000 dispensed yearly. After four years since it was introduced, pharmaceutical cannabis represents about 15% of all prescribed pharmaceuticals in Israel, with a clear runway for this growth to continue. We expect market growth to resume as the Minister of Health announced a new reform known as the prescription reform that will cancel the need for a special license and will allow any physician to prescribe medical cannabis under the public health care system. Of the latest INCB UN guidance, the Israeli Ministry of Health is expecting major growth of the market in 2023 to 85 tons, up from 49 tons in 2022, marking expected growth of over 70%, assuming this reform implemented. If the new government in Israel assembled, The new Ministry of Health stated that the new reform would be implemented soon, and while patients suffering from current bottleneck of lack of prescribing doctors, many companies in the industry are struggling from continued losses and lack of capital. Companies are exiting the market and liquidizing their products with some short-term effect, especially on low and mid-quality products, which Amos will elaborate more on the financial results. Eventually, for 2022, patient count grew only 18%, while intercure grew 77%, emphasizing the strength of our leading platform. And we believe this commission represents an opportunity to grow our leading share organically and inorganically, even before barriers will be lifted and the market growth will resume. During 2022, we've also scaled up our up-splain operation by upgrading the solvent facilities, post-harvest, nursery, and growing areas. This further solidified Kandok's solvent cultivation site as one of the largest and most advanced facilities of its kind in the industry. Our expert teams have also successfully added and produced tens of new highly demanded strains into their growth cycles, including premium high THC cookies cultivars, humble genetics, and some of the industry's top shelf products. In the total, during the year, we successfully launched more GMP products than any other company in the industry. Committed and named, will remain focused on increasing not only our local cultivation in Israel, but also our global exclusive strategic partnership. During the year, we have been able once again to be the first company to meet the strict new 109 protocol and resume importation from our partners to Israel. Although the Israeli regulators are constantly hardening the importation process, we are well prepared for future evolving regulations with the best teams and pharmaceutical labs globally. As our core markets are growing and evolving, we are also increasing the high-quality supply of our existing strategic partners and evaluating new potential strategic partnerships. We have extended our successful exclusive partnership with Organica, a world-leading indoor grower, to supply us with up to 20 tons of our chosen genetics, extending its reach into our core markets in Europe and UK. We also announced expansion of the company's partnership program, forming a collaboration with the leading cannabis brand, Binz, to develop and offer a range of non-flour cannabis products which we believe will significantly enhance our product portfolio and further strengthen our market position. Both the Ministry of Health in Israel and the Ministry of Economic have eased the process of exportation, enabling us to ship pharmaceutical-grade cannabis products in any format to any legal markets in the world. I am happy to update that our teams have made great achievements and successfully completed export of InterQ's products to our EU hub preparing for EU GMP commercial launches in UK and Germany. We expect commercial export achievements to ramp up in the coming quarters. We have built a unique international supply chain that can supply every core market with our winning branded product portfolio, and we will continue to scale up our upstream operation in the coming quarters. Moving on to downstream. Keeping with our C2C model, we've expanded our one-of-its-kind dedicated medical cannabis dispensing operation during 2022. At the end of 2020, our specialized medical cannabis pharmacy chain was comprised of only three locations. As of December 2020, our chain includes 28 doors. We have developed 26 locations across Israel's major cities, out of which 20 are actively dispensing medical cannabis and six are in the process of obtaining the license to dispense. Growing our cannabis dispensing footprint more than nine times in the last three years has positively impacted our businesses while ensuring patients receive the highest quality service from more than 90 highly trained, specialized pharmacists. In 2023, we expect to add several more locations, and with that, all currently 26 will be fully running and operational. Our leading pharmacy chain will have a full national footprint. During 2022, we have developed two new locations outside Israel, which included Cookies branded shop in Vienna, Austria, which is up and running, and the pharmacy under development in the heart of London, UK. International expansion is one of our main goals ahead. As most of the world is taking a medicalized approach towards cannabis, a rapidly growing number of countries are adopting our unique and strict pharmaceutical cannabis regulations. In fact, the list includes more than 40 countries that are in various stages of adoption. Pharmaceutical-grade cannabis regulation is indeed becoming a world standard. Improving by avoiding other companies' mistakes, we carefully expanding our reach by duplicating our winning model in the UK, Germany, and Austria. All of these markets are in early stages, a few years behind the Israel market in product quality, but with similar competition and regulation. Our 15 years of know-how and execution, proven model and leadership position sets us up to succeed in every territory with supportive regulatory framework. Before I hand over the call to Amos, I want to know that 2022 has concluded 15 years of organic growth and one of our best year to date. During 2022, Intertour achieved Record revenues of approximately $150 million, 77% more than the revenues of 2021. Our gross profit increased to over $60 million, representing 41% of revenue. And adjusted EBITDA increased to $32 million, representing 22% of revenues. Net profits after tax were just under $17 million, generated $20 million cash flow from operations, and we ended the year with $95 million cash in hand and a solid balance sheet. As our target markets are evolving, we remain focused on execution with financial discipline while navigating through regulatory barriers and market challenges. While favorable regulatory cannabis reforms are on the horizon in Israel, Germany, and many other markets, we expect our growth journey to continue as we remain focused and committed to expand our leading platform, building shareholder value and improving quality of life for patient communities across the world. And now, I will turn the call over to our CFO, Amos Cohen, following which we will open the line for Q&A. Amos, the floor is yours. Thank you, Alex, and good afternoon, everyone. I am very pleased to be sharing with you today our financial results for the fourth quarter and year-end of 2022. Our focus continues to be execution, expansion, and building our unique vertically integrated model centered on our high-quality branded products while keeping financial discipline. We delivered record full-year revenue of $150 million or 389 million shekels, an increase of 77% compared to $85 million in 2021, an impressive growth as patient count grew only by 13%. During 2022, we continued to expand our vertically integrated platform. We scaled up our cultivation production facilities, expanded our logistics hub capacity, and added eight new locations to our leading medical cannabis dedicated pharmacy chain. exiting the year with an industry-leading platform of 28 locations, out of which 20 are actively dispensing medical cannabis, and for the first time, two international locations. We also reported an at-the-record fourth-quarter revenue of $41 million, or 106 billion shekels, and impressive growth, over 30%, greater than the fourth quarter of 2021 revenue of $31 million, or 80 million shekels. and up by 6% sequentially compared to the third quarter of 2022. Revenue growth during the fourth quarter of 2022 reflects increased market share and growing patient demand for our branded products and the strength of our medical cannabis dispensing operations. Our gross margin for the year 2022 reached 41% compared to 44% in 2021, while for the first quarter, the gross margin was 35%. During the fourth quarter, we have witnessed financial weakness affecting many players in the industry. Financially struggling companies and companies exiting the market sold low to medium quality products at lower prices, liquidating their inventory. This had an impact primarily on our ultra-medical and legacy products, while the prices for our top-selling, high-quality products remained stable. In the first quarter of 2023, we continue to see strong demands for our high-quality products and continued shifts from legacy meat quality to value products. We believe that these market conditions and completing the licensing of the eight pharmacies which are yet to dispense medical cannabis position us to further increase our leading market share and will revert in the coming quarters as the market will consolidate and the prescription reform will pass through. Turning now to adjusted EBITDA. We believe adjusted EBITDA of the cannabis sector and non-IFRS measure provides valuable insight into our operating performance. Adjusted EBITDA excludes from net income, as reported, interest, tax, depreciation, amortization, non-cash expenses, share-based compensation, acquisition and transaction costs, fair value step-up of inventory, and other income or expenses. For the full year of 2022, adjusted EBITDA was $32 million or 84 million shekels, which is 22% of revenue, compared to $22 million or 57 million shekels for 2021. For the first quarter of 2022, adjusted EBITDA was $7 million or 19 million shekels, which is 80% of revenue, a slight decrease compared to $9 million or 22 million shekels for the third quarter of 2022. demonstrating the strength of our platform and our ability to execute. As we continue to invest in scaling up our platform, CAPEX in 2022 totaled $18 million or 48 million shekels. We expect 2023 CAPEX will be at least 50% lower than 2022, and we mainly focus on our global expansion as we expect launching our branded product in Germany, UK, and other territories. and continued development of our leading medical cannabis dedicated pharmacy chain to about 35 locations. We are very proud. We are with our third consecutive year with a positive cash flow for operation generating in 2022, $20 million or 51 million shekels, proving our financial discipline. We ended the year with a solid cash on hand of $95 million or 246 million shekels compared to $83 million or 217 million shekels in 2021. In addition, our balance sheet includes $25 million of loans granted to companies, mainly associated with several uncompleted M&A transactions. We are financing about 70% of our capex with long-term loans from tier one banks in Israel. These are strategic relationships built during years of execution. As interest rate environment is changing, we are constantly revising our financing structure. With the strength of our balance sheet and our solid performance, including cash flow generation, we are well positioned to continue executing our profitable growth strategy, leveraging the foundation and leadership we have built to capitalize on global expansion and consolidation opportunities. For further information on our financial and operating performance, I encourage you to review the company's financial statements and management discussion analysis, which are available under the company's profile on CDAR and through EDGAR. This concludes our prepared remarks. We would like to thank everybody for joining us today's call and would now like to open the line for questions. Operator, please open the line for questions. As a reminder, to ask a question, you will need to press star 1-1 on your telephone. Again, that's star 1-1 on your telephone to ask a question. Please stand by while we compile the Q&A roster. Our first question comes from the line of Vivian Azar of Cohen. Your question, please, Vivian. Thank you. Good afternoon, good evening. I wanted to talk about the dynamism that you guys referenced in the Israeli market, please. Understanding that some of the wholesale discounting that you were seeing from competitors is going to be, you know, short-lived in nature. Can you offer some color on what the mix for the category looks like today by price point and how that compares to your own portfolio? Thank you. Hi Vivian, thanks for the question. Basically, we don't have official numbers for the Israeli market categories. I mean, we have some BI and internal evaluation. We think the market is probably about 70% on the high quality. Some people call it premium. And about 30% is on more discounted products. And I mean, yeah, almost elaborate about it. I mean, we've seen a trend of struggling companies exiting the market, selling their inventories in lower than cost sometimes. and affecting the market. We are seeing this trend since Q4, affecting the market prices and movement towards those more value products. Eventually, the mix didn't really change. I mean, the mix is still about 70-30, but this reflects on our portfolio. I would say our portfolio is close to the market portfolio. About 70% of our products is on high quality and about 30% are more on the side of what we call ultra medical or legacy product. And basically Amos also stated that we have seen this trend into also 2023. Eventually we expect those inventories either to sold out or to expire as eventually the market will clean up. We have expiration dates on pharmaceutical products and also we are seeing most of those players exiting the market. So basically we are expecting the cleanup to occur towards the mid of the second half of 2023. Thank you. That's helpful. And certainly that helps to explain, you know, some of the margin degradation that you guys saw sequentially in 4Q. But as I reflect on kind of the evolution of your gross margin on a multi-year basis, it would seem reasonable to think that there's also margin drag from your international operations. So can you just talk about your perspective on gross margin from here? How much of a recovery can we see as the Israeli market gets cleaned up? And then the offset, of course, being, you know, what kind of incremental gross margin headwind should we expect from your international expansion effort? Thank you. So, yeah, we think, again, like it's hard to speculate right now. I mean, there's a couple of trends that may affect a gross margin. We expect the prescription reform to be implemented. And once this happens, this might have a crucial effect, a crucial positive effect on the gross margin and it's really hard to speculate when this reform will be implemented. Regarding our international expansion, prices in Germany and in the UK are much higher than the Israeli market. We are seeing prices that are sometimes doubling with much lower quality. So we expect a positive impact on our gross profit margin as we will scale up and launch more products in those territories. Okay, that's helpful. And then just my last question, sticking with international, I think it's been our experience that progress in international, and in this instance, European cannabis markets, has certainly been slower to progress. That clearly informs what your differentiated strategy is, to be sure. But can you just reflect back on what your expectations were for international progress heading into 2022 and how you may have tempered your expectations around regulatory change in Europe for 2023? Thank you. Yeah. stated we are taking a careful step toward our international expansion, learning from basically the markets and other companies' mistakes. There are some niche markets at the moment for us at Europe. I mean, German market is about 13, 14 tons at the moment, and we are expecting a new reform there. So for us, Germany is a nice target market where we are competing there basically with the same competition, with the same companies that are playing here in Israel, supplying the market in Israel. But the quality in the German market, I would say it's where Israel used to be about two years ago. Israel is much more competitive in terms of quality. UK market is in an instant stage, but growing fast, representing a good opportunity for us also. But again, it's a small market yet. We are launching the first pharmacy in the heart of London to actually have a physical inventory. We've seen a big change in Israel. Once we launch a high quality product in the market, we've seen the market grow because of that offering. And yeah, we believe that once medical cannabis products in high quality will be offered in the UK market in decent prices, of course, comparing to the local market conditions, we will obtain a good market share. And eventually the market will grow because of the same trends we've seen in Israel in the early days. Understood. Thank you very much. Thank you, Vivian. Thank you. Once again, to ask a question, please press star 1-1 on your telephone. Again, that's star 1-1 on your telephone to ask a question. Our next question. comes from the line of matt bottomley of canaccord your question please matt yeah good evening thanks for uh all the colors so far i'm just wondering uh with respect to the particularly on the gross margin side of things i know you sort of explained uh some of the dynamics that are happening in the market that are causing some headwinds but given that you know q1 is sort of already in the in the rear view mirror here um typically when we see some of this uh you know price erosion or or some just you know difficult dynamics with respect to pricing. It's not typically a one-quarter event, and I know you expanded on this a little bit more, but I'm just wondering whether it's on margins or maybe any other sort of guidance, quantified or not, if you can give us indications of how Q1 is trended and any sort of expectations into the back half of the year with respect to the cadence of pricing in Israel. Hi, Matt. So as I said, it's really hard, and again, we are not giving any guidance, so I can give some colors and try to speculate a little bit about the trends. So as we stated, we are seeing the trend into the first quarter of 2023. And again, it's hard to speculate when the market will clean up and when the new reform will be implemented. The best guess of ours right now, this is the best we can give, is the second half of 2023. As we are seeing companies exiting the market, and some consolidation process already started, eventually leaving more room for us to grow our market share. But again, it's hard to speculate right now about in what quarter we will see the inflection point. Okay, got it. Thanks for that. And then my other question just relates to the potential for a pretty significant growth profile into next year on legislative changes for prescriptions. So one, can you just give us any description of how this process relates relative to other legislative endeavors in the past? So I know for the last couple of years there's speculation of maybe adult use that's kind of been kicked down the road and there's been various sort of elections in the interim that have probably delayed that, but sort of how concrete is the actual catalyst of sort of an easier access to patients when it comes to those that can prescribe. And the second is just the ability to service that. Assuming that it does happen, you know, an overall 70% increase in market demand, is that something that would require more capital investment? Is it something that you think, although it might alleviate, you know, pricing pressures, something that, you know, the operators in general overall in Israel can support that level of growth in one year should it occur? Okay, thanks for the question. So the prescription reform is built after probably two years in the Ministry of Health. They've examined the biggest bottleneck in medical cannabis market, which is the doctor prescribing In Israel, the physicians need to have a license to prescribe. Also, the patient needs a license, but the main bottleneck is this license to prescribe that is given to about 200 physicians. Out of them, we have only a couple of tens which are actively prescribing. So we have about 123,000 patients, and that means doctors have to prescribe 240,000 prescriptions per year. Divided into 45, 50 physicians, you get a huge queue. Also, the regulation calls for Maximum cost for each prescription, which is about $70. While the actual price, again, because of, of course, over-demand on supply, the actual price is sometimes triple that price. And that costs a lot of constraints. Many doctors, you know, charge much more than the regulations. And from time to time, the Ministry of Health is halted and canceling their licenses. In the first half of 2022, the Ministry of Health has canceled the license of several doctors who were in charge of 20,000 patients. That basically brought the market down. to a stable line without growth and we saw we see this happen again in the beginning of 2023 and this will continue to happen unless they will solve this bottleneck um so a committee was uh was called and the committee is unpolitical uh it's totally professional and the committee concluded in the and the minister of health has announced this reform um And then we went into elections and in the new government, the new Ministry of Health in the first day stated that this reform will be implemented. So again, it's a huge suffering for patients. Of course, it's also a big constraint on the industry. But again, the patient community in Israel is also a big political power. And yeah, we have the reason to believe that this reform will be implemented soon. Again, no crystal ball for the timing, but this is a big constraint and a big suffering for the patient community. Got it. Appreciate it. And just on the part of the question with respect to the ability to service the market, If there's a 70% increase, I know you have relationships for various import arrangements out of Canada, but just how you're situated, should that growth come in faster than you're anticipating relative to your own capacity internally? Okay. I didn't explain also that the reform will cancel the need for a specific license, and Basically, every physician under the public system, the Israeli health care system, would be able to prescribe at least the second and go on a prescription. So this, of course, will eliminate the bottleneck and the market. I mean, the Minister of Health is expecting the market to grow exponentially. by the 70%. This is an official number. So, yeah, I have to say that we are preparing ourselves for this reform. We scaled up our operations, our cultivation operations here in Israel. We signed up with the third parties also. and we scaled up also our supply agreements with Organigram and other international partners. So I would say we are basically ready for this reform, and I hope that this reform will be implemented soon so we can exercise on everything we've built here. Okay. Well, thanks so much. Step back. Thank you. Thank you. Our next question comes from the line of Pablo Zuanek of Zuanek and Associates. Your line is open Pablo. Hello, Alex. Look, just one question regarding this prescription reform. Obviously it sounds like a big catalyst for the industry, but I guess, you know, I'm thinking the case of Germany, all the doctors there are able to prescribe, but very few do right. And in the case of Israel, We are calling this a bottleneck, but these doctors there that didn't have a license, they were free to try to get a license to prescribe cannabis, right? So explain to us why this is different and why it would be such a big catalyst. Okay, Pablo. Thanks for the question. So there's a big difference between the Israeli regulation and the German regulation. Also, regarding the doctors, I would say, enthusiastic to prescribe their cannabis. Basically, the huge difference is that Israel has a clinical practice where the doctor can use this green book and use this clinical practice and be, I would say, protected. We have to understand that most of the doctors, they didn't learn about pharmaceutical, medical cannabis in their universities. So the big difference is this clinical practice that Israel is using. And again, I mean, Israel is much more advanced in terms of accepting medical cannabis. By the Ministry of Health, medical cannabis has become a first line of treatment in some indication, not like in Germany where you have to, first of all, use many other pharmaceuticals and only if that doesn't really help you, the doctor can prescribe you a medical cannabis. So there's a big difference. I think eventually Germany, not only Germany, a lot of other countries, probably even including the FDA, we look into the Israeli regulation and the Israeli clinical practice, and actually we are expecting a new book that will be issued very soon by the Minister of Health that will be more scientific, and this time will be in English. And I know that many regulators around the world, in Australia, in Germany, and even in the US, are waiting for this book. And basically, this is, I would say, the most advanced regulation and regulation in the world. So Israel is, as I said, is few years ahead of any other markets in terms of accepting and developing this regulation. Thank you. And I think you said that there's only 200 doctors in Israel that have this license. Why do you think the number was so low? I mean, was it very difficult or expensive to get the license or a lot of time that we have to spend to get the license? Can you explain that? Again, it's hard to explain why are there only 200 physicians that got the license. Probably it's because of the process. The Minister of Health, you need to go for a special course and then to go to exams. we are seeing the young generation of physician accepting that and the old generation usually won't follow those barriers and eventually physicians in Israel are accepting medical cannabis But to prescribe medical cannabis, as I said, you need this specific license. You need to report. Again, it's a biocracy process. It's not like prescribing a regular narcotic. You have to be connected to the Minister of Health with a special system. So all those biocracy lean and hang over the market, and not only the market, it's basically, this is basically why a lot of patients are suffering from cues and from prices that are much higher than the regulation stated. Right, sounds like a big catalyst. Just to be clear, in terms of the stores, you are at 18 in Israel, and I think you aim to finish with 26 by the end of 23. Is the opening of the stores going to depend a bit on when the prescription reform comes in, or do you have already pretty much the schedule lined up for the year? So in Israel, we have 20 actively dispensing stores. It's not stores. It's dedicated pharmacies. and another six that are in development. The development phase of those pharmacies actually does not depend on the reform. Again, it's a very biocracy process. Sometimes it can take six months, sometimes it can take two years, depending on the district in Israel. So yeah, this reform might open also the bottleneck for the pharmacies. That's part of the reform. But again, it's not the biggest constraint. And actually, we expect to end up the year with more than 26 actively dispensing pharmacies. Thank you. One last one. I saw you canceled that deal in Australia with Better. Can you just remind us of what was the original logic of that deal and what could you be doing in Australia in the future? Thanks. That's it. Right now, the issue with Better, because again, we loaned some $2.5 million to Better and The issue with better is right now on quote, we are, we are, we are seeing better. So it's kind of hard to me to, uh, to get into details. Um, yeah, I would say we had, we had a very good logic in, in turning into, uh, into this, uh, MNA. Um, uh, some of it is, is, is, uh, better, uh, presentations about, uh, Australia and the license. Uh, they have, they had the second active license in Australia. Unfortunately, this did not mature because of many reasons not related to InterQ. And I don't want to dive into it because it's right now on hold. Thank you. Thank you. Thank you. And ladies and gentlemen, that does end today's Q&A session and concludes today's conference call. Thank you for your participation. You may now disconnect.