Good day everyone and welcome to Intercure's third quarter 2021 conference call. At this time participants are in a listen only mode. A question and answer session will follow management's remarks. This conference call is being recorded and a replay of today's call will be available on the events and presentation section of Intercure's website and will remain posted there for the next 30 days. I'll now turn the call over to Mr. Phil Carlson of KCSA for introductions and the reading of the safe harbor statement. Please go ahead, sir. Good morning, everyone, and welcome to Intercure's third quarter 2021 earnings results conference call. A copy of the company's earnings press release is available on the news and events section of our website at www.intercure.co. With me on today's call are Mr. Alex Rabinovich, Intercure's chief executive officer, Mr. Amos Cohen, the company's chief financial officer. Today, we'll review the highlights of financial results for the third quarter 2021, as well as more recent developments. Following these formal remarks, we will be prepared to answer your questions. Before we begin, please let me remind you that during this conference call, InterCures management may make forward-looking statements made within the meaning of applicable security laws. Forward-looking statements may include, but are not necessarily limited to financial projections or other statements of the company's plans, objectives, expectations, or intentions. These forward-looking statements are based on current expectations that are subject to a number of risks and uncertainties that may cause actual results to differ materially from those expressed or implied in such statements. Factors that could cause actual results to differ materially include, but are not limited to, the risk factors contained in the company's filings with CDAR and the Securities and Exchange Commission. Please also note any forward-looking statements made here are, as of today, and except to the extent required by law, the company assumes no obligation to update statements as circumstances change. Also, please note that all amounts expressed during this call are in Canadian dollars or new Israeli shekels unless otherwise noted. Now I will turn the call over to Mr. Alex Rabinovich, Intercure's CEO. Alex, please go ahead. Thank you, Phil, and welcome everyone to Intercure's third quarter 2021 earnings conference call. I'm delighted to be hosting our first earning call as a NASDAQ-listed company. This is an exciting time for all at Intercure family as we continue to execute our profitable growth strategy, establishing our leadership position, achieving new firsts and new records. This includes seven consecutive quarters of high-digit growth and improved profitability, five consecutive quarters with positive cash flow, crossing one ton mark in GMP medical cannabis product dispensed monthly, over 70,000 patients served, and achieving annualized revenues run rate of $100 million, increased gross profits, and a just EBITDA run rate of $23 million. This is one of the strongest performance of any NASDAQ-listed cannabis company. Before we dive into the highlights of the third quarter of earnings and other recent developments, I would like to briefly introduce you to Intercure and how we became who we are, the leading, profitable, and fastest growing cannabis company outside North America. Today, Israel-based Intercure is a leading global cannabis company with over 14 years of organic growth. We are one of the world's true cannabis pioneers. We are Israel's largest licensed cannabis company and we were one of the first to offer good manufacturing practices certified and pharmaceutical-grade medical cannabis products. For our participants from the United States who might not be familiar with these terms, I would like to explain a bit more. Besides the US and Canada, all major countries are in a different stages of implementing pharmaceutical standards and regulations of medical cannabis. These standards which also known as EU GMP or GMP, are much stricter towards the entire supply chain from genetics, cultivation to distribution and dispensing. For example, GMP medical cannabis is a physician prescribed from a testicle narcotic product dispensed only through authorized pharmacist by a licensed pharmacist. Although Israel is known as world leader in cannabis research, is also a leader in developing and implementing a federally endorsed regime for pharmaceutical medical cannabis. Since the implementation of this regime, pharmaceutical medical cannabis is prescribed by a growing number of physicians and medical experts for more than 60 medical indications. For some of these, pharmaceutical cannabis becomes a first line of treatment, setting a stage for a consistent 3-4 average monthly growth of patients. Medical cannabis is now the largest out-of-pocket Rx product sold in Israel with a run rate of over 40 tons dispensed annually. This medicalization process combined with growing public support has also set a clear pathway for legalization of adult use. Israel is few years ahead of all other international markets representing the future of international cannabis industry. These are exciting times as GMP medical cannabis continues to expand globally in Europe, UK, South America, Africa, and the Pacific, where policymakers are slowly implementing similar regulations. We strongly believe that as a proven leader, we are well positioned to capitalize on this global cannabis revolution, which begins with GMP medical regulation, and we believe it will be followed by legalization of adult use. Since 2008, our company has been developing, cultivating, and distributing our high-quality branded products offering with the largest GMP product portfolio to date. As a true pioneer, we were the first to import GMP medical cannabis using designated, fully loaded, tail-to-cockpit airplanes, the first company to export dry flowers to the EU, and the first Israeli licensed producer to become publicly traded in Tel Aviv stock exchange, following by a listing on TSX, and now we are also a publicly listed company on NASDAQ. We have built a market-leading international supply chain with a profitable, scalable, and vertically integrated seed-to-sell GMP standards operation and executed 14 years of organic profitable growth. We achieved much more than record profitable growth during those 14 years. We have grown from approximately 10 employees when we first began cultivation to over 320 employees today, in which more than 60 of them are specialized pharmacists. Additionally, we expand cultivation from our original 2,000 square feet to over 355,000 square feet of advanced climatized control facilities with a maximum capacity of 2 million square feet. Those are one of the largest and most advanced in the space, producing a diverse product range from ultra-medical strains for treating children with severe autism to high THC premium cookie strains. And we are constantly continuing to develop and launching new cultivars and ramp-up production to meet the growing demand for our branded products. We increased our pharmaceutical-grade distribution operation, which now covers 100% of the Israeli, UK, and German markets. In parallel, we're continuously expanding our leading and one-of-its-kind pharmacy chain focused on dispensing medical cannabis, which now includes 20 pharmacies, 14 of which are licensed to dispense medical cannabis. Leveraging the company's integrated unique operating model dedicated to serve the growing medical cannabis patient community, companies branded pharmacies are the top performing in the GMP regulation globally. Additionally, during the month of October, the company reached a record of one ton of medical cannabis products dispensed in one month. This represents our leading position with approximately 30% market share of the Israeli medical cannabis. Since 2018, we have increased our revenues from $3 million to a run rate of over $100 million, 33 times higher and keep growing. A key part of our strategy is our strategic partnership with some of the leading international pharma and cannabis companies. including SLE of Teva Pharmaceutical, Novolog, Tilray, Organigram, Fortmer, Charlotte-Webb, and Cookies. These strategic and exclusive partnerships emphasize our commitment to be the best in class across all factors. We are currently duplicating our winning model into new territories with evolving supportive regulation, and this includes Germany and the United Kingdom, and also Australia. It's important to note that recently Israeli regulators have begun implementing a reform on exportation of pharmaceutical-grade cannabis, enabling us to export our products for the first time in bulk. This will have a tremendous positive effect on our international business, especially as the target markets continue to evolve in implementing GMP medical cannabis programs. Behind all of this success is InterQ's management team and dedicated employees who have significant proven experience building leading international companies in highly regulated markets, and our chairman, Mr. Ehud Barak, who served as Israel's 10th prime minister. With that all said, I will now move to our third quarter results. I'm very proud to share that InterQ reported revenue of $25 million or 62 million new Israeli shekels for the third quarter of 2021, three times greater than the third quarter of 2020 and up 36% sequentially. This also represents the company's seventh consecutive quarter of high-digit growth and its fifth consecutive quarter with positive cash flow from operation. EBITDA for the third quarter of our cannabis sector approximately $6 million, or 14 million new Israeli shekels, increased driven by revenue growth, improvement in gross profit, and operating profit. These are impressive results, and Amos will speak more about our financials shortly. In addition to our strong financial results, I would like now to focus on some of the milestones we achieved throughout the quarter. On September 1st, We were pleased to commerce trading on NASDAQ, a significant milestone for our business and a testament to our success we have accomplished so far. In addition to the status of trading on one of the world's leading stock exchange, this listing also provide us with important capital to fuel our future growth. This NASDAQ listing also expands our visibility and access to both US retail and institutional investor sharing our execution and profitable growth journey as federal legislation and regulations are evolving in the U.S. and around the world. During third quarter, we acquired Canomed's retail assets. This includes two medical cannabis dispensing pharmacies with another pharmacy in the process of receiving its license as well as adding another medical cannabis patient support center to our operations. This acquisition is part of our consolidation strategy of the Israeli medical cannabis market, which began with our previously announced acquisition of Israeli licensed cannabis producer, Better. Since the integration process of these assets began, I'm happy to share with you that their revenues and profitability increased by more than 30%, representing the strength of our vertically integrated structure and our ability to execute. We were also the first company to meet the new importation requirement set by the Israeli Medical Cannabis Agency, also known as 109 Reg. Being able to meet the 109 requirement enabled us to resume importation from our strategic partner and since then we have successfully landed and released shipments from Tilray, Organigram and Fortmer Life Science. This impressive shipment supports only part of our leading dispensing operation capacity and the growing demand for our branded products. We expect to continue leading importation to Israel, meeting the evolving challenging regulatory requirements. We ramp up our cultivation and manufacturing in our southern facility site to full capacity, and together with our northern facility, we are now the largest cultivator in Israel to date. To continue meeting the growing demand for our high-quality branded products, we have begun the process of expanding our southern facility, including phase B of our post-harvest. During the third quarter, we completed a number of successful new product launches. It is worth noting that these new high-quality and high-CFC products quickly became some of the most patient-requested and the top-selling products showcasing the strength of our brand positioning within the market. In addition to these milestones, during the month of September, I purchased over 420,000 shares of our stock in the open market, valued at over $3.7 million. I did so because I believe that the company, InterQ, is undervalued, considering our leading position, financial performance, strong balance sheet, and proven ability to execute our strategy. Finally, post-period end, InterQ received 5.2 million shares back from the sponsors of our SPAC transaction. According to the agreement, the shares were subjected to free furniture from the SPAC sponsor based upon share price target criteria. The return of the shares to the company without cost adds significant value of approximately $56 million by current share price to all InterQ shareholders. We look forward to continue our strong momentum in the remainder of the year and throughout 2022 as we remain focused on operational excellence and executing profitable growth. I will now hand it over to Amos to discuss our financial results in more detail, after which I will have some more closing remarks. Thank you, Alex, and good morning, everyone. I am very pleased to be sharing our financial results for the third quarter of 2021 with you today. Our focus since introduction of GMP regulation has been execution, expansion, and building our unique vertically integrated model centered on our quality broadband products while executing our profitable growth strategy. We just reported another record revenue quarter of $25 million, an impressive growth close to three times greater than the third quarter of 2020 revenue of $9 million, and up by more than 36% sequentially compared to the second quarter of 2021. Revenue growth during the third quarter of 2021 reflects increased market share and growing consumer demand for our branded products, same-store sales growth, expansion, and the strength of our medical cannabis dispensing operations. On an apples to apples basis, excluding the impact of consolidating the trading house operation acquired last quarter, our normalized gross margin for the quarter reached approximately 45% compared to 42.6% in the second quarter of 2021, representing a better product mix as we are implementing our vertically integrated model and selling more throughout our dispensing operation. With this, I have to note that on a fully integrated model, our branded product generating a much higher gross margin, and we still strategically save 100% of the market. As our supply, including the imports, couldn't keep up with the growing demand for our branded product and the accelerated growth of our dispensing operation, we still had to supply third parties' final product, so there is still plenty of upside once fully integrated. This was our first fully integrated Consolidated quarter of the trading house operation, we generate lower margin from third parties inventory in the acquisition and yet to be fully integrated into our model. Together with the impact of the trading house operation, our gross margin was 40% in the third quarter. Going forward, as integration process continues, we expect the trading to serve our internal medical cannabis dispensing operations and contribute to our margins. Turning now to adjusted EBITDA. We believe adjusted EBITDA of the cannabis sector and non-IFRS measure provides valuable insight into our operating performance. Adjusted EBITDA excludes from net income, as reported, interest, tax, depreciation, amortization, non-cash expenses, share-based compensations, acquisition and transaction costs, fair value step-up of inventory, and other income or expenses. For the third quarter of 2021, adjusted EBITDA was $5.7 million, which is 23% of revenue, increase of 20% compared to $4.7 million for the second quarter of 2021. We are proud with our fifth consecutive quarter with a positive cash flow from operation generating $3.9 million, demonstrating the strength of our financial disciplines. We ended with a strong cash balance of $85 million compared to $81 million on the second quarter of 2021 and $19 million on the third quarter of 2020. With the strength of our balance sheet and our solid performance, including cash flow generation, we are well positioned to continue executing on profitable growth strategy, leveraging the foundation and leadership we have built to capitalize on global expansion and consolidation opportunities. For further information on our financial and operating performance, I encourage you to review the company's financial statements and management discussion and analysis for the three and nine months ended on September 30, 2021, which are available under the company's profile on Cedar and through EDGAR. With that, I will now end the call back to Alex for his closing remarks. Thanks, Amos. We've achieved so much, but our journey has just begun. As more and more, Major countries are implementing medical cannabis programs. We can clearly see that cannabis revolution expanding to every region on the globe. We will continue to grow our pharmaceutical-grade leadership globally, duplicating our winning model to every territory with evolving favorable regulations. Alongside the global expansion, we believe CBD regulations are just around the corner in our territories, and together with our strategic partner, Sherlots Web, we intend to become the leading player in this arena. Looking to the near future, legalization of adult-use cannabis is the next natural step following medical, representing another major growth engine for us. With the current political climate in territories such as Israel and Germany, it is not a question of if rather than when. As all of us know, there is a growing consensus in the U.S. surrounding federal legalization, and current administration has been consistent that medical comes first. We believe that upon federal legalization, the FDA will regulate medical cannabis in the U.S., and in fact, the FDA is showing interest lately in the Israeli GMP model and standards. With a proven record of operating under the most strict regulatory framework, we will be thrilled to see this scenario happen and pharmaceutical-grade cannabis will be available to American patients, to us, pharmacies. Last but not least, we will continue to lead the consolidation process of the international cannabis market and shape the future of our industry. To conclude, as a company, we have executed solid profitable growth over the last 14 years Through a clear strategy, financial discipline, execution, and hard work, we've achieved our leadership position for a small pioneer licensed producer to the leading, profitable, and fastest growing cannabis company outside North America. I would like to thank our shareholders for their support during this exciting time for InterQ, as well as our entire team for their efforts achieving these outstanding results. We expect growth to continue in the fourth quarter and throughout 2022, as we will continue focusing on executing our profitable growth strategy, building long and short-term shareholder value. This concludes our prepared remarks. We would like to thank everybody for joining us on today's call and would like now to open the line for questions. Operator, please open the line for questions. Thank you. If you'd like to ask a question, please press star 1 on your telephone keypad. A confirmation tone will indicate your line is in the question queue. You may press star 2 if you'd like to remove your question from the queue. For participants using speaker equipment, it may be necessary to pick up your handset before pressing the star keys. In the interest of time, we ask that you each keep to one question and one follow-up. Our first question comes from the line of Vivian Ather with Cowan & Company. Please proceed with your question. Hi, good morning, or good afternoon. Good morning, Vivian. So, gross margin continues to advance nicely. You noted that relative to the normalized margin that you posted in the quarter earlier, that with full vertical integration you would be, I believe you said substantially higher than that. Can you put some numbers around that and then also speak to kind of the pathway to that fully optimized gross margin? Thank you. Yeah, hi Vivian. So like we cannot provide specific numbers, you know, as we are moving through the integration model. But we clearly see that once we are selling our products to our supply chain and eventually supply it to our dispensaries, we are seeing a much higher gross margin, and this naturally will be above 50%. Okay, that's helpful. And then for my follow-up, you noted at the end of the prepared remarks that you have an outlook for continued strong top-line growth. That's certainly been evident in your results in 2021 to date. Do you have any incremental color that you could offer in terms of the cadence of your top-line? You know, certainly triple-digit growth becomes tough to comp at some point, so how should we think about growth in percentage terms, perhaps, for either the upcoming quarter or for the next year? Thank you. Well, yeah, I mean, we are definitely seeing a continuous of our momentum throughout the rest of this year and into 2022. And regarding, you know, the scale, I think It's about how fast regulation will evolve, not only in Israel, but also in territories like Europe, where we are expanding these days. Understood. Thank you very much. Thank you, Vivian. Thank you. Our next question comes from Sean Muir with Canaccord Genuity. Please proceed with your question. Hi, good afternoon. My first question, so I just wanted to touch on the acquisition of the trade house that was announced in the last quarter. I believe at the time the acquisition was expected to be accretive starting Q3 of this year, so I was just hoping to get any sort of update on any integration activities undertaken or currently in process as it relates to that transaction, and then maybe even a higher level view of how this asset fits into your Israeli cannabis infrastructure and the capabilities that are enabled as a result. Okay, Sean, so good morning, first of all. So, yeah, I mean, we acquired one of the leading trade-outs here in Israel with a clear focus to fully integrate the trade-outs into our model. We expect the acquisition to be accruative starting at 2022 as we inherited some of all the inventory during the acquisition. And like in third quarter, in fourth quarter, we will see some clearance of this inventory. Besides that, the main focus of operating the trading house is to serve our dispensary, dispensing arm and work it internally to be our purchase arm towards all our pharmacies. Okay, thank you. And then in your prepared remarks, you noted that the company is now at 20 retail pharmacies, 14 of which are licensed to dispense medical cannabis. I was wondering if you could help us understand what the processes are or hurdles are ahead if you were to enable those remaining locations for medical cannabis dispensing, and then potentially what a normalized timeline would look like in that sort of process. Okay, good question. So the process really depends on the district. Israel is divided into six districts, and every district has its own kind of sheriff. So in some districts, we expect... a very short process to transform from a regular pharmacy to a licensed or authorized to sell cannabis. When I'm saying a fast, it's going to be a six-month process. With some of those pharmacies, we already started, of course, the process. In other regimes, the process can take a year plus. And this is, again, part of the reason There are only about 160 licensed pharmacies in Israel out of about 2,000. Thank you for the caller. I'll pass it on. Okay, thank you. Thank you. Ladies and gentlemen, as a reminder, if you'd like to join the question queue, please press star 1 on your telephone keypad. Our next question comes from the line of Pablo Zwanek with Canaccord Fitzgerald. Please proceed with your question. Good morning. This is Matthew Baker on for Pablo. We have two questions. Could you provide your best estimate for the current size of the Israel market now in tons and dollars and what your estimated market share is? So, hi, good morning. So we estimate the current run rate of the Israeli market to be over 40 tons and growing. In terms of market size, the market is nearly 300 million dollars. And this is really depend on the month. With some month we do see better inventories and a little bit of a higher volume. So about $300 million as a market and growing. We said, you know, we do not give a specific market share assumptions, but we just stated that we reached a one-tone dispensing markup. So one tone should be about 30, one month monthly. So one ton monthly should be around 30% market share. All right, thanks for that. Also, how much of the domestic demand is being met by imports and how much is by local production? Okay, so again, there are no clear numbers for that from the authorities. And also, importation is kind of a fluctuating process. As you know, we just had like almost seven months of non-importing into Israel as of the 2009 regulation. And the market did grow. So we assume that importation serves about 40 or 30 to 40% once the gates are open. Okay, and if I could just ask one more follow-up. What do you guys think the realistic regulatory changes could be that could take place over the next 12 to 18 months in Israel? So we expect... kind of a cannabis reform. For the first time, cannabis is part of the coalition agreement. Part of it will be a reform in medical cannabis, where the process of obtaining a license should be lifted and eased. Also, we hope that regarding manufacturing of pharmaceutical cannabis, regulations will will evolve and we will adopt a similar one to the EU GMP. At the moment, Israel is a much more strict regulation than the EU GMP. So there is a process of equalizing the Israeli GMP to the EU GMP. Besides that, there is a reform on the exportation of Israel. This was already... and voted by the government, and we expect to start shipments by the new exportation regulation beginning of this December. All right, thanks for the color, and congratulations on the quarter. Thank you. Thank you. Thank you. Ladies and gentlemen, this concludes our question and answer session. I'll turn the floor back to Mr. Rabinovich for any final comments. So thank you all for your questions. In closing, we are extremely proud of our achievement over the past quarter, and we look forward to continue this momentum to the rest of the year and into 2022. Thank you. Thank you. This concludes today's conference. You may disconnect your lines at this time. Thank you for your participation.