Good day and thank you for standing by. Welcome to the Intacure second quarter 2022 earnings call and webcast. At this time, all participants are in a listen-only mode. After the speaker's presentation, there will be a question and answer session. To ask a question during this session, you will need to press star 1-1 on your telephone. Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Adam Haliva, Communications Officer. Please go ahead. thank you michelle and good morning everyone and welcome to intercure's second quarter 2022 results conference call and webcast a copy of the company's earnings press release is available on the news and events section of our website at www.intercure.co with me on today's call are alex rabinovich intercure's chief executive officer and amos coin the company's chief financial officer Today, we'll review the highlights and financial results for the first quarter and the June 30th, 2022, as well as more recent developments. Following these formal remarks, we will be prepared to answer your questions. But before we begin, please let me remind you that during this conference call, Intercures Management may make forward-looking statements made within the meaning of applicable security laws. Forward-looking statements may include but are not necessarily limited to financial projections or other statements of the company's plans, objectives, expectations, or intentions. These forward-looking statements are based on current expectations that are subject to a number of risks and uncertainties that may cause actual results to differ materially from those expressed or implied in such statements. Factors that could cause actual results to differ materially include, but are not limited to, the risk factors contained in the company's filings with CDAR and the Securities and Exchange Commission. Please also note any forward-looking statements made here are as of today and except to the extent required by law, the company assumes no obligation to update statements as circumstances changes. Also, please note that all amounts expressed today and during this call are in Canadian dollars or new Israeli shekels, unless otherwise noted. And with that, I will turn over the call to Alex Rabinovich, Insecure's CEO. Alex, please go ahead. Thank you, Adam. Good morning, everyone, and thank you for joining us for our second quarter 2022 earnings call. I'm proud to report that InterQ has a record-breaking second quarter with quarter-over-quarter top-line growth of 9%, reaching $37 million, more than double the revenue of our second quarter 2021. This marks our third consecutive quarter of high growth, representing an annual run rate of $150 million. Our momentum coming out of our last quarter and our continued focus on execution and financial discipline resulted in another strong performance in the second quarter. Adjusted EBITDA grew by 4% to $9 million, which represents 22% of revenues. Additionally, gross profit increased by over 150% over the year and 60% sequentially for over $60 million during the second quarter. Q2 was also our end consecutive quarter with positive cash flow from operation as we exited the quarter with $96 million in cash. As I'm sure you're all aware, I'm very proud of our team delivering a solid performance. We continue to expand and grow our dynamic international supply chain, which now stretches across four continents, utilizing six high-end cultivation sites across the globe to supply the growing demand for our high-quality breaded pharmaceutical-grade medical cannabis products. During the second quarter, we continued investing in scaling up our cultivation, production, and dispensing operations. Our southern cultivation site, located near the Gaza Strip, was able to remain 100% operational during the recent military conflicts in the area as we designed and built an armored layout that saved about 150 employees. Hi, everybody. Apologies, we had a connection problem and we got thrown out, but we're back and we can continue from the pre-recording that we started. Alex, go ahead. Thank you, Adam. These strong results are especially impressive when you take into account the slowdown in new patients for all curements in Israel during the first half of 2022. This was mainly due to the loss of physicians responsible for more than 20,000 monthly prescriptions as the Ministry of Health halted their license to prescribe medical cannabis. However, in July, almost 2,500 new patients have been added and we expect to see this trend to continue in recruitment, coming back to the growth we've been accustomed to in the past three years. While we believe that the potential number of patients is about 5% of the population, according to the Ministry of Health, there are now about 116,000 medical cannabis patients in the country, representing only 1.3% of the population. The rising patient count is naturally followed by rising demand for high-quality branded medical products. This is true not only in Israel, but we are seeing the same trend in our core targeted markets, Germany, UK, Austria, and Australia, where we expect to launch our platform in the coming years. Parallel, we continue to experience rising demand for our branded medical products coming from many new territories around the globe, including Switzerland and even Thailand. As part of our strategy to duplicate our model internationally, we are working with local regulators and evaluating local partnerships that can execute in this new and exciting market. During this quarter, we scaled up our upstream operation by enlarging the southern facilities, forest houses, nursery, and the flowering rooms. This further solidified CanDoc's southern cultivation site as one of the largest and most advanced facilities of its kind in the state. Our expert teams have also successfully added and produced 12 new highly-demanded strains into their growth cycle, including premium high-DHC cooking cultivars, four of which have been successfully launched during the third quarter. Our strong internal distribution and dispensing operations to dispense many more of our own products if we had more. To meet the demand, we remain focused on increasing not only our local cultivation in Israel, but utilizing our global exclusive strategic partnership. At the end of the second quarter, we've been able once again to meet the strict 1.0.9 protocols and complete the first importation from our partners at Credoly. These products have been processed and produced by our own local team and has been successfully launched during the third quarter out of the candle's brand. With that said, we now face a new 1.0.9 protocol, which added more barriers and complexity to already a complex import process, which may create a slowdown in importation into Israel. We are well prepared for these challenges as we invested heavily in scale, depth, and reach of our domestic supply chain as the largest cultivator in Israel. Furthermore, our teams have made progress with the top international pharmaceutical labs to meet these new requirements, and I'm confident that just as we were the first company to crack the previous 1.0.9, we will be the first to resume importation under the new protocol. Although the hardening of the importation process, there is an easing on the exportation. Both the Ministry of Health and the Ministry of Economy have eased the process for exportation, enabling us to ship pharmaceutical-grade cannabis in any format to any legal medical market in the world. Our teams have made great advancements, and we expect commercial export shipments to ramp up in the coming quarters. As our core markets are growing and evolving, committed demand for our branded products We are also increasing the high quality supplies of our existing strategic partners and evaluating new potential strategic partnerships. We've built a unique international supply chain that can supply every core market and we will continue to scale up our upstream operation in the coming quarters. Moving on to downstream. I'm also happy to report that we continue to expand our one-of-a-kind leading medical cannabis dedicated pharmacy chain during the second quarter. Together with the international cooking team, we completed the grand opening of our flagship cooking pharmacy in Be'er Sheva, the largest city in Israel's southern region, known as the capital of the Negev. This cannabis monument is located at the center of Be'er Sheva, in front of the city hall, in a unique building that covers an area of over 1,000 square meters and is spent entirely in the globally recognized Cookies Baby Blue. And as far as I know, this is the largest medical cannabis-dedicated pharmacy in the world. The pharmacy is uniquely adapted to serve Israel's medical cannabis patient community. which includes, among all other things, the largest pharmacy state in Israel with a capacity to store over a ton of medical cannabis products. It took us two years to complete building the pharmacy and acquire all the needed approvals and licenses. Amalfam was celebrating, and we sure did, with a grand opening celebration, which included live music, food trucks, bills, and special offers for all patients living in Be'er Sheva and the drowning towns. And now, for the first time, patients in the south have access to the highly-demanded products, including cooking trains cultivated in our southern facilities. Additionally, by the end of the quarter, we've added a medical cannabis dispensing pharmacy located in the northern city of Naharia, which is currently the only pharmacy in the area approved to dispense medical cannabis. only the city residents, but also the surrounding region. The addition of an area location and the opening of Be'er Sheva now brought our medical cannabis dedicated quality chain to 25 locations, of which 17 are actively dispensing pharmaceutical-grade medical cannabis. We expect that by the end of the year, we will receive medical cannabis dispensing licenses most of the remaining eight pharmacies and add new locations to our living chain. In June, we also made another big advancement in our global expansion with a successful opening of our first flagship cookie store in Austria, located in the heart of Vienna. This flagship location offers cookies unique CBD menu, available for the first time in Europe, as well as cannabis-related lifestyle products. In the future, as regulations are evolving, pharmaceutical and medical cannabis will be available for Austrian patients, including cooking EUGMP TSC products. This successful launch represents the spirit of our expansion into additional European countries as we continue our mission to supply the highest quality breaded cannabis products to communities across the globe. We are also progressing with duplicating our winning model in the UK, Germany, and Australia. All of these markets are in early stages, a few years behind the Israeli market, which is the largest and most advanced in the space. Our 15 years of know-how and execution, proven model, and leadership position sets us up to succeed in every territory with a supportive regulatory framework. Before I hand the call over to Amos, I want to note that June 30 concluded our best half-year ever, and we couldn't be prouder. During H1 2022, InterQ achieved record revenues of approximately $72 million, 130% more than the revenues of the first half of 2021. Our gross profit increased over 120% year-over-year to over $30 million, and adjusted EBITDA increased 100% year-over-year to $17 million, and profit before taxes for the first half were just under $60 million, 188% growth year-over-year. We expect this growth to continue while we remain focused and committed to expand our unique platform, building shareholder value, and improving quality of life for patient communities. And now, I will turn the call over to our CFO, Amos Cohen, following which we will open the line for Q&A. Amos, the floor is yours. Thank you, Alex, and good morning, everyone. I am very pleased to be sharing with you today some details on our financial results for the second quarter of 2022. Our focus continues to be execution, expansion, and scaling up our unique vertically integrated platform globally. We just reported another record quarter with total revenue of $37 million or 95 million shekels, more than double comparing to the second quarter of 2021, revenue of $18 million or 45 million shekels, and up by 9% sequentially compared to the first quarter of 2022. Revenue growth during the second quarter of 2022 reflects increased market share and growing patient demand for our branded products, same store sale growth and the strength of our medical cannabis dispensing operations, which we continue to expand and reach 25 pharmacies. Eight of those are still in the process of obtaining medical cannabis dispensing license. As our efficiencies of our vertically integrated structure continue to positively impact our gross margin, our gross margin for the quarter reached 44%, compared to 43% in the second quarter of 2021 and 41% in the first quarter of 2022. As Alex mentioned, we have invested in our upstream operations and successfully achieving this goal while obtaining our GNA costs at the same level of the previous quarter at $3 million, representing an effective 9% to 10% of revenue, and $11 million for the full year of 2021, which was 12% of revenue. Our reported IFRS operating profit for the quarter reached $7 million, representing over 100% growth year over year. Turning now to adjusted EBITDA. We believe adjusted EBITDA of the cannabis sector and non-IFRS measure provides valuable insights into our operating performance. Adjusted EBITDA excludes from net income, as reported, interest, tax, depreciation, amortization, non-cash expenses, share-based compensation, acquisition and transaction costs, fair value step-up of inventory, and other income or expenses. For the second quarter of 2022, adjusted debita was $9 million or 22 million shekels, which is 23% of revenue, 90% more than the second quarter of 2021, which ended with $5 million or 12 million shekels. We are proud with our eighth consecutive quarter with a positive cash flow from operation, demonstrating the strength of our platform and our financial disciplines. We have finished the quarter with one of the strongest balance sheets in the space with $96 million or 245 million shekels cash on end. Looking at our AFI results, we achieved total revenue of $72 million or 183 million shekels and adjusted EBITDA of $17 million or 43 million shekels, which is 23% of revenues compared to the first half of 2021 with total revenue $31 million or 78 million shekels and adjusted EBITDA of $9 million or 22 million shekels. This represents revenue growth of over 130% and nearly doubling our adjusted EBITDA. Looking forward, we expect revenue growth to continue throughout 2022. With a proven track record of executing profitable growth, we are well positioned to continue scaling up and building shareholder value as the leading cannabis company outside North America. This concludes our prepared remarks. We would like to thank everybody for joining us today's call, and I would like to open the line for questions. Operator, please open the line for questions. Thank you. If you have a question, you will need to press star 1-1 on your telephone. Please stand by while we compile the Q&A roster. And our first question comes from the line of Vivian Azar with Cowan. Your line is open. Please go ahead. Hi. Good afternoon. This is actually Victor Ma on for Vivian Azar, and thank you for taking the questions. So my first question is on inventory. Given the IMCA stance in limiting cannabis imports, can you comment on current inventory levels in Israel and how much excess foreign inventory is in the system? Hi, Victor. So there are no official data regarding inventory, total inventory in Israel. The MCA does not supply us with official numbers. So it's, again, it's hard to speculate. I would say there is no shortage of inventory on the low and medium quality. But if the new 109 regulation will keep importation out and there will be no importation, we will be missing high-quality products shortly in Israel. Great. Thanks for the caller. And then just to follow up, we've recently heard of increased discounting in the Israeli market from some of our peers. What has your response been to the intensifying price competition, especially in light of weaker patient growth? Victor, can you repeat the question, please? Yeah, sure thing, Alex. So we've recently heard of increased discounting in the Israeli market from some of your peers. What has your response been to the intensifying price competition, especially in light of weaker patient growth? Yeah. Okay, so Israel market, of course, as you know, from a statistical grade is the leading market in the world. We are competing here with basically all the players. I don't think there is any player that don't ship or try to ship to Israel or cultivate in Israel. So it's a competitive landscape. I would say we have a big edge on competition. We are, first of all, vertically integrated with a very strong distribution and dispensing system. I think by far the leading one in Israel. And we are still far away from reaching the demand for our product. So the way we see it right now, the real competition is not affecting us. We still need to produce more products and sell more products, and this is our main focus. And regarding patient counts, yeah, we had, I would say, two products with very slow patient recruitment. And it doesn't come from the demand side. It comes from a regulatory step that our regulators took against a couple of our physicians. But in July, we saw the demand coming back and the recruitment coming back because the demand is there. And once the technical barrier is kind of sold out, with patient count increased by 2,500 new patients. So, I mean, I don't think there's any question about the demand. The demand remains solid. We estimate the potential patient count in Israel to be between 3% to 5% of population. I think it's very in line with the estimates of the Ministry of Health. So looking forward, I don't think there is a question regarding the market. Having said that, of course, we are seeing more and more companies with kind of a weak balance sheet and trying to get rid of products and cash out. This puts some pressure on mostly on low to mid quality products. And we are seeing those trends. So this may affect the market. As you know, CanDoc is totally focused on the highest grade. We do not produce or intend to produce a medium or low quality product. So at the moment, we don't see any effect on our business. Understood. And just to follow up with the third question, with the opening of your first international store in Vienna, do you expect the higher sales and marketing expense in 2Q to reflect normal operations going forward? Okay, so the opening is kind of a spearhead. We intend to, of course, open more retail locations across Europe in the coming years. Again, I mean, we are operating a bit differently from other companies. We have a very strong financial discipline and we don't expect to see any material impact coming from that. And actually, I can share with you that since the opening, the retail location is performing according expectation and it's even possible. So I don't see any negative influence on our future performance. Great. Thank you. I'll jump back into the queue. And our next question comes from the line of Pablo Ziuynik with Cantor. Your line is open. Please go ahead. Hello, Alex. Look, I mean, obviously you answered the question about the demand and supply dynamics in the market. But I was surprised that one of your partners or one of your suppliers, Tilray, would sound so negative in the last call about the Israeli market. And it pretty much sounded like they were not supplying you anymore. So maybe just relationships, I guess, Organigram, Clever Leaves, as you look forward. Thank you. Hi, Pablo. I can't get into details regarding specific remarks of partners. It's still a very fragmented market and each one of the partners is using a bit of a different approach. I can say that the relationship with all partners are very healthy. Most of the partners are applying our QA approach. And Cleverly, of course, is a new partnership. We need to ramp up our production with them. We just made the first shipment into Israel, but of course, it was just to start the relationship. With Cleverly, we intend to use some of their facilities with our genetics and our know-how and actually scale up our production line. So it will take a bit of a time. And with all others, I would say the relationships are very healthy. Okay, thank you. And then I don't know if you disclosed this, but in terms of your total sales, can you say how much is retail and how much is wholesale? Or pretty much all your production is being sold through your own stores and you're not net wholesaling? Pablo, thank you for the question. Okay, so you know we operate in a vertically integrated model, and as time will move and we'll have more and more retail reach out, we will move more into the integrated model. Currently, we do not disclose additional information or breakdowns regarding how much was sold inside our... vertically integrated system and how much we sold to third party but you can guess from from the gross profit that you know that this quarter uh we had more sales uh internally as our as our retail reach is growing right but again and again of course you don't have to disclose but um of your total retail sales i mean within your stores if i look at your retail business Would your own brands be like a quarter of your retail sales right now? Would they be 75%? Can you just give a rough range? So the rough range is about, I would say, about 40, 45, sometimes 50%. But again, it may be a little bit volatile. Again, as we ramp up our production, the demand for our products remains strong and solid. So this is about the numbers. Okay. Look, I'm going to ask a couple of follow-ups. I don't know if there's many other people on the line here on the queue, but can you maybe give more color on your e-commerce capabilities? I mean, we saw IMC buy the Panaxia online business. I'm just trying to understand, you know, your Omni channel and the way you're able to work online and maybe deliver, if that's a growing segment in the market. Okay, so yeah, of course, I would like to give more colors about that. So Israel online, including call center, is about, I would say, about 10% to 15% of the market. I don't see growing that much. Again, that's been traditionally the number. We are also focused on that segment, and I would say carefully we are leaving this segment in Israel. Again, in Israel, all deliveries has to go, has to come out from the pharmacy, physically pharmacy. So there is no online pharmacy like the German model. So it's a bit of, and the regulation is much tighter. So every delivery has to be directly to the home of the patient, only to his official home. So it's a very, very tight and strict regulation. And it's been traditionally about 10 to 15% of the market. With this, I would say proudly we just launched the first app which can give patients the ability to order their pharmaceutical-branded products directly from their phone or from the app. So this is the first app in Israel. And it's up and running. Actually, the last two launchings we made, we made it only to the app, so it's kind of ramping up the downloads of the app. So, yeah, looking forward, we intend to keep our leading position also in the online segment. Okay. And then just to follow up. Maybe you can expand on your confidence that the demand for medical cannabis in Israel will start to pick up or accelerate. I want to get more color there if you can provide, please. So the demand is solid. I mean, the government stated that 27% of adult Israelis are consuming cannabis, and medical cannabis demand is very solid. The big question has always been regulations and the process to obtain the license and the prescription. Right now, and as you know, Israel is kind of in a weird political situation. We don't have a stable government in the last five years or so. We have elections almost every year. So in that environment, it's really hard to put new regulations. The Minister of Health has formed a committee to assess the process of obtaining the prescription for medical cannabis. And the result of this committee was that, first of all, you have to ease the process and cancel the need for a license. Right now, new patients need to obtain a license and a prescription, and also committee suggested that the GPs could prescribe medical cannabis, and medical cannabis will become a regular prescribed product. Right now, only authorized specialists can prescribe and can give a license, and the Minister of Health is kind of controlling the recruitment by giving those physicians the number of licenses every month. So this committee has already finished and already this has been already kind of approved by the Minister of Health and we are still waiting for a new government to form and implement those regulations. And once those regulations will be implemented, I believe that the market will get to between 3% to 5% of population. Got it. And one last one. If you can expand on your ability to operate in Europe, particularly Germany, right? I mean, you talked about your CBD store in Austria. I suppose it's CBD only, right, obviously. But But I'm just trying to understand if I'm, you know, company X in Portugal or in Australia or Denmark, and I'm trying to enter the German market, I'm going to try to work with the people that are established there, whether they are, you know, licensed importers, distributors, or even producers like Demecan. So I'm just trying to understand what's your approach particularly to Germany, and what can you claim that you bring to the party for us to think that you can actually win in Germany eventually? So, yeah, again, thanks for the question. Again, I can't elaborate too much. Again, there is a lot of strategy here, so I have to be careful with what I'm saying. But I'll share some color, of course. Our strategy is to duplicate the same model, the same structure we have here in Israel to core markets, and Germany is one of our core markets. We've been, of course, working with the leading companies in Germany the last two years. And eventually, when we will launch the products in Germany, we want to be sure that we have as much as integration as we can, and not only sell our products to distributors, So duplicating the same structure and the same model from Israel takes time. And anyway, it takes time to ramp up production. And currently, as I said, we're still kind of missing products even for the Israeli market. So we are aiming to do a big splash in Germany, of course, with the local partner, and building the same structure using the same system, same product and product line we have here in Israel. And basically doing like launch the best product that of course winning the Israeli market in the German market. And the way we see German market right now is where Israel market used to be about three years ago. In terms of quality of products, in terms of competition, in terms of players, it's very similar to Israel. Thank you very much. Thank you, Pablo. And our next question comes from the line of Yvonne Khan with CGF. Your line is open. Please go ahead. Hi there. Good afternoon. Thank you for taking my question. I just had a quick question on if you guys could provide some color on how the cookies branded dispensaries have been performing compared to Intracure's branded retail stores. And if you could also provide some commentary on the rollout plan for the rest of the year in terms of expanding your retail dispensary account in Israel. Thanks. Hi, Yvonne. Thanks for the question. So again, just on the color side, I would say that we are a company that really believe in branding and cookies is one of our top brands that we use. We've seen and we've noticed that once you put the right brand and you market it right, of course, you get more economics and better traffic. So I would say that the cookies, we have right now four cookies branded retail pharmacies Focused, of course, on dispensing medical cannabis in Israel, and those ones are performing, of course, as the top pharmacies actually in Israel, not only in our system. So again, it was a big investment for us. We choose prime location in major cities for those pharmacies, and those pharmacies are invested heavily. So they bring a bit of a different experience. And of course, some of the products are exclusively sold out only on those pharmacies. So they are performing, I would say, better than any other pharmacies. Thank you. And can you repeat the second question? Sorry. And we have a follow-up question from Vivian Azar with Cowan. Your line is open. Please go ahead. Hi, this is Vikram on for Vivian Azar again, and thank you again for the questions. I just have one more. So with increased competition in Israel, can you just remind us of your current market share position over the quarter and how much it increased sequentially or year over year? Thank you. Okay. So again, there is no official numbers in Israel. So I have to be kind of be careful with, you know, with information. I can't give you the exact market share, again, with no official numbers, but as you know, patient count almost didn't grow in the first half, and we grew 9% or 10% sequentially quarter over quarter. So you can, of course, understand that we increased our market share. But again, with no official numbers, I'll have to be really careful about, you know, the numbers I can provide. Got it. Thank you for all the answers. Thank you. And I'm showing no further questions. So this does conclude today's question. Everyone have a great day. And this also does conclude today's conference call. Thank you for participating. You may now disconnect. Everyone have a great day.