Ladies and gentlemen, thank you for standing by and welcome to Intercare 2021 fourth quarter and year-end earnings webcast. At this time, all participants are on a listen-only mode. After the speaker's presentation, there will be a question and answer session. To ask the question during this session, you will need to press star then one on your telephone. If you require any further assistance, please press star then zero. I would now like to turn the conference over to your speaker for today. Adam, you may begin. Thank you. Good evening, everyone, and welcome to Intercure's fourth quarter and full year 2021 results webcast and conference call. A copy of the company's earnings press release is available on the news and events section of our website at www.intercure.co. With me on today's call are Alex Rabinovich, Intercure's Chief Executive Officer, and Amos Cohen, the company's Chief Financial Officer. Today, we'll review the highlights and financial results for the fourth quarter and full year ended 2021, as well as more recent developments. Following these formal remarks, we will be prepared to answer your questions. Before we begin, please let me remind you that during this conference call, Intercures Management may make forward-looking statements made within the meaning of applicable security laws. Forward-looking statements may include, but are not necessarily limited to, financial projections or other statements of the company's plans, objectives, expectations or intentions. These forward-looking statements are based on current expectations that are subject to a number of risks and uncertainties that may cause actual results to differ materially from those expressed or implied in such statements. Factors that could cause actual results to differ materially include but are not limited to the risk factors contained in the company's filings with CDAR and the Securities and Exchange Commission. Please also note any forward-looking statements made here are as of today and accept to the extent required by law. The company assumes no obligation to update statements as circumstances change. Also, please note that all amounts expressed during this call are in Canadian dollars or new Israeli shekels, unless otherwise noted. Now, I will turn the call over to Alex Rabinovich, InterCure CEO. Alex, please go ahead. Thank you, Adam. Shalom, everyone, and thank you for joining us for our fourth quarter and full year 2021 earnings call. First of all, we are excited with our outstanding results for the fourth quarter, but I first would like to apologize for the inconvenience of rescheduling this conference call. We at KPMG wanted to ensure that everything is correct. As you might have noticed, our audited results came stronger than our preliminary expected results, which is in line with our commitment to continue delivering strong performance. 2021 was another successful year for InterQ as we continued to solidify our position as the largest, fastest-growing, and most profitable cannabis company outside of North America. In line with our profitable growth strategy, we executed well on all fronts, This produced strong financial and operating results while further positioning InterQ for continued growth. The fourth quarter of 2021 was our eighth consecutive quarter with high double-digit growth and total record revenue of $33 million, almost three times greater than the fourth quarter of 2020, and representing sequential growth of over 24%. Our adjusted EBITDA in the fourth quarter was $9 million, representing 123% year-over-year growth, and our Q4 EBITDA margin was approximately 26%. This quarter concluded a record-breaking 2021 with a total annual revenue of just over $89 million, with an adjusted EBITDA of $23 million, representing almost 230% and almost 250% growth over 2020. As we don't bear any special taxes or two ATEs, our strong positioning and financial discipline successfully generated cash from operation six consecutive quarters in a row, and more than $10 million generated during 2021, and we ended the year with one of the strongest balance sheets in the industry with $89 million in cash. These are unmatched results in markets beyond North America, and I want to thank our team and management for delivering such a strong quarter in the year. Our performance affirms the strength of our brand's global platform and our ability to focus on execution. I will take some more of your time and walk you through some of our recent milestones and their part in continuing to grow our business and deliver value to all stakeholders. support the growing demand for our breaded products to increase our upstream supply chain by scaling up production in our cultivation sites, especially in our southern facility, which is now one of the largest and most advanced high-quality medical grade sites in the space. We are very proud in reaching the highest quality dry flower standards by successfully cultivating the first-ever pharmaceutical grade cookies breaded products. In addition, We scaled up our strategic global cultivation with our exclusive partners, which extends over three continents, utilizing over six high-end cultivation sites. Ramping up cultivation and production of our unique genetics supports our growth in the domestic and international markets. We expect further increase in our scale and depth in 2022, laying the groundwork to support increased demand for our branded products in our target markets, Israel, Europe, and Australia. Keeping with our vertically integrated seed-to-sell model, we've expanded our one-of-its-kind dedicated medical cannabis dispensing operation during 2021. As of December 31, 2021, our chain included 20 pharmacies in five locations in major cities across Israel and four pharmaceutical logistic hubs, of which two we own and operate, covering 100% of the Israeli market. Since the beginning of 2022, we've added additional three new locations, totaling 22 pharmacies, 15 of which are actively dispensing pharmaceutical-grade medical cannabis. We expect to expand our dispensing operation within the coming year in our domestic market and beyond as we are duplicating our winning model to new territories. Growing our cannabis dispensing operation six times in the past year has expanded our reach while ensuring patients receive the highest quality service. The effect of this was seen last October as we reached a world record of one ton medical cannabis product dispense in one month. This represents our leading position in branding, products, and service, with approximately 30% market share of the Israeli medical cannabis market, the largest and fastest-growing medical cannabis market outside of North America. Our fast-growing, vertically integrated model enabled us to disrupt the competitive landscape. Our expertise, execution, and rapidly scaling our high-quality branded product supply chain gives us a clear competitive advantage and an edge as we enter new markets. In addition to expanding our production and reach, we successfully launched new high-quality branded products and introduced a group of pharmaceutical-grade medical products for the first time. Our combined portfolio includes a broad range of offering across patient segments, from ultra-medical for treating specific health indication to high THC globally recognized cooking products. By offering a variety of products at the right price point with a professional assistant, we are able to meet patient needs and provide an unmatched experience. To meet the solid demand for our quality products in Israel, I'm proud that we were the first company to meet the new importation requirements set by the Israeli Medical Cannabis Agency, known as the 109 Protocol. Being able to meet the 109 requirements enabled us to resume importation during the second half of 2021 from our strategic partners, and we have successfully landed shipments from Tilray, Organizam, Fortman Life Science, and others. These shipments mark a significant milestone in regard to the navigation and streaming of regulatory requirements will support the growing demand for our branded products. Regarding exportation, since we last spoke, Israeli regulators have begun implementing a reform on exportation of pharmaceutical-grade cannabis, enabling us to export our products in bulk for the very first time. The reform is a milestone moment that will have a tremendous positive ripple effect on our international business, especially as the target markets continue to evolve and implement GMP medical cannabis programs. Throughout 2022, we will continue to supply our branded products in new markets and expand distribution channels. In fact, there are currently over 40 countries in different stages of implementing pharmaceutical-grade medical cannabis regulations, and most of them are much bigger than Israel. In addition to exporting products from our own facilities, we utilize our exclusive strategic partnership with other global leading companies to provide new markets with our high-quality branded products. In that regard, we announced last week a new partnership with Cleverleaf, which now joins a prestigious list of partners. We expect to add more strategic partners as we continue to expand our international supply chain during 2022. Another landmark regulatory change is occurring in the CBD fund. In December 2021, the Israeli Ministry of Health announced that CBD products with THC threshold of 0.3%, will remove from the dangerous drug act. In spite of the evolving Israeli political situation, we expect the Israeli Minister of Health to implement regulations which align with their announcement, which de facto recognize CBD's benefits and to permit registration and return sales of products containing CBD. We've been prepared for this chance since December 2020 when we signed an exclusive partnership with the leading CBD company in the world, Sherlock's Web. In preparation for opening the Israeli CBD market, we recently announced a strategic partnership with Almond Health, B1F market leader in Israel, with unmatched shelf space of over 1,700 pharmacies and points of sales. By taking action before regulation, we are positioned to lead the new CBD wellness market in Israel. As the industry evolves and matures, we believe that three to four players will come to dominate the pharmaceutical-grade cannabis market throughout a process of consolidation. During 2021, we signed a letter of intent to acquire one of the pioneering and leading licensed producers. During 2021, we signed a letter of intent to acquire one of the pioneering and leading licensed producers in Israel and Australia, cat holdings known as Betel. Just recently, we announced that we have signed a definitive agreement to acquire 100% of Betel's shares and expect that this historic acquisition mark the first major consolidation in the pharmaceutical-grade medical cannabis space. The acquisition of Betel is expected to further strengthen our leadership position in the pharmaceutical-grade medical cannabis market In addition, the acquisition is expected to be accretive to our financial model with revenue estimated at 50 million NIS or almost 20 million Canadian dollars. And now, let's dive into our international expansion, one of our main goals for 2022. As I explained in the past, most of the world is taking a medicalized approach towards cannabis and rapidly growing number of countries are adopting this unique and strict regulation. And this is, in my opinion, the most exciting cannabis market in the world today with lots of barriers to entry. We are duplicating our winning model into new territories with evolving supportive regulation. This includes Germany, Austria, the UK, and Australia. During the fourth quarter, we expanded our relationship with the iconic cannabis brand Cookies into Europe. We are opening our first cookies in random locations in Vienna and London and many more European cities in the pipeline. Looking into the future, we believe that the next step in most territories after medicalization is legalization of adult-used cannabis. Cannabis today is no longer a taboo and enjoys broad support across the political spectrum. Just this year in December, Germany's new government announced plan to legalize cannabis for recreational use, which we believe will start with the rolling out of a pilot program that could begin in the near future. This is a significant long-term growth engine for InterQ. Furthermore, we believe many countries will follow Germany, and some might even speed up the process to capitalize on the existing momentum. We are encouraged by this trend in Europe, and we are monitoring the United States, the leading cannabis market in the world. Regardless of the recent advance with the Moore Act, we expect that medical cannabis, once federally legal, will be regulated by the FDA. We believe that the FDA will establish similar regulation for medical cannabis to those we already comply with. In the upcoming year, we plan to lay down the first foundations for our federally-complied U.S. operation. In summary, the Interclue team delivered another strong performance in 2021, We continued our track record of solid financial results, expanded our operation in Israel and abroad, set a foundation for continual international expansion, and leading the consolidation process. As we enter 2022, I strongly believe that Intercure is well positioned for another great year. We expect revenue growth to continue in the first quarter and while 2022. The opportunities ahead of us are significant. and we will continue focusing on delivering solid possible growth and strengthening our position by providing value for patients, employees, and shareholders. So for us, the fun is just beginning. And with that, I will now hand it over to Amos Cohen, CFO, to discuss our financial results in more detail. After, we will open the line for questions. Thank you, Alex, and good afternoon, everyone. I am very pleased to be sharing with you today our financial results for the fourth quarter and year-end 2021. Our focus continues to be execution, expansion, and scaling up our unique vertically integrated structure centered on our high-quality branded products while executing our profitable growth strategy. We just reported another record revenue quarter of $33 million or 80 million shekels, impressive growth close to three times greater than the fourth quarter of 2020 revenue, of $11 million or 27 million shekels, and up by almost 30% compared to the third quarter of 2021. Revenue growth during the first quarter of 2021 reflects an increased market share and growing patient demand for our branded product, same-store sales growth, expansion, and the strength of our medical cannabis dispensing operation. Our gross margin for the quarter reached approximately 46% compared to 40% in the third quarter of 2021, representing a better distribution and product mix as we are implementing our vertically integrated structure and selling more through our pharmacy chain and logistics hubs. With this, I have to note that with a fully integrated structure, our branded products generate higher gross margin and will still statistically serve 100% of the market as our supply couldn't keep up With the accelerated growth of our dispensing operations, we still had to supply third parties' final products, so there is still plenty of upside once fully integrated. Turning now into adjusted EBITDA. We believe adjusted EBITDA of the cannabis sector and non-IFRS measure provide valuable insight into our operating performance. Adjusted EBITDA excludes from net income, as reported, interest, tax, depreciation, amortization, non-cash expense, share-based compensation, acquisition and transaction costs, fair value step-up of inventory, and other income or expenses. For the fourth quarter of 2021, adjusted debita was $9 million or 21 million shekels, which is 26% of revenue, increase of over 50% from the third quarter of 2021 and over 140% from the fourth quarter of 2020. We are honored to be part of a company that has shown six consecutive quarters of positive cash flow for operation, generating over $10 million or 25 million shekels, demonstrating the strength of our financial and operational disciplines. The growth was driven mostly by the expansion of our medical cannabis dispensing platform. Over the course of 2021, we added 19 pharmacies, bringing our total retail location to 20, 14 of which our IMCA approved to dispense medical cannabis while the remainder are in the process of approval. Alongside iPharmacies, we've also added two logistics hubs, Greenzone and Pharmazon, to support a growing chain of end patients. As a result of this expansion, we now serve over 70,000 recurring patients monthly in Israel alone. We ended the year with a strong cash balance of close to $90 million, or 217 million shekels. This is up over 370% over the first quarter of 2020. With the strength of our balance sheet and our solid performance, including cash flow generation, we are well positioned to continue executing our profitable growth strategy, leveraging the foundation and industry leadership to capitalize on global expansion and consolidation opportunities. For further information on our financial and operating performance, I encourage you to review the company's financial statement and management discussion and analysis for the three and 12 months ended December 2021. which are available under the company's profile on CDAR and through EDGAR. Thank you, Amos. This concludes our prepared remarks. We would like to thank everybody for joining us on today's call and would now like to open the line for questions. Operator, please open the line for questions. Thank you. Ladies and gentlemen, as a reminder to ask a question, you need to press star then 1 on your telephone. To withdraw your question, press the pound key. Again, that's star one to ask the question. Please stand by while we compile the Q&A roster. Our first question comes from the line of Sean Amir with Canaccord. Your line is open. Hello there, and congratulations on the quarter. Thank you. The first question was – no problem. The first question was related to your market share, and I really appreciate the color in the release highlighting the 30% over there. One thing I wanted to ask is that in the Canadian market, we see market share leaders change really month over month still, just given the share volume of product coming to market. I understand that the Israeli market is less competitive from a supply standpoint than in Canada, but I was just wondering if you could help us understand how some of the market share movements have progressed in the Israeli market. And if you have any sort of certainty that there's legitimate customer loyalty developing for certain products or brands, or maybe you could help us detail some of the things you're doing to hold or maintain the market share. And if I could just tag on to that, what would the market share look like pro forma, the better acquisition? Hi, Sean. Hi, Sean. So, yeah, first of all, we are not consolidating better yet. So, I mean, this transaction is still in process. So, everything we reported is, of course, without the better acquisition. Yeah, regarding the market share, I mean, we do see a lot of patient loyalty. And basically, again, I mean, Amos has mentioned it and We have a very good visibility on patients. Patients are very, I would say, visible. It's a very forecastable model for us. Also, Amos mentioned that basically the demand for the product was much higher than what we could supply. So yeah, coming all together, I would say the pharmaceutical-grade medical cannabis is a very different market from the Canadian. Maybe it's closer to the medical side, but we are seeing a great loyalty support from patients. Thank you. And then if I could just pivot over to the retail strategy, congratulations on really growing the platform there. My focus more so is on kind of expanding throughout the other EU markets. So as you're looking across the EU markets and analyzing your expansion with that Cookies retail partnership, what would you favor in terms of are there any markets that intrigue you for entry or would you be looking to go deeper into some of the markets that you're in? such as Austria and the U.K.? So, yeah, there's lots of barriers. I mean, actually, those markets are in infant stage. We also look at Germany as kind of an infant stage market. They are where Israel was about, I would say, four years ago. So almost no inventory in pharmacies and a couple of thousands of patients. But the good news is the market is growing. And since regulations are similar, we believe that same pattern that happened in Israel will happen in these markets once. those pharmaceutical-grade medical cannabis will be available for patients, and physicians can prescribe trusted brands. So yeah, we've seen this phenomenon in Israel, and I think we have a very good chance of duplicating the same model in those markets. Thank you. I'll hop back in the queue. Thank you. Thank you. Our next question is from Scott Fortune with Roth Capital Partner. Your line is open. Good evening, and thank you for the questions. Real quick, can you provide a little bit of color on kind of patient growth that's continuing in Israel? Obviously, with the changes in some of the medical regulations, where do you see the current patient growth from that standpoint? And then just expand upon the CBD opportunity timing there and the potential opportunity in Israel for, you know, not only your own medical brand CBD, but also the OTC side of the CBD opportunity there. That'd be great. Hi, Scott. So, yeah, I mean, first of all, regarding the CBD market, I'll start with the CBD market. So, yeah, So the CBD market is a fresh market, so we start from a clean, blank table. Regulations should be implemented very soon, as the Minister of Health has already declared on the standards. It will need a very long registration process by the Minister of Health. It's not going to be similar To the US market when you don't need any registration, so the minister of health is kind of the Israeli FDA So there will be lots of barriers to entry We expect you know some of some of the products for example cosmetics and Some of the food supplements it will take very much longer to register and And for us, we think with the partnership we've established, we think that the economic model for this market will be similar to what we are seeing on the pharmaceutical medical one. We are using strong partners. Charlotte Webb is our main partner for the SKUs, for the product. We will have to convert them into the Israeli regulation. We already started this process like a year ago. So I believe we are ahead of competition with that. And, of course, Charlotte Web is a world-known brand. So that gives us an advantage. Also, the partnership with Altman. I mean, we are starting from the gate code with the number one market in the shelf market. in OTC products, and this is really important. We will use their logistics and their presence to enter more than 1,700 pharmacies and shops around Israel. So, yeah, we remain optimistic about the market, but again, you know, every new market takes time and new regulation takes time. I appreciate that. And then real quick, color on the patient. Yeah, so the patient enrolling is continuing to grow. Basically, the demand is, of course, much, much higher than, you know, the current 1,012 patients in Israel. So... So we are seeing a run rate of about 3,000 new recruitments per month. This is around like 3% or 2.5% monthly. This is the current phase. We are missing some prescription prescribing doctors. Some of the leading doctors in Israel went into a hold, like two of the most leading doctors went into a hold. That kind of, I would say, armed a little bit the growth rate of the market. But the good news, the demand is out there. There is a reform right now in the parliament in medical cannabis to ease this process and make it much more cheaper. And that's basically the intent of Sharon Eskel, the parliament member. Now with the Israeli political situation, it's really hard to assess the future of this reform and the future of this law, but the trend is to ease the process. Got it. And then one more quick one, just Alex, kind of big picture, as you see Germany, some other markets looking to potentially go recreational or adult use. How do you view kind of a long-term strategy? with, you know, obviously you can't export with adult use because of the UN treaties in place, but how do you view that going forward with the UN treaties for adult use versus the recreational side and kind of strategy around that to be able to serve into these markets once they go REC? Yeah, so it's a good question. So, I mean, from the gate code, we established the international supply chain So we own and cultivate here in Israel. We own two sites. But besides that, we have more than seven sites. Some of them are in Europe. And basically those sites can supply us with our products. We are working only with strategic partners, meaning we have a very deep relationship with them. We are not just buying inventories. So with this relationship, we can leverage their infrastructure to supply us in many territories. Thanks for your detail. I'll jump back in the queue. Thanks. Thank you. Thank you. Our next question comes from the line of Vivian Acer with Cohen and Company. Your line is open. Hi, this is Victor Ma on for Vivian Acer, and thank you for the questions. For the eight Israeli retail locations that are not currently dispensing medical cannabis, can you guys provide a timeline on when you expect these locations to start dispensing cannabis, adding to the 15 locations that are currently doing so? Yeah, I mean, again, it's a good question. You have to understand, of course, that those pharmacies that are enrolling into the license, it's a very long process. are actually a loss center for us. We usually don't sell anything there, and we just keep the personnel and keeping the regulations forward towards the medical cannabis dispensing license. So yeah, I can say that we just received two of them after first quarter ended. So now we're still waiting for six of them. And those ones should be rolled in with licenses this year. But besides these eight, we developed more pharmacies. So we expect a number of about eight to ten pharmacies that are in development stage to be kind of in parallel to our dispensing operation throughout the year. Got it. Thanks for the caller. And then for the retail locations that you aim to open in the UK and Austria, how should we think about the market profiles for these operations relative to your Israeli doors, specifically from the impacts of a more nuanced supply chain? Yeah, so as I mentioned, those markets are in infant stage, especially the Austrian one. I mean, we will be probably the first one to currently involved in a program there. So we look at them as, you know, as the first years of the regulations here in Israel. And, I mean, we expect at least the UK one to be profitable a couple of quarters after opening. This, you know, these pharmacies will be supported by supply. We are already working on supplying them. in the last 18 months or so. So as you know, registration takes a long, but we do have partners and strong partners. So yeah, we think we will see probably the same phenomenon we saw in Israel. So every market starts with the connection between the pharmacies and the doctors. And that's basically how the market starts. But again, since we will be first movers in both markets, I mean, we expect, of course, those ones to have like a big splash and an impact on the patient community and the potential patient community. Those will be basically the first branded centers with cookies. And as you know, cookies is a well-known brand. And from there we will take it slowly, step by step, into more cities and more locations. Very similar to what we did here in Israel. Got it. Appreciate the color. And then just one last question. So on the clever leaves agreement, can you guys offer any more specifics for that deal and kind of how that fits with the relationships that you guys have with the other Canadian LPs? Yeah, so Cleverleaf has a very different infrastructure from the Canadian LPs. Basically, they invested a lot in South America area. This area is, you know, it's been not in our top priority. So, of course, with them, we look at this region, and they have also an incoming EU GMP facility in Europe, in Portugal. And besides that, as I mentioned, we are working closely with partners. So we think the partnership potential has, you know, has also a potential to supply some size, some good size to the Israeli market. So, yeah, I would say cleverly invested heavily in infrastructure in the past years. And, you know, together we are much stronger. Right, and then in terms of the specifics of the strategic partnership, is there any incremental information you guys can offer or no? No, we can't disclose names at this time, sorry. Understood, thanks. Thank you. Thank you. Our next question comes from the line of Aaron Gray with Alliance Global. Your line is open. Check to see if you're on mute, Mr. Gray. Thank you for the questions, and congrats on the quarter. So kind of piggybacking off the last question, right, with Clever and opportunities there for Portugal or Colombia, you know, it's kind of export flour. Just thinking about, you know, pricing tiers within Israel, you know, can you talk about the premium versus, you know, the mainstream in value segments and how you've kind of seen those kind of parse out over the past year or so and how you see those evolving As the Israeli market continues to grow and continues to be supply constrained. Thank you. We are seeing a great demand for high quality basically dry flowers from a typical grade in Israel. And with this, you know that Israel has become the biggest importer in the world. The local market basically can't keep up with the demand. The Israeli market right now, the run rate is above, I would say, 45 tons yearly. So, yeah, it's not a small market to supply. We are seeing a great demand for quality, and patients are willing to pay more for those quality. But quality that comes with brands, that's kind of a winning formula. Usually most of the brands, I would say, are new to the patients. and it's really hard to get patient loyalty. But once you do have those highly quality, I'm not gonna say even premium, it's enough to be high quality, together with the brand, we are seeing a lot of loyalty from the patient community. So I would say the demand is more towards the quality and patients are willing to pay for it. And on the high quality, we are not seeing right now a lot of competition. The market is still evolving, and the market still needs good products. All right, great. Thanks for that, Kalar. And then just going off of retail, obviously you guys still have a number more to open. You've made some acquisitions in the past and now have a pretty good footprint. Do you guys think about M&A on the retail side within Israel? Is that kind of more on hold now as you open up these other stores? Are you still looking to potentially add more retail? And that would be it for me. Thank you. No. Basically, we are developing more retail locations, more pharmacies, and we look for more pharmacies to basically enroll our nationwide pharmacy chain. Eventually, we target between 30 to 40 pharmacies across Israel. And together with the national online service, we will cover all of Israel, every major city of Israel. All right, great. Thank you very much. I'll jump back into the queue. Thank you. Thank you. I'm not showing any further questions in the queue. Ladies and gentlemen, this concludes today's conference call. Thank you for your participation. You may now disconnect.