[
    {
        "date": "2022-05-17T08:00:00-04:00"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hello, thank you for standing by and welcome to the inter-tier first quarter 2022 earnings call and webcast. At this time, all participants are in a listen-only mode. After the speaker presentation, there will be a question and answer session. To ask a question during the session, you'll need to press star one on your telephone. Please be advised that today's conference may be recorded. If you require any further assistance, please press star zero. I would now like to hand the conference over to your speaker today, Adam Oliva, Communications Officer at Intecure. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Josh. Good morning, everybody, and welcome to Intecure's first quarter 2022 results conference call and webcast. A copy of the company's earnings press release is available on the news and events section of our website at www.intecure.co. With me on today's call are Alex Rabinovich, Intecure's Chief Executive Officer, and Amos Cohen, the company's Chief Financial Officer. Today, we'll review the highlights and financial results for the first quarter ended March 31st, 2022, as well as more recent developments. Following these formal remarks, we will be prepared to answer your questions. But before we begin, please let me remind you that during this conference call, Intercares Management may make forward-looking statements made within the meaning of applicable security laws Forward-looking statements may include but are not necessarily limited to financial projections or other statements of the company's plans, objectives, expectations, or intentions. These forward-looking statements are based on current expectations that are subject to a number of risks and uncertainties that may cause actual results to differ materially from those expressed or implied in such statements. Factors that could cause actual results to differ materially include but are not limited to the risk factors contained in the company's filings with CDAR and the Securities and Exchange Commission. Please also note any forward-looking statements made here are as of today and accept to the extent required by law. The company assumes no obligation to update statements as circumstances change. Also, please note that all amounts expressed during this call are in Canadian dollars or new Israeli shekels unless otherwise noted. Now, I will turn the call over to Alex Rabinovitch, Intacure's CEO. Alex, go ahead, please."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Adam. Good afternoon, everyone, and thank you for joining us for the first quarter 2022 Earnings Code. I'm proud to report a great start to 2022 with strong first quarter results demonstrated by total growth, continued positive cash flow from operations, positive adjustment EBITDA, and continued progress in scaling our operation across all segments. We continue to successfully execute what we have stated, providing the highest quality pharmaceutical-grade branded cannabis products while delivering profitable growth. Our strong balance sheet, profitable vertically integrated C2C platform, and our proven skills position us at the front of the industry, and we are well set to execute on strategic opportunities in the current environment. The third quarter of 2022 was our ninth consecutive quarter of possible growth, with a total revenue of $34 million, almost three times greater than the first quarter of 2021, representing a sequential growth of 9% and an annual rate of $138 million. Our adjusted EBITDA in the first quarter was $8 million, representing more than 100% year-over-year growth, and our first quarter EBITDA margin was This is our seventh consecutive quarter with positive cash flow from operation and ninth consecutive quarter of high possible growth. In addition, we reached during the quarter record profits before tax of almost $8 million by presenting 250% growth year-over-year. We ended the first quarter with $91 million cash in hand. These excellent results are mainly due to organic growth in our world-class medical cannabis dispensing operation, fueled by solid demand for our high-quality branded products, and supported by dynamic international supply chain, which now consists of more than six cultivation sites around the globe. Before I turn over the call to Amos Cohen, who will discuss in depth our financial results, I want to go over some of the highlights and milestones of the first quarter. During the quarter, we continue scaling up our operation across our platform, including our cultivation sites in Israel, which utilize our unique genetics and protocols, producing some of the highest quality and most demanded products in the space. Organic growth was supported by more than five successful product launches during the quarter, including the first ever 100% pesticide-free new family of products. we continue to launch new breaded products, providing doctors and patients a vast product portfolio, which meets the needs of different patient segments, from the ultra-medical to the highest quality light medical products. Our international supply chain continues to scale and deliver growing high quality supply for our breaded products, which are highly demanded in Israel and many other markets. However, We are still far away from meeting the stock demand for our branded products, even in the Israeli market, which is a few years ahead of all other markets. And in this quarter, we're still in charge of our revenue. We are seeing great demand for our branded pharmaceutical product portfolio coming from Germany, UK, Australia, and many other emerging markets. In fact, we could have sold much more if we had more supplies. we are constantly continuing to scale up our supply chain, including Israel and beyond. During the quarter, we signed an exclusive strategic partnership with Cleverly. Through this partnership, intercured high THC medical cannabis products will have additional supply and access to several medical cannabis markets. As part of the partnership, Cleverly will cultivate intercured high-quality strains to launch EU GMP-compliant branded products within the EU, UK, South American markets, and our home base in Israel. Establishing exclusive long-term strategic partnerships with world-class partners supports our international expansion plans and our possible growth strategy without having to invest heavily in infrastructure. And during 2022, we will continue to scale our supply chain. We are very proud of the unique vertically integrated platform we have built, which is now expanding globally. As we stated, we are focused on duplicating our model into every territory with supportive regulatory framework. And in the first stage, we are focusing on four key territories, UK, Germany, Australia, and Austria. We are making great progress on this front, and I want to thank our teams in Europe as we are preparing to launch our first retail location in Vienna as part of our strategic partnership with Cookies. The upcoming launch of Cookies Vienna and more will follow soon is just the first step as we duplicate our seed-to-sell model into targeted markets which continue to develop. Throughout 2022, we expect to launch our first branded dispenser operation and pharmaceutical products in the UK, Australia, and Germany. We expect that our global expansion will have an accretive impact on our financial, especially during the back end of 2022. In our whole market of Israel, we continue to solidify our undisputed leadership position. The Israeli market is the largest and the most advanced pharmaceutical-grade medical cannabis market in the world, representing an annual run rate of over 50 tons prescribed products. During the quarter, the Israeli market added approximately 3,000 new patients, about 4% growth, to over 112,000 prescribed patients. This is despite the loss of key physicians responsible for more than 20,000 monthly prescriptions, and the Minister of Health has halted the license to prescribe medical cannabis. This creates a temporary bottleneck as the demand for medical cannabis prescriptions remains solid with at least 3 to 5% of population eligible for medical cannabis under the current guidelines. And this is compared to 1.9% of population currently. Israel is currently the largest importer of medical cannabis globally. As import regulations are evolving, we expect that the new importation protocol known as the new 109, will add more barriers and complexity to the already complex import process. These new requirements will be implemented by the end of this month and may have an impact on the local market. We are well prepared for these challenges as we invested heavily and scaled both our depth and reach of our domestic supply chain as the largest cultivator in Israel. Furthermore, Our teams are working diligently with top international pharmaceutical labs to meet these new requirements, and I'm confident that just as we were the first company to crack the previous 109, we will be the first to meet the new 109 protocols. During the quarter, we added an additional three new pharmacies to our one-of-its-kind pharmacy chain dedicated to serve medical cannabis patient communities. This brings our chain to a total of 23 locations, 14 of which are actively dispensing medical cannabis during the first quarter. Excluding the temporary negative impact of eight pharmacies, which we are developing and in the process of receiving the first medical cannabis dispensing licenses, and one pharmacy whose activity was temporarily halted Gross margin for the first quarter was higher than 42%, and EBITDA margins were higher than 26%. During the second quarter, the heart and pharmacy resumed to full cannabis dispensing activity, and one of the eight pharmacies received its first medical cannabis dispensing license. We operate in highly regulated space, and we expect to receive the needed licenses for the remaining seven pharmacies before we end, and we expect that each additional pharmacy to have positive effect on our financial and operations. More cannabis reforms are on their way in Israel. During December 2021, the Israeli Minister of Health announced that CBD products will be removed from the Dangerous Drug Act. We expect that the Israeli Minister of Health will follow and implement regulations which will include specific product registration prior to sales. This portrait is expected to complete June 2022, and our team is prepared to be the first company to register CBD products in the country, including the highly anticipated Sherlock's Way breaded products. With a goal to lead this new market, we've entered a strategic partnership during the first quarter with Altman Health, the wellness market leader in Israel with an unmatched shelf space of OTC and nutrition supplements at over 1,700 pharmacies and point-of-sale across Israel. As leaders of this space, we also are leading the consolidation process. During the quarter, we announced that we have signed a definitive agreement to acquire 100% of car holdings known as Betel, marking the first major consolidation in the pharmaceutical-grade medical cannabis space. The transaction is expected to close in third quarter 2022, subject to customary closing commission, as well as specific approvals from the INCA and other regulatory agencies. In the current environment, our strong balance sheet, fiscal discipline, and our clear strategy position us to take advantage of the opportunities arising and further strategic acquisitions. Before I end my commentary, I will share with you that these are exciting times for InterQ and the international cannabis market. as many major countries outside North America are adopting favorable cannabis regulations and reforms. More than 40 countries are in various stages of implementing the pharmaceutical-grade medical cannabis regulation, which we believe that in the coming years will be a global standard. In parallel, Israel and Germany are advancing reform for the opening of recreational adult-use markets in Israel Private adult consumption has been decriminalized by the Minister of Justice on April 1st, a major step towards the future regulated recreational market. In Germany, we are all aware of the new government and Minister of Health announcements to legalize adult youth cannabis in the country. We believe this creates a ripple effect with many countries to follow. Here today, we make great progress and we are on track to reach and maybe even exceed our goals for 2022. As the leading, profitable, and fastest-growing cannabis company outside North America, InterQ is focused on execution, taking a major role in shaping the exciting international cannabis market. And with that, I will now turn the call over to Amos Cohen, CFO of InterQ, for more details on our first quarter results."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Alex, and good morning, everyone. I am very pleased to be sharing our financial results for the first quarter of 2022 with with you today. Our focus continues to be execution, expansion, and scaling up our unique vertically integrated platform globally. We just reported another record quarter with revenue of $34 million or 87 million shekels, close to three times greater than the first quarter of 2021, revenue of $13 million or 33 million shekels, and up by 9% sequentially compared to the fourth quarter of 2021. Revenue growth during the first quarter of 2022 reflects increased market share and growing patient demand for our branded products, same-store sales growth, and the strength of our medical cannabis dispensing operations. Our gross margin for the quarter reached 41% compared to 44% in 2021. As we do not capitalize any expense of any pharmacy in the process of obtaining medical cannabis dispensing licenses, pharmacies which is in the process have negative impact on our financials. Excluding the temporary negative impact of nine pharmacies which were active but with no medical cannabis dispensing license, gross margins for the first quarter was higher than 33%. As Eric noted earlier, we expect all those pharmacies to begin medical cannabis operations during 2022 and to be accruative to our financials. Our reported IFRS operating profit for the quarter reached a record of $8 million, representing 250% growth year-over-year. Turning now to adjusted EBITDA. We believe adjusted EBITDA of the cannabis sector and non-IFRS measure provide valuable insight into our operating performance. Adjusted EBITDA excludes from net income, as reported, interest, tax, depreciation, amortization, non-cash expenses, share-based compensation, acquisition and transaction costs, fair value, step-up of inventory, and other income or expenses. For the first quarter of 2022, adjusted EBITDA was $8 million or 21 million shekels, which is 24% of revenue, more than double compared to the first quarter of 2021, which ended with $4 million or 10 million shekels. Excluding the impact of those nine pharmacies, EBITDA margins for the quarter will be over 26%. We are proud with our seventh consecutive quarter with a positive cash flow from operation, demonstrating the strength of our platform and our financial discipline. We have finished the quarter with one of the strongest balance sheets in the space with $19 million or 231 million shekels cash on end. Looking forward, we expect revenue growth to continue in the second quarter and throughout 2022. With a proven track record of executing profitable growth, we are well positioned to continue scaling up and building shareholder value as a leading cannabis company outside North America. This concludes our prepared remarks. We would like to thank everybody for joining us today for today's call and would now like to open the line for questions. Operator, please open the line for questions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. As a reminder, to ask a question, you will need to press star one on your telephone. To withdraw your question, press the pound key. Our first question comes from Vivian Azar with Town & Company. You may proceed with your question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, good afternoon. This is actually Victor Ma on for Vivian Azar, and thank you for taking the questions. So you'd mentioned in the past that the domestic medical supply in Israel is unable to keep up with the growing medical demand. Given the IMCA's stance on prioritizing domestic cultivation over foreign imports, what do you think the impact will be on pricing and product availability in the near term?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I mean, the local market has been growing the last three years rapidly, and the local market expects quality to continue to improve. Part of the reason the import is playing a big part of the Israeli market is the fact that on early days, quality, the Israeli quality of specially dried flowers was much, much lower than the import. But during the last few years, we are seeing some improvement. Basically, we believe that intercure ability right now and quality in our local cultivation are even higher than the quality that we are importing. Having said that, the market is still very dependent on importation. If the new regulation will will slow down or even stop the importation to Israel, we expect prices to go up, especially in the highest quality products."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Thank you for the caller. And as a quick follow-up, how do the new import regulations from the IMCA kind of affect your partnership with CleverLeaks in Israel, along with your cultivation? and wholesale strategy, if at all?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So it's still hard to speculate, you know, what will be the impact because, again, I mean, we are in the process of cracking those new regulations. We are putting lots of effort. I can only look at a little bit in our past experience and performance. The last time we had, like, a similar new regulation in place It took us a couple of months to crack them, and we were the first company to actually resume importation. Basically, we are well prepared, both with our local cultivation ability and also with our team that are totally focused on cracking those new regulations."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Understood. Thank you. I'll hop back into the queue."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Thank you. And as a reminder, to ask a question, you will need to press star 1 on your telephone. Our next question comes from Matt Bottomley with Canaccord. You may proceed with your question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning, everyone. Thanks for taking the questions. Just wanted to chat a little bit about, you know, the cash flow and potential uses or needs for capital going forward. You know, there's been an acceleration here of a lot of the initiatives you're doing, and it seems like you're still, you know, on the whole operating at a fairly CapEx-like model. But just given some of the initiatives, you know, in your partnerships to get into, you as well as some of the more recent partnerships with Clever Leaves, et cetera. I'm just curious if you think that your free cash flow will be sustained as you continue to grow here, or do you think we're going to have to dip into, you know, uses of that cash flow in order to support some of these growth initiatives?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, Matt. Actually, it's afternoon here, so good morning to you. Apologies, yeah. We're at the other side of the world, but... Yeah, of course. Regarding our cash flow, so looking forward, we expect a positive cash flow from operation to continue. But we believe that we will invest in CapEx. That's part of our – and CapEx will turn into more growth. You know, we are not working in a virtual world anymore, retail dispensing points cost capital and also scaling up operation. But I would say we are well prepared. We don't see any different or big difference from our past experience where we scaled up operation the last three years. So I think we can expect 2022 to be something like in line with what we've seen in the past from InterQ. Of course, we want to use our cash position also strategically. In this current condition and current markets, we are seeing more opportunities for M&A and more strategic opportunities. And basically, we want to use the cash position into a profitable growth."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Appreciate that. And then just a second question for me, just because we hear it a lot from a lot of the Canadian LPs talking about Germany, just your thoughts on, you know, outside of your prepared remarks, you know, the potential for legalization. Is there investments that can be made up front of that happening that you think are worthwhile to consider? Or is it just, you know, the medical opportunity is more than enough for the time being and everything on top of that is just sort of gravy? I'll leave it there, thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. So yeah, I would say that we really believe that the markets, not only Germany, will eventually evolve into adult use. It's a process that has started with decriminalization of adult consumption. So right now, Israel and Germany is decriminalized, the consumption of adult use. So eventually this process will end with regulation. For us, part of our strategy in pharmaceutical grade is building up brand equity for our products and for some of our brands. So we will utilize the current regulation in Germany and also in other markets to build up this brand equity and brand awareness and, of course, operations. And, again, it's hard to speculate now, you know, how those regulations would look like. Will it be in pharmacies or in dispensaries? But, I mean, for us, it's not a question of if. It's only a question of when."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks so much for that. Thank you. Thank you, and I'm not sure any further questions at this time. I would now like to turn the call back over to Alex Rabinovich for any further remarks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, everybody, for joining us and following our exciting journey. So, yeah, we'll be really happy to see you again in the next call."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. This concludes today's conference call. Thank you for participating. You may now disconnect."
    }
]