[
    {
        "date": "2021-08-09T08:00:00-04:00"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning. My name is Melissa, and I will serve as your conference operator today. At this time, all participants are in a listen-only mode. A brief question and answer session will follow the formal presentation. If anyone should require operator assistance during the conference, please press star zero on your telephone keypad. As a reminder, this conference is being recorded. Joining me on the call today will be Dr. Pete Saltzman, Chief Executive Officer of Immunivint, and Dr. Frank Torti, Executive Chairperson of Immune Events. Before we begin, I'd like to remind everyone that today's conference will include certain forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements include, for example, statements regarding the potential efficacy and safety of Immune Events product candidate and Immune Events expectations regarding the timing, design, and results of its clinical trials, including the timing of future data readouts and announcement of future indications. These forward-looking statements are not guarantees of future performance and are subject to various risks and uncertainties, assumptions known or unknown, which could cause actual results to differ materially from those indicated or anticipated. For more information, investors are encouraged to review Amendment's most recent quarterly report on Form 10-Q filed with the SEC on August 9, 2021. Now, I'd like to turn the call over to Dr. Pete Salsman. Thank you. Dr. Salsman, you may begin."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Melissa. I want to take this opportunity to thank everyone for joining the call today. I realize that we do not always do quarterly earnings calls, but because we've been more limited in our ability to interact with the investment community over the last several months than typical, we wanted to take the opportunity to have a call today to highlight the results from the quarter and engage in a dialogue around our go-forward strategy. I will start the discussion today with a brief recap of our financial results and close with some comments on our programs. With that, I'd like to begin by briefly reviewing our financial highlights for fiscal first quarter ended June 30th, 2021. R&D expenses. Research and development expenses were $18.7 million for the three months that ended June 30th, 2021 compared to $16.9 million for the three months that ended June 30th, 2020. The year-over-year increase primarily reflected higher personnel-related expenses and increases related to clinical activities for analyzing data and the program-wide data review, partially offset by lower contract manufacturing costs. G&A. General and administrative expenses were $11.2 million for the three months that ended June 30, 2021, compared to $9.7 million for the three months that ended June 30, 2020. The year-over-year increase was primarily due to higher personnel-related expenses. Net loss. The net loss was $30.5 million, or $0.31 per common share, for the three months that ended June 30, 2021, compared to $26.7 million, or $0.38 per common share, for the three months that ended June 30, 2020. Net loss for the three months that ended June 30, 2021 and 2020 included $3.9 and $4.0 million, respectively, related to non-cash stock-based compensation expense. In addition to the first quarter results that I just briefly reviewed, we announced last week a $200 million direct investment by Roivant into Immunivant. I'm joined today by Dr. Frank Tordy, the executive chairman of Immunivant, who is also a member of Roivant's senior leadership team. Frank, I believe you are in a unique position to put this investment into perspective, which I'd like to ask you to do."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, and it's a pleasure to join you today on the call and be able to express my excitement and support for the company. And this investment not only is the executive chair of Immunovans, but also is a representative of the Roivant management team. As a member of Roivant's senior leadership team, I know the rigor with which Roivant's investments are assessed. And this significant investment is further evidence of Roivant's continued confidence in and commitment to Immunovans, both now and importantly in the future. Fundamentally, we believe 1401 is a unique asset. In our view, the mechanism is validated with successful phase two and three trials across numerous studies and sponsors. There's been proof of concept in multiple indications, and we have the potential in 1401 to deliver the most flexible and patient-friendly dosing experience with the best form factor in the class. And we've always found the class, the anti-SDRM market, exceptionally attractive due to a wide range of indications that the mechanism could potentially address. Now, that's something that's been said before, but if you look at the pace of new indication announcements from all the companies in the field, the interest and development intensity around the mechanism is only increasing. There are now, for example, companies targeting approximately 15 or more distinct indications with anti-FCRN therapies, with at least five of those indications being disclosed only over the last several months. And these indications are characterized by a high unmet need with a still outdated standard of care, often consisting of broad-spectrum immunosuppressants and IVIG. And so the opportunity to take, share, and remake multiple existing markets, as well as to create new ones, is really remarkable. We've now observed from the data Immunobant describes in June and in other analyses that 14.01 is even more potent than we initially expected, which opens up a path for us to be uniquely flexible in our dosing and dose strategies to address the myriad of diseases that can be impacted by FCRN. In particular, the flexibility of dosing not only enables Immunobant to design programs to target the ideal level of IgG suppression in a particular disease, But we believe also will enable a new event to design dosage regimens where changes in albumin and LDL outside of normal limits will be mostly either modest or of short-term duration during an induction phase, for example. In addition, when you think of a signal like lipid elevation, our ability now to consider things like dose, dose interval, induction and maintenance, inclusion-exclusion criteria, baseline lipid levels, treatment with antilipid therapy, et cetera, and just generally bring a degree of thoughtfulness to the issue is, of course, much different now. than it was when this was an unexpected signal first emerging. So I think you'll see design elements that take advantage of 1401's flexible profile from our trials in the future. With that said, this is a landscape that is moving fast with well-capitalized competitors pursuing indications aggressively. For example, Argenix raised about a billion dollars in February to aid in the advancement of their drug, and in now six different indications, and they said they plan to have 15 by 2025. J&J is likewise moving aggressively post their acquisition of Momenta. And in a field with that degree of investment, taking a serial and stepwise approach is not the strategy we at Royvan thought would best position the company for long-term success. So our investment was really designed to allow the company to move forward in an unencumbered way and let the team really be aggressive with their clinical development approach. You know, in particular, we fully appreciate the unique features this antibody offers in terms of a very broad therapeutic window with its convenient low volume, subcutaneous injection form factor. So we think Immunovant's 1401 can really make a big difference for many, many patients. But to realize that potential, we know Immunovant's going to need to execute an ambitious clinical development plan. In some cases, Immunovant is already ready to run a pivotal trial and include design elements that will differentiate 1401 versus competing assets in the class. In other cases, Immunovant will be running first-in-class proof-of-concept studies and new indications. And to be a leading anti-XCRN, which we definitely believe Immunivant can be and 1401 can be, we'll need to execute many of these trials in parallel. And that's where the incremental $200 million investment really made a lot of sense to ensure we can drive long-term value creation. You know, when you step back, drugs with validated mechanisms, very large market opportunities, and transformative potential in markets this big just don't come around very often. And with approximately $575 million now on the balance sheet, Immunobant is well equipped to focus on the execution of their trial, as well as expanding into new indications. Now, Roivant is incredibly excited about the prospects of 1401, and we're eager to support Immunobant through this investment and through broader engagement. And I also look forward to personally continuing to work closely with Pete and the Immunobant team to help develop 1401 to help maximize the benefits for patients and to drive future value for all of our shareholders. So, thanks for having me on the call today, and with that, I'll turn it back to Pete for some additional comments."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Frank. That's a great overview. Before I get to the $200 million investment from Roivant, I'd like to discuss Myasthenia gravis from both a strategic angle and in terms of execution. Let's start with execution. I believe we are on track to gain alignment on our pivotal MG design with the FDA in Q4 of this calendar year. In fact, we have communicated with FDA regarding a meeting early in Q4 to review modifications to our pivotal Phase III study in MG. These modifications are based on the agency's advice and feedback obtained during our previous end of Phase II meeting and are also based on our recently communicated program-wide review. Contingent upon the FDA feedback we receive in Q4, we plan to initiate our study in the early part of 2022, and we're very excited about how this program is shaping up. Gaining alignment with the FDA and getting back into the clinic will be an important catalyst for Immunovant, especially given the remaining opportunity we see for patients and for 1401 based on our understanding of patient needs and 1401's potential. I also think the strategic opportunity for 1401 is underappreciated by the market. Not surprisingly, Immunovant's market research highlights the enthusiasm that neurologists have for the anti-FTRN class generally. The rapid onset of symptom control and the percentage of deep responders have been impressive, especially given that studies reported to date have involved short-term dosing. Recently, our marketing and medical teams dug deeper with patients and with physicians who treat large populations of patients with myasthenia gravis. This research highlights something very important, specifically that patients strongly desire to avoid relapse. When patients with myasthenia gravis relapse, weakness and symptoms can occasionally get much worse very quickly. Relapse can be a crisis. So patients want steady control. At the same time, physicians and patients do desire to minimize immunosuppression in the long run. I think that is why an induction and maintenance approach resonates with clinicians. 1401's broad therapeutic window is very well suited here. Our higher doses achieve the rapid and deep IgG reduction needed to maximize the initial clinical response. Then our broad therapeutic window and convenient subcutaneous dosage form enable us to design a study that steps down IgG suppression to match patients' needs without the PK-PD extremes of cyclic therapy. On June 1st, we disclosed data regarding 1401's broad therapeutic window and the insights gained from the comprehensive program review. I want to emphasize that these insights inform our enthusiasm for the potential of 1401 broadly, not just in MG. Patient needs differ by indication, by severity, and by stage of disease, and we believe this variability is best addressed with a therapeutic option that offers a range of treat-to-target IgG suppression levels. The flexibility in dosing not only enables us to design programs with the ideal level of IgG suppression, but as Frank said, we believe this will also enable us to design dosage regimens where changes in albumin and LDL outside of normal limits will mostly be of short-term duration during induction. What we've seen to date is that dose-dependent changes in LDL are predictable and reversible. We've also seen that the PKPD curves for IgG differ from the PKPD curves for albumin, and therefore LDL. Our models predict that as we go from high doses during the induction phase to more modest doses during the maintenance phase, then the albumin and LDL will generally return to values within normal limits, while IgG will remain suppressed at levels that are likely to maintain a clinical response for most patients. I expect our MG protocol, and frankly our protocols in many other conditions, to be unique and differentiated in this regard. Moving on to another condition, I'd also like to review our approach to thyroid eye disease. As we previously disclosed, we had to prematurely terminate our Phase IIb study of 1401 in moderate to severe TED due to our unanticipated program-wide lipid review. Prematurely discontinuing a study is always difficult, especially for patients and investigators. And in this case, more so, as only 41 of the projected 77 subjects to be randomized completed the primary efficacy evaluation at week 13, a bit over 50%. Consequently, the question that this study was designed to answer, that is whether a 12-week course of 1401 improves proptosis, could not be answered with any certainty. What we did observe is that 1401, in a dose-dependent manner, decreases total IgG and thyroid stimulating immunoglobulins. As previously disclosed, on review of the data from the early study visits when approximately 85% of the enrolled patients were assessed for proptosis response at each visit. It appeared that the 680 milligram dose and possibly the 340 milligram dose could achieve a meaningful separation from placebo. We believe that the 1401 induced declines in total IgG and thyroid stimulating immunoglobulins coupled with the efficacy trends observed at the early visits when most of the enrolled subjects were evaluated for these efficacy parameters are promising. We've also been following the evolution of the market carefully over the last couple of quarters. Royvent was a very early believer in the potential of thyroid eye disease as an indication, having designed studies as early as 2019. The initial enthusiasm was driven by an understanding that the unmet need is very high and that the addressable population was solidly in the range of other rare diseases. It might surprise people to recall that tepratumumab's phase two data was originally published in the New England Journal of Medicine in 2017. Nevertheless, by 2019, when Roivant was designing the 1401 trials, I don't think the opportunity was fully appreciated. Today, that is certainly no longer the case as tepratumumab's launch is clearly validating the market opportunity. Physicians and patients are enthusiastic about medical therapy for thyroid eye disease with decreased ocular symptoms and reduced need for surgery. These benefits are great for many patients. However, insulin growth factor also appears to be a pretty foundational pathway across many organ systems. So blocking this pathway, may have consequences beyond the extraocular tissue that is the target in thyroid eye disease. I'm aware of a recent study presented at Endo 2021 virtual conference that reported 65% of patients receiving tepratumumab in a small case series experienced otologic symptoms. Hearing impairment, including deafness, is also reported in the FDA label as having a greater incidence on tepratumumab as compared to placebo. It's early days, so we'll have to see how this all plays out in terms of clinical experience and product labeling, but I do think it highlights an opportunity for a product with a different mechanism of action and a potentially different benefit-risk ratio. Another important point regarding thyroid eye disease relates to the market potential that Roy meant recognized a couple of years back based on really understanding patient needs. In my experience, across a wide range of autoimmune conditions with high unmet need, physicians and patients not only appreciate but also really need medications with different mechanisms of action. Given the diversity of individual patients, it's almost inevitable that some patients will respond better to one mechanism and others will respond better to a different mechanism of action. Beyond that, patients who are severely or even moderately impacted often require sequential therapy with different mechanisms of action to get close to being fully well. Bottom line, I'm really excited about the opportunity for patients and for 1401 and TEDD. We've also been working on getting the warm autoimmune hemolytic anemia program restarted. We found the data generated prior to the clinical cause to be compelling, albeit on a small data set of only three patients who completed 11 or 12 weeks of therapy. Experts who reviewed our data with us shared with us that spontaneous improvement is uncommon in these patients after failing multiple rounds of steroids and immunosuppressants. In particular, I find our observation that one of the three patients experienced a very strong response and maintained this response throughout the treatment period to be very encouraging. This large improvement in hemoglobin can be achieved with very high-dose steroids, but very high-dose steroids just aren't a long-term solution. So patients end up tapering down, relapsing or partially relapsing, and then many of them are still getting intermittent blood transfusion. That's certainly not an ideal standard of care. I said earlier that I wanted to get back to talking about the importance of Roy Vant's $200 million direct investment, and this is probably a good point to do that. As Frank mentioned earlier, there are 15 indications being actively studied across the NTF CRN class. That's remarkable. People are very excited about this class, and I agree with Frank that the right strategy is for ambitious parallel development. We're now well-positioned to pursue this strategy. With regard to the timeline for providing additional uplays, Updates. I'll just reiterate that we expect to provide a meaningful update on our MG program by the end of the year, specifically that we've achieved alignment with the FDA. We expect to do the same thing for our TED and WAHAP programs in early 2022. Behind that will be announcements of our new indications later in 2022, once these are ready to go with regulatory alignment. We also plan to hold an R&D day in the first quarter of 2022, and I'm sure that will be very interesting. In summary, we expect a steady stream of strategic and execution updates that we believe will be very exciting for investors, followed later by data across a wide range of indications. This stream of updates, and even more so the stream of progress in Immunovant's development program, make us very enthusiastic about our prospects. With that, I'll ask the operator to open the line for questions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. At this time, we'll be conducting a question and answer session. If you'd like to ask a question, please press star one on your telephone keypad. A confirmation tone will indicate your line is in the question queue. You may press star two if you'd like to remove your question from the queue. For participants using speaker equipment, it may be necessary to pick up your handset before pressing the star keys. Our first question comes from the line of Robin Karnascus with Truist Securities. Please proceed with your question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, guys. Good morning. Thank you so much for taking my call. This is for Robin. So the PR mentions plans to initiate clinical trials in at least two indications. Maybe you can talk, you talked about all the 15 indications that FDRNs are being investigated in. Can you talk a little bit about the rationale behind selection of these indications? And just a little confused you, you said that at least one of these trials will be a pivotal trial. Is that beyond MGTED and WEHA? And then maybe it's a little too early to talk about it, but if 1401 plays out the way you expect it to in TED. How do you see the market evolve in TED? Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Karen. A great set of questions there. So your first question related to our selection criteria, and I mentioned that there are 15 different indications now posted to clintrails.gov across the entire anti-FCRN class. How will we select which indications we're going to pursue next? I think that's a pretty classic type of analysis that we're doing with probably the two most important elements being the probability of technical success. How good of a fit is the anti-F-seron mechanism for the particular disease in question as one element? And then secondly, the degree of unmet need. How much opportunity is there to benefit patients. In addition, of course, we'll consider the unique features of 1401 that I discussed, including the broad therapeutic window and the really simple subcutaneous form factor, and then some other logistical factors like the clarity of regulatory endpoints. All that goes into our decision-making. Ultimately, we want to have a set of indications some of which we have an opportunity to be best in class where there's already been clinical validation, perhaps by another asset, and then some indications where we can be first in class. So I think that's for your first question. With regard to the statement around a, and one of our indications beyond MG being pivotal, that could apply to Weha TED or one of the new indications. So we're thinking about those four indications as a group. And we believe that one of them will begin with a pivotal trial in 2022. And then we'll also have the previously announced pivotal trial in MG. So that's two pivotal programs in 2022. Finally, with regard to thyroid eye disease, I think it's just a really, really interesting market. You know, it's a, like many of the auto antibody conditions, for a long time there wasn't a good therapy. There were some therapies, for sure, and there was good surgical therapy for patients who had extreme impact of thyroid eye disease, but there just wasn't a good medical therapy. So with the advent of new innovation and with the launch of tepratumumab, I think what physicians are experiencing is that there is a lot of unmet need in this marketplace and a lot of opportunity for patients to benefit. Depritumab is, of course, indicated for relatively short-term therapy, having been studied for six months, and that achieves a high degree of initial proptosis response, which is great. And thyroid eye disease is not as chronic of a condition as something like myasthenia gravis, but some patients are still impacted after their six-month course of therapy, and other patients relapse after the therapy is stopped. So all of that makes me think that over time, this market will evolve to a situation where patients, many patients will be treated sequentially with more than one mechanism of action to get them as close to normal, as close to fully well as they can be, and to maintain that response as long as possible."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Thank you so much."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Our next question comes from the line of Thomas Smith with SVB Learing. Please proceed with your question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, guys. Good morning. Thanks for taking the questions, and thanks for the updates. I guess first, in terms of 1401 dosing, are there any additional analyses that are being conducted on the previously collected data?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And if so, when can we expect to see these analyses communicated?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, thanks, Tom, for that question. So we are taking the totality of data that we have from all the patients who were dosed with 1401 prior to the pause in dosing and continuously refining our models to give us an understanding of how dosage regimens that we haven't yet studied might perform. That's obviously, as you know, the the rationale for PKPD modeling. So, yeah, we're looking at a lot of different potential dosage regimens, and we expect those to inform our protocols going forward. And I would expect that detailed information regarding the output of our models and the design of our protocols, including any new dosage regimens, would be part of our R&D day in the first quarter of 2022."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, that makes sense. Thanks, Pete. And then it sounds like you're relatively close to, you know, having a pretty good idea of the trial design for the pivotal MG study. I guess what else would you be able to share with us, both in terms of details around that study? And then I guess, you know, what the, what you feel are the major outstanding, perhaps gaining factors to starting that study and gaining alignment with the agency?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Right, right. So in terms of the protocol itself, I mean, I think, you know, as I've indicated, I see a lot of opportunity for an induction and maintenance type of approach. So I think the protocol that we ultimately achieve alignment with the FDA on, which, of course, is dependent on any final feedback they have, will have that flavor provided. In terms of gating factors, it's really just the logistics of the back and forth and gaining alignment with the FDA that we have to work through at this point."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. And then maybe one last question, Pete, in terms of I guess your overall engagement with the agency across three different divisions. If you can maybe speak to, I guess, any other gating factors that you feel like are outstanding in terms of being able to restart, you know, the WEHA and thyroid eye disease programs."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Right, right. It's really the same element as what I just mentioned for myasthenia gravis. Obviously, we have the most data in Myasthenia gravis and so that is that's a good place to start having completed an end-of-phase to meeting with the division previously and so that that interaction will be will be the first one and then the interactions with the other divisions will follow and there's obviously a whole host of background information that is the same for any interaction and a lot of that will be reviewed first with the agency via the interactions with the neurodivision."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, great. Thanks, Pete. I appreciate you guys taking the questions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, no problem, John."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Our next question comes from the line of Douglas with HC Wainwright. Please proceed with your question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, good morning. Thanks for taking the questions. Just, you know, Pete, as you think through indications and prioritization, Is there any change or thinking just given sort of some of the flexibility in terms of dosing and managing albumin levels and LDL levels that will be needed? Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I think the big insight came just as we were doing our final preparation for the June 1st call and finalizing our 10K. And that was really rooted, honestly, in optimizing efficacy within immunology conditions. And what we came to realize, Doug, is that across a wide variety of immunology indications, you want to optimize efficacy by treating hard up front with induction and then minimize the patient's long-term immunosuppression by tapering down a little bit in the maintenance phase. So this induction and maintenance phase is really used across a wide variety of mechanisms and indications to optimize the efficacy. So I think efficacy is always one of the most important things for any new asset. We then realized that this approach was also attractive from an albumin and LBL standpoint, primarily because, as I mentioned earlier today and previously, the PKPD models are different for IgG and for albumin. So you get a much steeper fall off of the albumin impact as you step down the dose as compared to the reduction in the IgG. So that allows for a sort of a sweet spot to be achieved for chronic dosing with a more mid-range dose potency that still has really good IgG reduction. Remember, we reported a 62% median reduction in IgG for the 255 dose, while having a much more modest impact on albumin and therefore LDL, where that dose had a 16% reduction. decrease in albumin and a 15% increase in LDL, speaking about the 255 dose. So that's really fundamentally what I think is going to provide us a great path forward and a lot of indications."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. And so just to clarify, so you don't really see this being sort of a limiter in terms of what indications you may or may not pursue at this point?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I don't because, again, in the short term when you're in that induction phase, the The goal of the physician, the goal of the patient is really to get the symptoms under control is really around efficacy. There will certainly be some small percentage of patients for whom a medication that changes albumin or LDL even for a short term may not be appropriate, but that's going to be true of any asset. There'll be a small percentage of patients that aren't ideally suited. And then there'll be a large majority of patients for whom this can be a really nice option. Maybe I'll ask Frank to make a point as well on this, because I know he's thought a lot about this topic."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Frank, we're not hearing you yet. You might be on mute."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Pete. I think the other thing we're aware of, obviously, is others in the field are thinking about some of the issues, right? If you see how this manifests, for example, in the nipicalumab phase three design that has just been released by J&J, they didn't change much from the protocol they wanted to go forward with other than adding an exclusion criteria for patients who have had myocardial infarction, unstable angina, heart disease, or stroke within 12 weeks of screening. So clearly other companies are grappling you know, with in the field kind of similar kind of issues with the FDA and thinking about how they go forward. And, you know, we're taking lessons, obviously, from those points."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Chris, thank you so much. Thanks, Doug."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Our next question comes from the line of Sam Slutsky with LifeSide Capital. Please proceed with your question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, good morning, everyone. Thanks for the presentation. Just One question for me. In terms of resuming development in WEHA and TED, are you able to discuss what the general design and size of next studies might look like? And then for TED, can we expect to see data from the Phase II study prior to next steps?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, great question, Sam. So the $200 million investment from Roy Vance obviously allows us a lot of flexibility in our thinking, so we're thinking about the best way to approach both of those conditions in terms of next steps. in the context of what we've learned so far and in the context of, you know, what we ultimately want to achieve, which is a differentiated approval in those indications. So, I'm not yet able to get more specific beyond that. In terms of the releasing the thyroid eye disease data in greater granularity, prior to gaining alignment with the FDA on our next trial. I don't think we'll do that. I think, you know, right now we have a lot of information that we're pouring over confidentially with some advisors and using that to design our next trial on thyroid eye disease. And then probably at the time that we announce that design for that next trial, it would be a good time to share more detail on what we've observed."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. Got it. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Our next question comes from the line of Yatin Saneja with Guggenheim. Please proceed with your question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, this is Evanon for Yatin. Thank you for taking our questions. You know, what specific steps would you take to mitigate the LDL issue in the TED trial that you're starting up again? Is there anything that you're doing beyond potential adjustments in the dosing regimen? And then I have a quick follow-up."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, thanks for that, Evan. So thyroid eye disease is a little bit unique in that it's likely a shorter duration of therapy. So this is a condition that may just have induction and then the maintenance phase could be off medication. That's essentially the tepritumumab design, which makes sense in a condition that is somewhat self-limited. Thyroid eye disease resolves over a period of versus the other conditions which don't resolve spontaneously. So I think given that the dosing in thyroid eye disease is likely to be of a shorter-term duration, then it may be that there's nothing particular that needs to be done for lipid management, given that shorter-term excursions in LDL for the vast majority of patients, particularly with some modest inclusion-exclusion criteria changes, won't really be an issue. That said, we are considering the kinds of things that you'd imagine, and Frank highlighted briefly in his prepared remarks, which is dosage modification or antilipid therapy. That could play a role in thyroid eye disease programs as well. So all that stuff is things we're looking at, and we'll get finalized over the next six months here."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. And then just one quick follow-up. Are there indications or subsets of patients within a particular indication across the 15 indications that you mentioned that are currently being investigated in the FCRN space, you know, where these lipid issues are not that big of a deal?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, there's a wide variety of comorbidities. For most of the autoantibody conditions, the comorbidities are not actually that significant. That may be because for many of the autoantibody conditions, there's not as significant of a sort of total body inflammatory state as there are in some of the more general autoimmune conditions. But certainly if you look across all 15, you'll find some variability. I think, you know, maybe the most important point, though, just to kind of keep hammering it home, is that short-term changes in LDL are not concern for the vast majority of patients. So when there's a short-term change associated with induction, I think that's not going to be such an important consideration, particularly if that short-term excursion is associated with higher efficacy because of the deep reduction in IgG that can be achieved with induction with 1401."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "No problem."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Ladies and gentlemen, this concludes our question and answer session. I'll turn the floor back to Dr. Sossman for any final comments."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Melissa."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, I appreciate everyone joining today's call. I'm sure you can really hear our enthusiasm based on a remarkable market opportunity, 15 announced indications across the classes. This is really, really unique, I think. Our enthusiasm is also based on 1401's differentiated profile with a broad therapeutic window and a simple subcutaneous injection form factor, and based now on a strong balance sheet enabling us to pursue an ambitious parallel development program. Thanks, everyone. Have a good day."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. This concludes today's conference. You may disconnect your lines at this time. Thank you for your participation."
    }
]