[
    {
        "date": "2022-05-17T18:00:00-04:00"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "great thank you everybody um thank you everybody here who are here in washington dc for the asgct conference it's exciting to be in person again and everybody online on the webcast we're glad that you could attend today my name is william ho i am the president and co-founder of innate bio we are one of the leading companies focused on the development of gamma delta t cells and it's a really exciting time um very quickly Very quickly, I want to make some introductions to some of the team members that are here today. Myself, I've been in biotech for over 20 years across most areas of the business, but we're really happy to have Dr. Larry Lam, our scientific co-founder, really one of the world's best experts in the translational research around gamma delta T cells. He's been working in cell therapy and manufacturing for almost 30 years. We have Pat McCall, our chief financial officer, who will be with us today. He is a CPA by training, joined us from Turnstone Biologics. And Trishna Goswami, our chief medical officer, hematologist, oncologist by training in her early years after her training. And her practice, she was at Metimmune, AstraZeneca, working on many of the checkpoint inhibitors, and most recently joined us from Gilead, where she joined from Immunomedics. She was actually involved in the approval of Chodolvi in bladder cancer and in triple negative breast. And finally, Kate Rocklin on our team is our chief operating officer, an entrepreneur and actually really well trained in oncology, was trained at Weill Cornell, did much of that training at Memorial Sloan Kettering and really fantastic in making sure everything moves forward for us. Today, we're happy to have two guests as well who will speak. Dieter Kablitz joins us from the University of Kiel. Both of these individuals are widely recognized world leaders in their area. Dieter is an expert in gamma delta T cells. And Bruce Levine from the University of Pennsylvania. One of the earliest CAR-T programs. Dr. Levine has pioneered much of the manufacturing. And today is also the president of the ISCT. So we're glad to have him with us today. So, a quick disclaimer. I want to start off with a video. This video is actually quite exciting. This was created by our scientists and Dr. Lam in the labs. And what you're seeing are brain tumor cells expressing green fluorescent protein. The little white dots are actually gamma delta T cells. And what we're showing here is actually a single gamma delta T cell who's going from tumor cell to tumor cell driving cytotoxicity, killing those tumor cells, and demonstrating serial killing. This is one of the first videos that we're aware of showing that gamma delta T cells can kill multiple targets and continue killing. This video, I'd like to say, actually took us about 30 years. Dr. Lam has spent 30 years trying to improve and perfect the technology as we move forward into manufacturing in the clinic. We're often asked, what are these weird cells? How come there hasn't been a focus on it? So today I wanted to take us all back into time. In reality, the Gamma Delta T cells have been actually for quite a number of years, and in fact, included some of the luminaries in the field. The Gamma Delta TCR was actually first identified by Adrian Hayday, who's at the King's College in London. He identified one of the T-cell receptors. And very shortly thereafter, Sue Dillon, who runs a company today in Philadelphia called Arno, and who was previously the head of immunology at Janssen, described these lymphocytes that were found in the gut of mice. But very quickly, some of the luminaries in the IO space, Malcolm Brenner, Jim Allison, David Raleigh, Mark Davies at Stanford and his partner Chen, identified the other receptor. But you can see a lot of progress was made from 1985 through to the mid-1990s. Our journey actually started in 1992. At that point, a young postdoc was conducting research at the University of South Carolina and was actually manufacturing grass for patients who were being treated for their leukemia. Through the fall of 1992, they were actually treating six pediatric girls. And on Christmas Day, he found himself inside the stairwell of a hospital in tears because the fourth girl had just passed. And it was that experience that drove him to search for what made the difference for those patients. Those patients who lived longer versus those patients who were dying following their transplant. And as you can see here, in 1996, Dr. Lam published the first demonstration that higher levels of gamma delta T cells seem to be associated with better survival. Years later, we had this data. Published in 2007, Dr. Lam is now recognized as having demonstrated that higher levels of gamma delta T cells are associated with survival outcomes. Many of the gamma delta T cell players use this particular Kaplan-Meier curve. You can see those patients that have higher levels have a 71% survival versus those that are low or normal are closer to 20%. Published in 2007, you can see there was a long period of time when there was really nothing in the gamma delta T cell from the mid-90s to the 2005. But right thereafter, we started to see an acceleration of interest in gamma delta T cells. In 2010, the FDA approved the first prostate cancer vaccine, Provenge, and there was a sudden interest in cellular therapy. In early 2011, in the Gamma Delta T cell space, actually, innate pharma published the first study using Gamma Delta T cells expanded in vivo in combination with Rituxan, the CD20 targeting antibody, and found complete responses. Unfortunately, shortly thereafter, we had the checkpoints, Yervoy and Abivo come out, and the company made the decision to shelve their cell therapies as Dendreon unfortunately went bankrupt. Right around the corner was the University of Pennsylvania doing a seminal deal with Novartis to advance the CD19 car and we know the interest that that's driven. The formation of Kite and Juno and the approval of the first CAR-Ts targeting CD19. It's very recently that Dr. Levine and the team at University of Pennsylvania celebrated an anniversary with Emily Whitehead, I believe now being over 10 years out and still in remission. But shortly thereafter, we had the first formation of Gamma Delta T cell companies. We had TC Biopharm, Adacet, and ourselves all formed around 2015. We had Gilead first get into the space with Kite, and then there was an acceleration. In 2018, Fate entered into the space with the first IPS-derived IND approval, but then we saw the pharma coming in with Takeda acquiring two companies, Gamma Delta Therapeutics and Adaptate. We saw Century announce their IPS programs, and we saw the Bristol-Myers. All of a sudden, this is where we are today. with over two dozen companies focused on the Gamma Delta T cells. As a prior investor, I always said that it's very lonely early on, but you know you're doing the right thing and you're in the right direction when all of a sudden people are coming towards you, you're building interest, in the area that you're studying or that you're investing in. And we can see all the companies today working on gamma delta T cells, we have V delta ones, we have TCRs, we have CAR Ts, we have our own drug resistant immunotherapy program, and we have IPSCs. But throughout all of this, we believe that innate bio is a leader in the space. Our team, Dr. Lam, has created some of the seminal contributions to the translational research in gamma delta T cells. We've had a number of firsts. The first to enter the clinic with a genetically modified gamma delta T cell program. The first to deliver a large bolus here in the U.S. of allogeneically delivered gamma delta T cells. and now we're one of the first to create an IPS cell program, and in particular, one that's demonstrated an ability to create both V Delta 1s and V Delta 2s out of IPSCs. We're excited about our knowledge and our know-how and the platform, and I'm really happy to have all of you joining us today and to introduce you to our team to talk about what we've accomplished and what we have right around the corner. And so with that, I'd like to introduce Dr. Lam to the stage and tell you about our very new IPSC program that was introduced here at the ASGCT conference. Larry?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, so... Okay, so I just wanted to take you through this new IPSC program. First of all, just a little review of what is an IPSC. It's a cell that you can take from the skin or from the blood of the donor, and then using four factors called the aminocle factors, the cell can be taken back. At that point, it's a different. specific and self-specific. Following that, you can actually select the forms that express the genes that form the cell medicine. in a large variety of patients. So, this slide, like the previous one, it shows our work with a bio. Again, we take the purple blood cells, they're reprogrammed, and they're taken back into chloropotency, but we, are able to drive both Delta 1 and Delta 2 gamma delta T cells. The first time this has been done. These cells, again, are available for disease-specific edits. They give us the opportunity to custom edit one cell or another cell and possibly even use both cells in a single treatment. of a selected cancer. Again, colon was selected, expanded, and characterized. And we'll share a little bit of data on the next slide. We were able to obtain dozens of individual iPSC followings, including both Delta-1 and Delta-2. The identity of the rearranged TCR is confirmed with sequencing, and we were also able to show the cones were at a normal keratotype And if you look at, to your lower right, you'll see that there's both the Delta-1 and the Delta-2 cells that are showing expressions of pluripotent markers, POC 3-4 and SSA-4. And as they begin their differentiation process in the middle, full cytometry plot, you're seeing expression of CD7 and CD3, both T cell markers. uh both t-cell markers that confirm that we're working with gamma delta t cells but the most important thing is that all three of the clones that were derived are all killing uh a a cancer line this in particular is the u87 uh glioblastoma cell line and they and they almost overlap each other showing the reproducibility of the cell process But importantly also, at a five to one ratio, which is a very low effector to target ratio, they're killing well over 60% of their target, approaching 70% of their target. But that's not everything. We're also able to transduce V-delta-1 cells with our chlorotoxin CAR, which we'll hear a little bit about towards the end of this meeting. And I wanted to emphasize that we've had a V-delta-2 program from the beginning, but this is the first time we've been able to move into delta-1 cells, show that we can transduce these cells with high efficiency with a functional CAR, and then ultimately differentiate them into V-delta-1. into a therapeutic cell product. And this is a little video that shows these IPSC, again, binding and killing these green fluorescent protein-tagged U87 glioblastoma cells. And as you can see, several of the cells sticking to the glioblastoma, and ultimately you see them kind of blubbing up and ultimately clearing the plate. I don't. At this point, I'd like to introduce Dr. Kablitz."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I think my microphone works, I think. Okay, thank you, Dr. Lampe, and thank you for giving me the opportunity to spend a few words on gamma-delta T cells. As Dr. Hu was introducing me, I've been working with gamma-delta T cells maybe for too many years, since the early 90s, so our focus has been on the characterization of the anti-cancer activity of gamma-delta T cells and the mechanisms how these cells are activated. So I would like to convince you why gamma delta T cells are important and from our and many other people point of view are the best effector cells to be used in cellular immunotherapy. And this is just to remind you that there are several types of cytotoxic cells available in the immune system. So gamma delta T cells are just one of several cells which can kill tumor cells. And in addition to the gamma delta T cells, you have the natural killer cells which are part of the innate immune system."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And on the other hand, you have the CD8 cytotoxic T cells, so-called alpha-beta T cells, which are part of the adaptive immune response."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And somewhere in between, you have the gamma-delta T cells, because these cells share features with the innate immunity and the adaptive immunity. Now, on this slide, I have highlighted some of the major differences between these three types of cytotoxic effector cells. The CD8 T cells are the ones, the classical alpha beta T cells, which have a high specificity. And in the context of the tumor immunology, they can recognize tumor-antigen-derived peptides. But the frequency of these cells is very, very low, as low as the frequency of any antigen-specific alpha beta T cell. And the other issue is that these cells only work if the tumor antigens are presented in the right context of the so-called HLA molecules. So that is what we call HLA restriction. So it works nice in the autologous setting, but you have problems if you want to go to the allogeneic system. In addition, the CD8 T cells usually do not express very low levels of so-called NK receptors, which are the predominant receptors expressed on the natural killer cells. Natural killer cells are potent killer cells, so they can kill tumor cells and virus-infected cells mainly. They have no antigen-specific recognition system in context to the T cells. As a consequence, they are also not HLA-restricted, but there are some restrictions due to the expression of these killer receptors. And yes, these cells are characterized by the expression of a variety of activating but also inhibitory receptors. And then you have the gamma-delta T-cells, which are a major or dominant population of the T-cells in the blood. Up to 5% of all T-cells in the blood are gamma-delta T-cells. And these cells recognize tumor cells through the recognition of stress-induced molecules or through the recognition of metabolites, which are dysregulated in tumor cells and which are usually pyrophosphates. The beauty of these cells, and I'll come back to this in a second, is that these cells are not HLA-restricted. So they don't care about these HLA molecules, which opens the possibility to use and to apply these cells in an allogeneic setting. So allogeneic transfer is possible and has been done, actually. And in addition, these cells usually also express at least one or several of the activating NK receptors. And these are receptors by which these cells then also can recognize tumor cells and be activated by tumor cells. So these are some basic features, but then you also have this kind of data in the literature. This is a paper from 2015, so it's a couple of years old. But everyone who works on gamma-delta T cells likes to show this slide because this illustrates very nicely that in this study, this was a large study, the abundance of tumor-associated gamma delta T cells was found to be the single most favorable prognostic parameter across a large variety of human cancers. This has been confirmed in other studies. This is just taken from a study from French researchers who have looked at the actual frequency of tumor infiltrating gamma delta T cells in several cancer types. And what they found is, again, a positive correlation, in this case, in two cases. cancerous colorectal carcinoma and prostate carcinoma. And here again, the frequency or the more gamma delta T cells were present among the tumor infiltrating lymphocytes, the better was the overall survival. Gamma delta T cells are present in the blood. There are different subtypes, and one of the issues, and this has been alluded to already, is the question which gamma delta subset is the best one in which setting. On the other hand, you have the gamma delta T cells within the tumor infiltrating cells, within the tumor tissue, and another issue is also, of course, how to activate the cells and how to make the cells which are present already in the tumor perhaps more active to kill the tumor. This is just taken from an old study of ours where we just demonstrated the presence of gamma delta T cells in this case in pancreatic cancer. So how can you design strategies to apply gamma-delta T cells for immunotherapy? In principle, there are two ways how to do it. One is that you activate the gamma-delta T cells which are present in the patient, and there are different strategies. I mean, bisphosphonates, these are drugs which have been or which are in clinical use to treat patients with bone diseases. Interestingly, also selectively activate gamma-delta T cells. So bisphosphonates plus IL-2 has been used in early studies to activate gamma-delta T cells in vivo. Then there are agonistic antibodies available which specifically and selectively activate gamma-delta T cells. And then, of course, you are probably aware of the bispecific T cell engagers which are popular in the alpha-beta T cell field. There are also companies which develop such bispecific T cell engagers to activate gamma-delta T cells. And then you have the strategy to adoptively transfer the ex vivo expanded gamma-delta T cells. Again, there are different stimuli available. I think one very important approach is one that is also followed by innate bio, and that is to make gamma-delta T cells resistant against chemotherapeutic drugs. And of course, there are other strategies like you can modify gamma-delta T cells with chimeric antigen receptors. And this is also under development by different companies. And that has been mentioned already. Of course, this is a very interesting strategy to use iPSC to develop gamma-delta T cell immunotherapies. So again, the advantages of the gamma delta T cells are twofold. One is that these cells actually use two different receptor systems to recognize tumor cells. One is the T cell receptor, the other activating NK receptors. In addition, these cells usually can be easily expanded in vitro to large cell numbers. And it's a major frequency or major proportion of T cells in the blood, which then expand under in vitro conditions. And this is, I think, very important. As I mentioned already, you can develop strategies where you use these cells in allogeneic settings. You don't have to depend on the gamma-delta T cells isolated from the tumor patient, at least in some instances. And these are features which are different from the CD8 CTL and the natural killer cells which only use either the T cell receptor or the activating NK receptors. CD8 cells, I mentioned this, have a very, very low frequency. Of course, they are highly specific for tumor antigen if you have identified a tumor antigen, but the frequency of these cells is extremely low. And then this is the important point, you cannot use these cells in allogeneic settings because you will end up with graft-versus-host diseases. And just to make this point, this is just showing the results of a study where we contributed. This was a study performed by Chinese colleagues where they treated patients with liver cancer and lung cancer with allogeneic gamma-delta T cells which have been expanded from healthy donors. And they were given several times. And this was a phase one study though. This was looking at safety, but they did a post-stroke retrospective analysis of survival. And there was a clear benefit specifically in the patients with liver cancer on the survival in the patients who received the gamma-delta transfer. And this was allogeneic, I must say. So gamma delta T cells are very nice, I think, and very efficient effector cells. However, I think it's probably most people in the field would agree that you need to think about additional strategies how to optimize the application of gamma delta T cells. And you can think about strategies how to make better gamma delta T cells in vitro. And among those is, of course, the chimeric antigen receptor modification. I think the important strategy is also to make the gamma-delta T cells drug-resistant. But then there are a bunch of possibilities that you can think of how to improve or how to improve the gamma delta T cell efficacy in vivo. And this, of course, you can think about checkpoint inhibitors. You can think about combination with chemotherapy. And I think an important point is also to think about targeting immunosuppressive tumor microenvironment. This is not specific for gamma delta T cells, but it's an important issue, of course. And there are others. So there are challenges in the gamma-delta T-cell therapy field. Another challenge is also which subset, and this has been alluded already, so there are two major subsets, V-delta 1, V-delta 2. What is the best gamma-delta sub-cell in what type of cancer? And then, of course, how to expand these cells. What are the most efficient protocols that you can use under GMP conditions? And then, of course, you can think about optimizing the effector activity using bispecific engagers, CAR strategy, et cetera. And as I mentioned already, you can think about combination therapies. Just to make this point again, I think the strategy to make gamma-delta T cells drug-resistant is extremely attractive, I would say. And this has been successfully demonstrated by INET-Bio using the demosolomide resistance of gamma-delta T cells in the context of treating patients with glioblastoma, with brain tumors. So telosomalide, temozolomide is a standard chemotherapeutic drug used in these patients. It kills tumor cells, but some tumors are resistant, but it would also kill normal cells. And so the idea to make gamma delta T cells resistant is, of course, very straightforward. This is taken from a paper of ours from a couple of years ago, which shows you just that this temozolomide also increases the susceptibility of tumor cells, which are not directly killed by the chemotherapeutic drug, to gamma delta T cell killing. This is shown here. So these are cells not treated, and these are treated with temozolomide, and then you see increased killing of the cells, which have been treated with temozolomide. And then, of course, you have the groundbreaking work of Larry Lamp and the group at Innate Bio, who have developed the strategy to make gamma-delta T cells resistant to thimosolomide, and they could show in this paper, which was published last year, that thimosolomide-resistant gamma-delta T cells can also kill thimosolomide-resistant glioblastoma cells. So this is, I think, a very nice system, and this, in theory, of course, can also be expanded to other chemotherapeutic drugs and other tumor systems. So with this, I think I hope I have convinced you that gamma delta T cells are very special. They have advantages over other cells as effective cells in the immune system. And with this, I think I stop here, and I would hand over to Dr. Kate Rocklin."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you so much. So I'm here today to tell you how we do it at InnateBio. How do we work with Gamma Delta T cells? And I'm going to tell you about our DELTEX platform. And this is really one of the core technologies that we've developed. And our DELTEX platform encompasses all ex vivo expanded activated Gamma Delta T cells. And there are several components of this platform that we think really differentiate us, not only from those in the cell therapy space, but specifically those in the Gamma Delta T cell space. And I'm going to walk you through a couple of those different pillars of our platform today. And the first is actually our ability to ex vivo expand and activate this cell type. And this is really critical because we know, as Dieter and Larry and everyone has so nicely outlined for us today, that these are incredibly powerful immune cells. They actually sit at the nexus of the innate and the adaptive immune system, and they naturally have the ability to recognize and kill stressed or tumor cells. But these cells, while they're incredibly powerful, are a very low percentage immune cell, usually less than 10%, down to 2%, and almost down to zero in most cancer patients. Therefore, we needed to develop protocols that we could actually generate sufficient cell numbers to dose patients. And based on Larry's 28 years of translational work, I'm very happy to say that we've developed ways to take cells from either a donor or a patient, expand those cells ex vivo, and we can actually generate cells of sufficient quantity to make a dose. We can control the cell quality, and we can also control the cell type-specific gamma delta T cell that we're generating, so either V delta 1s or V delta 2s. And we actually have the capability to do both, but the programs today we're going to tell you about are focused primarily on the V delta 2s. We've also developed some very exciting first-in-class proprietary gamma delta T cell engineering. And this is what Dr. Kablitz was alluding to with our MGMT program. What we've done here is we really wanted to think about the cell type that we're in, and we really wanted to take advantage of the endogenous mechanisms and how powerful that Gamma Delta T cell is. And the way that the Gamma Delta T cell actually recognizes and kills stressed or tumor cells is through a combination of complex receptors on its cell surface. And we didn't want to override that by taking a single antigen CAR and putting it on the cell. So what we did instead is we developed a platform where we can actually engineer our cells to be chemotherapy resistant. So these chemotherapy resistant gamma delta T cells can be dosed concurrently with the chemo. The chemo will kill some of the tumor, but on the tumor cells that remain, it will actually drive stress through DNA damage that will upregulate these signals the gamma delta T cell recognizes and actually light them up like a target for our gamma delta T cells to go out, seek out, and kill any of those residual tumor cells. And what's more with this platform is because the modifications we make are chemotherapy specific and not antigen specific, we can actually use these cells across a broad range of solid tumors. And finally, we've taken these together and we've developed a next generation advanced manufacturing platform. This is an automated closed system that's currently operating at clinical scale for both of our ongoing and upcoming clinical programs. So here I'm going to go a little more into detail on our manufacturing, which we know is so, so critical for any cell therapy company. So we work with the Milteni prodigy, and everything in this green box that you see on the screen here actually happens in that prodigy machine. That includes the expansion, the activation, and the genetic engineering of our cells. And we do that through proprietary computer programs that we've built that work with this robot. This process takes about 9 to 14 days, and importantly, because this is a closed process, it reduces the contamination, it increases the output, and those cells can then be efficiently cryopreserved, and then they can be thawed and put directly back into patients. And that's how we're currently doing both of our ongoing clinical trials. So we often get asked at InnateBio, how have we accomplished so much so quickly? And I'm here to tell you a little bit about the strategy behind how we've done that. So we've seen a lot of cell therapy companies come into the space over the last few years. And many of those companies have built out large manufacturing facilities very early on, and in many cases, even pre-clinically. And when we thought about that, that didn't make sense to us. It didn't make sense because we didn't feel that it was a cost-effective or time-effective way to advance our programs. So what we did instead is we partnered with a GMP academic facility, actually a facility that Dr. Lam himself built. And through that partnership, we were able to do three things. We were able to, one, transfer our technology and get into the clinic very quickly. We're also able to do process development and put process improvements in place very rapidly. And finally, in this collaboration with this facility, our skilled manufacturing technicians can actually go in and collaborate with that FACT accredited facility to actually manufacture these products. And this really is something that we're going to continue into the phase two. We're working with a larger GMP group, a GMP facility. We're also contracting with them so that our manufacturing staff can go in and work in that facility. And importantly, this facility is large enough to allow us to scale up for the number of patients we expect for the phase two, which Trisha will tell you about in a little bit. but even more importantly this facility is actually set up to allow us to go commercial if we so choose so we're really thinking ahead for the future and how we build out this technology in this company in a cost and time efficient manner and this really exemplifies how we operate at innate bio we really do the best we can to leverage our technologies to rapidly advance our clinical development our operations and our manufacturing so that we can get the highest quality data and products for patients at a reasonable time and cost. So where are we today? So I'm going to tell you a little bit more about InnateBio's pipeline. So I told you about our Deltex platform. I told you about our powerful manufacturing approaches. And I told you about our strategic vision. And this is where we've gotten to with this. And we are really proud that we've gotten further and faster than many of our competitors with a much lower cost input. And so what we have today is two programs that are in the clinic in phase one that are enrolling patients and generating clinical data. And Trishna will tell you about those a little bit later. We also have a phase two that we're planning where we're expecting the first patient in in 2023 and we're very excited to be advancing those programs and bringing our drug resistant immunotherapy further into the clinic. Importantly, though, we also have a very deep pipeline of preclinical programs that are moving forward. We told you today about our IPSC program, which we're very excited about and very proud to be introducing. We also have additional programs using our drug-resistant immunotherapy, or our DRI cells, and additional solid tumor indications. We also have programs where we're looking in combinations with other DNA damaging or immunogenicity agents, such as checkpoint and PARP inhibitors. And finally, we have several CAR-based approaches using both signaling and non-signaling CARs on our gamma delta T cells, which we'll tell you just a little bit about at the end. So we are just incredibly pleased that we have this deep clinical and preclinical pipeline. And with that, I'd like to turn it over to Will, who's gonna tell you more about our Solid Tumor Program."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sorry for everybody who didn't mean to break everybody's ears. I'm here to tell you a little bit more about our solid tumor cancer programs and our particular approach. As everybody knows, there's literally dozens of cell therapy companies trying to target solid tumors, in particular with an allogeneic program. It is essentially the holy grail of cell therapy today. Unfortunately, as you know, despite all the tremendous progress we've made with the CD19 and the BCMA CARs, very little progress has been made in the solid tumors. Even in the indications where we have seen complete responses, such as Christine Brown and the City of Hope with the IL-13 receptor alpha-2, unfortunately, there's often residual disease. The tumors are heterogeneous, the tumors grow back, and the patients unfortunately die often right on time. Our thesis and our approach to target solid tumors is based on three legs. The first is we do believe you have to have a meaningful duration of response. Now, most investors often think about that as simply persistence, persistence, persistence, persistence. And we do think you have to have some persistence, but the gamma delta T cell, in particular, the V delta two cells that we're currently working with are also antigen presenting cells. Arguably, if I can present antigen and elicit epitope spreading, I don't necessarily need persistence. The other thing is we think persistence is actually related to the depth of response. The deeper I can go, the less persistence I likely need. If I can eliminate the entirety of the tumor, get complete depth, I don't need persistence because the tumor's gone. And so our thought is how can we use what's in our armamentarium already to reduce the tumor and then can we get even deeper, driving a deeper response to try to prolong progression-free and overall survival for these patients. The other is how can we use novel cell types? We know early on people focused on alpha-beta T cells, and they're powerful killers. But as we want to move towards allogeneic therapies, we have to do more. They're MHC restricted, they have the potential to cause graft-versus-host disease, and we've seen numerous toxicities. There's more interest recently of NK cells, but some of the early clinical data has brought questions about durability of response and repeated dosing. We like the Gamma Delta T cell. We're a Gamma Delta T cell company, and we think the Gamma Delta T cell inherently has numerous tools, inherently... molecular switches, having the ability to distinguish between healthy tissue on one hand and tumor tissue. There was a paper published in 2019 that called the gamma delta T cell nature's CAR T cell. Not too surprising, nature can be much more complex than what we can achieve in the lab. And so one of the advantages we believe of the gamma delta T cell is that it can make that selection. Targeting the tumor while saving the healthy tissue. And this is important. If you think about the CD19 cars, we drive aplasia of the entire B-cell compartment. One of the challenges with solid tumors is the tumor is intertwined with the organ. If I drive aplasia and wipe out the organ, I'm going to kill the patient. So we need to make that distinction. The other is can we employ an approach that can drive immune stimulation and drive more endogenous mechanisms? I mentioned the potential for antigen presentation earlier, but can we try the stimulation of interferon gamma and other pathways to drive broader immune activation? We believe we're seeing some of those signs in our clinical programs, and we're excited about the potential for gamma delta T cells. Each cell type is a tool in our armamentarium. It's a tool in our tool chest. And for different cancer types and different solid tumor types, I think each of the different cells have its advantages. The gamma delta T cell, we think, may not be the best at everything, but they have a broad capability. They have NKG2D receptors. They have a T cell receptor. They have toll-like receptors. They can kill through granzyme and porphyrin. They have a CD16, so it can be combined with antibodies to drive ADCC. Importantly, these cells are also MHC restricted. In our hands and others, they're believed to be able to go from a donor to a patient without causing graft versus host disease and without gene editing. We think that's important because we like the concept of keep it simple. There's a lot of edits that we can make, but the more complex we make it, the manufacturing and, more important, the assays and the release criteria and the regulatory hurdles actually increase. And so we like the potential of the gamma delta T cells. But as I said... The cell itself is a tool. When we think about delivering a therapeutic for cancers, there's two items. One is the cell source. And whether you take an alpha-beta T cell, NK cell, or gamma-delta T cell, you have to pick your tool. And today, we can work with V delta 1s. We can work with V delta 2s. You can make the selection between allogeneic or autologous cells. Reality is we don't ultimately know what's better. We don't know if it's better to be matched and have the potential for antigen presentation or to be allogeneic and mismatch and drive alloreactivity. Ultimately, it will take clinical trials and clinical data to make that determination. Today, we can also produce iPS cells as well. And so as Dr. Lam had presented earlier, we have the capability to manufacture these cells. It's actually how I found Dr. Lam. He's actually been working with iPSCs since 2012. He published a paper in 2014 in PLOS One. And I was actually early on invested in gamma... in IPSCs and NK cells and was trying to figure out how do you actually produce one, which is how I met Dr. Lam when fortuitously he got stuck in a snowstorm in New York City in 2015. Our team has worked hard. We have multiple mechanisms for the cell sourcing, but ultimately you also have to find a way to target the tumors. In 2014, when I first was looking at the CAR-Ts, it's the summer when Juno and Kite came public. At that point, you had to file with the Recombinant Advisory Committee or the RAC. By 2014, I believe there was 45 protocols already filed with the RAC. There are plenty of BCMA and CD19s and CD20s that can target B-cell malignancies. In the upper right, you see a little cartoon demonstrating the tumor microenvironment for leukemia. It's fairly open. The B-cell leukemias are floating around in the blood or in the marrow, and we drive aplasia of the entire B-cell compartment. That's okay because those patients will live. We can give them IgG. In the solid tumor, it becomes much more challenging. I gave the kickoff plenary to the allogeneic cell therapies conference last week, and in a room of almost 500 people, I asked the question, who's found that target? Who's found the target that's expressed on the tumor cell? All of the tumor cell and none of the healthy tissue. Crickets. Nobody believes they found the target. There's numerous targets that people are trying to find, but ultimately the tumors are heterogeneous. We may need logic gates, as Dr. Levine will talk about later, to target multiple targets. But for us, if you look at this picture, It's complicated because not only do we have the target, but there's a stroma, there's fibrotic tissue, there's high-pressure fluid, there's Tregs and MDSCs and the heterogeneity of the tumor, all blocking your ability to effectively target the tumor. And so the question has been, What are the challenges and how do we deal with the tumor? And I'm going to give an example of glioblastoma here. If you look in the literature, the doubling time in vivo of a brain tumor is about 50 days. And so in the confined space of our cranium, I think we can all agree that doubling of a tumor is not really good for us. And so it'll cause seizures, it'll cause headaches and other issues with the patients. Most people are trained today in the investment community to simply look for a response, often defined by resist as a 30% shrinkage of the tumor. Unfortunately, you can see based on those doubling cycles, it's not a lot of cycles before we're back to where we are. There are always residual tumors left behind. because the tumors are heterogeneous. There's actually an author I really liked. Her name is Azra Raza. She has a book called The First Cell. And she's been treating MDS and AML patients for 40 years. And she describes a tumor not as a single individual cancer, but as if we had a million different tumors. And so when we treat, we kill a portion of them, but what's left now has more space, more nutrients, more blood, more oxygen, and they grow rapidly. Unfortunately, in glioblastoma, we know in the standard of care, there are always residual cells, even if we can't see them. All of these patients eventually die. Over 80% of them relapse within two centimeters of the original resection cavity, meaning that relapse is due to microscopic residual disease that we can't see. And so the question is, how do we get deeper? How do we deal with the tumor bulk? How do we actually eliminate those cells that are left behind? And that's what drove my interest when I first met Dr. Lam, was that instead of finding a specific antigen, he found a way to target a pathway, a pathway that's conserved in evolutionary biology, that of the DNA damage response. Now, most people, when I talk about DDR on the investment committee, will automatically think about PARP inhibitors, ATM, ATR protein kinase inhibitors. But reality is the DNA damage response pathway has been designed through evolution to eliminate cells that have DNA damage. We all get DNA damage every single day. Here today in Washington, D.C., was a beautiful summer day. Lots of sunshine. Walking outside, we're getting DNA damage, but we're not walking around with tumors because our bodies know how to get rid of it. Either through upregulation of DNA repair, upregulate the mismatch repair genes, and we can excise the damaged DNA, religate the strands, and we're on our way. If they can't be fixed, then through CHECK1, CHECK2, ATM, ATR protein kinase inhibitors, we can trigger apoptosis, the cell suicide pathways. But just in case that fails, biology built in an ingenious redundancy. Those cells that have DNA damage simultaneously upregulate the stress ligands, the NKGTD ligands. And so what we found is we can use alkylating chemotherapies such as temozolomide to artificially induce DNA damage. as Dr. Kablitz showed you, we can upregulate the NKG2D ligands. What's interesting on the upper right-hand side here is we can upregulate those ligands even on those cells that are resistant to chemotherapy. And so you can see during the PK of the chemotherapy, an upregulation in this case, NKG2D is going up by 600%, MCA, MCB by 300%. This is an experiment that Dr. Lam ran. And in a separate experiment by a third party below, this is even conserved on so-called cancer stem cells. Those glioma cells express stem factors such as Oc4 and KLF. You can see below, we can force expression even on that compartment. And so we can get deeper. If we can combine dosing with chemotherapy, not only do we kill the chemosensitive cells, but the chemo-resistant cells and their cancer stem cells. In our preclinical models that were published in a peer-reviewed journal last year, we demonstrated complete eradication of the tumor in 80% of the animals. The challenge is that the chemotherapy is lymphodepleting. If I upregulate the marker, but I killed all my T cells, it doesn't matter. And so that's what we fixed. We found a way to take the tumor's own resistance mechanism, in this case, a protein called methylguanine DNA methyltransferase, or MGMT, and we genetically engineered it into the gamma delta T cells so it'll survive super therapeutic doses. It allows us to dose concomitantly, but to attack the tumor at its period of maximal vulnerability and when we upregulate the marker through avidity. This is actually important. Marcella Maus, who's one of our Scientific Advisory Board members, actually published a paper in Nature about two weeks ago. This paper was about interfering gamma receptor pathways, and they found that in solid tumors, but not leukemias, avidity is important. And so we're excited by our approach because we can upregulate the expression of these NKG2D ligands, driving up avidity. It's like Velcro. All those individual weak hooks and loops over accumulation of them create a strong bond and ultimately trigger the activation of the gamma delta T cell. And so we're excited about our approach. We're excited by the ability to upregulate avidity and to target other compartments to get deeper. Our first trial, which Trishna will talk about very shortly, IMV200 is in frontline glioblastoma. You can see here, everything above the center blue line is the standard of care. We're in the front line. We do sometimes get questions about that. I'll just give you a little anecdote. Early on, we designed the study in the relapse setting. We went to actually one of the leading neuro-oncologists, Lisa DeAngelis, who was head of neuro-oncology at that time at Memorial Sloan Kettering. And she said, if you actually want to make a difference, If you want to make a difference with an immunotherapy in cancer patients, go to the front line. The tumors are more amenable to an immunotherapy, the patients are healthier, and they haven't been lymphodepleted through multiple rounds of different therapies. And so we listened to Lisa or Dr. DeAngelis and made the decision to move to the front line. Today, Dr. DeAngelis, her job is taming lions. She's actually the chief medical officer at Memorial Sloan Kettering. Imagine having to manage that for all the managers out there. But we're excited. You can see we're in the front line. In the front line setting, Dr. Goswami will talk about it very shortly. But in the maintenance setting, these patients get six doses of chemotherapy. With each dose, every 28-day cycle, we give a combination of our chemotherapy with our DRI Gamma Delta T cells. The goal is to use surgical debulking, radiation, and chemotherapy to kill some of the Tregs to debulk the tumor. And then with whatever's residual, attack it with multiple doses with the hope that over repeated doses, we could reduce the number of residual tumor cells, get deeper to prolong survival, and importantly, progression-free survival. And so with that, I'm going to pass it off to Dr. Goswami, our chief medical officer, who will tell you about our clinical programs. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So as the oncologist in the group, I want to kind of give you a bird's eye view of where I think cancer therapy has gone in the past and where we're going in the future. So obviously, back in the 70s, 80s, we started with chemotherapy. These were the big guns, so to speak. These were drugs, toxins that basically indiscriminately killed rapidly dividing cells, whether they were cancer cells or unfortunately normal tissue cells of the body. We then started getting smarter and understanding the pathology and pathobiology of cancer. and developed targeted therapies that targeted a single pathway in that pathophysiology, taking a cell from benign to malignant. But we realized that cancer cells are quite smart. They learned how to evade these pathways by simply just up-regulating or down-regulating complementary pathways. We then started developing ADCs, which are near and dear to my heart. Not only did I work on the first phase three for moxitubumab, an ADC developed it for the treatment of hairy cell leukemia back in my met immune day. But I led the approval of Tredelvi in bladder cancer, most recently immunomedics. And these drugs were meant to essentially lessen some of the toxicities of chemotherapy by reducing the off-target toxicity. They're good, but they're not quite there yet. And then we learned to think about not just focusing on the cancer cell, but how the cancer cell communicates with the rest of the body specifically the immune system, and the immune checkpoints were born as we started learning about the specific signals that cancers release to evade that immune detection. And now we've gone to the final step of really manipulating those immune cells on a fine-tuned basis to target them and use them as the best part of the therapies to treat the cells the best. I think innate bio has been a little bit smarter than perhaps some of our competitors in our history of drug development in that thinking about our therapy a little bit more thoroughly and figuring out the best way to use all of these pieces of our armamentarium smarter to be able to elicit the best responses, whether it's overall responses or survival. Speaking of response, we now know that as we've learned more about checkpoint inhibitors, gotten a little bit more data. As we are getting more data for some of the newer therapies that have been approved based on overall response rate, there's been a step back to reconsidering whether response rate is really the best method to assess the clinical benefit of these agents. And so now regulators are stepping back and saying, you know what, maybe we need to think about more robust trials that are looking at more traditional endpoints like progression-free survival or overall survival that really give us the best bang for our buck. Which makes sense because immune therapies, one of the biggest challenges that we've learned, especially in my days at AstraZeneca where we battled over whether overall response rate was the right endpoint, was that really where these agents make the most benefit is really by giving us durability. Now, as several of the speakers earlier have spoken about, there are several challenges with taking immune therapies into the solid tumor space. There's tumor heterogeneity, there's issues with getting the T cells directly to the tumor, as well as obviously getting the T cells to attack the tumor in its entirety from the outside down to the core. There are very few targets that have been identified that can be directly ablated. And as I mentioned, tumor cells are smart little buggers. If you identify one target, they will downregulate that target and evade that therapy. So we really need a much more comprehensive way to get at these guys. Tumors are also very immune suppressive. And when we think about combination therapies, of course, Combining the chemotherapy makes ultimate sense, but chemotherapy kills not only the cells, tumor cells, but also the immune cells as well. And this is where I think we have huge benefits as an abio. Now, obviously, we've talked about checkpoints and several immune therapies that have been developed in or tried to be developed in GBM. There have been several different challenges because of the issues that I just discussed. But at least when we think about what N8Bio is bringing to the field, because of Larry's beautiful work in creating this DRI technology, we have cells that are chemo-resistant that are then going to be able to partner well with a therapy that not only gets you a response, but durability as well. So what is this disease, GBM, and why are we wasting our time with immune therapies? I just told you that... there have been several challenges in this field. Well, first of all, as an oncologist, this is a disease that's horrible. It's the second most common brain tumor. Median age is about 64 with the male predominance. There are no clear risk factors, but we do know that certain patients with certain genetic disorders have a higher risk of developing these diseases. They present with headache and seizures, and God forbid, in certain populations, you will actually have patients presenting with frank loss of function if the tumor affects a specific part of their cortex. And the disease is diagnosed not just by imaging, but really by biopsy to identify specific mutations that will allow us to determine that it truly is GBM, specifically IDH mutations, and 1p-19q co-deletions. And despite everything that we have in our armamentarium, the median survival still is only one to two years, and this is what motivates me as an oncologist to try better. And unfortunately, even though survival, I'm telling you, is two years, depending on the age of the patient, their performance status, the extent of the tumor resection that the surgeon is able to achieve, in addition to the MGMT status of those tumors, the survival could be even much less. But GBM provides us in T cell therapies a beautiful model to demonstrate the efficacy of gamma delta T cells because we can directly localize to the face and GBM, unlike other tumors, does not metastasize outside the brain. So it's the best place and model to be able to demonstrate the utility of gamma deltas. So what's the standard of care right now? is as folks have mentioned earlier, it's temozolomide with radiation therapy as induction therapy for six weeks, and then maintenance temozolomide for six cycles, a minimum of six cycles. Despite that, we still get overall survival, median survival about 14 to 16 months, and median PFS of only about seven months. And if we think about MGMT status for those patients, those who have MGMT unmethylated tumors, meaning The MGMT is a repair enzyme if it's preserved and you insult the patient with additional chemotherapy, their tumors can repair themselves quickly. Those patients, unfortunately, live a lot less. And so we're looking at median survivals or PFS of only five months. And so those are some of the key numbers to remember. Again, median overall survival 15, 14, 15 months, PFS seven months, and unmethylated PFS is five months. So we started our first phase one trial at UAB looking at autologous Delta X, DRI, Gamma Delta T cells in combination with temozolomide. These are newly diagnosed patients. And what we're essentially doing is these patients will undergo surgical resection. We'll have the surgeon put in a RICM catheter by which we will administer the cells. The patients then undergo a phoresis where we draw off the cells, and while they are completing their six weeks of induction chemotherapy radiation, we are developing the cells and then delivering it back to them with maintenance temozolomide. There are three arms to this trial. We're giving a fixed dose of cells, one times ten of the seven cells, but we're increasing the doses as we increase the cohorts. So graphically speaking, this is what we're doing. Again, surgical resection, catheter replacement. The patients then get apheresis. And as we are developing the cells, the patient's undergoing their six weeks of chemotherapy and radiation. And once they have recovered enough from all of that and are ready for maintenance, we are giving them the cells directly into the atrium catheter into the tumor bed. So there's no error in terms of where those cells are going. And we're giving them the concurrently, not only because it's standard of care, but it essentially those ligands that we need our gamma-delta cells to see to attack. We've treated six patients so far. We've had no DLTs, no cytokine release syndrome, and no evidence of ICANS. And again, for a T-cell therapy that is administered directly into the CNS, this is kind of impressive. All of our treated patients have exceeded their PFS based on their age and MGMT bias. And if you look at the data here, this is graphically showing you exactly that. In blue are the first three patients who were treated with a single dose of cells. The orange circles are the infusions. The red bars are where we expect their progression to occur based on their age and MGMT. The red circle is where progression actually occurred. And as you can see, in each case, progression occurred after where we expected their progression event to have occurred. In purple are the patients who've completed multiple doses of cells. We have one patient now who's completed all three doses. This is data from December. We'll be providing an update at ASCO, so please check the post. Several people ask, well, what happens? Do you actually see the cells? How long do the cells last? How durable are these cells? And it's very difficult to assess that because these are autologous cells, normal human body cells in a patient. And because we don't have CAR technology here, it's not like we can tag them with that CAR to identify them. We have anecdotal data from patient 001 who had a biopsy prior to the infusion and a biopsy after he relapsed to demonstrate what's been going on with those gamma deltas. So A is his pre-treatment brain tumor sample. So this is the brain tumor itself. Here is the background of cells. And B is the relapse of the brain tumor biopsy. Here you see necrosis and the brain tumor itself. This is 150 days after a single dose of cells being delivered to this man's brain. Can I guarantee that those are all the gamma delta cells that we infuse? No, I can't. But I think that pictures speak louder than words in showing you that there is something happening. The other thing that we have is looking at allogeneic unmodified gamma delta T cells. So these are patients who are leukemia patients who are getting a haploidentical transplant. And what we are doing is essentially assessing the safety of an of gamma Delta cell taken from that donor who provided the bone marrow transplant for this patient. So the patient has their leukemia. They've received whatever induction therapy they're going to receive. They get Flucide TBI as their conditioning regimen. We give them their haploidentical bone marrow transplant. And then five days after we give them an additional dose of gamma delta cells. And the goal is simply just to assess, are we triggering severe amounts of graft-versus-host disease in these patients as a result of these additional cells? This is also a dose escalation, but here we're actually increasing the dose of cells from 1 times 10 to the 6 cells per kg to 1 times 10 to the 7 cells per kg. And of course, these cells are being delivered intravenously. It's a small data set. We've had, unfortunately, some severe delays due to COVID, but nevertheless, we've treated three patients with dose level one, no DLTs, no CRS, no ICANS, and what's most important to me, no greater than grade three events of GVHD. We've had grade one, two skin and intestinal GVHD that have been steroid responsive. What's notable here is that in an AML patient who's an adult, these patients, unfortunately, do very poorly in general. They're generally going to relapse within a year. Even in the setting of what should be considered a curative transplant, 50% of these patients will relapse within a one-year period. And what we've seen is with all two of the three patients that they are beyond that one-year point approaching two years, they're patient-free. But the third patient is also close to a one-year mark. And we'll be updating this shortly for you. So where are we going now from this? We're hoping to put the lessons that we've learned for 100 and 200 together into this IMB 400 program in GBM. And the goal here is multifold here. We want to build on the safety and efficacy data that we've generated for autologous cell therapy and confirm that signal. We want to generate some initial safety data for intrathecal allogeneic cell therapy in the relapsed GBM population, and then look at the relative risk-benefit ratio of treating newly diagnosed patients with either auto or allogamma delta T cells. And then finally, the trial will also have an arm, as I'll show you shortly, that will establish whether there's a efficacy signal for allogeneic therapy in the relapsed setting with the goal of essentially potentially giving us accelerated approval. And these relapses are very, very poor overall survival of only about . So there's a lot of work to be done there. This year with the autologous and the allogeneic IND will be going in shortly thereafter. This is the trial design. We're looking at beginning the trial with arm A, which is a continuation of our IMB 200 program. And the goal here is, again, autologous cells being delivered to a newly diagnosed patient population in combination with temozolomide. 40 patients to just confirm the signal. We'll then be opening up the phase 1B. We'll be looking at allogeneic cells. together with a single dose of temozolomide in a recurrent GBM population. Safety has been established in those patients. We'll then go on to open up two arms with relapsed GBM and one newly diagnosed GBM. And again, the relapsed GBM because the durability that we're seeing so far with the diagnosed patients, this should be a potential menstruational program. This would lead us to have discussions and decide whether more patients are needed to secure some regulatory activities. And then the RMC will allow us to compare and contrast with RMA, auto versus allo in the newly diagnosed population to understand for patients what's the best modality, what's the modality that offers them the best risk-benefit ratio, knowing that not all patients will be able to generate autologous cells and not all patients will have a healthy donor available to supply cells. I'll just point out here also that the endpoints here are overall survival rates. Again, we're not doing overall response because this is immunotherapy. Immunotherapy means durability, and durability is what is gonna provide us with the most convincing argument that there's something there there. With that, I will turn it over to Dr. Levine, leader in CAR T-cell therapies."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, thank you. So it's a pleasure to be here in person seeing people in 3D. I haven't seen in three years. These are my disclosures. I'm going to take you back about 15 years to provide some context before looking forward. I want to recommend this book. And this is a book about precision engineering called The Perfectionist by Simon Winchester. And in various chapters, he takes us through the history of engineering, first steam engine pistons, Rolls-Royce engines, Leica cameras, the Hubble, GPS, photolithography, and the sake of quartz watts. Cell therapy is not precision engineering. it's challenging. If we look at the various categories of drugs, small molecules, proteins, viral vectors, cell therapy, size, stability, handling regulatory and so on, look at the size across the top. I like to think of the size as a rough correlation to the complexity of the drug product. But that complexity Maybe challenging, but it's our friend because cells can do so much. And as you've seen just prior to what I'm telling you and to follow. I want to take you back a dozen years to our first CAR T-cell trials in cancer. We started CAR T-cell trials in the late 90s in collaboration with CellGenesis and HIV, and then started our preclinic work in 2004 in cancer. The first patient treated here is Bill. He has relapsed refractory chronic lymphoid leukemia. He has no other treatment options. He's not eligible for a stem cell transplant. Up top, you see his bone marrow. Everything that is stained brown is leukemia. Six months later, his bone marrow is clear. In fact, that lasted 10 years until he unfortunately contracted COVID just before the vaccines came out. The first three patients, two complete responders, one still leukemia-free almost 12 years later, will be August. In those first three patients, between 2.9 and 7.7 pounds of leukemia were obliterated in the several weeks after their CAR T-cell infusion. That's the power of cellular therapy. We now have global CAR T regulatory approval. We have six products approved, six indications, hundreds of treatment centers in dozens of countries. What we want to be able to do and what innate bio is doing is teach every cell to be all that it can be and more. We're working at the University of Pennsylvania on manufacturing faster cars, our traditional manufacturing process. We started at 14 days. We're now at about 10 days. We actually have a three-day process. And we know from what you've heard today and from the work of others that CARs are moving beyond alpha-beta T cells, gamma-delta T cells, NK, their CAR macrophages, CARs and blood stem cells, and CARs derived from iPSC. So this technology is moving forward on a number of fronts and beyond oncology. We and others have investigated CAR T cells in HIV. There's a report, and it makes sense, of CAR T cells for autoimmunity or tolerance. This is a paper in New England Journal in lupus. We published clinical studies out of Penn, CAR T cells for heart failure and fibrosis. There's even some speculation, some report on senolytic CARs, so CAR T cells for aging. Think of your engineered cells as drug factories. And then moving beyond ex vivo to in vivo, here's a report from Penn in January. We all know about lipid nanoparticle mRNA vaccines, but here are targeted lipid nanoparticle mRNA-encoded CARs. So Drew Weissman, who gave the George Stamm lecture this morning, described this technology. This is an anti-CD5 link to a lipid nanoparticle delivering mRNA to T cells targeting fibroblast activation protein in a model of cardiac fibrosis. So we are in the era of synthetic biology. We can engineer CAR T cells with AND or NOT gates. We can engineer checkpoint resistant CARs, safety switches, and conditional CARs or stealth CARs. And we need all that in solid tumors because solid tumors are challenging for reasons of antigen escape, for reasons of immunosuppression, for reasons of geometry. And we have the ability with engineered cells to address all of those. And I should also mention in the realm of cell therapy, the work modifying stem cells to treat hemoglobinopathies. And this is a real challenge. seminal event in expanding the reach of these cell therapies. So some critical path issues for wider patient access. We need to work on enhancing potency. You've heard some of that already today by incorporating armor switches, combination therapies. These are complex to manufacture. So how do we incorporate automation? You've heard the use of the prodigy? How do we shorten culture? We need education and training at all levels. That's why many of us are here at ASGCT, but I'm the immediate past president of ISCT, International Society for Cell and Gene Therapy. And so finally, we have to admit that these are financially complex in the current iteration. How do we work on value-based payment mechanisms and predictive biomarkers? So I mentioned IACT. I liken us to the Rosetta Stone, just as you needed the Greek to decipher the hieroglyphs. We're built on three pillars. We have a scientific pillar, as many societies do, but we also have regulatory and quality operations and commercialization. And you need to be conversant in all three of these languages to translate cell and gene therapies. And I'll just say I am part of a fantastic team at Penn Children's Hospital. And we have to recognize our patients. And it truly does take a village to bring this forward. And I'm so pleased to see the progress that Innate Bio has been making and has been sharing with you today. So I now turn it over to who? Larry."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I just didn't hear it. All right. So, thank you, Bruce, for that great introduction to CAR T-therapy. Let me talk a little bit about a unique CAR that any CAR has put together. This is a prototypic CAR. Basically, this CAR is part of it. Okay, and also this particular car is put together with our drug resistance gene, MGMT, as well, which is cleaved off the construct and integrated after the transduction is complete. So one thing unique about this car is you don't see a signaling molecule coming after it. And there's a reason for that. Gamma delta T cells are very effective cell killers. As I talked about and Will talked about earlier, they have multiple ways of killing. and multiple approaches to, uh, finding, uh, finding and seeking out and killing cancer. So we want to use those. Uh, we don't want to take them away simply by, uh, putting a car that's going to turn the cell into, you know, nothing for, uh, nothing more than say a one trick pony. Uh, so, um, this is our prototype concert, uh, our prototype, our prototype concept. Now, let's talk a little bit about the use of this CAR. As you know, in our brain tumor studies, we are infusing the DRI product directly into the tumor cavity. So we are able to deliver a high concentration of cells directly to the tumor. What about cells that you can't do that with? Extracranial tumors, ovarian cancer, lung cancer, breast cancer, And for that matter, brain tumors like DIPG that you can't just go into surgically and put catheters in. You need a car that's going to be able to seek out and define and destroy those cancers. And by doing so. You can also bring the power of the gamma-delta T cell to that cancer, eliminating a lot of the issues with heterogeneity that you would see with a CAR that's transduced with a single antigen recognition molecule and bringing the force of being able to target all the NKG2D ligands with a gamma-delta T cell. This is a very effective approach, as we see. These are four separate experiments that were conducted by the lead scientist in this program, Lei Ding. The first set of flow cytometry, reading left to right, experiment 1, 2, 3, and 4, you see the cell lines cytotoxicity with no gamma delta T cells. So it's just basically the cell line, 3, 7, 6, 7. and 1.4, so the cell line is almost completely viable. When we infuse into the dish a expanded and activated unmodified gamma-delta T cell product, of course we do see killing, 15%, 34%, 38%, 36% at around a five to one effector to target ratio, or four to one effector to target ratio. So, but when we put the cell transduced with the car, we can see that that efficacy is increased significantly from 15 to 35 on experiment one, 34 to 68 in experiment two, 38 to 54 on experiment three, 36 to 63 in experiment four. Now, if you're trying to treat A breast cancer or a lung cancer out in the circulation, you need that kind of power. And we do know that gamma-delta T cells alone will home to their tumor. But we get a lot of loss during that time, too. So the car can direct the cell to the place where the action needs to happen. And this is a... This is a video of these car-transduced gamma delta T cells attaching to and killing the same U87 line that you saw just recently. And you'll see they clear the plate in this 16-hour time lapse and destroy the cells with all the debris collecting on the bottom of the plate. And with that, I'll turn this over to our Chief Financial Officer, Pat."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Dr. Lamb. I don't know if this..."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Pat. So I'm actually going to invite our management team to the stage. We're going to do a question and answer period. I know there's a bunch of questions that are online. We have a number of people here with us today here in the room. So can I get the management team? We'll do the question and answer period. We have mics. If you have questions for Dr. Kablitz or Dr. Levine, they can answer as well. And then I will... sum up everything and conclude after the Q&A period. But we have quite a bit of time, so if anyone has any questions,"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Testing, all right, yeah. Why don't we start off with some questions we've got online, and then after we answer a couple of those, we can see if anyone in the room has any questions. Keep it loose. Starting off, I'm hoping the management team can talk us through the competence level you guys have with the full allogeneic approach with IMB 400, based on what you've seen with IMB 100 and other results such as"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So let me address this. This is Will, the president and CEO. As we were talking to Dr. Levine earlier today about autologous versus allogeneic approaches, I think the conclusion that we came up with was ultimately nobody knows. A lot of these are firsts. There are things that we're doing for the first time that nobody has seen before. So arguably, there are benefits to the autologous, as I said, with the V delta 2 cells. They are professional antigen-presenting cells. But we don't know what kind of an MHC match is actually required to present antigen. Allogeneic cells have the ability to potentially be off the shelf. Arguably, they can come from younger patients who do not have cancer, so they're not immunosuppressed, and so they should have greater cytotoxicity. But ultimately, we believe that the data should drive it, which is why Dr. Goswami has created a robust multi-arm, multi-center study that will look at both autologous and allogeneic in both the front line and the relapse setting. You know, there was some data that we saw just very recently, and I'll bring this up. I only saw this data in the last two weeks. A lot of people are trying to gene edit whether it's gamma delta T cells, NK cells, or alpha beta T cells to prevent graft versus host disease. The flip side of the same coin on the allogeneic side is host versus graft. Arguably, your graft lasts only as long as the period of lymphodepletion. It's actually one of the reasons why we went into the brain, because you don't have a lot of host NK cells in the brain, so your cells should last longer. But alternatively, The other side, that host versus graft, there are people who are trying to knock out the MHCs. There are probably 20 companies trying to knock out beta-2 microglobulin or CD74. We didn't know, but early on we had a hypothesis. Well, if I clean the surface of the cell, does it look weird? Does a clean cell actually get rejected? We didn't know, but very recently our competitor, as you mentioned, Adacet, they have the CD20 antibody with an allogeneic program. Blake comes from Atara. They worked with the early EBV, so they're HLA matching. But there they did an analysis with a mixed lymphocyte reaction and found that the beta-2 microglobulin knockouts was actually not worse than the HLA matched. But I presented at the Allogeneics Cell Therapies Conference last week. Hans Klinerman followed me. Hans is the founder of the NK92 line, what was originally Conquest that became Nanquest and is today Patrick Soon Chung's Immunity Bio. They actually had a slide, first time I've ever seen it. They looked at NK92 alone. Cytotoxicity based on peripheral blood NK cells is about 20% with the HLA matched. With the beta-2 microglobulin knockout, they had over a 60% cytotoxicity against the knockout. Unfortunately, that was even higher than the control, which is a K562 line. It's a leukemic cell line that people use as a control. Now, many people are actually trying to add HLAE or HLAA back onto it to prevent that rejection. They did it. HLAE actually resulted in a slightly better result, but still had 40% cytotoxicity. The concern, we don't know until we run the trials, but there's some early evidence that we're seeing now that some of the approaches that people are taking may actually wipe out their therapeutic."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Next question. All right. Can you talk a little bit about the division of resources and any prioritization that will occur between INB 400 versus INB 200 and how you guys are thinking about that moving forward?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So I can. that study wrapped up by the end of this year. So there will be no resource prioritization as a result of that because 400 won't open until next year."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Awesome. Easy peasy. And sort of piggybacking off of that, how are you planning to move forward with the IPSC program? Are you looking into partnering? Is this going to be internally driven? What are sort of your long-term thoughts around that?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I mean, strategically, IPSCs are exciting, right? They're sexy. But it is a huge undertaking. And reality is only one company to date has put these into a patient, right? Fate Therapeutics with their NK cells. There is a lot of work that still has to be done. It's possible we don't know that longer term we may need comparative studies because we really don't know if an iPS cell is going to be better than an autologous cell or an allo cell that comes from a donor. There's a lot of data out there. People have their biases. Our goal is to advance this because it has the potential for creating a uniform, homogeneous product that looks much more like a drug. You can actually store it, cryopreserve it, and distribute it as needed. But we don't know some of the answers to the questions as to durability and whatnot. Ultimately, we're looking for a partner, someone who can invest the dollars that can help us advance this and do much of the scale-up that requires for the large-scale commercialization for the creation of these banks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Trying a little bit on that last point, a little bit more, you've alluded briefly to what the structure of that partnership might look like. Can you take a deeper dive into sort of what that might be and how you envision, in a perfect world, for you, what is that partnership?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "We are always entertaining discussions with potential partners. As we showed earlier, Takeda is the first pharmaceutical company that has gotten into the space. Almost every pharmaceutical company is interested in allogeneic therapy, especially if you can create iPSCs. Now, do we want to give the key to our assets, the DRI in our approach to target solid tumor? As a prior investor, I'd rather not. I'd rather keep that as long as I can. But we have a platform to create a source of gamma delta T cells. We continue to have dialogue with people. There are some people who are developing cars, who would like to put cars onto gamma delta T cells. They have vectors that they're already using in alpha beta T cells. It's a very easy collaboration to do. There are others who have vast antibody libraries. The gamma delta T cell has an active CD16. It can be functioned just like an NK cell. It can be combined with antibodies. Adacet recently had the CD20 data. There were complete responses in follicular lymphoma, but by innate pharma a decade ago in 2011 when they combined the gamma delta T cell expansion with rituxan. And so those are some of the partnerships that we may look at."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Gotcha. That helps clarify that. How should investors think about your IPSC platform's ability to produce both IPSC-derived B-delta-1 and B-delta-2 gamma-delta T-cell subtypes? Can you speculate as to how these different subtypes could be used in therapies?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "B-delta-2 cells are unique in that, well, first of all, let me say that B-delta-1 and B-delta-2 cells overlap with a lot of functions. But V delta 2 cells are the only cell that we know at this point, the only gamma delta T cell that can process and present antigen and potentially bring on a follow-on response. V delta 1 cells, as we showed in our very early work in children back in 1991, are a long-term persistent cell. They will stay around for a long time. But they also have some drawbacks as well. There's evidence that shows that VLT1s in some tumors can be converted into a tumor promoter. And so as we sort these out and look at how we edit these cells and how we use them, it's by nature the possibility that one cell might be better for one type of tumor, One type of cell might be better for another, and a combination might be better for a total therapy, depending on the edits and the mixes that you can do. It's an exciting time to start looking down the road at this."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Awesome. Are there any inherent differences in the gamma delta T cells that are derived from iPSC, or does the power of the platform come from the ability to engineer specific CARs and other proteins into these cells?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I'll just address that. I'd say they're all tools in the tool shed, right? So for different diseases and different indications, we think we want to use different tools. I think to date, the analysis that we have done in the IPS-derived gamma delta T cells, I think we have to do more characterization, but we know to date that we can differentiate both V delta 1s and V delta 2s. They are cytotoxic. And so they are functional. The karyotypes are normal. And we have been able to genetically edit it. For expedience sake, we use the lentiviral vector. We are looking at potential CRISPR modifications and other gene editing. But we use the lentiviral vector and found actually very high transduction at 70%."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Gotcha."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Let's go to... Why don't we see if there's anybody in the room that has a question first, and then we can go back to some of the online questions because they're coming in."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Any pressing questions?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, it's Matt from Oppenheimer. Thanks for... Can you hear me? Thanks for the event. Really interesting. I'm kind of curious on the cocktail transcription factors you're using for your IPSC protocol. And if you think there's freedom to operate there, because I guess that is kind of a question that we get from investors. And then also on your use of CMIC as a transcription factor, are there any concerns about cellular transformation downstream, or do you think that that's been accounted for? Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "CMIC, is there any concerns about it because it's an oncogene?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Not today, no."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I believe that when we look at it, we look at the differentiated cells and we look for those transcription factors and they don't exist anymore, right? So with respect to the landscape, I think most people are using the same Yamanaka factors, Oc4, KLF, CMIC, et cetera. There are some concerns about the IP landscape. We are analyzing that landscape. Oops, sorry. My understanding is some of that early IP may expire, but also ultimately we don't have a product yet, right? So like many other areas around CRISPR or whatnot, I think the IP landscape is still sorting itself out. Other questions? Yes. If not in here, how about online? Are there more questions online coming through?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "With your IPSC program, do you see an opportunity to move beyond AML leukemias to lymphomas?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "We're not currently focused on leukemias and lymphomas. We have the IMB 100 program. I think it's possible to do some combinations. Larry has some ideas about non-signaling CARs or whatnot. In general, my bias as a business person, I'm not from the scientific side because I think there's fascinating scientific stuff that we can do, but my bias is really trying to target, can we target solid tumors better? The solid tumor market has been very challenging for the cell therapy space. I'm really encouraged by the data that we're seeing thus far. As Dr. Goswami said, we'll have an update at ASCO in two weeks. It's a market that's nine times bigger. If we can solve that problem, that's where I'd like to be, rather than the dozens of companies currently focused on the leukemia and lymphoma."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "How different is it producing iPSC gamma deltas compared to iPSC Ts or Nks? What is the differentiation in this process?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Very different. I think at the poster yesterday, everybody came and said, how do you do this? What do you do? Can you tell me your process? We're one of only two people who have differentiated gamma delta T cells. We're the first one to show that we can create both delta ones and delta twos. It is, I think, very different from the T cells and the NK cells. And we're excited by our capabilities."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "what is the timing for choosing another solid tumor program and will it use IPSC?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "No. I think as on this slide in front of you and as Pat, our CFO, had alluded to, we are already working on other solid tumors. It's our goal to actually come public later this year and likely present data early next year about a specific solid tumor. Just like in our IPS cell program, I think... We could have been out months ago or years ago and said, we want to do IPSCs, but it's not in my nature as the CEO and leader of this company. We want to execute, demonstrate that we can actually do something, and when we come out with it, we want to show data that we can do it. And so it's our hope to actually publicly announce another solid tumor indication later this year with data following shortly thereafter."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I also wanted to mention the IPSC questions. that this, you know, we seem to forget that I, in collaboration with the UAB Stem Cell Institute, had been working with T-cell manufacturing, particularly the Amidophil T-cell manufacturing from IPSC since 2012, and we've been, where I refined some of this process in my academic lab, and then we were lucky enough to bring on Dr. Yang Yi, who is an IPSC specialist who's been able to take the previous work and really do this wonderful program out of it. But it's not something that just sort of popped up. It's been in the process for a long, long time."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I just want to reiterate, as I said earlier, whether I get my cell from a donor or an IPSC, at the end of the day, I have a cell. and we know those cells if if they naturally killed the tumors in your body your body's immune system would have eliminated the tumors in in the first place but over long term with chronic immune antigen stimulation we've selected against those tumor targets that are expressed highly and so we essentially have high low affinity low avidity interactions and so we have to find a way to get the immune cells to target those tumors And so the source and manufacturing of the cell is one thing. The other is how do you target it? And so we went early on by taking cells from peripheral blood, or you can take it from skin in other locations, manufacturing the cell, testing the ability for us to target the tumors, and now we're also getting into the iPSCs."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Gotcha. And sort of building off of what you just said there, is there any sort of different factors you're looking for from the IPSC compared to the donor cells in terms of what they need to prove in terms of characterization and anti-tumor activity?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I mean, the first thing with IPSCs is the early data, you had to show that they were permanently differentiated, right? So the first Yamanaka won the Nobel Prize in Medicine in 2012. The first IPSC programs were actually in the eye. There's risk to using an IPSC if they're not terminally differentiated. The first programs in the eye were put on the hold because they formed teratomas. And so you're not likely to have such risks when you take cells from peripheral blood and manufacture from a patient. And so they're much more complicated to manufacture that way. Again, I think we have to do much more work to test the iPSCs. Ultimately, whether the homogeneity and the consistency and the ability to manufacture a lot of cells actually... holds up to actual patient or donor derived cells. Like we don't even know if the autologous cells versus the allo cells will be better because the autologous cells have some matching. They may present cells with the gamma delta T cells. There may be some remnants of other cell types that may co-signal and drive a broader immune response. It's all very interesting biology that we're still studying."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Gotcha. To jump around a little bit, to hop off the IPSC just for a tad, for INB400, what capacity constraints do you have for the phase 1B2 trial in glioblastoma?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So I can touch on that very briefly. You know, cell therapy manufacturing is always the constraint that you run into in these larger-scale trials. I think we've been working very diligently to build out this larger manufacturing facility. We do have a large dedicated suite that we'll be working in, and we do believe that while we will ramp up with just a handful of patients per month to start, that we can rapidly get to the realm of, you know, I would say, you know... numerous patients per month and I think trying not to give away the store here but I think that Tristan is designed to study and we're implementing a plan so that we can reasonably complete enrollment within a year to two years so I think that we're feeling comfortable with how we're scaling up and the capacity that's available to us very cool any questions in the room otherwise I can keep going"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Why don't we do two more and then I can wrap it up. That sounds good."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I imagine people are sick of hearing from me. What are you using as your markers for success for a durability response in your IPSC program?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I think that's early because we're not even in the clinic. We're not in the clinic yet with respect to durability of response. As I said, our current treatment is in glioblastoma. And really, I think there's another company out there in the cell therapy space where the CEO and the team is using the moniker. It's time that matters. So there are many examples of tumors where patients shrink the tumor, and I know investors like to use tumor shrinkage as the model. As a prior investor, I was always concerned because the analysts and the investors that are out there, how many times have you seen a phase one study, you see a response, and ultimately the regulatory endpoint is progression-free survival and overall survival. They unblind the phase two, and the p-value is nada. And so there are challenges where patients may get tumor shrinkage, but if it doesn't impact the mechanism in which the patient ultimately dies, you're not going to see a benefit. So for our trial, as Trishna had said, we're currently looking at progression-free survival and overall survival as the endpoints. We're encouraged. It's challenging for an immunotherapy in the frontline setting because I can have an effect. I can have fluid coming in. I can have T cells coming in. Like you saw in the histopathology, we see an increase in T cells in the tumor bed. That may show up as progression because the tumor is getting bigger. There's more fluid on the MRI. But reality, it may be pseudoprogression. The patients are living longer. Time is what ultimately matters. And so we're encouraged, the first dose cohort, every patient has gone beyond their expected progression-free survival. Every patient we've treated has gone beyond the overall median survival. And we'll present some data in two weeks at the first patients that will receive three doses. And I'm pretty encouraged about that. And as we move from three to six, if we can get progressively longer in progression-free survival and overall survival, then ultimately that's what matters."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Gotcha. And last question, going pretty big picture on this one. Any updates on partner strategies? We touched on this with the IPSC program, but from a larger... I think we talked about that already."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "We're obviously always in discussions with potential partners. As I said, there are people who have antibodies I want to combine with. There are people who have novel therapeutics that we want to combine with. I'll give you an example. We showed earlier that we can upregulate the NKGTD ligands with temozolomide. Dr. Rocklin presented at CITI last year a combination with PARP and temozolomide. We hypothesized, why do you need the endogenous BRCA mutation? Why not just cut the DNA and drive a hypermutation with temozolomide while blocking base excision repair? In such examples, we actually saw an increase in the mRNA of NKGTD ligand by 2,800%. And so really significantly increasing the expression of the ligands. And so we're looking at partnerships with small molecules, clearly like everyone else, checkpoint inhibitors, potential other ADCC operating drugs, but also people who have novel CAR vectors that we can combine. But, you know, I'll just very rapidly sum it up here. Look, we're really excited about what we're doing. I think we've put together just an amazing team here. On the Gamma Delta T cells, Dr. Lam and the R&D team has expertise that I believe is second to none. We've built a robust platform with our Delta X platform, and we can do anything. Everything and probably more than any of our competitors out there. We can do CARS. We can do non-signaling CARS. Our DRI approach is unique. And today we can do iPSCs. We can do both V-delta-1s and V-delta-2s. We have a wholly owned clinical pipeline. INB 100 in leukemia patients testing the safety of donor-derived cells. We had patients as of the end of March almost two years out. and we will give additional updates, but we're excited about that. In IMB 200, in brain tumors, we think we are making a difference for these patients. When we have updates, look at the data, look at progression through survival, but also anecdotally the quality of life. These patients undergo seizures, they have headaches, they're not functional, they can't work. And so we're encouraged by what we're doing, and as the data matures, I think we can have a real benefit. And finally, the preclinical program between what's today IMB 400 will hopefully move into a phase two, replace the IMB 200 program. But the multiple arm study that's designed to test really thoroughly, let the data drive our decisions, will let us test allogeneic versus autologous in the front line versus relapse setting and really see how we can benefit patients. We have a wholly owned pipeline and preclinical pipeline that we think we can partner. The value in our stock today is quite low, but we think we can make a real difference. Our team thinks there will be a day when we can use cell therapy and other tools in the armamentarium to give cancer patients a new lease on life. And it's our mission to use our knowledge and our experience to try to transform the hope in cancer patients into reality. It's an exciting time. We have an exciting pipeline. The capability in our team is second to none. And so I want to thank all of you for joining us, all of you who are online today. And we hope you will continue to do your diligence. And I hope all of some of you will join us in our journey and our mission. So thank you."
    }
]