Greetings, and welcome to the Intelligent Buyer Solutions, Inc. First Quarter 2023 Earnings Conference Call. Currently, all participants are in listen-only mode. A question-and-answer session will follow the formal presentation. As a reminder, this conference call is being recorded. Joining us on the call today from the company are Harry Assuminaitis, CEO and Chairman of the Board, Spiros Akiris, Chief Financial Officer, and Philip Hand, Executive Chairman of Intelligent Fingerprinting Limited. A press release announcing the results and the update has been issued this afternoon and is available now on the company's website. If you haven't received this news release or if you'd like to be added to the company's distribution list, please contact the Investor Relations Department noted at the bottom of the earnings release. Some of the statements on this conference call for forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, Section 21E of the Securities Exchange Act of 1934, and the Private Securities Litigation Reform Act of 1985, which involves risks and uncertainties. Forward-looking statements on this call include, without limitation, Intelligent Biosolutions, Inc.' 's ability to develop and commercialize its diagnostic tests, realize commercial benefits from its partnership and collaborations, and secure regulatory approvals, among others. Although Intelligent Biosolutions, Inc. believes these expectations reflected in such forward-looking statements are reasonable as of the date made, expectations may prove the results have been materially different from the results expressed or implied by such forward-looking statements. Intelligence Biosolutions, Inc. has attempted to identify forward-looking statements by terminology including belief, estimates, anticipates, expects, plans, projects, intends, potential, may, could, might, will, should, approximately, or other words that convey uncertainty of future events or outcomes to identify these forward-looking statements. These statements are only predictions and involve certain unknown risks and uncertainties and other factors included in the company's public filings filed with the Securities and Exchange Commission. Any forward-looking statements contained in this release speak only of the date. We undertake no obligation to update any of these forward-looking statements contained in this release to reflect any events or circumstances occurring after the date or to reflect the occurrence of unanticipated events. During these conference calls, the company may refer to EBITDA, a non-GAAP measure. EBITDA is not and should not be considered an alternative to net income loss income loss from operations or any other measure of determining operating performance. EBITDA is normally calculated by adding back income tax, depreciation, and amortization to net income loss. I would now like to turn the call over to Harry Semionitis, CEO of Intelligent BioSolutions, Inc. Harry, please go ahead. Thank you, Operator, and thank you, everyone, for joining us on our fiscal first quarter 2023 financial and business update call. Today I'm going over the last three months' milestones and achievements, most notably of which was our acquisition of Intelligent Fingerprint Limited, or IFP, which lays the foundation for a future of the company and is reflected in our announcement name change to Intelligent BioSolutions. In brief now, we have a strong, broad technology platform for delivering convenient, on-site diagnostic and substance testings with comprehensive and complementary manufacturing, commercial infrastructure, and expertise from both companies. I will then turn the call over to Phil Hans from IFP, then Spiro, our CFO, for a review of some of key financial metrics, including our preliminary year end and fourth quarter results, with an update forecast cash burn. Without a doubt, finalizing the acquisition of Intelligent Fingerprinting, or IFP, announced on October 4th, which has been in active development for some time, is a significant achievement for the business going forward. Not only with the highly complementary and synergistic onsite point-of-care testing technologies, but also increased our commercial, manufacturing, and regulatory capabilities. We are confident that this acquisition is in the best interest for both companies and shareholders alike. As a brief reintroduction, IFP is a UK-based developer and manufacturer of point-of-care medical diagnostic products. Specializing in lateral float products, utilizing fingerprint sweat, as its primary test substrate. IFP's pioneering and proprietary testing for evidence of recent drugs of abuse misuse, including opioids, cocaine, amphetamines, and cannabis. This is commercially available in specific geographies and leverages a full portable system with sample collected and analyzed onsite in a matter of minutes. We are in the process of expanding our geographies globally, and we expect to be selling within Australia early in the new year, followed by other regions within Asia and Europe. Turning then to what we now simply refer to as the biosensor product, which is a non-invasive saliva-based glucose biosensor solution for patients living with diabetes. Intelligent biosolutions has initiated activities towards key clinical studies intended to be conducted in parallel. The first of these studies is intended to optimize the testing by eliminating the variables that may affect detection of glucose levels in saliva and in the sample collection method. While the second study is designed to effectively assess the accuracy and the reproducibility of measuring saliva glucose with the biosensor strip. Preparations for both of these studies is actively underway, and neither one is in any way impinged financially or otherwise by the recent IFP acquisition. Meanwhile, in leveraging IFP's ongoing manufacturing infrastructure and expertise, intelligent biosolutions continues to progress its construction of a state-of-the-art manufacturing facility at the University of Newcastle, Australia, specifically aimed at production of the BioCentre to support both clinical development and commercial demand, primarily for glucose testing, but also with other potential test applications very much in mind. The company anticipates construction to commence before the end calendar year of 2022. Finally, and before turning the call over to Phil, it would be remiss to not also welcome Mr. David Jenkins and Mr. Jason Eisenberg to our board of directors. Both individuals bring a wealth of operational, technical, and strategic experience and insights that will be invaluable as we both grow and pivot our integration of IFP and further development of the biosensor into IBS. I would now like to turn the call over to Phil, the chairman of IFP, who will be introducing IFP's product and our future. Phil, please go ahead. Thanks, Harry, and I welcome the opportunities to partake in the company's earnings calls. Let's get straight into it. The IFP fingerprint testing platform is proving highly disruptive when compared to the traditional invasive user-in-liver tests and is garnering widespread attention and adoption. Among the many recent contracts that serve as a testament to the overall and relative value of the fingerprint test are those recently announced. New client relationships with Gold Star Transport, Eastern Airways and the Glass Systems Group. Each of these sales wins reflects the unique advantages, both technical and practical, of on-site testing, these being sufficient to displace legacy methods and warrant organisation-wide adoption and rollout. Adding context to the opportunity with IFP, the global drug testing market is estimated to be approximately $4.6 billion as of 2023, with an anticipated compound annual growth rate of 5.6%. The United States alone is estimated to comprise some 75% of this global market. Intelligent BioSolutions has its eyes set squarely on expansion of the IFP product line into the U.S. point of care workplace market, which ultimately requires commercial accreditation from the U.S. Food and Drug Administration, FDA. Initial interactions with the FDA have begun in earnest, and though additional work remains, we believe those interactions to have been favorable. In all, we see Envision in our pursuit of U.S. market approval and launch as a two-year plan requiring approximate funding of $2 to $3 million. That will open access to an estimated $3 billion U.S. drug testing opportunity. As with GBS's prior proprietary saliva-based testing technology, Intelligent BioSolutions intends to explore the full breadth of applications for fingerprint testing beyond the current portfolio of drugs of abuse. including potential diagnostic applications already identified, these being opiates for pain, epilepsy treatments, antipsychotics, cortisol, C-peptide, and fructosamine. Based on the IFP knowledge base and intellectual property, Intelligent BioSolutions also foresees diagnostic potential for the fingerprint testing platform in areas including infectious diseases, such as MRSA, Lyme disease, dengue, severe dengue, measles, and German measles. And finally, also in quality control assurance of the food supply with prospective testing capabilities for biological food contaminants such as brucella, salmonella, and proteus. Moving beyond just fingerprint assays, another area that clearly demonstrates the diagnostic potential of IFPs lateral flow technology is a recent receipt of CE marking for a saliva-based rapid antigen screening test for COVID-19, which is both less invasive compared to nasal and throat tests, contains no single-use plastic, and is 95% lighter than conventional tests, reducing both material waste and logistics costs associated with ongoing global demand for COVID testing. The management team that is now integrated into IBS along with the intellectual property behind IFP, will allow us to continue to grow at a rate that would not have been attainable without coming under the Intelligent BioSolutions umbrella. I would now like to turn over the call to our CFO, Spiro Sakiris, for a more detailed review of our third quarter financials. Thank you. Spiro. Thank you, Phil. I'll now provide a brief overview of Intelligent BioSolutions 2023 first quarter results. As of September 30th, 2022, the company's cash, cash equivalents and marketable securities totaled approximately $5.74 million, compared to approximately $8.24 million on June 30, 2022. This change was primarily due to expenditure relating to the proposed pilot manufacturing facility in Newcastle, Reduction of current liabilities from June 2022, the major component of this being equipment purchases being commissioned for this facility. And exchange rate losses from the conversion of our foreign currency balances to USD and general overhead. For the year ended September 30th, 2022, the company had a preliminary net loss of 1.21 million or 8 cents per share. compared with a net loss of 1.43 million or 10 cents per share for the same period last year. This decrease in loss is primarily due to government support income recognised in the current period compared to the same period last year. Government support income was 0.31 million and zero for the year ended September 30th, 22 and 21 respectively this is a result of increased qualifying expenditure incurred in setting up of the pilot manufacturing facility the company is of the view that the current operating plan and financial resources its cash cash equivalents and marketable securities as of the 30th of september 2022 will be sufficient to cover expenses and capital commitments into the first half of 2023. This cash runway forecast does not incorporate revenue from planned new markets for the IFP product, nor the potential exercise of the glucose North American license option agreement. Lastly, we will be switching over to a December 31 calendar year when it comes to our reporting. That being said, in our next earnings release, we'll be reporting 2022 full financials that will incorporate IFP. With that summary complete, I'd now like to turn it back to the operator for any outstanding questions amongst our call participants. Operator? Yes, thank you. At this time, we will begin the question and answer session. To ask a question, you may press star, then one on your touchtone phone. If you're using a speakerphone, Please pick up your handset before pressing the keys. To withdraw your question, please press star then two. At this time, we will pause momentarily to assemble the roster. And the first question comes to John van der Mosen with Zax. Hey, everyone. Spiro, Phil, good to hear your voices. And Harry, welcome back to the CEO role. And also, congratulations to all of you on the new companies that you added, new clients that you added since the merger closed. Things are starting off pretty good. I had a couple questions on a few different topics. I guess, you know, I'll start out with just the initial effort in Australia and New Zealand with IFP. You know, you had mentioned there that you expect to start with that. What are some of the items that you will accomplish? And, you know, when do you expect to see, I guess, the first sale take place? What are some of, I guess, the milestones that you have for that region? Yeah. Thanks, John. This is Harry. I appreciate your kind words. Look, the IFP in the past have been able to reach the Australian market, but the efforts that we're doing in the Australian market now is giving a end-to-end solution for very similar to what we are seeing in the UK now. So the ability for people to test onsite with a return to lab process if they need to verify the test. So we've gone through the regulatory requirements. We understand what they are and they are minimal requirements. um the next phase is bringing in demo units so we can start showing the technology and we're also looking at providing good laboratory back-to-base kind of testing options for our clients so the plan is very aggressive we would like to be able to start seeing sales in the first quarter in 2023 um just getting through just some of the logistics we don't foresee any problems and we expect the success that we're seeing in the UK. Remembering this technology is an unbelievable way that people can actually test for substance abuse at point of care, on-site, minimally invasive, and a very affordable solution. So we're going to go off the back of what we're seeing currently already, what we're doing in the UK, and we're going to replicate that in Australia. So we're expecting, like I said, we're expecting strong growth Not in terms of earning revenue, but in terms of client base, because that's the key for the success of the business, is increase our number of customers that we have out there. Great. And then the follow-on regions that you're going to pursue, I think there's the United States, obviously, and then Asia. Are there any kind of easier areas to approach first? Look, the holy grail for us is, and like Phil said, is the U.S. represents 75% of the overall market. That's the one we're really focused on getting there. Our plan is to get in there within two years, going through all the regulatory requirements that we need to do. So that's very exciting. So we expect that in two years. There are so many other regions that have already inquired in terms of our technology and they want to get our hands on it. We want to make sure we do it right, giving the end-to-end solution to So we have to work with bodies there, pathology labs as well, to get that back-to-base testing. So to answer your question, the demand out there, we're seeing a lot of interest all over the world, from Japan, from Indonesia, from mostly all of the places within Asia, and then we're very aggressively looking in Europe. So the technology can be ordered by anyone today. It's just we want to make sure that they have the ability to go to the back-to-base laboratory testing to verify any results that they have at point of care. Great. And then I saw in your presentation that you had this UK police force project out there. What is that and could that potentially be a big revenue generator in the future? Absolutely. And what I'll do here is I'm going to pass it over to Phil who can really explain the details on that one. Phil, do you want to take the lead on this one? Yeah, yeah. Hi, John. Good to speak to you. Thanks, Harry. Yeah, the UK police side of things is a really pretty large and active market, and it doesn't just extend to the UK, actually. Harry's already talked about Europe, and, you know, we've got a lot of significant interest from a number of European countries with respect to drug testing at the roadside and looking at how drivers might be potentially impaired through drug usage. The market's changed quite a lot in terms of people moving away from driving under the influence of alcohol to being wise to that and now turning to driving under the influence of drugs with a thought process that they might not be able to be quite as easily identified using the technology that has been out there in the past. But with the advent of new technologies that we can bring to the market and use in a point-of-care scenario like the intelligent fingerprinting, fingerprint testing solution, we've garnered quite a lot of interest from the UK police force in the context of that. So we're talking to the right bodies. We're talking to the Home Office here in the UK. We're talking to the Department of Transport. As Harry said, it's important to make sure that the whole process from sort of start to finish is put in place. But we've seen significant interest. And I think as we go through into 2022, And beyond, certainly in some of the European countries, we'll start to see some pickup of the products in those market areas. Got it. And next question is on the manufacturing facility. I saw in your press release that you've received some more equipment for that. When are you anticipating the cash flows for the grant funding to roll in? John, great question on that. Like we said, we're aggressively continuing our project on the manufacturing facility, but I'll get Spiro to go into the financial details in terms of the government grants coming back. Spiro? Great, thanks. Thank you, John. Thanks for that question. Now, with the money flowing in from the grant process, it's all based around milestones. So as we achieve each milestone, we expend the funds beforehand and then we get the proceeds of the grant. So we're basically working now on the next stage of the grant reimbursement, and we'll announce that to the markets once that happens. But the next stage is looking to be coming out shortly. And then what we do is after that, leading up until the manufacturing, there's different stages that come through. Okay. So it sounds like, you know, looking at your cash level right now, you've already spent some money that will get replenished. from the grant reimbursement when it comes, is that right? Exactly, exactly right. And that will be, we'll work on that as we speak. Okay, well, that's good news. And next question, I know I'm jumping around here, but I saw cortisol was your next test for the biosensor. What does the, I don't have a sense of what the market looks like for that. Can you tell me what you pursue there and where the demand for that is? Yeah, look, In terms of that one, we're still analyzing in terms of the overall market and the opportunity. It is a test that's currently being done out in the market. But with our solution, we believe that it could be actually a better test and a more non-invasive test. We're at the stage now to actually identify that market, so I don't have the answer on me right now. But the market is substantial. But to that point, John, what we do here at IBS is With every test that we're looking to go down, there's two parameters. One is how easy is it to develop the product and get it regulatory approved, but how big is the opportunity? Is there a need for the market? So that's what we're going through right now. We have got the ability to test for cortisol, we believe, but now we just want to substantiate that in terms of is there a market there and does it make sense for us to go down that path? So we're in that stage of exploring as we speak. Okay, got it. And regarding the saliva blood correlation study, is there a journal article being put together for that? Is that something that we would see out there in the near future? And do you have any journal targeted or timing on that, if so? Any results? At this stage, no. We won't be publicizing anything until we get it to, as you can understand, the parameters where we actually want it to be. So we expect the probably... Probably the next release in terms of the updating to where we are in the clinical trials, that will probably be more on the back end of Q1 next year or maybe early Q2. And that's when we believe that we can start publicizing some of our results. Very good. All right. Well, thank you for taking my questions. Appreciate it. No, thank you, John. Always appreciate your questions, Perry. Thank you. This concludes our question and answer session. I would like to turn the floor to Mr. Semyonitis for any closing comments. Thank you, Operator. Look, in closing, as you can see, we've had a significant progress in the last quarter, which has really laid a strong foundation for the business. The team and I are very excited and focused on the path forward as we deliver intelligent solutions to our customers all over the world. And now, more than ever, non-invasive point-of-care screening solutions are in real high demand, especially in areas like diabetes and substance abuse. And as you heard from Phil, the overall market in terms of substance abuse in the US, there is a huge need in terms of getting that under control. We intend to be at the forefront of both technology and innovation and market penetration in every possible vertical and region globally. Never to be taken for granted, I sincerely think the entire Intelligent Buyer Solutions team for their perseverance in pulling together the IFP acquisition over the goal line and their equal commitment and energy integrating the two businesses going forward. We likely genuinely appreciate the ongoing support of all our shareholders who are empowering us to drive testing and diagnostic innovations and look forward to sharing details on the exciting new pursuit as we continue our progress. If you require any other further information, please visit us online or reach out to your investor relations department with any other further questions. Thank you. Thank you. The conference has now concluded. Thank you for attending today's presentation. You may now just change your lines.