Hello, and welcome to the Insight first quarter 2022 earnings conference call and webcast. At this time, all participants are in a listen-only mode. A question and answer session will follow the formal presentation. If anyone should require operator assistance during the conference, please press star zero on your telephone keypad. As a reminder, this conference is being recorded. It's now my pleasure to turn the call over to Christine Cho, Head of Investor Relations. Please go ahead. Thank you, Kevin. Good morning and welcome to Insight's first quarter 2022 earnings conference call and webcast. The slides presented today are available for download on the investor section of our website. Joining me on the call today are Irve, Barry, Stephen, and Christiana, who will deliver our prepared remarks, and Dash, who will join us for the Q&A. Before we begin, I'd like to remind you that some of the statements made during the call today are forward-looking statements and are subject to a number of risks and uncertainties that may cause our actual results to differ materially, including those described in our reports filed with the SEC. We will now begin the call with Hervé. Thank you, Christine, and good morning, everyone. Insight's strong momentum in 2021 continues into the first quarter with product and royalty revenues up 20%. Jackify grew 17% year-over-year, with patient demand driving growth in MF and PV, as well as in GVHD, following the successful launch in the chronic indication. Our hematology and oncology portfolio grew 24% year-over-year, driven by our new product uptake, consisting of multiple new launches, including Pemazir in Europe and Japan, and Minjuvi in Europe. The Optelora launch continued to be very successful with strong uptake by dermatologists, high satisfaction reported by both patients and physicians, and significant advancements with payers, which Barry will address in his remarks. We made progress across all stages of our pipeline with important updates that include positive 52-week data for roxalitinib cream in vitiligo, the prioritization of 280 and 318 in our Oral PD-L1 program and the start of our CDK2 clinical program. Our royalty revenue remains strong, growing 23% year-over-year, contributing to our growth profile. Turning to slide five. As you can see on the left, we are still in the early phase of launch for many of these products, including Obzelua in atopic dermatitis, Pemazir in cholangiocarcinoma, where we are expanding geographically, and Minjuvi, which is just starting to launch in Europe, and Jackify, where we recently launched in chronic GVHD in the U.S. There is ample room for growth with each of these new launches. On top of that, we have new potential indications that will be providing additional growth opportunities with Obcelura and VT-Ligo, and with our partner product, where we have new indications being planned over the next few months for Aluminium, Tabrecta, and Jacqueline. In addition to these launches, there are a number of programs in our mid- and late-stage pipeline, as shown on the right, that could have a meaningful impact on our revenue. Before handling the call to Barry, I would like to provide an update on Obzelura manufacturing. We have recently received FDA approval and have implemented a new manufacturing process to improve the dissolution of API for Obzelura. In addition, Consistent with best practices, we have received FDA approval for a second manufacturer of Opsalura to support our successful launch. We are also preparing to reintroduce samples in the U.S. Now to share more details on product performance and outlook, I will turn the call over to Barry. Thank you, Hervé. Good morning, everyone. The launch of Opsalura in the U.S. is off to an excellent start, with over 68,000 total prescriptions written through the end of the first quarter. More than 38,000 new patients were treated in the first quarter, bringing the total number of new patients treated with Opsalora to over 57,000 since launch. We attribute the robust uptake and the very high satisfaction of both patients and physicians, which is fueling the positive feedback loop and driving demand. Patients are requesting refills, which accounted for roughly 23% of prescriptions in the last week of Q1, another good indicator of long-term growth potential for Opsalura. On the payer front, we have added coverage of over 75 million additional lives since the end of January. This brings the total number of covered lives to 146 million, highlighting the progress we have and continue to make in the early months of launch. Turning to slide eight, Multiple leading indicators are supporting the long-term potential of Opsalora, including market share gains for new patients and positive feedback on patient experience. In just six months since launch, our 12% new patient share now exceeds that of Eucrisa and Dupixent, highlighting the unmet need for more efficacious treatments for atopic dermatitis patients. Over 7,500 physicians have now prescribed Opsalora. We continue to increase our prescriber depth week over week, gaining an average of 200 to 300 new writers each week. Our high decile prescribers, those who see the highest volume of AD patients each week and who have written a script for Opsalora, have initiated an average of 18 new patients of Opsalora since launch. This repeat prescribing shows the positive experience and confidence that physicians are having with Opsalora and is supported by recent market research from the field. We are receiving very favorable feedback from the physicians about the efficacy of Opsalora, resulting in a high rate of satisfaction among both patients and physicians. In a recent survey, over half of the physicians indicated they expect to increase prescribing of Opsalora in the next three months, with over 60% of our top dermatologist indicating Opsalura will more than double in the coming months. Moving on to our progress with payers on since our last update earnings call, we were able to get NDC blocks removed with one national PBM, one large national health plan, and multiple key regional plans, adding approximately 53 million commercial lives. which are now covered, including our progress with Medicaid and government channels. Our total number of lives covered has increased by 75 million to reach 146 million, which is outstanding progress in the short amount of time. As a final note on Opsalora, we are also preparing to reintroduce samples in the United States. Turning to slide 10 and Jackify performance. Jackify net sales in the first quarter grew 17%, year over year to $544 million. Total patient demand grew across all indications, and the growth in new patient starts of 12% versus the first quarter of 2021 remains above pre-pandemic levels. New patient starts in GVHD grew 25% year over year, with strength coming from the launch in the chronic indication. With the strong demand for Jackify, we are raising the bottom end of our Jackify full-year net product revenue guidance from $2.3 billion to a new range of $2.33 billion to $2.4 billion. Turning to slide 11, Monjuvi net product sales in the US grew 21% year over year to $19 million in the first quarter. And we are continuing to see uptake in new and existing accounts, more second line use, and a gradual improvement in duration of therapy. Monjuvi net sales were $5 million with the launch ongoing in Germany, and we continue to seek reimbursement in other countries. Temazir grew 34% to $18 million, with the duration of therapy continuing to drive its performance. And with that, I'll turn the call over to Stephen. Thanks, Barry, and good morning, everyone. Starting with ruxolitinib cream on slide 13, Last month, we presented updated 52-week data for ruxolitinib cream in vitiligo at the American Academy of Dermatology annual meeting. As a reminder, during the 24-week double-blind period, patients were randomized two-to-one to receive ruxolitinib cream 1.5% BID or vehicle. After the 24-week visit, all patients crossed over to active therapy. At 52 weeks, approximately 50% of the patients initially randomized to ruxolitinib cream experienced at least a 75% improvement in their VASI score from baseline, and nearly one-third of patients experienced at least a 90% improvement in facial VASI. No new safety signals were seen, and ruxolitinib cream was well-tolerated with no serious treatment-related adverse events reported. These data demonstrate the potential for substantial improvement in repigmentation with a longer duration of treatment with ruxolitinib cream. Also at AAD, we presented data from our population-based VALIANT study, which aimed to better understand quality of life burden faced by people with vitiligo. In studies, anxiety and depression were reported in up to 68% and 62% of patients with vitiligo, respectively. The psychological impairment that may result from vitiligo can be similar to that of other skin diseases, such as psoriasis or eczema, and can impact patients of all types, indiscriminate of skin color, percentage body surface area involvement, or the area affected. Many patients with vitiligo have stopped seeking treatment due to a lack of approved therapies. We are excited at the potential to bring the first FDA-approved therapy for repigmentation to people with vitiligo and to be able to offer them a new choice of therapy. Ruxolitinib cream is under review both in the United States and in Europe, with the PDUFA date in the United States of July 18. Moving to slide 15, we are initiating a study in vitiligo to evaluate the benefit of adding phototherapy to ruxolitinib cream treatment. This is a 48-week trial. where patients will receive 1.5% ruxolidinib cream twice daily for 12 weeks, followed by ruxolidinib cream plus or minus phototherapy. Rounding out dermatology, INCB 54707 is in Phase II studies for vitiligo, higher adrenitis suprativa, and pyrigonodularis, where there continues to be high unmet medical need and a lack of effective therapies, or in some cases, no approved therapies at all. We expect to present data for vitiligo and higher adenitis suprativa in the second half of this year. Turning to slide 17 and our oral PD-L1 program. Last year at CITSE, we presented data on the three compounds in our oral PD-L1 program where we demonstrated the first clinical activity with an oral PD-L1 inhibitor. We saw evidence of tumor shrinkage with all three compounds, and in the case of H6550, an increased rate of peripheral neuropathy. Based on clinical data from ongoing studies and positive therapeutic ratios seen for 280 and 318, we have opted to move forward with these two compounds. Enrollment is progressing well in both studies with 280 and 318. We continue to observe tumor shrinkage with both compounds, and to date, no evidence of peripheral neuropathy has been seen. There are several benefits to an oral PD-L1. including the potential for better management of immune-related adverse events due to a shorter half-life, the opportunity of developing oral-oral combinations, and the ease of dosing with an oral agent. We expect to provide a data update from our Oral PD-L1 program in the second half of this year. Moving to early development on slide 18, we are initiating a phase one dose escalation and dose expansion study in advanced solid tumors with our novel, potent, and selective oral small molecule CDK2 inhibitor, INCB123667. CDK2, in complex with cyclin E, is a cell cycle regulator which, when inhibited, has been shown to suppress tumor growth, mainly in cyclin E amplified tumor models. Cyclin E is an amplified oncogene in multiple aggressive cancer types, including ovarian and endometrial cancer. To close, we expect multiple regulatory and key clinical data readouts this year, as shown on slide 19. Specifically for limba, the once-daily RUX NDA will be submitted in this half of 2022. The BET and ELK2 combination trials with ruxolitinib are progressing well, with data expected in the second half of 2022. The ruxolitinib cream PDUFA for vitiligo in the United States is July 18th, and we expect an EMA decision in the second half of this year as well. For our partnered products, ruxolitinib in acute and chronic graft-versus-host disease and capmatinib in non-small-cell lung cancer, both have received positive CHMP opinions. With that, I would like to turn the call over to Christiana for the financial update. Thank you, Stephen, and good morning, everyone. Our first quarter results reflect continued strong revenue growth with total products and royalty revenues of $728 million, representing an increase of 20% over the first quarter of 2021 and reflecting growth across products commercialized by Insight and Insight Discover products commercialized by our partners. Total product and royalty revenues for the quarter are comprised of net product revenues of $544 million for Jackify, $49 million for other hematology oncology products, and $13 million for Opsalura. Royalties from Novartis of $71 million for Jacavi, and $3 million for Tabrecta, and royalties from Lilly of $48 million for Olumia. Turning to Opsalura, in the first quarter, the growth in prescriptions continued to be strong, leading to gross product sales of $90 million for the quarter. As payers add to formularies, we are starting to see the improvement in the gross to net discount rate. The fully loaded gross to net discount rate decreased from 92% in the fourth quarter of 2021 to 86% in the first quarter of 2022, leading to net product sales for the quarter of $13 million. On our Q4 call earlier this year, we showed you our forecast of the evolution of the gross to net discount rate as depicted by the dotted blue line. The green line represents our actual gross-to-net discount, and as you can see, Q1 was very much on track. We expect the gross-to-net discount rate to continue to decline in Q2 and normalize at a fully loaded rate of 40 to 50 percent between Q3 and Q4, depending on the timing of the removal of the remaining NDC blocks by PBMs and the addition of Opsilura on formularies. Moving on to our operating expenses on a GAAP basis, ongoing R&D expenses of $333 million for the first quarter decreased 13% from the prior year period, primarily due to the continued investment in our late-stage development assets. Total R&D expense of $353 million for the first quarter includes milestone consideration of $20 million for our collaborative agreements. SG&A expense for the first quarter of $210 million increased 36% from the prior year period's total SG&A expense, or 49%, excluding the $13 million one-time payment recorded in the first quarter of 2021. The growth was primarily due to our investments related to the new dermatology commercial organization in the U.S., and the related activities to support the launch of Oxelura. Our collaboration loss for the quarter was $5 million, which represents a 50% share of the U.S. net commercialization loss for Monjuvi. Finally, our financial position continues to be strong as we ended the quarter with $2.5 billion in cash and marketable securities. Moving on to our guidance for 2022 as a result of our strong first quarter performance, as well as signs and expectations of sites reopening and providing us with increased access to physicians, we are tightening our JAK-FI guidance range from $2.3 to $2.4 billion to a new range of $2.33 to $2.4 billion. We are also reaffirming our other hematology oncology revenue, COGS, R&D, and SG&A guidance for the year. Operator, that concludes our prepared remarks. Please give your instructions and open the call for Q&A. Thank you. And I'll be conducting a question and answer session. If you'd like to be placed in the question queue, please press star 1 on your telephone keypad. A confirmation tone will indicate your line is in the question queue. You may press star 2 if you'd like to remove your question from the queue. For participants using speaker equipment, it may be necessary to pick up your handset before pressing star 1. One moment, please, while we poll for questions. Our first question today is coming from Rick from Morgan Stanley. Your line is now live. Great. Good morning. Thanks for taking my questions. So I had a few on Opsalura. First, could you speak a bit more about the manufacturing update you began the call with? Specifically, at this point, how many batches or what portion of the current commercial supply do you estimate has been impacted by some of the texture issues that you mentioned previously? And for the updated manufacturing process, What is the current thinking around the timeline for getting that up and running, and how long do you think it will be before the sampling program can be reinstated? And then I had a follow-up, but maybe I'll ask you those questions first. Vikram, hi. It's Steven. I'll take your question, and I'll just reaffirm some things we said on the actual prepared remarks. And just to reiterate, we know that the texture issue is due to a very small amount of active pharmaceutical ingredient that has come out of solution. And that has obviously been the focus of all our efforts. You know, as Herve said up front, we have implemented a recent process change via a regulatory process called a CBE30 that improves solubility. We've received FDA approval for this, and that process is underway and is improving the dissolution of API. In addition, as Herve said on his prepared remarks via a longer regulatory process called a prior approval supplement, And as is best practice, we've initiated a second manufacturing site, and that is coming on board as we speak to answer your questions specifically. So those units from that second site in the next couple of weeks will be out in the field and with patients. We absolutely expect also within the next week or so, as Barry said in his remarks, to begin the sampling program as well, given that now we have a batch made for that. We don't give specific numbers on percentages, but as we have already said in the call, 68,000 prescriptions with a very small amount of complaints, the rate is obviously coming down, and we expect it to do so now with these improvements as well going forward. Thanks. Got it. That's helpful. And then as a follow-up for Vitiligo, assuming FDA approval in July, would you anticipate providing U.S. sales guidance for Vitiligo the way you have for AD? And more generally, as you've evaluated the opportunity in Vitiligo over recent months, how do you think the commercial opportunity compares to what you're seeing now evolve in AD? So, Vikram, hi. It's Christiana. In terms of the Vitiligo peak sales potential, I think it's a little bit of a different situation than AD. AD is an established market where it was easier to have a sense of not only the size of patients that are affected by AD, but the number of patients that are actively seeking treatment today and how this market looks like and how it may evolve. In the case of vitiligo, as we have discussed in the past, there are no effective therapies now. the majority of patients are not currently seeking treatment. So it's a little bit harder to have right from the beginning a sense of how quickly that will change. And therefore, we may not be in a position from the beginning to give you The peak sales estimates that we did for AD, actually, if you look at vitiligo and you run the numbers, even for the current number of patients that seek treatment, you can see that you can very quickly get to very big numbers, like in the billion-plus type of numbers. So we want to see a bit more of how this evolves before we come out with a peak sales potential for vitiligo. Okay, understood. Very helpful. Thank you. Thank you. Our next question today is coming from Creepa de Veraconda from Truist Securities. Your line is now live. Hi, thank you so much for taking my question. I was wondering, now that you're reinstating the sample program, would this continue if and when Obzodular is approved for vitiligo? especially given that you might need to use it for a slightly longer period of time versus atopic dermatitis in order to see efficacy. And for Aflura and atopic dermatitis, as the drug is being adopted and removed through the launch, do you have a better sense now of duration of therapy, and is there any gap between refills, or you're seeing people refilling at pretty good compliance rates? Thank you. So, Kripa, this is Barry. So, yes, when we initiate, reinitiate the samples for AD, we anticipate we'll still have samples and continue samples throughout the launch of vitiligo. As far as, you know, duration of therapy, it's too early in the launch. I mean, we've launched for six months now. We see new patient growth continuing to accelerate. We see the refills at 23%. We think that's pretty good for right now. And so as far as duration of therapies, we don't know. As far as gaps between tubes, for example, we also don't know. We'd have to go back to the clinical trial to see exactly what those patients did. But it may not be the same in the real world for duration of therapy. What we've said in the past, of course, is that once we stabilize over a period of time, as we get into launch, we anticipate that patients will generally get three to four tubes of Opsalura per year for atopic dermatitis. Thank you. If I can ask a quick follow-up question. One of the KOs we spoke to said that consensus about Opsalura is broadly really good, but the black box label may be affecting uptake in community settings. Is that what you're seeing, or is the... Is the use of the drug impacting how community doctors are looking at it? No, I can't say that community doctors are any different than academic doctors. In fact, in dermatology, there's very big practices that treat many, many patients and their uptake of Opsalura. So our highest decile prescribers, for example, continue to use it. They'll tell us sometimes that individual patients might have more questions about the black box, but they're very used to explaining black box or side effects or potential side effects that any drugs they use may have. So they're comfortable walking patients through that, but we really haven't seen it as a barrier. Great. Thank you so much for taking my questions. Thank you. Our next question is coming from Matthew Pipps from William Blair. Your line is now live. Good morning, thanks for taking my questions. First on the Podium 304 study, following the recent FDA adcom, even though this trial does have a couple of US sites, it's not really comparing Ritofanilamab to the current standard of care in the US. So wondering if you've got FDA sign off on that trial design, or if you'll have to make changes based on kind of the FDA's pushback of Lillicentilamab approach. And then second, at the time of the Monjuvi deal, You had mentioned longer-term upside was really from the potential of Monjuvi plus parseclicib. So I assume given the recent FDA ODAC on PI3 kinases and the decision to withdraw the parseclicib NDA, that option might be kind of gone now, but just wondering what it means for the top-line study. And does the secondary OS endpoint in the myelofibrosis combination studies become, you know, really important after that ODAC, or does it? maybe not impact myelofibrosis as much. Thanks. Matt, hi. It's Steven. Thank you for your question. So just for everybody else, Podium 304 is our IV checkpoint ratafanilamab in non-small cell lung cancer. It's a replication, if you will, of the initial PEMBRA approval in that indication in that it's in a combination with chemotherapy. versus checkpoint inhibitor alone. And as you point out, it's a global study with sites all over the world, including in the United States. So we think that is the central difference from the Lilly issue they had with their checkpoint inhibitor, where it was China-only data. So we have representation across Western Europe, Eastern Europe, Asia, and a small amount of U.S. sites. So we think from a diversity of subject point of view, we're well covered with that. You know, the modeling of the studies exactly from a statistical point of view, in keeping with what was seen in the initial PEMBRO approval in that indication, that was discussed with regulators and, you know, feedback was given and aligned with them. So we feel... We are in a completely different position to what was the central complaint against the Lilly submission with their checkpoint inhibitor in non-small cell lung cancer, given the diversity of our population across the world, the size of the study, replication of the statistics to achieve the same endpoints, which again wasn't exactly the case with the ODACU reference. For tafacitimab in combination with paraclisib, you know, we remain interested despite some of the negative halo on PR3-delta inhibitors for a number of reasons. Firstly, because, you know, we know this is a tremendously active doublet from work that morphosis have done before with tafacitimab with idealisib in that having upwards of 100% response rate. So we are absolutely, you know, continuing to look at our data in TopMind, which is ongoing across different disease segments, including lymphoma, including chronic lymphocytic leukemia. But you are right. I mean, there is a large increase in the safety of DELT inhibitors, and it's something we'll have to consider very carefully before going forward with any bigger study there. We hope in the second half of this year to have decent data sets for the different subgroups of diffuse large B-cell lymphoma, low-grade lymphomas, chronic lymphocytic leukemia with that doublet, and then we'll have to make decisions in keeping with the context you allude to. I'm glad you also brought up the myelofibrosis program because, again, it's RUX in combination with paraclisib in two different settings. So there's a first-line study, which is enrolling very well, It's a goal enrollment of around 440 patients, and it's a very clean study in that it's RUX plus paraclisib versus RUX alone in that indication with a SVR 35% decreased primary endpoint. So the differences, again, given the milieu you talk about with PI3-Delta inhibitors, is that this is a randomized study. at a different dose of a delta inhibitor. You know, there's no induction therapy. It's a standard constant dose. It's a defined treatment period. The studies were agreed to and signed off with regulatory authorities and does have, as you point out, also the ability to capture overall survival. So we think we're well covered in that indication. The suboptimal study there is in about 220 patients, also enrolling very well. should complete next year, different endpoints, again, a randomized study, and in capture, you know, primary endpoints as well as secondary endpoints that will include safety. So, again, a different dose, and we think we well covered there as well. But we're not immune to the fact that the road for DELT inhibitors will be extremely safety-focused as they should be. Thanks. Thanks, Stephen. Thank you. Our next question is coming from Brian Abrams from RBC Capital Markets. Your line is now live. Hey, thanks. This is Leonid on for Brian. So thanks for providing all the gross to net color. I was just wondering if I could ask a little bit more on that. I guess in previous calls, you mentioned that you have levers to adjust gross to net on your end. So I'm curious, you know, if the improvements in gross to net are largely from better insurance coverage or if also you're adjusting any of the patient assistance programs, and I guess, you know, for how long and to what degree do you expect these patient co-pay assistances to last? And then if I can just squeeze in one more, you know, have you had any sense that there might be patient and doc perceptions that because insurance isn't covering UpCellera, that's actually limiting willingness to write scripts? And so I guess when you see better coverage, are you expecting that there might be a script inflection as well for UpCellera? Thanks. So Leonid, it's Barry. So on the gross to net, so as we said, as we continue to get better coverage as the NDC blocks are removed, our gross to net, as Christiana said, is going to improve in the second quarter, in the third quarter, and in the fourth quarter. So we have 146 million lives that are covered now. So they have access to the drug. And as far as our full buy down program goes, knew from the very beginning when we launched this drug that we wanted to have a generous patient assistance program where if a dermatologist wrote the prescription, the patient would be able to get it regardless of NDC blocks. As those NDC blocks are removed and utilization criteria are written, then we take down those full buy-down programs, and that actually does improve our gross to net over time because it's just unnecessary now. Insurance companies are going to pay for it. As far as coverage goes, I mean, just as I said, the prescribing is not impacted. We did not want it to be impacted because we had a generous patient assistance program in place, and there really hasn't been any barriers. As prior approvals, of course, come into place, dermatologists and their offices are very familiar with going through the prior approval process. Every prescription for psoriasis, every prescription for atopic dermatitis for branded drugs all have to go through prior approval. So there really isn't the barriers, and we tried to remove those barriers as much as we could so people could get great experience with Opsalura, and we know that they're really having Great experience with Opsalura. Physicians, dermatologists are telling us they're having great experience with Opsalura. So we think the uptake that we're experiencing now is going to continue throughout the end of the year and beyond. Thank you. Our next question is coming from Corey Kazimoff from J.P. Morgan. Your line is now live. This is Gavin. Thank you for taking our question. There's been a lot of focus on Opsalura, so I'll stay away from that. But just on the pipeline, I guess, the adenosine program and CD73, this has been an increasingly competitive area of development. Perhaps you can just frame some expectations for us on the initial data we're expected to see later this year. Thank you. Hi, it's Steven. Thanks for bringing that up. Yeah, we have, you know, all three components of the program that's needed are in our pipeline. So we have a small molecule, potent and selective A2A, A2B inhibitor. We have a large molecule, CD73 inhibitor, and then we have the combination availability with checkpoint inhibitors, either IV and ratafanilamab or with the oral PD-L1 program. So that's somewhat of the uniqueness. Then in terms of, you know, the A2A, A2B, and CD73, you know, we are slightly behind the competition, but we have the ability, you know, to learn from them and see where they go. And you're right, you know, there is a lot of interest in inhibiting adenosine in the tumor microenvironment, either through a doublet or triplet, as I point out, The dose escalation and expansion phases for the A2A, A2B have gone very well and on track with data this year, and CD73 slightly behind, but also on track, and now we're doing the doublets. So we're progressing well with the program and expect to provide you some updates in the second half of 2022. Thank you. Great. Thank you. Your next question is coming from Mara Goldstein from Azuho. Your line is now live. Oh, great. Thanks so much for taking the questions. I just wanted to ask, I know we talked a lot about Apsalura, but I just wanted to get a little bit of clarification on the gross net steady state at 40% to 50%. And is that also anticipated, you know, in a post-Vitaligo commercialization, that that would be sort of the long-term steady state? And then also, is there any update on the NDA filing for RUX QD? Sure, I'll take the first part of your question, Mara. So yeah, so the gross net that we say 40-50% includes the Vitiligo launch, and going forward with AD and Vitiligo, our gross net will try to keep in that range as we possibly can, but we're very confident Going through the year, as we said, by the end of the year, second half of the year, 40% to 50% is our goal. I'll turn the other one about RUX QD over to Stephen. Hi, Mark, Stephen. So our RUX once a day file is going in now, this half of 2022. The critical path was stability, which is complete. We expect a standard 10-month review period. So it should be first quarter of 2023 that we'll be expecting that approval. The reason we expect it to be successful is that from a bioavailability, bioequivalence point of view, we met the criteria that's in the FDA guidance for area under the curve. So we're within that range that's required for the multiple dose strength. And now that stability has been complete, you know, we have confidence in that submission and should have it actioned around the first quarter of 2023. Thanks. Thank you very much. Thank you. Our next question is coming from Mark Fromm from Cowan & Company. Your line is now live. Thanks for taking my questions. In respect to vitiligo, it's a combination of Barry and maybe Stephen. Just for the label, what think you guys view as kind of the important elements to get in there from a commercial perspective, you know, particularly to drive, as Krishan mentioned, you know, that the increased patient flow into the clinic seeking treatment and kind of what are the elements of the TRU-V studies that, you know, probably aren't going to be in the label but are going to be important to kind of stress to the community to drive that out? I mean, you know, I'll turn it over to Stephen. I'll try to give you an answer to your question. I actually think the most important thing is just that this is the first and only drug approved for repigmentation of vitiligo, and there really should be no barriers, really, other than that. If Stephen has other viewpoints about what should be included or not included in the label, I'm not sure. Yeah, hi, Mark. It's Stephen. You know, I think if you go back to the eligibility criteria from the two large Phase III studies, You know, the age would be key, you know, 12 and above. The body surface area involvement up to 10%. And in the dosage and administration section, we feel that it's likely to reflect the fact that it's different from AD and that, you know, continuous dosing is needed to achieve the benefits I spoke about in my prepared remarks, which are quite remarkable when you get, you know, over time, you know, 20% absolute percentage improvement in facial VASI 75 between week 24 and week 52. On the week 52 point, you know, the initial submission was obviously on the primary endpoint on week 24. During the four-month safety update, we were able to provide some of the 52-week data. But now, you know, with the three-month extension on the PDUFA, we've been able to also supply more of that data. So that would be a good upside. and obviously it will depend on the FDA and the negotiations that are forthcoming to have the complete 52-week data set in. So reflect the entirety of both the efficacy and the safety data. Thanks. Okay, that's helpful. Maybe, Stephen, for 707, the updates coming in the second half across some of the other dermatology indications, what do you view as meaningful responses in hydrogenitis you know, to move forward with this type of mechanism, given kind of all the labeling concerns around JAK. And then on the vitiligo side, is the long-term plan there with that to kind of have people on oral therapy chronically, or is it more of just get them to a place where OpsAlert becomes a better option for them, and then they transition to OpsAlert? Yeah, thanks, Mark, for both questions. So hyaluronidazeprativa, you know, distressing condition for patients, A lot of unmet need. There is an approved TNF inhibitor, but not widely used in this indication, probably due to somewhat a lack of efficacy with it. It's a condition that involves abscesses, nodules, and scarring in areas of the body like the armpits, axilla, and groin. And it can be very distressing psychologically to patients as well. The established endpoint for the one approved drug is something called the Hiscar endpoint. It attempts to capture the improvement in abscess and nodule formation and seems to be, you know, the regulatory endpoint that's needed. But you're right. It's tricky to measure. There's both object and subjective components to it, but the, you know, our Phase II data, We'll show you, we feel is very encouraging for the effect of a JAK inhibitor in this unmet need area. Just to address, you know, the safety part of what you said, you know, we fully expect, given that this is an oral JAK inhibitor, you know, in an inflammatory condition, clearly an inflammatory condition, that it's likely that we'll be dealing with black box class labeling language. I mean, that has been, you know, known to us for a while now. And so we feel, you know, the therapeutic ratio is important, right? So in settings of high unmet need with a lot of severity, with the efficacy that we desire, you'll get to the desired therapeutic ratio that's needed to use the drug. So that's the HS component. For vitiligo here, I just want to stress that it's different from the cream indication. So this is for people with more extensive body surface area involvement. The principal eligibility criteria here is 8% or above body surface area involvement. So it's a little confusing because the cream is 10% or below, and this is 8% or above, so there's a little bit of overlap. But it gets to the therapeutic ratio question again, that these are people with extensive vitiligo, that there'll be more acceptance to use, you know, an oral JAK inhibitor with a different therapeutic ratio. We know it's efficacious. I mean, you know now from the CREAM data, from multiple reports with oral JAK inhibitors, that you get, you know, repigmentation here. But you'll have to have, you know, suitable safety. And again, you know, we're very likely to be dealing with the black box labeling down the park when it gets there, and that'll fix, you know, factor into our decision making. with that particular indication. Thanks. Okay, thank you. Thank you. As a reminder, that's star one to be placed into question Q. Our next question today is coming from Jay Olson from Oppenheimer. Your line is now live. Hi, this is Chong on the line for Jay. Thanks for taking the question. I guess on the oral PD-L1 program, I'm just curious, any learnings like dosing optimization or tumor selection that you can apply to the development of the follow-on molecules you are prioritizing right now? And also, between these two follow-on molecules, would you further prioritize one over the other? If so, when will that happen? Thank you. Hi, it's Steven. So, you know, in terms of dose, I don't know exactly what you're alluding to, but just to make... broad comments, and across all areas of the FDA, but particularly in oncology now, there's Project Optimus, there's a refocus on getting the dose correct. It's likely that everybody in this space now will have to do a lot more dose work, a lot more exposure efficacy analysis, a lot more exposure toxicity analysis, and may even be down the park an area where we'll be taking more than one dose into pivotal studies. And, you know, you cannot argue that getting the dose right is critically important, that this effort from the regulators will be a big deal. And, you know, we've already adapted, like many other companies, to have the right resources now to do these analyses and get it right. For oral PD-1 specifically, we do have a pharmacodynamic marker. We can measure PD-1 inhibition in peripheral blood mononuclear cells. So we know, you know, that we get in the right degree of inhibition. And just to be clear, we want 90% or above inhibitory concentrations of that PD marker constantly when we dose our drug. So we're working on that now with both 280 and 318. You know, your question around what histologies are important, it somewhat remains to be seen. I mean, given that we now know these are all active compounds, we've seen activity in areas that are known to be IO responsive, so the hotter tumors, if you will, microsatellite high tumors are also of particular interest here. So that's currently the main focus. As I said in my prepared remarks, You know, given that it's oral, that it may differentiate on safety with its quick off rate, you can do oral-oral combinations. People can go home and not need to come into a clinic setting for infusions. It could lend itself more also to adjuvant and maintenance settings. But we're not there yet in declaring what particular histologies and what area we're going to particularly go after. We hope, though, to be making those decisions towards the end of this calendar year, perhaps early next year, on where we'll be going from a registration point of view. Your last question as regards, you know, will we take both forward or only one in terms of 280 and 318? I still think it's a little premature to answer. We have both in the clinic at the moment. Both are enrolling well. Both have shown tumor reduction in terms of shrinkage and no neuropathy with either agent yet. And we'll do more of what I was talking about in terms of dose optimization and modeling before declaring which particular one we'll take forward in oncology. But, you know, my own view at this juncture, there may be interest in non-oncology settings, for example, enhancing hepatitis B virus-directed therapies, et cetera. So there may well be utility down the park in having a second compound for non-oncology settings. It's just a little early to declare which way we'll go. Thanks. Great, thank you. Thank you. Next question today is coming from Leon Wang from Bank of America. Your line is now live. Hey, thanks. This is Leon Wang calling forward to Zain Ahmad. I guess one more question on Opsadora growth to net. You previously mentioned that one of the benefits of talking to payers relating to Biddleigo is that when your current negotiations And when vitiligo is approved, you don't have to necessarily go back to payers to negotiate brand new contracts. Now, if that's the case, and would you say some payers are waiting for the label of vitiligo to be approved before kind of finalizing the payer coverage negotiations? So I'm trying to understand the cadence of when you might see that next step. basically percent lives covered and improvement from that dynamic. And my second question is, previously you mentioned the gross to net range could normalize anywhere between the 30 to 50%. Today you said expect that to be around 40 to 50% by the end of 2022. But just as a clarification, going forward beyond 2022 DC, I guess potentially gross net discounting to be somewhere lower, perhaps in the 30% to 40% range. Thank you. So Leon, this is Barry. So as far as negotiation goes for Vitiligo, no, we don't have to go back. So there's a couple of different things. One is that you're talking about contracts with PBMs for the large part. So that's one part. So those contracts are at least ones fully completed. And remember, those are divided into two parts. So the three big PBMs really cover about 80% of the commercial lives in the country. But think about that as variable and non-variable. About 50% of patients are, let's call them variable, where in fact the plans, the insurance plans themselves, like you and I have, They, in fact, can make their own decisions and, in fact, write their own utilization criteria about how the drug's being used. So we don't have to go back and negotiate. And then the other half, sorry, are the ones that you might say are a preferred formulary where they have true NDC block. So we have one of the big PBMs that are fully NDC block removed and the rest of the variable plans have written their utilization criteria. And then, in fact, when we launch FIDELIGO, we don't have to go back and negotiate with the PBMs for new contracts. But utilization criteria, once FIDELIGO is launched, will be written by the plans. And it will take weeks to months for those utilization criteria to be written for each of the various insurance plans, of which there are many throughout the country. Before launch, no, they're not going to have utilization criteria. Before approval, they're not going to have utilization criteria written for vitiligo. In fact, even though they know about the phase three data for Aptolora and vitiligo, They're not going to write a plan until it's approved because they just don't want to take time to do that. But we're educating, of course, payers that this is in fact coming and they know it's coming and we know that they're going to write utilization criteria for it because most of them have utilization criteria already for other products, not all of them, but some of them do. for things like light therapy and so forth. So we know that utilization criteria would be written for vitiligo. As far as the gross to net is concerned, at least for over this year, last couple of quarters, we've always said 40 to 50% gross to net is our goal, and that's what we're shooting for, particularly as we continue to negotiate with the various payers. Thank you. Our next question today is coming from Andrew Behrens from SVB. Your line is now live. Hey, this is Chris on for Andrew Behrens. I was just wondering if we could get a little bit more color on the prescriber details for Opsalura. How many dermatologists and how many general practitioners are in the mix for Opsalura? And are those docs primarily those that you've detailed to from the Salesforce, or are you seeing more of a halo effect? And then just as a quick follow-up question, I'm wondering if the new product manufacturing method for Apsolura is going to change anything fundamental about the drug, the PK or, you know, the pH or anything like that. And if so, is that going to concern any of the regulatory agencies in terms of the safety and efficacy? So, Chris, I'll take the first part and hand the second part over to Stephen. But as far as, there's about 8,000 dermatologists in the United States or so. And general practitioners, no, we don't really see any. I mean, they could obviously write for Opsalura, but we really don't see any. All of our detailing, all of our educational work goes towards dermatologists and their offices. But remember, especially in dermatology, nurse practitioners and physician's assistants are very important. They're prescribers. There's tens of thousands of them. So when we call on dermatologist offices, we of course call on the nurse practitioners. And the physician's assistants are very important. In fact, the medical assistants as well that are very important, particularly when it comes to reimbursement. So it's all direct education. And we're working very well and have reached all of our top prescribers. And we'll continue to educate all of the dermatologists nurse practitioners, PAs, and the offices as we move forward. For the product manufacturing changes, I'll turn it over to Stephen. Yeah, Chris, thanks for your question. I mean, the top line clear answer is there's nothing fundamental changed on the drug currently as regards PK or PH. The CBE30 change, you know, by the regulations is a mild to moderate change that specifically doesn't do that. And the prior approval supplement change was bringing a new manufacturer on board. using the same process. In fact, you specifically do not want to do what you allude to because that would require you to redo all your clinical studies. So you have to be very careful to not make changes that affect those in any substantial way, either PK or PH. So thanks. Got it. Thank you very much. Thank you. We've reached the end of our question and answer session. I'd like to turn the floor back over to Christine for any further closing remarks. Thank you all for participating in the call today and for your questions. The IR team will be available for the rest of the day for follow-up. Thank you and goodbye. Thank you. That does conclude today's teleconference and webcast. Let me just connect your line at this time and have a wonderful day. We thank you for your participation today.