[
    {
        "date": "2022-08-02T08:00:00-04:00"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hello, and welcome to the Insight second quarter 2022 earnings conference call and webcast. At this time, all participants are in listen-only mode. A question and answer session will follow the formal presentation. If anyone should require operator assistance, please press star zero on your telephone keypad. As a reminder, this conference is being recorded. It's now my pleasure to turn the call over to Christine Cho, head of investor relations. Please go ahead, Christine."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Kevin. Good morning and welcome to Insight's second quarter 2022 earnings conference call and webcast. The slides presented today are available for download on the investor section of our website. Joining me on the call today are Irvay, Barry, Steven, and Christiana, who will deliver our prepared remarks, and Dash, who will join us for the Q&A. Before we begin, I'd like to remind you that some of the statements made during the call today are forward-looking statements and are subject to a number of risks and uncertainties that may cause our actual results to differ materially, including those described in our reports filed with the SEC. We will now begin the call with Hervé."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Christine, and good morning, everyone. In the second quarter, revenues increased 29% year-over-year, reaching $911 million. JAKA5 net cells grew 13% to 598 million, benefiting from growth in new patient start in all three indications. The contribution from our other hematology and oncology products continued to increase as the launches of PEMASIR and MINJUVI progressed in Europe and Japan. We also made significant progress with the launch of OBSELURA in atopic dermatitis, where we now have the third PBM-GPO contract signed. This is a key milestone in achieving broad formulary access and an important step towards accelerating the growth of Opsalura net revenue. As we shift from free drug to paid prescription, we are seeing some temporary delays in the filling of prescription, which had an impact on second quarter revenues. However, patient demand and satisfaction remain strong, and improvements in reimbursement are translating to an increase in covert claims with a significant increase seen in July. These metrics are pointing to a continuation of a successful launch in atopic dermatitis. Turning to slide 5, two weeks ago, Opzera was also approved for the treatment of non-segmental vitiligo, becoming the first and only therapy for repigmentation for this patient. The approval of Obzera was a momentous occasion for the millions of people living with the disease and generated a tremendous amount of excitement in the dermatology community with advocacy groups and patients. Turning to slide six, we also had multiple approvals this quarter with our partner products. Jacavi was approved as the first posterior systemic treatment for both acute and chronic GVSG in Europe. Olumiant was approved as the first and only systemic treatment for alopecia areata in the U.S., Europe, and Japan, and Tabrecta received European approval for a subgroup of patients with non-small cell lung cancer. Together, these approvals provided insight with $130 million of milestone revenues and will contribute with royalties to our future revenue growth. Finally, looking at some of the additional highlights of our pipeline on slide 7, povercitinib formerly known as 707, is now in preparation for a Phase III study in HS, following the positive results from our Phase II trials. As part of the LIMBER program, IND clearance was received for CK0804, Telanco's cord blood-derived TREC cells, as add-on therapy to roxalitinib for the treatment of myelofibrosis. We also received FDA clearance FDA acceptance of the NDA submission for QD-roxalcinib with a PDUFA date of March 23rd. And lastly, in early development, we expect to initiate a clinical program later this year with 459, a LAX3 PD-1 bispecific antibody developed in partnership with Merus. We have multiple ongoing studies across dermatology, limber, and hematology-oncology, as you can see on the right. where each represents a meaningful opportunity and puts us in an excellent position for future growth and diversification. With that, I'll turn the call over to Barry."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Hervé, and good morning, everyone. Starting with Opsalora, the launch in atopic dermatitis continues to be strong, and we are very pleased with the progress that we have made across a number of important metrics. To date, over 10,000 physicians have prescribed Opsalora, with new writers being added each week. Physicians continue to report a high level of satisfaction with Opsalora, with 67% stating that they are highly satisfied, up from 46% earlier this year. Additionally, in a recent poll, physicians indicated nearly half of their AD patients would be appropriate candidates for Opsalora, up from 37% earlier this year. Efficacy, including rapid age reduction, as well as tolerability and the ability to use Opsalora in sensitive areas remain the key product attributes and we expect these attributes to continue to drive demand for Opsalura in AD. Turn to slide 10. Earlier this month, we announced that we now have signed contracts with the three largest PBM GPOs, an outstanding achievement 10 months into launch, and a key step towards reaching our steady-state gross-to-net goal. The contract with the third PBM became effective July 1st, and individual plans will now be adding Opsalura to their formularies. The charts shown on this slide is our internal H67 data, which is the number of Opsalura units shipped from wholesalers to pharmacies. With regards to IQVIA data, there has been an increased variability with the data in recent weeks. The overall trend, shown by IQVIA data, is representative of the actual kinetics. However, the number of filled prescriptions, as reported by IQVIA, are being over-projected. It is important to take away from this slide a couple of points, both on Q2 performance and on recent trends. In the second quarter, as NDC blocks were removed and Opsilor was added to formularies, pharmacists and dermatologists began to shift from the process of the free drug program to going through the formulary process. this shift has two different effects. One is a temporary delay of filled prescriptions, which you saw in the second quarter, and two is the positive impact on covered claims, the benefit of which will be more pronounced beginning in Q3. We are already seeing a return of 867 demand to within the range of our highest point since launch. Additionally, the percentage of covered claims, as shown by the red line, has risen rapidly from the mid-20% range at the end of June to nearly 55% today. We anticipate with the combined effect of an increased number of filled prescriptions and improving gross to net, Opsalura will have a more meaningful contribution to net sales in the second half of this year. On slide 11, we're turning to Vitiligo. This slide captures some of the highlights from Opsalura's FDA-approved label as the first treatment for repigmentation in Vitiligo. This is a historic approval for patients living with this disease, and the approved label includes a number of important points that will help to drive the success of the product in this indication. Opsalora is approved for patients 12 years of age and older and can be applied to affected areas up to 10% BSA. The label allows for continuous use of Opsalora anywhere on the body, including sensitive areas, with no limit on duration of use. The 52-week efficacy data, which has been included in the label, demonstrates the continued improvement in repigmentation with longer duration of treatment. Highlighting the importance of staying on therapy, the label also notes that a satisfactory patient response may require treatment with Opsalura for more than 24 weeks. And lastly, Opsalura was well tolerated with application site acne as the most common AE in 6% of the patients. turning this slide 12 for the launch in Vitiligo. Remember, these are the same target physicians as with AD, where we'll be able to leverage our existing relationships with physicians and to be able to benefit from the high level of satisfaction and experience that many already have with Opsalura today. Our launch is underway with a comprehensive multi-channel marketing campaign that will ensure broad and consistent reach to effectively drive awareness, and importantly, to educate physicians on Opsalura's mechanism of action, its impact on vitiligo, and its unique clinical profile. To support the launch of Opsalura and vitiligo, from the patient perspective, we're focusing on raising awareness and providing best-in-class support. We plan to build awareness and activate patients living with vitiligo through a strong presence on social media, print, and eventually TV. We're also partnering with advocacy groups where there has been an enormous amount of excitement for Opsalora and Viligo. This will be the first treatment for repigmentation available for these patients, and the safety and efficacy profile has been proven in the largest randomized clinical trial in this setting. It is important to drive patient adherence and compliance on Opsalora. This will, of course, begin with physicians setting the right expectations, and we will provide tools to help ensure patients have successful treatment experience. We will launch a new Vitiligo app along with other tools designed to help patients track their treatment and response, as well as provide appointment reminders, which we expect to have a positive impact on patient adherence. And of course, we will continue to provide access to Opsalura with copay assistance that can lower copays to as low as $10 a month. We see this launch in Vitiligo as one of the largest opportunities for our franchise. We are starting with a very good label and we have heard from patients and advocacy groups around the country there is a large established medical need. This together with the momentum from the launch in AD will support a very successful launch. Moving on to Jackify on slide 14. Jackify net sales in the second quarter grew 13% year over year to $598 million. Total patient demand grew across all indications, and the growth in new patient starts continues to remain above pre-pandemic levels. GVHD patient growth of 18% year over year was driven mainly by the launch in the chronic setting. With strong demand for Jackify, we are again raising the bottom end of our Jackify full-year net product revenue guidance from $2.33 billion to a new range of $2.36 to $2.4 billion. Turning to slide 15, Manjubi net product sales in the U.S. grew to $23 million in the second quarter, with more use moving into the second line setting and a gradual improvement in duration. Minjubi net sales were $4 million, where the launch is ongoing in Germany and share in second line continues to increase. Temazir worldwide net sales were $19 million, with the launch currently ongoing in Europe and Japan. With that, I'll turn the call over to Stephen."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Barry, and good morning, everyone. We are making significant progress within our dermatology pipeline. As you know, Opsalura received FDA approval in vitiligo a few weeks ago and has now obtained two important FDA approvals in less than a year. We will continue to pursue other indications that may expand the use of ruxolitinib cream to more patient populations in need. Additionally, we are developing our oral JAK1 inhibitor, ovocitinib, formerly INCV54707, in higher adrenitis suprativa, vitiligo, and purigo nodularis, all of which are in Phase II, and as Hervé mentioned earlier, we are preparing a Phase III in higher adrenitis suprativa. There is significant potential with each of these indications where there are limited treatment options, or in some cases, No FDA-approved treatments. One of the interesting studies we are doing with ruxolitinib cream is the long-term extension of the TrueV studies, where we are evaluating the duration of response following the withdrawal of Opsalura. On the left, you can see the study design for the TrueV studies. At 24 weeks, after the primary endpoint has been reached, patients could roll over into the long-term extension study for an additional 28 weeks. At 52 weeks, patients who achieved at least a facial VASI 90 response are then randomized one-to-one to receive 1.5% ruxolitinib cream BID or vehicle. Additionally, those patients who did not achieve at least a facial VASI 90 response at 52 weeks are maintained on therapy with 1.5% ruxolitinib cream BID. The primary endpoint of the study is time to relapse in those who are placed on vehicle with numerous secondary endpoints. Moving to slide 19, we are announcing today the most recent compound moving into clinical development, INCA32459, a LAG3 PD-1 bispecific antibody. INCA32459 has been shown to be superior to independent LAG3 and PD-1 blocking in the LAG3 PD-1 dual receptor assay and has increased cellular activity compared to a combination of the monoclonal antibodies. Additionally, in a humanized mouse model, 459 controls tumor growth better than the combination and gives us confidence that it may provide differentiated pharmacology and a clinical profile relative to current treatments. On the next slide, we have a number of opportunities within Limba to expand our leadership in MPNs and GVHD. with multiple programs reaching important milestones in the second half of 2022 and into 2023. The NDA was accepted by the FDA for QD ruxolitinib, and later this year we expect initial data from the BET and ELK2 programs in combination with ruxolitinib, and we plan to start a Phase I program evaluating the combination of CK0804 and ruxolitinib in myelofibrosis. The second quarter was a very successful quarter for Insight, with multiple product and partnered product approvals, and we look forward to a busy second half of the year. I'd now like to turn the call over to Christiana for the financial update."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Stephen, and good morning, everyone. The second quarter results reflect continued strong revenue growth with total product revenues of $664 million. representing an increase of 15% over the second quarter of 2021. Total product revenues are comprised of $598 million for Jacobi, $50 million for other hematology products, and $70 million for Opsalura. Total royalty revenues for the quarter were $118 million and are comprised of royalties from Novartis of $84 million for Jacobi and $4 million for Tabrecta, and royalties from Lili, of $30 million for Illumiant. Jacovi and Illumiant royalties for the quarter were negatively impacted by FX headwinds, while Illumiant royalties were also impacted by a decrease in net product sales of Illumiant for use as a treatment for COVID-19. Finally, total revenues for the quarter grew to $911 million, a 29% increase over the prior year period as a result of the growth in product revenues as well as $130 million in milestone revenues related to the multiple partner product approvals achieved this quarter. Turning to Opselura, we recorded gross product sales of $89 million in the second quarter. As payers add Opselura to Formularis, we are continuing to see improvement in the gross-to-net discount rate. The fully loaded gross to net discount rate decreased from 86% in the first quarter of 2022 to 81% in the second quarter of the year, leading to net product sales for the quarter of $17 million. As you can see on slide 25, the evolution of the actual gross to net discount rate in Q2, represented by the green line, continues to be very much on track with the forecast we showed you earlier in the year. We expect the gross to net discount rate to continue to decline in the second half of the year and normalize at a fully loaded rate of 40% to 50% by the end of the year. Moving on to our operating expenses on a gap basis, ongoing R&D expenses of $344 million for the second quarter increased 2% from the prior year period, primarily due to the continued investment in our late-stage development assets. SG&A expense for the second quarter of $253 million increased 50% from the prior year period. The growth was primarily due to our investments related to the new dermatology commercial organization in the U.S. and the related activities to support the launch of OxyLura in atopic dermatitis and pre-launch activities for vitiligo. Our collaboration loss for the quarter was $3 million, which represents our 50% share of the U.S. net commercialization loss for Monjuvi. Finally, we ended the quarter with $2.7 billion in cash and marketable securities. Moving on to our guidance for 2022, as a result of our strong second quarter performance, we are tightening again our JAKAFI guidance range from $2.33 to $2.4 billion to a new range of $2.36 to $2.4 billion. We are also reaffirming our other hematology oncology revenue, COGS, R&D, and SG&A guidance for the year. Operator, that concludes our prepared remarks. Please give your instructions and open the call for Q&A."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Certainly. We'll now be conducting a question and answer session. If you'd like to be placed into question queue, please press star 1 on your telephone keypad. A confirmation tone will indicate your line is in the question queue. you may press star two if you'd like to move your question from the queue. For participants using speaker equipment, it may be necessary to pick up your handset before pressing star one. One moment, please, while we poll for questions. Our first question is coming from Salveen Richter from Goldman Sachs. Her line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning. Thanks for taking my questions. Two for me here. On Opsalura, how do you know that 2Q revenue is is not driven by lower organic demand as you shift from free drug versus reimbursement dynamics? And then secondly, for the drug in vitiligo, could you just speak to the education required around time to onset of effects so that patients do not expect an immediate improvement?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "You know, I think the, well, what we're saying about the revenue is really was mostly a gross to net situation that Christiana pointed out that that's what we forecasted in the beginning from Q1 to Q2 is consistent where our gross to net was going to be. And then our demand, as you see in the sort of middle of the quarter, we ran into a little bit of a bump in the demand when we switched from the free drug program to the to fully covered for patients that are covered under the contracts that we signed. And as you can see, and that's why we showed you the graph on slide 10, is that we believe that we've overcome these situations, that we have most of the NDC blocks removed. They're continuing to be removed as we move into the third quarter here. And it will only get better, but our last week of demand was in fact the biggest week of demand that we had. in the last week of July, and we believe that that trend line for demand is going to continue. The second question, as far as little I go, is maybe Steven."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yes, Sylvain, thank you for asking the question. You know, I think if you go back to label, this is why it's just so great to have the 52-week data incorporated in the label, while unexpected, because it's obviously not in the placebo randomized period. To have it in was a really good win, because we can educate within label now to what was seen. And so just to reiterate, you know, in terms of the primary endpoint, the facial VASI at 24 weeks and then at 52 weeks, you see this continued absolute increase of another 20 percentage points in the primary endpoint from the 24-week endpoint to the 52-week endpoint, talking to exactly what you were alluding to, that there's this gradual time to onset in terms of improvement in repigmentation. And it's actually reflected multiple times in the label with the efficacy data, with the dosing guidance that allowed continued use, and with a statement that says you may have to wait upwards of 24 weeks or beyond to see improvement. So we can use both the commercial channel in terms of promotional activities, because it's within label, and then obviously appropriate medical communication to continually educate both the treaters, the physicians, as well as patient advocacy groups, et cetera, that there is this continued improvement over time. And it'll be very much part of our efforts across the whole spectrum involved in the dermatology program."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Thank you. Our next question is coming from Tahzeen Ahmad from Bank of America."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, good morning. Thanks for taking my questions. With regards to your guidance to 40% to 50% growth to net by the end of this year, I know you've talked about you're happy with the launch trajectory thus far, but what are you feeling particularly confident about? What absolutely needs to happen for you to reach that target? Is it more penetration into formulary? Is it a strong launch for Vitiligo out of the gate? Just help us try to understand how, because you're still at 81%, which is definitely an improvement, but still you know, with Steve Klein to get to where you want to be. And then secondly, for Vitiligo, I'm just wondering, in the early days of the launch, are you able to compare how scripts have been relative to the early days of when AD was launched? Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So, Tanzine, so to get to 40%, 50%, really, we just take that from the contracts that we already signed. So the rebates and fees that we have to pay – That's really what's going to drive our gross to net. Our increased confidence in our net revenue, it will be based on demand. So we do truly see that we're going to get to this 40 to 50% gross to net by the end of the year, just because a lot of the work is out of the way. Now, utilization criteria has to be written as a downstream plan for many of these things, particularly for vitiligo. But there's no NDC. There's mostly no NDC blocks now. More NDC blocks continue to be removed. But they all will be removed relatively soon. And that'll take us to this target that we've talked about. But really, it's going to be the demand that we continue to see great enthusiasm around AD. And certainly, vitiligo hasn't even started yet. Now, as far as vitiligo, well, versus AD. AD, as we've talked about before, I mean, there's 30 million patients in the United States that might have atopic dermatitis. We say that there's 5 million patients that are in our treatable population. That's a whole lot of patients that were already seeking treatment. In terms of vitiligo, we talk about 150,000 to 200,000 patients that are actively seeking treatment for their vitiligo. So there's far fewer patients that you can imagine that are going to come in perhaps right away, but we do absolutely see demand out there when we talk to the advocacy groups, when we talk to our patients, when we talk to the dermatologists who treat these patients, the demand is there. And then there's millions of patients beyond the patients who are actively seeking treatment for vitiligo today that we think will re-enter and go back to their dermatologist to seek treatment just because now there's something effective that's going to be available. So we don't necessarily see that there's going to be a gigantic bolus today. We do know that patients are coming in today and getting scripts filled for vitiligo and getting it paid for, but we don't really know how many at this point. But it will take a number of weeks to a number of months, in fact, for all of the plans to write the utilization criteria for vitiligo. But we have a great label, and we think that's what's going to be put into the utilization criteria by the downstream plans."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks. Our next question is coming from Brian Abrams from RBC."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi. Good morning. Thanks for taking my question. Also on Opsalura, where are you seeing Opsalura being placed on formularies in a topic term relative to your expectations? I guess I'm wondering whether the slower growth in end-user use is because you're now facing prior authorizations and step edits, or if it's just a matter of temporary miscoding at the level of the pharmacy as you transition from free drug. And then I guess along those lines, it looks like another question on gross to net, it looks like your expectation range for third quarter is somewhat broad. I'm wondering if you could talk about maybe some of the puts and takes there and the degree to which this is going to be where you end up, I guess, for third quarter will relate to some of the formulary placement elements from the third PBM that got online in July. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure, Brian. So our expectations are for where they're placed on formulary. Again, it's the utilization criteria that downstream plans end up putting into place for AD. So most of the plans can have one prior therapy or two prior therapies at TCI or TCS. All of our contracts are written so that the downstream plans can take advantage of rebates by deciding to put it after one step or two steps, but most of them are just there. They're at one step or two steps, and we think that'll evolve over time and only get better. There's not necessarily miscoding at pharmacies. There certainly was A little bit of maybe an unexpected slowdown that we believe is fixed now that when people were switching from the free drug program to the prior approvals, it was easier for some pharmacies to continue to get free drug rather than going through the prior approval process. But in this marketplace, prior approvals are the norm. And in fact, dermatologists are used to doing prior approvals all the time. Most of them are electronic prior approvals that occur very quickly, and if not, they might take one or two days to get through the prior approval process. So we did have a slowdown, but it really picked back up again, and I'm really proud of our market access team that was able to step in and solve these problems. For the gross to net, I might hand it over to Christiana."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, Brian. Regarding the gross to net, as we showed you on slide 25, the shape of the curve from Q2 to Q4, the second half of the year, can take various forms, but we are confident that at the end of the year we'll be getting at least 40% to 50% gross to net discount rate. What would impact the shape of that curve in the second half is how quickly the remaining plants put oxaluron formularies and the speed in which the remaining NDC blocks get removed. But as we showed you, we feel very good with the progress that we have made. And at this point, we have 80 percent of plants that or 80% of patients that are covered, commercial patients, that are under plans that are under those three large PBMs with whom we have contracts, and over 50% of prescriptions that currently are covered. So we are progressing well towards that 40% to 50% steady state rate by the end of the year."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. Very helpful. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Next question is coming from Jay Olson from Oppenheimer. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Oh, hey. Thanks for taking the question. For the limber program, can you talk about the potential for myelofibrosis disease modification with all the different combinations of RUCs with PI3K, ALK, BET, BCL2, and whether or not you've seen any preclinical or clinical evidence of fibrosis improvement with any of those combos? Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Jay, it's Steven. Thanks for your question. So obviously the endpoints in clinical trials to date have been on spleen volume reduction and then symptom improvement to give you what you need for clinical benefit. But people look at fibrosis as well and then other things like allele burden, et cetera, to get to the point you're talking about. One of the issues with reading fibrosis from bone marrows is sampling, is inter-observer variability, central confirmation, et cetera, with the grading, is not always very precise. But you do sometimes, you can get a sense of fibrotic improvement. So to reiterate, you know, clinical benefit comes currently, at least at a regulatory standard, from the spleen volume reduction and symptom improvement, and then, you know, disease modification as an underlying secondary endpoint. In terms of the therapies you mentioned, you know, we'll have to see, basically. There is preclinical clues, certainly in, for example, in the BET program, certainly in terms of the new effort with selencos and the T regulatory cells that we use there from the umbilical cord that you can potentially have underlying disease modification. But ultimately, it's the clinical data sets that will prove that. With paraclisib, you know, we've announced the primary endpoints for both the first line and the suboptimal study in terms of spleen volume reduction and certainly in first line needing symptoms as well. With ELK2, the promise potentially also comes from what we want is underlying anemia improvement and then the ability to continue to dose RUX at adequate levels to get maximum effect. So that's mainly what's been looked at. And again, just to be repetitive, we'll ultimately see. So there are some preclinical clues that you can do underlying modification, but we'll await the data sets. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sounds great. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. As a reminder, that's star one to be placed into question Q. Our next question today is coming from Mark Fromm from Cal, and your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks for taking my questions. Back to the gross to net on Opsalura, I'm just doing some back of the envelope calculations with the graph you showed. I mean, it looks like the covered claims are getting a gross to net that's maybe in the low to mid 40s. Is that accurate? And then based on that, is there any reason to expect the kind of plans that are coming online later in in the year to be materially different in terms of the gross net associated with them than the ones that are online currently."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Mark, the first part of your question, I guess, what you're saying, our gross net is determined by the overall number of units that we sold and obviously the amount of reimbursement we're getting. or payments we're getting for that. So right now, our gross to net, as you can see, is what we expected to continue to improve. 55% of claims are being covered now. Every single day, that's going to get better and better. Gross to net at the end of the year, of course, is going to be in the range that we said. So they're not material different, but the gross to net will be better for each tube that we sell by the end of the year. So we're very confident of the guidance that we've given so far in terms of gross to net and I'm very confident that our demand is going to continue to increase week after week, particularly now with the vitiligo approval as well as the AD approval."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Just a comment on that. There are two ways to look at it. You can look at it over the entire set of prescription over a period of time and that's the graph we have showing that over a given quarter, the gross to net for all of this prescription, it's an average, has been 81% and improving, obviously will be improving in Q3. And then you have the other aspect, which is the percentage of covert claims. And when the claim is covered, the net price for a given tube, that one tube that is covered, is in fact very much in line with our target that we have given for the full year, the 40% to 50%."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, that's very helpful. And then maybe just on the pipeline, Stephen, the decision to move forward in hydrogenitis, is the Phase II data just available internally this year, or should we expect to see it? And then as you go towards Phase III, what's kind of, given the safety labeling of the JAK class, You know, kind of what's the clinical profile that you think you need to be able to establish on the efficacy side in order to be a, you know, a good option for hydrogenitis patients?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, thank you, Mark. So the, yes, the intention is to show the complete phase two proof of concept data set at a median this year. So you will see it in 2022. We expect, you know, to be treated with JAK class labeling here because it is, after all, in an inflammatory condition. Again, you know, these are patients with a lot of unmet need. They tend to have high body mass indexes and, you know, a lot of abscess and nodules. So the profile we need to see, you know, there are numerous ways to measure it. We looked at abscess and nodule count. We looked at this established combination endpoint called high score. It's a scoring system that was used with the Humira approval. And then, you know, we'll work out with the regulatory agency what's the best one to use for a phase three study. And then, you know, there is a reasonable placebo response rate here as well. Again, you'll see that when we show you the full data set. So you want to see, you know, a large delta between the placebo and then the efficacy effect, given that you're going to have class labeling likely a black box because it's an inflammatory condition. And, you know, we're confident in what we've seen thus far with 707 in this entity. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Next question today is coming from Evan Seekerman from BMO Capital Market. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, guys. Thank you so much for taking my question. So I know earlier on the call, you had mentioned some of the commercial dynamics that you saw during second quarter were temporary. I'm just wondering how temporary they were. And now that we're a month into the third quarter, have you seen some of these trends reverse? And then looking ahead, You know, with the growth to net around 40% to 50% for Opsalura, is that what we should be expecting come 2023 and 2024? Is that really the steady state kind of in the years beyond 2022? Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, so it was, Evan, it was temporary. We believe we had a problem mostly with, you know, the large portion of our prescriptions are filled by independent pharmacies, so it took us a little while to work together with them to figure work out them getting back to doing prior approvals, which they're very familiar with, and we're very confident that that was, in fact, temporary. Now, the gross to net of 50% going forward in 2023 and beyond, we're certainly going to do everything we can to protect our gross to net. As you know, the PBMs and payers will always come back and try to get more and more and more, so we just keep on working to maintain that. that grows the net because we think the value that this product offers is exceptional, and we don't want to lose that value."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, great. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Our next question today is coming from Michael Schmidt from Guggenheim Partners. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, thanks for taking my questions. I have another one on Opsalura. Just maybe talk about your confidence in the script data and the increase in demand in the third quarter. It sounded like you said that prescription data was overestimated in a second, and when I look at your gross sales, it looks like they declined slightly from 91 in the first quarter. Just wondering how confident you are in those forecasts."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, so our script data is very accurate. Obviously, we know exactly how much we're shipping. We know what we've reported the 867 data is what our wholesalers ship to the pharmacies, which we think really reflects prescription volume. Just getting to your last part, the demand in Q2 was actually higher than Q1. I believe it was 42,000 tubes in Q1. One for demand in 47,000 tubes in Q2 for demand. So the difference in the gross sales that we reported last time and this time is really an inventory issue. So inventory was lower at the end of Q2 than we anticipated. So that's really the difference there. So we're very confident in it. Well, we've talked about TRXs. That's IQVIA TRXs. So there is a misalignment that often happens with the products that IQVIA sells, particularly at the beginning of a launch. And they happen to be, and this is the data, obviously, that you guys get, other analysts and investors get. So, you know, it worries us a little bit when they're over-projecting. We work with IQVIA, and they will, in fact, at some point, make the corrections as they often do, and they go back and send out to their customers what they believe the real data is today. So we're very confident about our data. We're very confident that now week after week, as it was in the beginning of the year, prescriptions will continue to grow from this point on, and I don't anticipate any barriers to demand growth going forward."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, super helpful. And then there was another tropical approved yesterday in the dermatology space that could enter the AD market next year. And the WAC price was at a significantly lower than where Opsidor is priced. And I was just wondering how you think that might, you know, impact competitive dynamics longer term."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, I don't know why Arquitas priced as they do or anybody else does pricing differently. We're confident in the value that we offer, and that's the price. Now, also, Rifumilast, at least the data they released so far in atopic dermatitis, is not that impressive. So it didn't come near the efficacy and safety that Opsilor offers to AD patients. So their approval is a completely different indication, plaque psoriasis. So apparently it's okay in plaque psoriasis, and they have lots of competition there. So maybe their price point is based upon both the systemic competition as well as the other topical competition. So that was their decision. But we're confident in the way we priced our drug, and we're confident that both of these drugs that have recently been approved for plaque psoriasis will not equal the efficacy that we've demonstrated in our two Phase III trials thus far."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Super helpful. Thanks so much."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Next question is coming from Kripa Devarakonda from Truist Securities. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, guys. Thank you so much for taking my question. One question on Opsalura. Just wondering how long do you expect the copay assistance to continue? And then on the chronic GVHD, it looks like the uptake is pretty strong. I was just wondering if the strong launch is due to a bolus of available patients or Do you expect the growth to continue in a similar manner? Also, any additional color you can provide on when we can see data from Axotilamab, this and Axe collaboration? Thank you so much."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So I'll take the first part and hand the Axotilamab question over to Stephen. So copay assistance. So there's a couple of different parts to that. So as we launch the program, as many other organizations companies do when they launch a new drug in this sort of marketplace is that you pick up the full cost of the drug so we fully anticipated doing that we wanted to have a very generous program so that full buy down program essentially will be phased out over time and it's being phased out even now but their copay card program to assist patients to have a high copay will always be in place so we'll always do that plus Even patients that have, maybe they go through the prior approval process and they're denied through our Inside Cares program, they'll be able to get drugged. So in terms of GVHD, it's the chronic launch. So we did have a bolus in 2021 that we talked about. We had an expanded access program. We switched 200 or 300 patients over from expanded access program to GVHD. That's all gone, and we continue to grow, as we've demonstrated, 18%. year-over-year growth. Acute and chronic steroid refractory GVHD, Jackify is the standard of care, hands down, and we're very proud of that. Chronic patients are getting a lot of benefit from Jackify, and they'll continue to get benefit. We'll see continued growth there. I think we've talked about before how we divided up GVHD, and you can see that it's about 15% of our units going out. Our net sales are approximately 15%. We expect that to continue to grow. There's about 14,000 chronic GVHD patients out there. The prevalent population is about 14,000. But the incident population is relatively small. So it's an exciting area that we're in. We think Axotilimab will build upon that franchise that we have in chronic GVHD. And I'll hand the call over to Stephen now."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Barry. Thanks for the question, Kripa. You know, with our partner, Syndex, the agave study is ongoing and is enrolling excellently. It should, you know, complete enrollment this year. Then we wait for the primary endpoint, and we'll present the data in 2023. That's a registration-directed study in third-line chronic graft-versus-hurst disease with monotherapy, axotilamab. In addition, we will start, you know, combination work with a JAK inhibitor, which is now going to be ruxolitinib, and that'll be to get a safe dose and schedule. And then, you know, we'll move that up the treatment paradigm, look at, you know, earlier lines, earlier settings with a non-overlapping mechanism of action, plus the likelihood that there's no overlapping toxicity makes it a potentially exciting combination. So just to repeat, data in 2023 on the Pervidol registration study, which has gone really well. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you so much."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Next question is coming from Andrew Behrens from SVB Securities. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi. Thanks. I was wondering if we could get some more color on who's prescribing Opsalura and the copays. Are the majority of the prescribers the docs that have been detailed by your sales reps? And then Akivia has a breakdown of the copays, and it has a fair number of patients have zero copays. and also those that have over $75 copays. I was just wondering if those data points are accurate, and I probably should know this, but is your patient assistance copay offset part of the gross to net calculation? And then lastly, do you have any data on the abandoned scripts, the ones that are presented to the pharmacy but not filled by the patient because of the copay or lack of coverage?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "That's a lot of questions, but we'll try to answer them one at a time."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So who's prescribing? So dermatologists and dermatologist offices are prescribing, but that's dermatologists, physician's assistants, and nurse practitioners, of which there are many, and they're all prescribing. There's some allergists who are prescribing as well, so that's what's happening there. Breakdown of co-pays, it's sort of all over the place. We do expect, you know, an average co-pay that a patient might have once they're once their plan covers Opsalura either for AD or for vitiligo, and it could settle somewhere around $40. Unfortunately, at the beginning of the year, many patients also have a deductible that they have to meet before they get to their copay, so we pick that up as well. And, yes, copay assistance is part of the growth in that. That's a factor in our net sales. So any copay that we pick up, of course, is removed. but it's relatively low compared to a full buy-down or something like that. And number of scripts turned away by patients due to copays, I don't know. Like I said, there shouldn't be any due to copays because we'll help them to pick up the copay if they have a copay that is difficult for them to afford. But how many scripts did people walk away from Because of that, it shouldn't be any, to be honest with you. Like we said, we did have a little bit of a hiccup there where patients might have not been getting their prescriptions as fast as they should have or may have walked away because it was taking too long to get them filled. We think we have that completely fixed now, and there's always going to be problems in this marketplace that we have in this healthcare system that we have of patients running into barriers, but in fact, We do everything we possibly can to make sure those patients get the scripts that they need."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our next question today is coming from Morrow Goldstein from Missoula. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks for taking that question. I just wanted to circle back on the Opsalura physician survey that you showed. Do you have any insight, I guess no pun intended there, as to the driver behind the increase in that proportion of treated patients that are considered candidates for the drug? And then also, I'm hoping you might talk a little bit about RUX-QD and the potential positioning for that once approved or assuming approval next year. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "As far as the survey goes, I mean, all that's really saying is that, you know, when we first asked physicians, you know, what percent of patients that they believe are eligible for Opsalora, and this was, in fact, in AD, you know, they gave a number. But now that more and more have used, they've seen the safety and efficacy that Opsalora provides. You know, we have many patients and physicians who send in pictures of their of their eczema resolving relatively quickly or very quickly because of the use, so they're very excited about it. So the more they get experience with it, the dermatologists, physicians, nurse practitioners, PAs, the more they decide that this could really help a greater number of patients than we imagined. So I think that's only going to continue to increase both for AD and for vitiligo as dermatologists really see the efficacy and safety of this product. For RuxQD, you know, we're going to launch it next year. How are we going to position it? Well, you know, we think that this, you know, once a day versus twice a day is a very good option for many patients. So across all of our indications, obviously the A real reason that we're having RuxQD roll out is because we want to combine it with other products that Stephen talked about before that we have in our pipeline that we think will add to the safety and efficacy or the efficacy that Jackify already provides. So that's the real purpose of launching it, but we think many people will benefit just from the convenience factor, the better compliance that they'll get from a once a day versus a twice a day."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, and if I could just ask on corvacitinib in vitiligo, can you just speak to that difference in the body surface area criteria and how that aligns with how physicians treat vitiligo or current standard of care for vitiligo?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure, Steven, thanks for the question. So our current label with Opsalura is in patients with 10% or less body surface area involvement which incorporates about 80% of patients with non-segmental vitiligo. And, you know, for practical purposes, it gets pretty difficult to treat people with more body surface area involvement because of the amount of cream potentially you have to use. For porvocitinib in this vitiligo program, there's a little bit of overlap. And, you know, we worked with regulators. It's 8% or above. So these are people with much more extensive skin involvement, and they can go up to, you know, 20, 30, 40% involvement. And there, again, practically it becomes impossible to put that much cream on. The therapeutic ratio changes, and you can use, you know, an oral therapy to treat an oral systemic JAK inhibitor to treat the vitiligo. Because of that overlap, the numbers can get a little confusing, but that represents about 30% of patients. So you can sort of do the math there that have, you know, more than 8% involvement and require an oral JAK inhibitor because of the extent of disease involvement there. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Thank you. Next question is coming from Matt Phipps from William Blair. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning. Thanks for taking my questions. I guess on the QDRUX and then the BET and ALK data coming, is the next step after we see the data in the second half to move right to a fixed-dose combination with the QDRUX or is there an additional phase two trial or something that will happen. And then separately, on Monjuvi, I'm just wondering if you still see this as a 500 to 700 million opportunity given the rollout and in particular the broader label of Brianzi to include transplant ineligible patients, if that impacts your kind of long-term opportunity for Monjuvi."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, Matt, Stephen, I'll do the first part. So because it's, you know, it's once daily and it was a submission that involved bioequivalence and bioavailability data to get there, you know, we will be developing other clinical data. But at the same time, we've started developing fixed dose combinations because all of our other combinations are once daily as well. So whether it's paraclisib, the BET inhibitor, or the ALK2 inhibitor, they're all once daily and have the ability to have fixed-dose combinations. The PASA CLSIP registration studies are obviously ongoing and enrolling well, both the suboptimal and the first-line study, and obviously aren't with fixed-dose combinations at the moment. So once we have an FDC there, we would work out a transition, again, likely through a BA, BE route in conjunction with regulators to get there. But the future programs, should we go there with Beth and ELK2, would have the potential to go straightaway to an FDC. with each of those. So that's the promise there. And then I'll hand the question over to others for the second part."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, so Monjuvi, we certainly still have confidence in Monjuvi. We certainly still think that we're going to get to, in the relapsed refractory setting, we can get to $500 million. Obviously, it's taken us longer than we anticipated. You know, the marketplace has changed in diffuse large B-cell lymphoma. Over time, it's a very dynamic market. Obviously, there's more data with the CAR-Ts. There's more data with frontline Polyvi. There's more products entering that are the bispecifics, but Monjuvi and Len is an excellent combination for patients who have failed RCHOP therapy or relapsed on RCHOP, and we really believe that You know, there's really only a couple of options for patients who aren't going on to transplant, and that could be CAR-T, but the vast majority of patients should be eligible for Monjuvi-Len. So we just need to keep on doing a better job of educating because this is a product that really has great CR rates, and the duration of response is 44 months, a three-year follow-up. There's really not much better data or any better data in that particular setting for duration of response than Monjuvi Lens. So we really anticipate that this is a product that can serve a lot of patients in the relapsed refractory setting. And then, of course, we'll wait for data in follicular lymphoma and in the first-line setting because that's where the ultimate real value of the product will come from."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Next question is coming from Stephen Willie from Steve Foyer. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, good morning. Thanks for squeezing me in. So just a quick one on Opsalura. So I guess following the initial approval in AD, I know your guidance implied about three to four tubes per AD patient per year. And just wondering how the reorder rate that you're seeing at this point in the launch still informs some of the persistency and utilization assumptions that are that are embedded within that unit guidance on a per patient basis. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yes, Steven Sperry. So, you know, until we really see all of the NDC blocks removed, utilization criteria stabilized, it's really hard to know exactly what the refill rate is currently and is going to be in the future for AD. So these patients, we know that 25% of the data rate, 27% of our units this quarter were from refills. Is that the right amount? Is it gonna be more than that? It's hard to say at this point until we get fully stabilized on the payer situation. Once we do, then we'll really see what the refill rate is going to be. The drug works really well and some patients get relief very quickly, and some patients will have to have, will have flares, we know that from the clinical trials, and have to come back for a refill again. So it's not clear at this point, but like I said, it's 27% of our units currently, and, you know, that may grow into the future, but we'll have to get some more data before we can finalize that number."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "All right, thanks for taking the question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Our final question today is coming from Gavin Clark Gartner from Evercore ISI. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, thanks for taking the question. So, just on the LIMBER program, for the BET and ALK2 Phase 2 combination data that's coming in the second half of this year, could you start with some expectations for what data exactly we'll see? So, I know you mentioned it'll be the initial and somewhat limited efficacy data, but just wanted to clarify, like, what exactly you're planning to show. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, Gavin, Steven, thanks. So you're correct. It's actually mostly phase one safety data, but we'll try and incorporate as much of the efficacy component as we can in time for the abstract cutoff, et cetera. And then, you know, for, again, Beth, just to mention briefly, it's a drug we've had for a long time. We treated solid tumor patients at multiples of the dose years ago and, you know, hundreds plus patients. So we know its safety profile at higher doses very well. in terms of on-target thrombocytopenia. And now it's really about getting the right therapeutic ratio in combo with RUX and then make decisions to go forward. So it's largely a safety update to some efficacy. On ELK2, it incorporates some translational data as well, particularly as regards iron kinetics and hepcidin inhibition. So you'll see that as well in the data set that's presented. And we've seen favorable movements in terms of hepcidin inhibition and some iron kinetics But we'll have to see whether that translates to hemoglobin increases or not over time. So largely safety updates, minimal efficacy, some translational data for ELK2."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. We've reached the end of our question and answer session."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I'd like to turn the floor back over to Christine for any further closing remarks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you all for participating in the call today and for your questions. The IR team will be available for the rest of the day for follow-up. Thank you and goodbye."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. That does conclude today's teleconference webcast. You may disconnect your line at this time and have a wonderful day. We thank you for your participation today."
    }
]