[
    {
        "date": "2023-08-01T08:00:00-04:00"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hello, and welcome to the Insight second quarter earnings conference call and webcast. If anyone should require operator assistance, please press star zero on your telephone keypad. A question and answer will follow the formal presentation. You may press star one at any time to be placed in the question queue. As a reminder, this conference is being recorded. It's now my pleasure to turn the call over to Greg Scherzer, Investor Relations for Insight. Please go ahead, Greg."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Kevin. Good morning and welcome to Insight's second quarter 2023 earnings conference call and webcast. The slides presented today are available for download on the investor section of our website. Joining me on the call today are Arve, Pablo, Barry, Stephen, and Christiana, who will deliver our prepared remarks and participate in the Q&A. Before we begin, I'd like to remind you that some of the statements made during the call today are forward-looking statements and are subject to a number of risks and uncertainties that may cause our actual results to differ materially, including those described in our reports filed with the SEC. We will now begin the call with Hervé."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Greg, and good morning, everyone. So we had another quarter of strong performance, with product revenues growing 25% year-over-year, driven by JakaFi, OpsiloR, and launches in Europe. ChakaFi net product revenue grew 14% compared to the second quarter of 2022. For Opselora, the growth trajectory continues with net product revenues in the second quarter of 80 million, driven by new patient flow and growth in refills. Additionally, the launch in Europe is underway and Opselora is now available to patients in Germany and Austria. Our other hematology and oncology net product revenues were 64 million for the quarter and up 30% year-over-year, driven by the growth of Pemazir and Minjuvi in ex-U.S. markets. Now turning to slide five, we continue to execute on our development efforts. Recently, we announced positive top-line results from two of our high-potential programs. The true AD3 study evaluating roxalitinib cream in pediatric atopic dermatitis and the Agave201 study evaluating axatelimab in chronic GVHD met their respective primary endpoints. Stephen will discuss this result in more detail during his prepared remark, as well as provide updates on the important progress we made across many of our high potential programs as shown at the bottom of the slide. We also strengthened our research and development organization by appointing Pablo Cagnoni as president and head of R&D, And in this position, and as member of the executive team, Pablo will lead Insights R&D activities. This new role aligns chemistry, biology, and early and late-stage clinical development with the goal of maximizing speed and productivity in our research and development efforts. I will now turn the call over to Pablo for a few words."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Hervé. I'm thrilled to join the team at Insight, a company with such an impressive history of success and who has redefined the standard of care in myeloproliferative neoplasms, graft-resistant host disease, and vitiligo. Since joining just a few weeks ago, I've spent time with our teams, and I'm even more enthusiastic about the capabilities of our organization and about the quality of our science. We're prosecuting a broad range of biology with a diversity of modalities. And I look forward to working with them to continue to deliver major advances across our portfolio in order to make a meaningful difference for patients. Hervé?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Pablo. And with that, I would like to pass the call to Barry for a commercial update."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Hervé. Good morning, everyone. Starting with Jackify on slide seven, net product revenues for the quarter were $682 million, up 14% year over year, driven by the continued growth in patient demand across all indications. Total patient demand grew 5% year-over-year. By new patient starts, a good indicator for future growth was up 9% year-over-year. Given the strong underlying demand for Jackify, we are raising the bottom end of our full year 2023 revenue guidance to a new range of $2.58 to $2.63 billion. Turning to Opsalora on slide 8. The launch continues to be strong and is gaining positive momentum with both physicians and patients. The rapid adoption of Opsalora is driven by its compelling product profile and its ability to address significant unmet need in both atopic dermatitis and vitiligo. Opsalora net product revenues in the quarter were $80 million, up 42% compared to the prior quarter. U.S. patient demand increased during the quarter with total prescription growing 16% compared to the last quarter, and refills growing by 23%. The monthly prescription trend, as shown on the right, demonstrates the continued growth of Opsalora, which is coming from both atopic dermatitis and vitiligo. In AD, growth was primarily due to new patient flow driven by Opsalora's efficacy and impact on inflammation and itch. In vitiligo, where Opsalora is the only approved treatment for repigmentation, growth was driven largely by refills and our educational and awareness initiatives. We are very optimistic about the long-term potential of Opsalura as we continue to see the strong uptake and positive momentum. On slide nine, Monjuvi net product revenue in the U.S. for the quarter were $24 million, up 2% year over year, and were driven by continued growth in community accounts. Minjuvi Net product revenues outside of the U.S. were $13 million, up 198% year over year, and includes $6 million of previously deferred revenue related to the early access program in France, which ended in June. Pemezir net product revenue grew to $22 million, a 14% increase year over year, with $5 million coming from outside the U.S., where the launch is ongoing in 10 key markets in Europe. With that, I'll turn the call over to Stephen."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Barry. Starting on slide 11, as Herve mentioned, we have two exciting program updates we want to highlight from this quarter. First, for ruxolitinib cream, the primary endpoint was met in the Phase III True83 trial in pediatric atopic dermatitis patients aged 2 to 12. The top-line results showed that significantly more patients achieved Investigator's Global Assessment Treatment Score, or IGATS, with ruxolinib cream 0.75% and 1.5%, and with the vehicle control. No new safety signals were observed, and the overall safety profile is consistent with previously reported data. The long-term safety portion of the trial is ongoing, and data will be submitted for presentation at an upcoming scientific meeting. We also plan to discuss these data with regulatory agencies, and we anticipate a submission in the first quarter of 2024. We are excited about the potential relief ruxolitinib cream can bring to the roughly 2 million pediatric atopic dermatitis patients in the United States. Moving to slide 12. In partnership with Syndax, the Agavi 201 study, a global pivotal trial evaluating axotilumab in patients with chronic graft-versus-host disease after two or more prior therapies, met its primary endpoint of overall response rate across all three treatment cohorts, with the 0.3 milligram per kilogram every two-week dose achieving a 74% overall response rate. In the 0.3 milligram per kilogram cohort, 60% of responders maintained their response at one year, and 55% of patients achieved at least a seven-point decrease in their modified Lee symptom scale, indicating that responses were both durable and with symptom improvements. Axotilamab was well-tolerated, and the most common adverse events were consistent with on-target effects. The full data set is planned for presentation at a scientific meeting later this year with a potential BLA submission by year-end 2023. We are excited about the potential of Axotilamab in chronic graft-versus-host disease and in this heavily pre-treated and severe patient population. A phase 1-2 trial of axotilumab in combination with ruxolitinib is also being planned. Moving to slide 13, an update on our broader dermatology pipeline. For Opsilura, in addition to the positive top-line pediatric AD data, three phase 2 studies for lichen planus, lichen sclerosus, and hereditonitis suprativa have completed enrollment. For porvacitinib, the Phase II study in prurigo nodularis has completed enrollment, and we expect to have data in this indication later this year. Additionally, we previously announced the expansion of porvacitinib development into inflammatory and autoimmune diseases beyond dermatology, and now have initiated two Phase II trials in asthma and chronic spontaneous urticaria, CSU. On slide 14, I want to provide a little more detail on our studies in asthma and chronic spontaneous urticaria. Asthma is a chronic inflammatory disease with two endotypes. Type 2 eosinophilic asthma, the most common type, is primarily driven by Th2 cytokines, whereas non-type 2 asthma is characterized by a neutrophilic response. Many asthma patients have disease progression despite therapy with inhalers. Povacitinib appears to have efficacy in both type 2 and non-type 2 endotypes. In preclinical data, povacitinib results in a reduction of eosinophil activation and may potentially reduce neutrophil activation as well. The phase 2 study has been evaluated in moderate to severe uncontrolled type 2 and non-type 2 asthmatic patients. Unlike monoclonal antibodies that target a single cytokine, povacitinib inhibits the actions of multiple cytokines potentially providing superior efficacy in both endotypes. TSU is a mast cell-driven disease, presenting with hives and severe chronic itch. Overactivation of dermal mast cells and basophils results in increased serum levels of Th1, Th2, and Th17-related cytokines. We know JAK inhibition can modulate mast cell activation, including degranulation and cytokine production. both of which are drivers of chronic spontaneous urticaria. The Phase II study has been evaluated in patients who are inadequately controlled or progress on second-generation antihistamines. Moving to hematology and oncology, we achieved multiple clinical milestones across our high-potential portfolio during the second quarter. We continued to make progress in myeloproliftive neoplasms, or MPNs, where we presented updated clinical data at ASCO for our ALK2 and BET program. We also initiated a Phase 1 study of INCA33989, a mutant CalR antibody, and as previously discussed, axotilumab met the primary endpoint in chronic graft-versus-host disease. For oncology, both of the Phase 3 studies evaluating tafacitumab in first-line diffuse large B-cell lymphoma and in relapsed or refractory follicular and marginal zone lymphoma are fully enrolled. and the Small Molecule Oral PD-L1 Program continues to advance with multiple new studies initiated. Turning to slide 16 and an update on our Small Molecule Oral PD-L1 Program. Immune checkpoint inhibitors have transformed cancer treatment for patients. Despite the remarkable clinical benefits, intravenous formulations have disadvantages and there is ample opportunity for innovation and improved outcomes in this space. As the first company to demonstrate clinical activity with an orally available PD-L1 targeted agent, we have a unique opportunity for differentiation. As an oral small molecule, INCB99280 has a short half-life, which can reduce the burden of managing immune-related toxicities and provides a switch-off option if needed, which may offer improved overall safety, especially when combined with other agents. Additionally, the convenience of an at-home oral administration is often preferred by patients and may offer the potential for an improved quality of life. On the right, you can see the current studies of INCB 99280. We've initiated monotherapy phase 2 studies in both checkpoint inhibitor naive patients and in cutaneous squamous cell carcinoma. We also initiated two phase 1-2 combination studies with exitinib and ipilimumab. A third phase 1-2 study in combination with adagracib is in preparation. We also announced last night that in partnership with Replimune, we are starting a neoadjuvant study to evaluate 2-8-0 in combination with RP1, a tumor-derived oncolytic immunotherapy in patients with cutaneous squamous cell carcinoma. RP1 is Replimune's lead oncolytic immunotherapy product and is based on a proprietary new strain of herpes simplex virus engineered for robust tumor-selective replication, and is genetically armed with a fusogenic protein and GM-CSF. RP1 has already demonstrated substantial activity in cutaneous squamous cell carcinoma. At ASCO, we presented data for zolurgicertib, our ALK2 inhibitor, in patients with myelofibrosis. Initial data from 36 patients demonstrated early signs of clinical activity through hepcidin reduction and anemia response in monotherapy and in combination with ruxolitinib. Zolurgicertib was well tolerated with a favorable safety profile, allowing for continued dose escalation. We've added an additional treatment group in first-line JAK-naive myelofibrosis patients with anemia, and we plan to have updated data later this year. Additional data presented at ASCO for our BET inhibitor, INCB57643, demonstrated improvements in spleen volume and symptoms in both the monotherapy arm and in combination with ruxolitinib. It was generally well tolerated with two dose limiting toxicities observed in the higher 12 milligram once daily monotherapy arm. We believe we have an active compound with encouraging early data. Dose finding work is ongoing with 10 milligrams once daily as monotherapy as well as continued dose escalation in the combination arm. Turning to slide 19, we continued to make progress in other development programs. During the quarter, INCA33890, a TGF beta R2 by PD1 bispecific antibody entered the clinic, and a phase one study was initiated. Additionally, our Imolimab anti-IL15 receptor beta antibody received IND clearance, and we plan for it to enter the clinic later this year. Ritofanilam, which was recently approved in Merkel cell carcinoma, has completed enrollment in the Phase III non-small cell lung cancer study and in the squamous cell anal carcinoma study. Finally, on slide 20, we have a number of upcoming data readouts and other exciting milestones expected, and we look forward to sharing additional details throughout the remainder of this year. With that, I'd like to turn the call over to Christiana for the financial update."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Stephen, and good morning, everyone. Q2 was a very strong quarter with total product revenues increasing 25% year-over-year to $827 million, driven by the strong performance of JakaFi and Opsalura. JakaFi net product revenues for the second quarter were $682 million, representing a 14% year-over-year increase driven primarily by continued growth in patient demand across all indications and an increase in channel inventory. At the end of Q2, channel inventory had recovered from the depressed Q1 levels and was towards the high end of the normal range. The increase in inventory represented around $35 million in net product revenues. Obsolura net product revenues for the second quarter were $80 million, representing a 384% increase year-over-year driven by increased patient demand and expanded coverage. Finally, other rheumatology-oncology net product revenues were $64 million, representing a 30 percent increase compared to the second quarter of 2022, driven by patient demand and the recognition of $6 million of previously deferred Minjuvi revenue related to the Early Access Program in France, which ended in June. Turning to royalty revenues, total royalty revenues for the quarter were $128 million and are primarily comprised of royalties from Novartis of $90 million for Jacavi and $5 million for Tabrecta and royalties from Lili of $32 million for Eolumient. Jacavi and Eolumient royalties for the quarter were negatively impacted by FX headwinds. Turning now to slide 24 and the performance of Opselura. The launch of Opsalura has been very strong, with 2023 year-to-date net sales of $137 million. Since the launch of Vitilago, Opsalura net product revenues have grown at an average quarterly rate of 28%. Net product revenues grew 42% compared to last quarter, primarily driven by demand and the normalization of the typical Q1 dynamics. Moving on to slide 25, and our operating expenses on a GAAP basis. Total R&D expenses were $401 million for the second quarter, representing a 15% year-over-year growth, driven primarily by the progression of our pipeline, including the expansion of the clinical development program, evaluating raxolitinib cream in additional indications, and the progression of provocitinib into pivotal studies. The SG&A expenses were $284 million for the second quarter, representing a 12% year-over-year growth, driven primarily by promotional activities launched at the beginning of the year to support Opsalura in vitiligo and the timing of certain other expenses. Moving on to our guidance for 2023, as a result of Jakafai's strong demand growth, we are raising again the bottom end of our full year JAKA5 guidance to a new range of $2.58 to $2.63 billion. We are reaffirming our other hematology oncology revenue, HOGS, R&D, and the SG&A guidance for the year. Operator, that concludes our prepared remarks. Please give your instructions and open the call for Q&A."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Certainly. We'll now be conducting your question and answer session. If you'd like to be placed into question queue, please press star 1 on your telephone keypad. If you'd like to remove your question from the queue, please press star 2. One moment, please, while we poll for questions. Our first question today is coming from Brian Abrams from RBC Capital Markets. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, this is Leonid on for Brian. Thanks for taking my question. I guess I had one maybe on MF development in the limber program. Given the high bar that Jackify sets and the challenges on TSS50 exemplified by difficulties one of the competitor drugs recently had in hitting on the symptom score, how's this shaping your thinking about going to the front line or the second line with the bet inhibitor and just positioning of these molecules going forward? Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Leanna, thanks for the question. It's Stephen. Yeah, and for acknowledging, you know, ruxolitinib's incredible activity in terms of both spleen responses, but especially symptom improvement. And as you point out, it's a very high bar to beat. In terms of our own thinking, you know, one has to be obviously careful in study design, in adequate powering in terms of endpoints, and also making sure that you maintain adequate Jack inhibitor dose intensity going forward. And so, you know, both just to point out in terms of our combination programs, we talk about ELK2 first. You can see where it's heading. You know, clearly we have an increase in hepcidin reduction with increasing doses, and we're starting to see very encouraging hemoglobin responses. So the thinking along those lines would be potentially looking at, you know, in the first line study, an ability to, you know, you know, prevent anemia development and thus maintain, very importantly, Rux dose intensity and get the maximum benefits in terms of JAK inhibition in spleen and symptoms. And so that's where that's heading and, you know, hopefully, as we've said repeatedly, by next year we'll complete the dose escalation and be able to declare where we want to go. It's incredibly safe in terms of tolerability, so we're able to continue to dose escalate at the moment. In terms of the BET program, it's a little bit of a different thing in terms of tolerability. There's no on-target toxicity in terms of thrombocytopenia in terms of going in higher doses. So in monotherapy at the 12 milligram, we saw dose-limiting toxicity there, and we're back at the 10 milligram dose in terms of monotherapy. We've seen, again, extremely encouraging spleen response, symptom response, and also occasionally hemoglobin improvement. But to your point, you know, we have to think carefully about where to go in terms of first line or suboptimal study. And obviously, also, there's a competitor reporting out that data later this year, which we're going to watch carefully. And again, to be repetitive, you know, powering in terms of symptoms, you have to be very careful in the first line setting because ruxolitinib is so good. So that program as well. you know, we'd like to declare by the end of your time frame next year, earlier part of the year, where we go in in terms of registration directed efforts. And then also just to remind you, completely different efforts, you know, the CalR antibodies in the clinic now are potentially disease modifying dash, you know, even curative in the 30% of CalR patients that are in the MF population and in the ET population. And that could be a completely different way of thinking if you can eliminate the clone and change, you know, the disease trajectory completely and you wouldn't even be thinking then in terms of spleen and symptom response, you'd be eliminating the clone. So that's where we are with the program at the moment. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Thank you. Next question today is coming from from Truist Securities."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you so much for taking my question. I have a question about the axotilumab data from the phase two trial you reported recently. Another big question we've been getting is around the unusual dose response. So, you know, we've heard that this could be because of potential impact of SAEs and response rates. I know it's not been too many days since you reported the data, but it's been a few days since you've had to digest the data. Wondering if you have a sense of what it might take to understand what's going on there, And more importantly, how this might affect regulatory review. And then for Minjuvi, as you continue to work through reimbursement in EU, are you seeing a difference in how it's being used in U.S. versus EU? Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Perfect, Steven. I'll start off with your axotilumab question. So the agave two-in-one study had three doses and a schedule difference as well. So the first two were 0.3 milligram per kilogram Q2, one milligram per kilogram Q2, and the third dose level was three milligram per kilogram Q4. And you're right, you know, we had a pleasant surprise in having excellent activity across all the dose levels in patients who had actually a medium of four prior therapies, and including prior ROC inhibition, you're getting that, you know, with a 0.3, a 74% best overall response. The one milligram per kilogram is not really different, just to be clear. You know, when you're up at 67% on best overall response, and then if you look, you know, across at some other ways of looking at response, it's in a very similar territory. So we don't think there's a difference in response rate, but there is a difference in terms of tolerability, in terms of on-target effects, likely on liver Kupfer cells and transaminitis, that that gets worse with increasing dose. And certainly at the 3 milligram per kilogram, there's clearly more transaminitis, and that is likely not the regulatory dose. It'll be the discussion with the regulators on the 0.3 versus the 1, both showing excellent activity in terms of overall response rate and tolerability. And, you know, we're still in the early days of working that out with regulators, but we'd like to get that submission in, the BLA in, by the end of this calendar year, 2023? I'll turn it over to Barry for your second question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I will take it on Minjuvi in Europe. So there are two ways to look at it. I mean, the overall profile of patients that we are seeing using Minjuvi in Europe is not dissimilar to what we have in the U.S. In the sense that you have basically a group of patients who are not eligible to CAR T, obviously not eligible to transplant, and in many cases would be patients who are frail and are attracted by the very good safety profiles that we have with Minjuvi-Len, and obviously the very good efficacy that you can get there. Now, the extent to which CAR-T is used in different European countries is different from the U.S., so I would say it's a little bit maybe earlier on the curve, And what we see is that the volume, the group of patients that end up being eligible for Minjuvi is in fact larger in Europe. And we see that from the uptake that we are seeing. Now we have reimbursement in Germany, Italy, Spain, and a few other countries. And we continue to work, as you heard, in France and the rest of Europe to have full access. But the adoption curve for Minjuvi in Europe is in fact faster than what we saw in the US in terms of volume."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "That's very helpful."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Next question today is coming from Allison Bratzel from Piper Sandler. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi. Good morning. Thank you for taking the questions. First, just on Opsalura, could you help us understand gross net trends during the quarter? And also just the mix you're seeing between Atopic Derm and Vitiligo. I think it was 30% of scripts were thought to be for Vitiligo last quarter. Is that consistent now that we're into the second half of the year? And I guess what are you seeing in terms of persistence and refill rates in Vitiligo? And then secondly, just a question on the pipeline. Just on the Replimune agreement announced yesterday, Could you talk about the rationale for entering that agreement now? What aspects of RP1's clinical data in CSCC or other DERM oncology indications give you confidence in evaluating the 99280 combo in neoadjuvant CSCC? And just help us understand the scope of that trial expected to start early next year. Is that going to have registrational intent? Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Let me take the first part of your question and then I will turn it to Barry to discuss the mix. So in terms of the gross to net, in Q2 the average gross to net discount was 55%. So that was down from 60% in Q1. As we were expecting, Q1 has the highest gross to net given the higher co-pays and deductibles at the beginning of the year that we have to pay down, and that then comes down through the year. So we are at 55% average gross to net in Q2. In terms of dynamics, one thing that we saw in Q1 and we continue to see in Q2 was an increase in Medicaid utilization. And that has continued in Q2 with Medicaid increasing as a percent of the total payer mix."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So Allison, it's Barry. So as far as your other questions, vitiligo now represents about 35% of total prescriptions. In terms of refills, so for atopic dermatitis, I think we've said before that we expect two to three refills. two to three tubes per patient, and that's where we are now with AD. We're over two tubes per patient. For vitiligo, we don't have enough time yet. Most of the vitiligo patients coming on, as you can imagine, are new patients, and we need more time to reach the average number of refills. As we've said in the past, we expect the average to be around 10 tubes per year, and we think we're progressing towards that. I'll turn it over to Stephen for a reprimand question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Barry. So, Allison, in terms of cutaneous squamous cell carcinoma, it's an entity that's not very well captured by the groups that capture cancer statistics just because of the way it's treated, variability, often with surgery alone, et cetera. But it could be common enough that there may be upwards of 1 million cases across the board of cutaneous squamous cell carcinoma in the United States and actually north of 10,000 deaths. So it's clearly a medical problem with a lot of morbidity. You know, for 280 itself, we have now, as we've outlined for you, cutaneous cell squamous carcinoma study ongoing up on clinicaltrials.gov that's doing some dose ranging work with 280 and then will expand, you know, with a declared dose going forward and could potentially serve on its own as a registration effort, but that's down the pike and to be determined. You know, why replimune? Why RP1? It's a tumor oncolytic virus with actually, you know, outstanding efficacy already demonstrated in cutaneous squamous cell carcinoma that's advanced with checkpoint inhibitors. You know, activity in terms of response rates in the 70% range, complete responses in a 47% range. So really, you know, outstanding activity with checkpoints already demonstrated, but with intravenous. Given on, you know, how this is administered with intratumoral injections, it really lends itself to combining with an oral agent like 2-8-0, and we view this as an exciting potential going forward. This is a proof-of-concept study, though, in the neoadjuvant setting, and then we'll determine if there's a registration path afterwards. So thank you for the question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Thank you. Next question today is coming from Vikram Porhit from Morgan Stanley."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, good morning. Thanks for taking our questions. So we had two, both on Jackify. So first, could you comment on whether there were any outsized or large inventory purchases that contributed to Jackify's 2Q sales base? And then secondly, could you remind us where your dialogue stands with the FDA on QD Rocks and just what the next steps are for moving this program forward? Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, Vikram. It's Christiana. So first of all, in terms of your inventory, As you may recall, inventory at the end of Q1 was below the low end of the normal range, and that was because of the timing of an order. What we saw in Q2 was an increase in inventory that brought inventory back within the normal range. And I would say it's towards the higher end of the range, but that variability you see from quarter to quarter within that normal range. So we are back at the normal range, and as I commented during my remarks, the inventory increase during Q2 represented 35 million in net sales. Let me turn it to Barry for the second part of the question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Actually, I'll take it. Thanks, Christiana. So, Vikram, in terms of RUXXR, just to remind you, the CRL from the FDA was a concern around C min at steady state, not area under the curve and not C max, and then resulting in a potential theoretic concern in terms of efficacy, and that there was a, you know, 24 percent lower C min when you compared it to the IR. So in terms of the go-forwards, there's a potential approach that's quicker and involves modeling work that we're doing at the moment, and we need to discuss with regulatory agency. And we can't give you timing yet on that. And then a potentially longer effort that may take a little longer, but clearly for both, we'll have them ready and be able to submit way before the loss of expiration for RUX itself. So it's too early to give you regulatory timing. but both efforts are underway. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. Thank you. Thank you. Next question is coming from Salveen Richter from Goldman Sachs."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Her line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning. Thanks for taking my question. You will share more combo data on the Jackify out to embed combo in the second half, but in the context of where QD stands and the overall combination strategy here, Can you just help us understand what your thinking is on how this could play out from a life cycle management standpoint?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, so thanks, Sylvie, and it's Stephen. You know, both, as I alluded to in my prepared remarks, both BET and L2 are progressing well. You know, BET clearly activity with monotherapy and in combination is And now it's just about declaring the dose and then the registration intent for that, and then also watching the competitive space. ELK2, you know, very well tolerated. We can keep escalating and hopefully continue to see improved efficacy. And then that may be potentially a first-line effort because of its tolerability and the ability to both treat the anemia and maintain RUX dose intensity. And then I just outlined, you know, the QD effort on its own. in terms of formulation development. We also are working on fixed-dose combinations for both BET and L2, and those aren't impacted by the CRL in any way, but it is likely that when we go to pivotal studies with BET and L2, that those will be done with the IR in combination with the BET and L2, and then should we want to use FTCs, we'd pivot to that with bioavailability, bioequivalence work at that time. All of those efforts are underway aggressively. Again, we very much want to complete and should complete them before the loss of expiration of RUX itself. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Just a follow-up here. How does CalR and CK0804 fall into this strategy as well?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, thank you. So mutant CalR is on its own an entity that, as I said earlier, about 30% of myofibrosis, and in fact 25% to 30% of essential thrombocytemia, and is the oncogenic driver on its own. It's mutually exclusive, doesn't overlap with MIPL or V617F or anything else. And so should this work the way it looks preclinically and be well tolerated, It's an entity on its own and would be a different treatment paradigm in terms of thinking. Because the idea would be to eliminate the malignant clone and potentially cure you of the condition. So you would no longer have a clone that causes the disease and the disease symptoms. And that is why, you know, got a plenary at ASH and is potentially so exciting. And, you know, should that pan out all the way to the end, then about a third of each of those entities would be taken care of on their own with the antibody and would be no need for JAK inhibition, BET inhibition, ELK2 inhibition, et cetera. The Cilencos 0804 effort is a different effort entirely. It's umbilical cord Treg cells that are enriched to hone to the bone marrow and have already shown in small, you know, single case studies to change the natural history of myelofibrosis and potentially also improve fibrosis there as well, and to be safe. So it's early days with that, and we want to again show data on that later this year. And it's too hard to comment on where that will go from a strategic point of view, but the idea there again is to be disease-modifying, given the therapeutic modality."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Next question today is coming from Evan Siegerman from BMO Capital Markets. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi there. This is Connor McKay on for Evan. Thanks for taking our question. Congrats on the quarter. So you noted in your press release this morning increased demand for Opsalura. And I'm just wondering, you know, now that we're a bit further into the launch in Bitoligo, could you just comment on if you're seeing any previously inactive patients or patients who had stopped seeking treatment previously starting to come on to Opsalura? Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, Connor. It's Barry. So, we obviously have patients that have been seeking treatment all along for their vitiligo, and then new patients that learned about Opsalura and go in to see their dermatologist. I can't give you any numbers at all about the number of patients who were, in fact, inactive. But we do want to, part of our entire effort for any direct-to-consumer activity is to is really just to let those patients who want to have their vitiligo treated to know that there's a treatment available for the very first time that can actually help them to repigment their skin. So that's what we'll continue to do to drive the patients back to the office."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks. Yeah, thank you. Thank you. Next question is coming from Jay Olson from Oppenheimer. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Oh, hey, congrats on the quarter, and thank you for taking the question. Can you talk about the pace of Opsalura uptake in Europe versus the U.S., and any comments you could share on the momentum of Opsalura growth and when you might provide specific revenue guidance on Opsalura? Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I can take the European. I'll do the European part of this today. Okay. The approval and the launch in Germany and Austria took place at the end of the end of the quarter. It was in the last days of June. So we are in the process. Now we have a month and a half. We see a good uptake. In fact, we see adoption in Germany where you see the most important market and it will continue to be the most important for a year because we anticipate the next reimbursement to take almost that long. to become effective in other countries in Europe. So what you can anticipate there is, you know, another 10 months where Germany and Austria would be the only or the main countries where OPCELOA is being used. And what we see, I mean, there was in Europe when the approval was done first, the label in Europe is excellent. It's different from the label in the U.S. in terms of the entire safety profile. In fact, it has no equivalent of the black box in Europe. So all of this issue of systemic exposure to JAK has been looked at by the European authorities very differently from what the FDA has done in the US. And the media impact of the approval has been very visible on TVs and everywhere across Europe we had a number of patients and physicians speaking about the importance of treating and repigmenting vitiligo. So the awareness of Opselora is already very high. We have a lot of demand. We have programs we are trying to put in place to help patients where we can. And we are fairly optimistic that it will be a good product for Insight and it will have a reasonable potential. And the second part of your question is about guidance for Opselora."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "In terms of the guidance, we still want to see a few more quarters of uptake. It's still early. We want to be able to see through the earlier discussion how vitiligo patients, especially that have been inactive, come into therapy, and also more information on refills before we are in a position to provide guidance."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great, thank you for taking the questions. Thank you. Next question today is coming from Mario Goldstein from Missoula Securities."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, this is Jerry Gongon from Mayor Goldstein. Thanks for taking our questions. Starting first with Opsalura with the free drug program and the IQVA projection, are you seeing a difference between AD and vitiligo? And can you comment on the moving forward rates for the rest of 2023? And then looking towards axotilumab, could you share how Insight and Syndax are applying to share responsibilities for the upcoming BLA filing and maybe potential commercialization as well? Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So, Terry, for Apsilor, for a free drug, we don't really see any difference whatsoever with a free drug for atopic dermatitis and vitiligo. Obviously, I said before that there's more AD patients that are on Opsalora and a growing number of patients with vitiligo that are on Opsalora, but the free drug difference, we don't know."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Jerry, it's Steven. In terms of the BLA, obviously both companies have worked really well together. The study was executed well, brought in well, high quality, et cetera, but INSIDE will be leading the filing activities with, you know, syntax appropriately helping along the way. On the commercialization question, I'll ask Hervé to address it."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "The commercialization of AXA will be different in the U.S. and Europe and the rest of the world. So in the U.S., it's a co-commercialization led by Insight, where we would be booking the revenue and where there is an option for syntax to field up to 30% of FTEs in the field force if they choose to. And so that would be for them to decide if they want to do that. And at the end, we will do a 50-50 profit split of the commercial activities in the U.S. Outside of the U.S., it's a license where we will be paying a royalty to syntax, and we will be prosecuting all activities related to regulatory and commercial for acetylimax."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Next question is coming from Eva Previtero from TD County. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Congrats on the quarter. A few questions from us. Can you help set expectations for povercitinib in prurigal nodularis? What would be considered a good profile in that disease? And what's the efficacy bar for moving into phase three?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yvette, Stephen, yeah, the Pobacitinib-Pirago nodularis phase 2 enrolled really well. It's complete. We'll have data later this year. The central problem for those patients is a very intense and severe itch, and then obviously, you know, the actual skin lesions. But what the patients really want is the itch relief, and that's why we feel, you know, an oral JAK inhibitor is appropriate in these patients with more severe Pirago nodularis. There is an already approved drug in terms of dupixent in PN in general, so the regulatory path is pretty well established. This study, though, is a phase two proof of concept study. If we get the profile we want in terms of itch relief and then lesion resolution, then we'll advance to phase three development, but we'll talk about that later this year. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, and another question over sitnib. Give a quick enrollment update for the Phase 3 in HS. We know that AbbVie has recently opened a Phase 3 for RINVOC."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, thank you. So, we don't give numbers as we progress. We have two Phase 3s up and going. They're enrolling really well. You know, we obviously started before them. I think across dermatology in general, when you go back to RuxCream, AD, Vitiligo, et cetera, our operational execution has been excellent. We've got really good at knowing the derm space and how to conduct these studies, but we don't provide patient-by-patient enrollment updates. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you for taking our questions. Thank you. Next question is coming from Michael Schmidt from Guggenheim Security. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Oh, hey. Good morning. This is Kelsey on for Michael. Thanks for taking our questions. I just had two on axotilumab. Maybe could you just remind us how it might be positioned competitively versus Sanofi's ResRock in the third line setting, based on the previously announced top line data? And then I guess, could you just tell us how you're tracking with the planned JAKIFI combo study in the front line setting, and maybe what you might need to see in order to advance that into a phase three trial, any specific efficacy outcomes? Thanks so much."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So the AXA data, I won't go through again. I had them in my prepared remarks. But the eligibility criteria was for two or more prior therapies. The median on the patients is actually four. So we'll have to be discussing with regulatory agencies as to what, you know, line of therapy that would be given in terms of a label. It's likely to be at least the United States somewhere in the third line territory given the data set. But as I said in my prepared remarks, that efficacy of 74% was seen across the board, including in post-resuroc patients. And obviously, those were predominantly in the United States, given that's where that drug's approved. But it's premature to comment on the exact line we get in labeling, so we have those discussions. In terms of the combo work, I assume you're talking about graft versus host disease again. And in combination with ruxolitinib, there's theoretically a huge appeal because, one, you have a small molecule with a large molecule and no theoretic concern in terms of drug-drug interactions, non-overlapping MOA, a JAK inhibitor with a macrophage monocyte targeted drug. So we don't expect to run into tox. And then, you know, we want two very now very active drugs in graft-versus-host disease, It's really appealing. Can you move up the treatment paradigm? So we're going to start that combination as soon as possible with Ruxanaxa, you know, tested likely in the first, second line set in, and then we'll, you know, work out, see that activity, and see where we want to go. There is appeal to go first line because steroids are dominantly used there, are active, but have a lot of, you know, long-term toxicity. But there's also appeal in second line as well. We'll see where the data leads us, but an exciting time for that combination."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, great."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you so much, and congrats on the quarter. Thank you. Our next question is coming from David Lebowitz from Citi."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you very much for taking my question. Could you provide more detail on the number of tubes per patient on Opsalura? I'm just curious as to where the extent that overall growth in the quarter was driven by new patients coming to therapy or increase in the tubes per patient."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure. So, David Barry. So, basically, I mean, where they're driven from is we said that the total Rx's grew by 16%. that's across AD and vitiligo, and refills grew by 23%. So we expect refills to continue to grow and be more than 50%, in fact, going up much higher than that over time. As far as the growth from AD and vitiligo, both are growing. New patient starts in both vitiligo and AD continue in the right direction in terms of the refills for each. I discussed it before that We expect, in fact, that two to three tubes for the AD patients, and we hope to get to an average of 10 tubes per patient for vitiligo. We think we're headed in that direction now, and we'll continue to reinforce how to use the drug both with dermatologists and with patients, and we think we'll achieve at least that number."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks for taking my question. Thank you. Next question is coming from David, I'm sorry, Derek Archella from Wells Fargo."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, good morning. This is Yvonne for Derek. Thanks for taking our questions. Two quick ones for Matt. First, how are you thinking about M&A and what would be your priority between INI and oncology assets? And second, what are your thoughts on the HS opportunity for publicity in light of recent competitor data?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "You want to take the HS opportunity? So I'll do the second question first. So the profile in HS for porvacitinib, which we presented earlier this year at a medical meeting, is outstanding in terms of efficacy. In fact, we think, as far as we can tell, it's the first time ever that a Hiscar 100 has been reported by a compound in this entity. And by that, I mean a complete response. So abscess, nodules, fistulas completely disappearing. And that's really encouraging for the profile going forward for Porvo. You're right. It's now an active space of research. There's many biologics, including IL-17 targeted drugs. And, you know, there's lots of unmet need. And so it's good that other people are trying to address that. I would just say when you compare studies, you know, look carefully at patient populations. Look carefully at concomitant conditions. antibiotic administration. We didn't allow that on our studies. And then obviously the placebo arm activity as well when comparing. But the profile we saw in our phase two is outstanding. And if we replicate that in phase three, we'll have, you know, a potentially best-in-class compound there. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Maybe I can say a word about MNA. I mean, we are in a position where, as you can see, I mean, the growth of our Existing business is very strong. The pipeline is very promising. We have a number of very good products that we are now developing at late stage, and we didn't speak very much about some of the early stage projects, but they are also very interesting. So we are looking at what could be the best use of the cash that we have. We have north of $3 billion now, and how we could add to this diversification and growth that we are doing with our organic portfolio. It could be M&A or it could be licensing, business development. You see, you know, AXA TVMAP was licensed from Syndax, and it's clearly helping us strategically with the portfolio and the Limber program, and also adding mechanisms that we can combine with Jacketify. So this type of agreement could continue when we see them, when we find them, or acquisitions that could be in dermatology or oncology, assuming that these products that we would be acquiring have the potential to contribute to the growth in the year 25, 26 and beyond, because that's where really we need to add to the portfolio at that point. So that's really the criteria we are using. And we are sort of agnostic of, you know, onco versus derm. I think the question is the quality of the science, the quality of the product, and the timing and the potential of the products we would be adding to our portfolio."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, thanks. Thank you. Next question today is coming from Ben Benjamin from J&P Securities."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great, thank you. Congratulations on a great quarter, and thanks for taking the questions. Can you talk a little bit about the opportunity in Purego, Nodularis? You know, how big or small is this opportunity? And how should we be thinking if these, you know, current studies are positive? How should we be thinking about pivotal studies and how big they might be going forward? And maybe a bigger picture question is, you know, when we think about Durham as a business, is this something that, you know, ultimately will be part of insight, you know, kind of going forward and taking up a significant part of the revenues is something that might get spun off at some point, just given the size of the studies that you might need to conduct for these other indications. Any thoughts there would be helpful."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, Ren, it's Stephen. So, coraginodularis is often not diagnosed or underdiagnosed. It's hard to be precise on the epidemiology side. But they're probably around 200,000 or north of that patients in the United States with PN. And as I said earlier, their biggest morbidity is itch, and it's massive impact on quality of life. So that's what we're looking for in terms of erpovacitinib. The regulatory parts have already been defined by the Dupixent approval and how to get there. And it's, you know, premature to talk about sizing and powering. until we see our Phase II proof-of-concept data there. Just by the way, you know, ruxolitinib cream, Opsalura, in more mild PN, is also very active, and it's something we're obviously interested in studying and seeing the outcome of as well. In terms of the second question, I'll turn that over to Hervé."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Oh, yes. I mean, you can – I mean, the question is really, is dermatology a business that we believe has the potential to continue to grow, to be of a – you know, meaningful size, and the answer is yes and yes, and you can see it. You can see the program we are developing for rock scrim. There are four or five new indications we are prosecuting on top of vitiligo and atopic derm, where we believe there is a clear medical need and where, in fact, the power of topical jack is, with the safety profile it has and with the efficacy it has, is really competitively well-positioned. We choose to develop povacitinib in a number of indications where there is interest. And you can see that interest, in fact, now coming from the biologics and some other ways of approaching this biology. But we believe, again, that the JAK inhibitor is a very good way with the fact that we are ahead of the pack in that development process. is a very good way to help these patients. And being first or best in class in that case is very feasible. And then we have Oremolimab, which is a new mechanism that needs to be proven but could be also very promising. So we have this view of developing an IAI dermatology portfolio over time that will be contributing equally to the revenue or at least to the growth of the corporation in the next few years. And we see a lot of complementarity in the research that we are doing in inflammation, in immunology, and how it could apply for cancer on one hand, and in some cases how it can apply for autoimmune disease or inflammatory disease on the other hand. So all of that now is something that is well established. We have the team on the commercial side in the U.S. now fully fielded, and we are building it in Europe. I think it's a picture of insight for the next five years will be both DERM and ENCO in parallel."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. We've reached the end of our question and answer session. I'd like to turn the floor back over to management for any further or closing comments."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you all for participating in the call today and for your questions. The IR team will be available for the rest of the day for follow-up. Thank you and goodbye."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. That does conclude today's teleconference and webcast. You may disconnect your line at this time, and have a wonderful day. We thank you for your participation today."
    }
]