[
    {
        "date": "2023-10-31T08:00:00-04:00"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hello, and welcome to the Insight Third Quarter Earnings Conference Call. If anyone should require operator assistance, please press star zero on your telephone keypad. A question and answer session will follow the formal presentation. You may place into question queue anytime by pressing star one on your telephone keypad. As a reminder, this conference is being recorded. It's now my pleasure to turn the call over to Ben Strain, Associate Vice President, Investor Relations. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Kevin. Good morning and welcome to Insight's third quarter 2023 earnings conference call. Before we begin, I encourage everyone to go to the investor section of our website to find the press release, related financial tables, and slides that follow the discussion related to today's call. On today's call, I'm joined by Herve, Pablo, Barry, Stephen, Christiana, who will deliver our prepared remarks and will participate in the Q&A. I would like to point out that we'll be making forward-looking statements which are based on our current expectations and beliefs. These statements are subject to certain risks and uncertainties, and our actual results may differ materially. I encourage you to consult the risk factors discussed in our SEC filings for additional detail. I will now hand the call over to Hervé."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Ben, and good morning, everyone. In the third quarter, we continue to deliver double-digit revenue growth, important successes in pricing and reimbursement, and continued progress of the pipeline. Product and royalty revenues were $914 million in the quarter, with an 11% growth year-over-year driven by Jackify and Obsidua. Jackify net sales in the quarter were impacted by inventory variation, which Christiana will detail in her prepared remark. As you see, in the first nine months, Jackify growth continues at a rate of around 8% this year. The growth trajectory of Opselora continued in the third quarter with net product revenue of 92 million, driven by both new patients and refills in ED and vitiligo. In the first nine months of 2023, Opselora revenues contributed 229 million, and we expect Opselora to continue to be a key contributor to the growth of Insight in the next year. On slide six, We made important progress this quarter on two fronts related to pricing and access. First, as the IRA is implemented, we secured small biotech exception status for Roxolite Lib. This has two impacts on Jackify pricing and growth to net in the coming years. One, we expect that Jackify will be exempt from negotiation until 2029, making it de facto neutral to our initial business plan. And two, as you can see, we expect to benefit from the specified small manufacturer phase-in schedule for Part D catastrophic coverage versus the standard benefit, which will have a meaningful impact in the years 2025 to 2031. For Opselora coverage in the U.S., starting in 2024, Opselora will be listed as a preferred brand on the CVS Caremark and Aetna formularies, which will benefit roughly 30 million commercial lives. This achievement will move Obcelora to preferred brand from non-preferred brand tier and will result in increased access by reducing both step-elite requirements. Patients copay for many patients while maintaining Obcelora's favorable utilization management criteria. Turning to slide seven, we continue to make progress in our clinical development efforts across our portfolio. Just last week, we obtained new top-line results from the Phase II randomized study assessing the efficacy and safety of povacitinib, our oral JAK1 inhibitor in patients with prurigo nodularis. The study met its primary endpoint across all three treatment dose groups, and povacitinib was generally well tolerated. There are approximately 100,000 treated patients in the U.S. with prurigo nodularis with limited treatment options, and we are excited to move this program forward based on the Phase II data. Stephen will provide additional details. During the quarter, we had a significant presence at EADV, where we presented the full obcellular atopic dermatitis data in the pediatric population and positive long-term extension data in vitiligo. We also shared new positive data from the Phase IIb clinical trial of povercitinib in adults with extensive vitiligo. By the end of the year, we anticipate providing additional data from other key programs, including an update on our oral PD-L1 program, additional combination data of roxalitinib plus ALK2 and BED, and full disclosure of a novel preclinical program targeting the JAK2V617F mutation, which has the potential to be a disease-modifying therapy for many patients with myeloproliferative neoplasms. I will now turn the call over to Barry, who will discuss our commercial performance in more detail."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Hervé, and good morning, everyone. Starting with Jackify on slide nine. Jackify continued to experience increasing patient demand during the quarter as we delivered 2023 year-to-date net sales of $1.9 billion, growing 8% year-over-year, while total patients for the first nine months has also grown 8% year over year across all indications. The quarter over quarter impact in net sales is primarily attributable to fluctuations in channel inventory. Recall that we reported exiting Q2 at the high end of our normal inventory range and inventory drew down modestly in Q3. We continue to see strong growth in underlying demand and now are tightening our full year 2023 guidance to a new range of $2.59 billion to $2.62 billion. As we look to the future for Jackified, PV will be a key growth driver, particularly considering that a significant portion of patients are not receiving adequate benefit with hydroxyurea. Now, for the first time, we have data that clearly demonstrates the thrombosis-free survival benefit that can be achieved with Jackify. The data shows that patients who are not being adequately controlled and are switched to Jackify experience a 44% reduction in the risk of major thrombosis. We are already hearing from thought leaders that this data is game-changing in PV and reinforces the importance of early intervention for these patients. We believe this important data will help drive earlier use allowing us to further penetrate the PV market. Turning to Opsalora on slide 11, the launch continues to be strong and is gaining positive momentum with both physicians and patients as we establish Opsalora as one of the best recent dermatology launches. Looking at the first two years post-FDA approval, Opsalora outperforms all other dermatology products on a launch-aligned basis. The rapid adoption of Opsalora is driven by its compelling product profile and its ability to address significant unmet need in both atopic dermatitis and vitiligo. Opsalora net product revenues in the quarter were $92 million, up 141% when compared to the same quarter last year. U.S. patient demand increased during the quarter with total prescriptions growing 72% year-over-year and refills growing by 19% versus the prior quarter, with over 9,100 dermatologists now having prescribed Opsalora. The weekly prescription trend, as shown on the right, demonstrates the continued growth of Opsalora, which is coming from both atopic dermatitis and vitiligo. In AD, growth was primarily due to new patient flow driven by Opsalora's efficacy and impact on inflammation and itch. In vitiligo, where Opsalora is the only approved treatment for repigmentation, growth was driven largely by refills and our educational and awareness initiatives. We remain very optimistic about the long-term potential of Opsalora as we continue to see the strong uptake and positive momentum. We are also working to drive new patient growth and adherence through ongoing initiatives. During the quarter, we kicked off a new marketing campaign called Moments of Clarity featuring Mandy Moore. The goal of this campaign is intended to bring to life the stories of real people struggling with eczema who found relief by talking to their dermatologist and to build broad awareness of Opsalora as a non-steroidal topical option among mild to moderate AD patients. The campaign secured several high-profile media placements, including coverage with top-tier outlets like the Today Show and People Magazine. We are also continuing to roll out DTC initiatives in Vitiligo, which is building awareness, driving demand, and activating patients to discuss treatment options with their dermatologist. Turning to slide 14, we continue to make advancements with our payer coverage for Opsalora. payer adoption continues to improve with regional plans. And as of today, we have roughly 84% commercial coverage for Opsalora and atopic dermatitis covering over 127 million lives. In vitiligo, we have made significant progress since the launch and have improved our coverage by roughly 30% throughout 2023. The most recent progress was with Blue Cross Blue Shield federal employee program, which accounts for over 5.5 million lives. Additionally, as Irvade mentioned, Opsalura will be moving from non-preferred to preferred brand tier effective January 1, 2024, for CVS Caremark and Aetna formularies. With that, I'll turn the call over to Pablo."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Barry, and good morning, everyone. As you may recall, earlier this year, we made the decision to increase our focus on eight high-potential programs. Consistently with this, our near-term goals for the R&D organization would be to increase the rigor of our decision-making, accelerate the progression of our pipeline, and increase our efficiency to optimize our resource allocation. Before I hand the call over to Stephen for an update on some of our later stage programs, I would like to spend a few minutes highlighting some of our key earlier stage programs to give a more clear picture of the depth and quality of our pipeline. During the third quarter, TGF-beta receptor 2 by PD-1 bispecific antibody enter the clinic, and the phase 1 dose escalation study is progressing well. It has been designed with high selectivity for the PD-1 receptor combined with TGF-beta receptor 2 inhibition, and it has the potential to enable a synergistic approach to target multiple immunosuppressive pathways across a number of cancers. INCA34460 is a novel humanized anti-IL-15 receptor beta monoclonal antibody that's designed to target and deplete autoreactive tissue resident memory T cells. It has demonstrated efficacy as a treatment for vitiligo in preclinical models and received IND clearance last quarter. We have since initiated the phase one single dose ascending study. We also dosed the first patient for the phase one study of our novel anti-mutant COL-R targeted monoclonal antibody with a potential to eradicate the malignant clone in certain patients with myeloproliferative neoplasms and significantly modify disease outcomes. COL-R mutations are responsible for disease development in approximately 25 to 35% of patients with MF and ET. We're disclosing today for the first time a program targeting the JAK2V617F mutation, the most common somatic mutation in myeloproliferative neoplasms. The JAK2V617F mutation is located in the JH2 domain of the JAK2 receptor and is present in 55, 60, and 95% of patients with MF, ET, and PV, respectively. Unlike raxolitinib, which inhibits both wild-type and V617F mutation-positive cells, INCB160058 selectively binds to the JAK2-JH2 site, disrupting the V617F-induced conformation, and thus allowing selective inhibition of mutant activity in the JAK2 receptor while sparing wild-type. We expect to file the IND by year-end 2023 and enter into the clinic in 2024. Together, we're an anti-mutant call-out program. These two potentially disease-modifying programs represent a fundamentally new approach to addressing MF, ET, and PV, and solidify our leadership in MPNs. With that, I would like to pass the call to Steven, who will further highlight some of our key achievements this quarter with our mode-advanced programs. Steven?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Pablo. Starting on slide 19. As Hervé mentioned, we obtained the top-line results from the Phase II randomized double-blind placebo-controlled dose-ranging study assessing the efficacy and safety of porvacitinib in patients with purigo nodularis. The study met the primary endpoint for all porvacitinib doses studied of 15, 45, and 75 milligrams, and at week 16, 36.1, 44.4, and 54.1 percent of patients respectively achieved a primary endpoint versus an 8.1% rate for patients on placebo. The primary endpoint was designed to assess the proportion of patients achieving a greater than or equal to four-point improvement in itch at week 16. Corvacitinib was generally well tolerated across all doses, and the safety analyses were consistent with previously presented data, with no new reported treatment emergent adverse events. We plan on presenting the full data set at an upcoming medical conference in the first half of 2024. As a result of these very encouraging findings, plans are underway to initiate a phase three study in 2024. We had a significant presence at the European Academy of Dermatology and Venereology Congress earlier this month, which highlighted our commitment to the atopic dermatitis and vitiligo communities. In a late break in oral presentation, We presented positive 52-week data from a Phase IIb clinical trial evaluating the safety and efficacy of porvacitinib in adult patients with extensive non-segmental vitiligo. These results showed that treatment with oral porvacitinib was associated with substantial total body and facial repigmentation across all treatment groups at Week 52 and was well-tolerated at all doses throughout the study. During the 24-week post-treatment period, Total body and facial repigmentation was also maintained, which suggests durability of response following treatment discontinuation. These data further reinforce the efficacy and safety profile of porvacitinib as an oral treatment for patients with extensive non-segmental vitiligo, and we plan to initiate the PHRASE III study by the end of this calendar year. Porvacitinib has already demonstrated outstanding efficacy in the Phase II program in higher adrenitis suprativa. As a reminder, 52% to 56% of patients treated with porvacitinib achieved a Hiscar 50 at Week 16, with responses improving to 59% to 67% at Week 52. Additionally, Hiscar 100 response, which is complete resolution of all manifestations of the disease, was reported at Week 52 in up to 29% of patients. The two Phase III studies, STOP-HS1 and STOP-HS2, are enrolling very well, and this reflects the strong Phase II data presented earlier this year. We continue to expand the porvacitinib program focused on the science while leveraging our extensive dermatology capabilities. We look forward to advancing the development of porvacitinib in areas of unmet need where it is currently being evaluated in two phase three studies in HS and moving into a phase three program for vitiligo and prurigo nodularis. Work continues in the phase two proof of concept studies in asthma and chronic spontaneous urticaria. Moving to ruxolitinib cream on slide 23, also presented at EADV with expanded results from the pivotal phase three true AD3 study, evaluating the safety and efficacy of ruxolitinib cream in children 2 to 12 years old with atopic dermatitis. These data showed significantly more patients treated with ruxolitinib cream, 0.75% and 1.5%, achieved investigators' global assessment treatment success than patients treated with placebo. Treatment with ruxolitinib cream over eight weeks under maximum use conditions was also well tolerated in children. Expert feedback on the data has been consistently positive. namely that ruxolinib cream could be advantageous to the currently available non-steroidal topical options and an important option before resorting to currently available injectables. We are excited about the potential relief ruxolinib cream can bring to the over 2 million pediatric atopic dermatitis patients in the United States. As a late break in oral presentation at EADV, New results from the pooled analysis of the long-term extension data from the pivotal phase three TrueV program were presented. The long-term study extension evaluated Opsilura in patients 12 years and older with non-segmental vitiligo who previously experienced limited or no response to treatment at week 24. The data demonstrated that prolonged treatment of ruxolinib cream led to increased facial and total body repigmentation in those patients who were initial non-responders. Approximately 70% of patients saw improvements in facial VASI and total VASI at week 52, which increased to 85% by week 104. Throughout the long-term extension, Opsalura continued to be well-tolerated with no serious treatment-related adverse events. This data highlights the importance of prolonged treatment in patients with vitiligo, even when limited or no repigmentation is achieved in the first six months of treatment. On slide 25, we continue to advance Opsilura development beyond AD and vitiligo and into other indications where it has the potential to provide significant value as either the first approved therapy or first approved topical therapy for patients living with these dermatologic conditions. We currently have three phase two studies which have recently completed enrollment in lichen planus, lichen sclerosus, and mild to moderate HS. and two additional phase three trials evaluating Opsalura and Purago nodularis, which are all currently enrolling patients. Finally, on slide 26, we have a number of upcoming data readouts and other exciting milestones expected, and we look forward to sharing additional details throughout the remainder of this year. With that, I would like to turn the call over to Christiana for the financial update."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Stephen, and good morning, everyone. Q3 total product revenues were $783 million, representing a 10% year-over-year increase. In the first nine months of 2023, total product revenues were $2.3 billion, representing a 16% year-over-year increase. Total royalty revenues, which are primarily comprised of royalties from Novartis for Jacobi and Tabrecta and royalties from Lili for Lumient, were $131 million in the third quarter and $374 million in the first nine months of the year. Turning to JakaFi, JakaFi net product revenues were $636 million for the third quarter and $1.9 billion in the first nine months of 2023. In the first nine months of the year, JakaFi net sales grew 8% compared to the same period last year. While Jackathai demand net sales have continued to steadily increase quarter over quarter, in the first two quarters of 2023, we saw more notable fluctuations in channel inventory levels, which resulted in some variability in the quarterly reported net sales. As we had previously shared, at the end of Q1, channel inventory levels fell below the low end of the normal range, recovering in Q2, and ending the second quarter towards the high end of the normal range. At the end of Q3, channel inventory levels returned to the midpoint of the normal range. In the third quarter of 2023, the decrease in inventory had a $14 million negative impact on reported net sales. Turning now to Opsellura, Net product revenues for the third quarter were $92 million, representing a 141% increase year-over-year, driven by increased patient demand and expanded coverage. In the first nine months of the year, total Obsolura net product revenues were $229 million. Moving on to slide 32 and our operating expenses on a GAAP basis, total R&D expenses were $376 million, for the third quarter, representing a 2 percent year-over-year decrease, driven primarily by the decrease in one-time collaboration-related expenses, partially offset by continued investment in our late-stage development assets and timing of certain expenses. Total SG&A expenses were $268 million for the third quarter, representing a 1 percent year-over-year growth. Moving on to our guidance for 2023, we're tightening our guidance range for Jacobi to a new range of $2.59 to $2.62 billion. We are reaffirming our other hematology oncology revenue, COGS, R&D, and SG&A guidance for the year. Operators, that concludes our prepared remarks. Please give your instructions and open the call for Q&A."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Certainly. We'll now be conducting a question and answer session. If you'd like to be placed in the question queue, please press star 1 on your telephone keypad. A confirmation tone will indicate your line is in the question queue. You may press star 2 if you'd like to remove your question from the queue. For participants using speaker equipment, it may be necessary to pick up your handset before pressing star 1. One moment, please, while we poll for questions. Our first question today is coming from Salveen Richter from Goldman Sachs. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning. This is Anu Meedhan for Salveen. Thank you for taking our question. First, could you help us understand Upsalura gross net trends during the quarter and your expectations on the forward? And then just a quick question on the combo data with Jacofi, Alktu, and Bet that's expected in 4Q. I guess in the context of where the once-a-day dosing stands and the overall combination strategy and the positioning of each asset, can you just help us understand your thinking on how this could play out from a lifecycle management standpoint? Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, Anais, Christiane. I'll take the first part of your question and then turn it to Stephen. Regarding the gross to net for Opsalura in Q3, gross to net was 54%, down from 55% in Q2 and 60% in Q1. As we said in our prior call, in last quarter's call, we expect gross to net to continue around that 55% level. And any improvement would very much depend on the evolution of Medicaid."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And Anna, in terms of your second question and the lifecycle management of ruxolitinib in myeloproliftive neoplasms and beyond, including graft-versus-host disease, just to take the components of your question separately, the once-daily dosing, we continue to work with the FDA on a response, and one of the efforts involves modeling that may be a little shorter in terms of timeline, and one may require some further work. Regardless of the effort we undertake, both will be delivered way before the LOE for ruxolitinib. So that we'll pursue and continue. In terms of ELK2 and BET, both very important combinations, we're showing further monotherapy and combination data at the American Society of Hematology meeting in December. So you'll have to wait for those abstracts. and the median itself to see the data. But it's more data in terms of monotherapy and combination. Your question relates to how they may play out. You know, ELK2 is principally addressing hepcidin inhibition and then resulting in hemoglobin improvement. And the idea there would be to treat both the anemia from myelofibrosis as well as potentially the drug-induced anemia from RUX. And we'll see how that data evolves. BET is already a mechanism that has demonstrated the ability to shrink spleen, spleen volume reduction, to improve symptoms, and also through epigenetic means, improve hemoglobins. And we've already shown, you know, quite substantial efficacy with our own program. We'll see how other competitive programs play out in the short term. We'll show you data at ASH, and then we'll direct you towards our registration-directed efforts here. It could be placed in the first-line setting in combination with RUX, in the suboptimal setting in combination with RUX, and even as monotherapy post-JAK inhibitors, there's substantial efficacy with the VET program. And then just to round out limber, let me remind you, you know, axotilamab at a positive phase three this year with really excellent data in third-line graft-versus-host disease, and that submission is going in, and we'll progress that through the regulatory cycle."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Next question is coming from Tazine Ahmad from Bank of America. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning, and thanks so much for taking my question. Just one for me. I just want to get a sense of how you're thinking about the evolution of the competitive landscape as it relates to Jackify. There's been a recent new approval from Mama Lutinib for a subset of patients that might be on Jackify. How are you thinking about marketing Jackify in relation to this newly approved drug, and do you think that there's any risk of that drug taking market share? Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure, Tanzine. This is Barry. So as we think about competition in myelofibrosis, you know, there was already two other Jack inhibitors on the market, and neither of those Jack inhibitors have really penetrated, and they're I've actually been in the first and second line setting and haven't really moved at all over many quarters now in terms of their market share or, quite frankly, in terms of their net sales. For Momolotnev itself, you know, Jackify was compared directly in Simplify 1 study to Momolotnev, and Momolotnev failed in that study. The approval that they received, both in the first line and second line setting, for patients with anemia, Jacify is, in fact, the only drug that really has superior overall survival in myelofibrosis patients, regardless of anemia. So, in other words, patients who have anemia and got Jacify for myelofibrosis have a survival advantage. So, that strong designation gives us confidence that we'll continue to be the leader in myelofibrosis. Additionally, of course, patients are started, myelofibrosis patients are mostly started on therapy when they have symptoms. And Jackify clearly is the most effective therapy when it comes to managing symptoms and spleen. And then Momolotnib, just like the other drugs, are in fact much more costly than Jacify, Momolotnib being $26,900 per month, 60% or so higher than Jacify. So it seems like it was priced for a second-line drug, and we think that's where it'll be mostly used."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. As a reminder, that's star one to be placed in the question queue, and we ask you to please ask one question, then return to the queue. Our next question is coming from Brian Abrams from RBC Capital Markets. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, thanks. It's Leonid on for Brian, and thanks for taking our question. I just wanted to go back to maybe some of the reimbursement dynamics with Upseller. You guys mentioned the preferred brand designation from Caremark and Aetna. I guess I'm curious, how do you anticipate that impacting access and ultimately pulling through to utilization? And did you guys have to make any net pricing concessions for that? And I guess related to that, I mean, is this contracting that you're working on with some of the other payers as well?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks. Sure, Leonid. Barry again."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So, you know, in terms of Caremark, CVS, Caremark in particular, It's very important in terms of access for the patients. We're trying to make it as easy as possible for dermatologists to prescribe the drug and then for patients to receive it. So in this particular situation, we're going from a double step for atopic dermatitis. So patients would have had this to go through topical steroids and topical calcineurin inhibitors before they get to Opsalora. And in Vitiligo also had to go through multiple steps. Now, in Vitiligo, as it should be because of the label and the only drug approved for Vitiligo that re-pigments the skin for Vitiligo, having no steps to go through, so first-line therapy is excellent. And just having to go through one step because most patients will have, in fact, used topical steroids when they have AD, so that makes it much easier. In terms of contracting and concessions, you know, there's always a negotiation, of course, with the PBMs and the payers over rebates and fees and so forth. So, it might cost us a little bit more on the rebate end, but in fact, then the co-pays generally go down. And most importantly, what we're really trying to achieve is volume. And then I suppose your last question is the negotiations with payers always continues. We don't really have to have any further negotiations unless we choose to until 2025 for Opsalura. But there's always the chance that we come back and decide to do something slightly different in terms of getting, in terms of making access easier for patients. Most of the contracts that we have in place currently in fact, allow plans to step up and change their step therapy from two to one and so forth."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Next question today is coming from David Lebowitz from Citi. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you very much for taking my question. Would you be able to give us insight on the current I guess, rate of the number of tubes per patient in AD and vitiligo. You were expecting, have there been any changes in expectations, and where do you think stand right now?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure. So in terms of AD, I think we had it on the slide. It's around two. We've been saying that for a while. We expect two tubes per patient for atopic dermatitis on average. Obviously, some patients we'll get a lot more than that. In vitiligo, we need some more time really to evaluate exactly in the real world how patients will receive Opsalora for vitiligo. So patients who might just apply the drug to the face, for example, or apply it all over their body, it varies. But We'll continue to track the number of tubes for vitiligo, but obviously with our data so far, long-term extension data, patients can use it safely for years and continue to get benefits. So we'll update you when we have more information as we gather more data, as we have more use in vitiligo."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Next question is coming from Jessica Five from J.P. Morgan. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, good morning. Thanks for taking my question. Curious if you'll be in a position to provide Opsalura sales guidance for 2024, and with respect to your bet, what you'll be looking for in the upcoming Pell Abrasive results?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So, Joyce, I'll take the first part of the question regarding the Opsalura guidance. As we've shared with you in the past, in order to provide guidance, we want to have a a few quarters of real-world experience with Opsilura, especially for vitiligo, given that it is a new market, and be able to see how in the real world utilization is, how many tubes on average vitiligo patients use, and also how quickly and at what rate inactive patients can getting to see their physicians and get on therapy. So we are still very early in the launch of vitiligo, and we continue to monitor the progress and want to see a few more quarters before we are in a position to provide guidance."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And then in terms of your question related to BET inhibition in myelofibrosis, the competitor ongoing first-line study, which you allude to, is, you know, what we consider a pretty standard first-line study in about 440 patients. The primary endpoint is spleen volume reduction of 35 percent or greater. And, you know, already communicated, it has to be an end in terms of the secondary endpoint of hitting total symptom score 50 percent improvement or above versus the competitor RUX in that situation. For our own BET inhibitor, as I said earlier, you know, both monotherapy data we've already shown, spleen reduction, symptom response, and some hemoglobin responses, and then the ongoing COMBA work showing the same. And we'll have to see how, you know, that data plays out versus what the competitor delivers in that first-line study in terms of our registration efforts, and we'll communicate further about that at the ASH meeting coming up in December. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Next question is coming from Mark Fromm from TD Calendar Line. It's now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi. Thanks for taking my questions. Maybe first to start from the commercial side to follow up on one of the prior questions. Just on a blended basis, given this is a pretty large plan that you're moving up the formulary, but on a blended overall basis for the franchise, should we expect gross to net to incrementally increase in 24 versus the full year 23, given that move?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Mark, I'm not really sure, to be honest with you. We'll have to see what the volume is and what the improvement in co-pays is to see how it affects our gross to net. But anyway, we'll see. But there's always a chance that we could actually benefit a great deal from net sales by making it much easier for patients to be able to access our drugs."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Next question is coming from Bikram Peroyant from Morgan Stanley. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning. This is Gaspol of Bikram. We have two questions for Jackify. I mean, due to the recent effort about GSK or JARA, the first one is what portion of MF patients using Jackify can you estimate using an optimal dose due to anemia? And in this patient population, have you seen an increased rate of discontinuations as prescribers and patients potentially move towards Orjara? And secondly, have you observed a decrease in JAK-FI new patients starting MF since Orjara was approved?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Well, Cosmo, you know, the most important thing is that..."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "OJERA only got approved on September 15th. It really only launched in the last week of the year. I'd be surprised that there was actually any sales except for stocking sales in the quarter. So anyway, so I can't imagine that it affected any part of us yet. Now, what percent of patients might be receiving a suboptimal dose You know, what we've only said before, I believe, is that the number of patients who are at a steady state on, you know, a five milligram twice a day dose or something like that is only about 5% of our patients. I believe those patients are actually getting benefit, but that's the most. And, you know, just like in our clinical trials, cover one trial, I mean, only one patient discontinued for anemia. We don't believe that that's a big part of it. And like I said before about the benefits that Jackify provides to MF patients, whether they're anemic or non-anemic, it's overall survival, it's symptom control, it's spleen control. So, so far, we don't really see, we don't really anticipate impact by Lomalatinib, certainly in the third quarter."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Our next question today is coming from Matt Phipps from William Blair. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks for taking my questions. I wondered on the provercidinib phase three plans in vitiligo, how you can structure that trial to complement the current Opsalura utilization opportunities. Is it really just around baseline VASI scores? And then as you think further out about additional opportunities for provercidinib, what are you keeping in mind considering it looks based on the profile so far as to work in a pretty wide range of more classical autoimmune indications, but clearly there you might have more competition."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Matt Hyatt, Steven, thanks for the question. So, in terms of vitiligo, as we showed you, you know, the data in more extensive non-segmental vitiligo, you know, we saw, you know, really good effect in terms of facial VASI, facial VASI 75 and above, and then total VASI as well, body rate pigmentation of 50% or above. We will disclose, you know, when we go onto clintrolls.gov, what the endpoints are and what doses we'll be using. So it's premature to point you towards that, other than just broadly tell you that the population we target in is people with more extensive body surface area involvement when you compare it to the cream, which is indicated for people with 10% or below. This would open up the vitiligo community with people with much more extensive body surface area involvement where it becomes a little pragmatically hard to apply, you know, cream across the body, and an oral JAK can be used in that setting with the right therapeutic ratio. And as we got it to, you know, we want to get this study going by the end of this calendar year. Porvacidinib is, you know, relatively JAK1 specific. You saw, you know, the program in HS, both STOP HS1 and HS2 are enrolling really, really well based on the, you know, what we think is excellent phase two data, including that Hisco 100 response. But as you allude to, you know, we have now, you know, data in pyrago nodularis that's excellent, and we want to progress that into phase three. And then ongoing efforts beyond dermatology in asthma and chronic spontaneous urticaria, where the biology points to this kind of JAK1 agent potentially showing substantial benefit, in patients with more severe asthma who are on inhaled corticosteroids, long-acting bronchodilators, and still having early exacerbations. That's a Phase II proof-of-concept study, and then standard endpoints in chronic spontaneous urticaria. So, you know, this drug has demonstrated thus far, you know, remarkable activity in those areas where we study in Phase III now, and we'll see what happens in asthma and CSU. So thanks for the question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Next question today is coming from Michael Schmidt from Guggenheim Securities. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, good morning. This is Paul on for Michael. Thanks for taking our question. I just wanted to build on the prior question. Can you talk about how you plan to position Provercinib and Prurigo Nodularis in the planned phase three relative to sort of how you design the ongoing phase three studies for Opsalura? Is there a meaningful difference in the target patient populations, and how should we think about the specific addressable opportunities within PN for the two programs. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, thank you for the question. Just, you know, in terms of, and Herve said this up front in his remarks, there's a prevalence, you know, upwards of 200,000 plus patients, but there are about 80 to 100,000, you know, that currently get treated in this setting. And their main manifestation of their disease is itch and very severe itch. And that's what the Phase II showed, you know, that activity in that setting across the dose ranges. I think it's premature beyond that to talk about, you know, the endpoint and the dose we'll be using because we've just got the Phase II data in. But it will be, again, because it's an oral agent, targeting the more severe spectrum of PN. That's what I can tell you now. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Our next question is coming from Mauro Goldstein from Missoula Securities. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Thanks so much for taking the question. I just was hoping actually to get a little bit more color on the Medicaid penetration with respect to Opsalura because last quarter it was identified as a jump in the payer mix that had an effect on Opsalura and the gross net. And then secondarily, I'm just hoping maybe you could talk a little bit about PV for Jackify. I mean, the it looks like the percentage, just eyeballing it, right, of Jackify sales from PV has remained relatively stable. And I'm curious as to, with this new data and potentially earlier patient starts, where you think the growth could be."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure. So in part, as Medicaid patients for Opsular goes, it's about 14% of paid patients You know, as we said in the past, we had such good coverage for Medicaid throughout all 50 states that it was sort of grew faster than perhaps the commercial patients. So, I think that answers part of your question. For Jackify and PV, I guess if you're looking at the slide that we had there, you know, PV, it continued in terms of the patient share. It, you know, is about 35% or so. At any given time, for example, this year, the year to date, there's more than 8,000 patients on PV. But PV patients stay on the drug for a long time. So we're talking about what we think now the average is about 41 months that patients are staying on Jackify for PV. So that's important. So every new PV patient becomes that more important. And we think that there's lots of patients who are currently on other therapies, including hydroxyurea, that would benefit from moving to Jacobi earlier. And now that we have a study where there was no crossover, so that you can actually evaluate the long-term thrombosis-free survival and, in fact, progression-free survival for patients, that that's really an indicator that you really should start earlier with an effective therapy like Jacobi. And we think that's really where The upside is here is that each and every PD patient is valuable, and we can provide them with really effective therapy to manage their disease long-term."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So that's what our growth expectations are. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Next question today is coming from Andrew Barron from SBV Securities. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, thanks. Can you remind us how you see 33-989 fitting into the treatment paradigm for MF relative to the JAK agents? And then do you see the regulatory pathway leveraging surrogate endpoints for approval, or would you want to show a decrease in malignant transformation in this subgroup?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. Andy, were you asking about, Steven, just to clarify your question about mutant CalR and V617F in the future? We couldn't hear clearly your first part of your question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I'm just trying to understand how you see that fitting into the treatment paradigm relative to the JAK agents."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, great. Thank you. So, you know, as Pablo said in his remarks, you know, a remarkable effort from our research group to come up with compounds that now, you know, target new areas of biology. So in terms of mutant CalR, it's about 25 to 30% of myelofibrosis and ET. It's a neoantigen that's expressed, and the antibody targets that and could eradicate the clone. So you could be talking about a very new treatment paradigm that's disease-modifying or potentially, in inverted commas, curable if you eliminate the clone in those settings. Obviously, we early in the clinic, We need to prove it's safe and get there. But there's a lot of excitement, and obviously I got a plenary at ASH last year because of that with the mutant calor antibody. In terms of where it fits in, you know, it won't be an agent that's, you know, in the way we think about spleen volume reduction and symptom improvement. It could be, as I said, to be a little bit repetitive, eliminate the clone and sort of get rid of the disease, if you will. The same with V617F, you know, a target that many have pursued for a long time. And again, you know, credit to our research group for coming up with, as Pablo pointed out, a very novel way of targeting the mutation in the JH2 domain. And then again, the idea would be to eliminate the clone and disease-modified. And this is a bigger population. It's about 50% of MF, 60% of ET, and 95% plus of polycythemia vira. So for the first time now, we've been able to show you that we've come up with a target in PV where it's an area where we haven't been able yet to give you anything new beyond RUC. So we're very excited about that. Again, it's early. We have to get the IND across the finish line and get into the clinic. But it's superb science and would be a very different way of thinking about those entities. So thanks for the question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Next question is coming from Jay Olson from Oppenheimer. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, this is Sean. I'm live for Jay. Thanks for taking the question. So just follow on the prior question just for the B617F mutations. I'm just wondering, you're thinking about the monotherapy versus combination approach going forward. And just on the slide, it seems like those cholera mutations and B617F mutations are mutually exclusive. So just want to confirm if that's correct. And just a quick question after Laura, wondering if you can talk about the splits between AD and vitiligo in 3Q. That'd be great. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So this is Pablo. Let me take the first part of the question. So as Stephen mentioned, and I explained in my remarks, it's early days for both programs. I think that when you start thinking about how to position them and the potential combination with Jacify, I think we need to get through a few cohorts in the Phase I studies, understand the profile of these two new medicines, and then we'll start building a combination strategy. I think potentially that could be the case, particularly as you start thinking about symptom resolution, which I could find early in the treatment paradigm, and then using either V617F or the mutant CalR antibody to then try to eliminate the clone and potentially transform the outcomes in these diseases. The second part of your question, I think, was related to whether these are mutually exclusive, and they are. And that's actually an important point in understanding how to position them in the future. And then I think you had a question about AD, which I'll pass over to Barry. Yeah, Jung, I didn't really hear you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So AD versus Vitiligo, what were you trying to say? What is the script volume?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, the script splits between AD and Vitiligo. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure. Currently, it's about 60-40. So 60 AD, 40% Vitiligo."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Next question is coming from Ben Benjamin from J&P Securities. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, good morning, guys. Thanks for taking the questions. Maybe for Steve and Stephen, can you talk a little bit about how you view the competitive landscape in PN and NHS? And could the landscape change prior to your phase three readouts? Or are you the clear sort of market leader in both indications? And I guess just as a second sort of follow-up question, maybe for Hervé, you guys are generating significant, you know, cash flow. You have a strong balance sheet. The pipeline is largely ignored by investors and is, you know, significantly down. Can you talk maybe a little bit about the process that you might be going through to, you know, maybe switch gears, maybe acquire an entire company platform pipeline and all versus striking kind of one-off product collaboration agreements?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I'll start and then hand it over to Stephen. So let me remind you, so porvacidin is an oral agent. In both entities you're talking about, you know, are becoming, you know, very interesting in terms of the science, a lot of targeting with different modalities, but they're mostly intravenous IVs. large molecules that target things like IL-17, so very specific biology, whereas in, you know, these entities, there's more broad biology, and that's why we think JAK may be important here, both in PN and HS. So an oral agent, now we've shown, you know, what we think is very strong proof-of-concept data in both entities. HS, we have ongoing two phase threes, and PN will be proceeding there. Sure, you know, the landscape can always change as part of any assessment we do. We look at the competitive landscape and what may occur. But in terms of, you know, an oral agent, we think that's the big differentiator here. And then I'll hand it over to the second part of your question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So your question about, you know, the way are we sort of turning into a new direction regarding the use of cash? And the answer is we are... still continuing to look at opportunities outside of the company. We are still investing in our pipeline, but as you have noticed, you know, our growth of the revenue continues to be faster, higher than the growth of our expenses. So we continue to generate leverage and we continue to have an increasing cash flow, you know, quarter after quarter. And we are looking at opportunities to continue to add to the growth of the corporation in the year 25 to 30. So it's a relatively broad target. Obviously, valuations have been fluctuating a lot in the past in the past month, and it's creating opportunities that we are looking at. So there is a clear willingness for the right price to add new products that will be fitting with our portfolio If we can, we could do it through partnership or acquisition. In fact, we think both would be appropriate, and it's a financial question or it's a question of willingness to go one route or the other. But we could do it either way."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Next question is coming from Derek Archilla from Wells Fargo. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning. This is Seba on Fort Derrick. Thanks for taking our question. A quick one from us. Can you provide some color and the pace of the pipeline development and whether it will be timely enough to offset JAXA loss of exclusivity? Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So thanks for the question. Absolutely, that's the case. So I'll be a little repetitive. You know, the XR program, we're busy in terms of response to the FDA now, and the idea is to get the XR approval prior to the loss of the LOE for RUX. Both BET and ELK programs, you know, we want to declare where we go, and if we go into registration studies, you know, end of this year, early part of next year, and it'll give us enough time to execute a phase three program and get across the finish line there. So that's absolutely the intent. The mutant CalR and V617F, as Pablo said, are early, but with great promise of disease-modifying And so it's a little unclear, the regulatory part there, and it'll depend on demonstrating safety and efficacy. But we will, you know, we'll see. If that keeps going well, you could potentially execute a, you know, rapid phase three program, but it's really too early to say."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks. Maybe I can add, I mean, on this view about the Jakafai patent expiration and the way we are sort of allocating resources. That's basically the eight programs. You saw one of the slides is speaking about the eight programs that we are prioritizing in R&D, and that's where you have the list of the programs that will be impacting our revenue in the years that are coming relatively soon, with Calar being maybe the one that is a little bit of a stretch, but for everything else it could come later. Before that time, and the povacitinib program, which is increasing, today we had the news of an additional indication in prorigo nodularis, is in phase 3 now for one indication, HS. Phase 3 is being planned for prorigo nodularis and vitiligo, so all of that should be coming in the years that precede the patent expiration for JAKATRAC. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our final question today is coming from Evan Siegerman from BMO Capital Markets."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, Mark Mothman on for Evan. Just wanted to ask with the pre-submission meeting with FDA planned for Ruxcreen in pediatric patients, are there any nuances with that submission in the pediatric population versus adults that you think will require special consideration for the FDA and Insight? And has there been any indication on when that meeting may take place? Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Steven, so we don't, you know, guide to when we have the actual meetings, but the only nuance impedes is, you know, some safety requirements to demonstrate under maximum use conditions that there's no, you know, increased levels or untoward side effects. We've completed that work. We're satisfied with the results and we're discussing it with the FDA. So that'll put our submission, you know, sometime later. hopefully in the first half of next year in terms of having that complete data set and submitting it then, and we're very comfortable with the data. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. We've reached the end of our question and answer session. I'd like to turn the floor back over for any further closing comments."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you all for participating on today's call and for your questions. The IR team will be available for the rest of the day. Please don't hesitate to reach out. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. That does conclude today's teleconference and webcast. You may disconnect your line at this time and have a wonderful day. We thank you for your participation today."
    }
]