[
    {
        "date": "2023-02-07T08:00:00-05:00"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hello, and welcome to the Insight fourth quarter and full year financial results conference call and webcast. If anyone should require operator assistance, please press star zero on your telephone keypad. A question and answer session will follow the formal presentation. As a reminder, this conference is being recorded. It's now my pleasure to turn the call over to Christine Cho, head of investor relations. Please go ahead, Christine."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Kevin. Good morning and welcome to Insight's fourth quarter and full year 2022 Earnings Conference Call and Webcast. The slides presented today are available for download on the Investors section of our website. Joining me on the call today are Herve, Barry, Stephen, and Christiana, who will deliver our prepared remarks, and Dash, who will join us for the Q&A. Before we begin, I'd like to remind you that some of the statements made during the call today are forward-looking statements. and are subject to a number of risks and uncertainties that may cause our actual results to differ materially, including those described in our reports filed with the SEC. We will now begin the call with Hervé."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Christine, and good morning, everyone. 2022 was another successful year in which we delivered strong commercial performance and made significant advancements across all stages of our oncology and dermatology pipelines. Revenues from our current portfolio of commercialized products grew 18% year-over-year, both in the fourth quarter and for the full year, to $764 million and $2.7 billion, respectively. Total revenues for the year, which include our royalty, grew 14% to $3.4 billion. As we look across our portfolio, the drivers of this double-digit growth are the continued commercial execution for Jackify, net sales of which increased $275 million in the year to reach $2.4 billion, and initial contributions from recently launched products and indications, including Minjuvi and Pemezir in Europe and Japan, and Opselora in the U.S. I want to touch briefly on Opselora, which we believe will be a significant growth driver for Insight. Opselora was approved in September 2021 for atopic dermatitis, and this past July we received approval and launched Opselora in vitiligo as the first FDA-approved therapy for repigmentation. The approval was well received by dermatologists, patients, and patient advocacy groups, and the launch has been very successful. Strong patient demand and increasing formulary access drove net sales of 61 million in the fourth quarter and 129 million for the full year. In 2023, we expect an approval for Opselora and Vitiligo in Europe, which adds another layer of growth for the franchise. Turning now to our regulatory and R&D achievement, our clinical development pipeline is focused on three therapeutic areas, MP and GVHD, other hematology and oncology, and dermatology, and we made significant progress across each of these three areas. In Limburg, we presented new data from ongoing combination studies and disclosed an important new discovery asset targeting mutant cholera, which has the potential to be a disease-modifying therapy for approximately 30% of patients in MF and ET. In other hematology and oncology, we presented updated data for our oral PD-L1 inhibitor, 2-8-0, which shows promise both as a monotherapy and combination agent. We also progressed parsaclizib into phase 3 for warm autoimmune hemolytic anemia, a disease in which there are no approved therapies. And in dermatology, we continued to expand our portfolio with Obcelora and Povercitinib focusing in disease areas where there is a significant unmet need. Lastly, we had two important updates relating to patents. The first is that INSIGHT earned pediatric exclusivity, which entitles INSIGHT to six months of exclusivity added to our patents for JAKAFI and OBSERWA. This expands our ability to enforce our JAKAFI patents through December 2028. This extension further applied to our existing Obserora patent. In addition, late last year, we obtained an issued patent and allowed claims for the treatment of atopic dermatitis and vitiligo, respectively. We are confident in the strength of these claims, permitting us to protect Obserora out to 2040 in the U.S. Before moving into the outlook for 2023, I wanted to take a moment to look back at the growth of our product revenues as shown on slide 6. Over the past five years, approvals for new products and indications, as well as strong commercial execution of our existing portfolio, has allowed us to grow our product revenues at a CAGR of 18%. On slide 7, looking at our historical operational performance. On the left is our revenues versus our total R&D and SG&A spend. We have delivered strong operational performance over the past five years, with total revenue growing at the 17% CAGR and our operating expenses growing at the 13% CAGR. On the right, we are showing our operating leverage, excluding the impact of dermatology on revenues and sales and marketing expenses. Here you can see our operating performance is even more pronounced. We can expect to drive further operating leverage over time with our high-growth dermatology franchise, which is in early stages of launch and where we could see two additional approvals in the near term. Turning to slide 8, as we look ahead for insights, there are four main drivers of sustainable growth, and we are already making significant progress in each of these areas and expect to continue the strong momentum throughout 2023. The first driver is our JAKAFI franchise and LIMBER program, where we aim to expand our leadership in MPN and GVHD. In 2023, beyond the approval of Roxolitinib XR, we expect important data, including pivotal results for our part-activity combination in suboptimal responders to JAKAFI in MF. Next is Opselora, where we are launching in AD and VT-Ligo, and where in 2023 we will be launching in Europe. In other areas of clinical development, we expect new data from our oral PD-L1 program and povacitinib in prurigo nodularis and VT-Ligo. Lastly, we will be monitoring early data from our CDK2 and mutant color program. With that, I would like to pass the call to Barry."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Hervé, and good morning, everyone. In the fourth quarter, Jackify net sales grew 9% year over year to $647 million and grew 13% for the full year to $2.4 billion. Total patient demand rose 7% in 2022, driven by an increase in new patients across all indications. The launch of Jackify in chronic GVHD continues to be strong. with the total number of patients in Q4 growing 11% versus prior year quarter. A key driver of growth in GVHD is the duration of therapy, and based on recent data, the average duration, which includes both acute and chronic, is approximately 15 months. On slide 11, as you can see on the left, Jackify has grown consistently year over year, ranging from 200 to 250 million each year. We expect to continue strong growth in 2023 with full-year net product revenues to be between $2.53 to $2.63 billion. Turning to Opsalura on slide 12. We had a strong quarter for Opsalura with continued double-digit sequential growth in patient demand in atopic dermatitis and a very successful launch in vitiligo. As you can see on the chart on the right, total demand, which includes both free and paid drug, grew 34% in Q4 versus prior quarter to reach 84,700 units, driven by both new patient growth and an increasing number of refills. Paid demand, as shown by the light blue bars, grew 52% in Q4, driven by continued improvements in formulary access. net sales grew 61% versus prior quarter to $61 million. Total full-year net sales for Opsalura were $129 million. Looking ahead, we expect both AD and vitiligo to be significant growth drivers for Opsalura. In AD, Opsalura is the number one prescribed branded agent for new AD patients and its impact on itch, which remains unmatched by any other topical therapy, continues to be the primary driver of prescribing. We expect the efficacy profile of Opsalora to continue to drive uptake in AD. In terms of additional near-term growth opportunities, pending the results from the Phase III trial, we could see an approval in pediatric AD next year for 2- to 11-year-olds. In Vitiligo, the size of the market and the potential opportunity is substantial. There are an estimated 1.5 million patients diagnosed with Vitiligo in the U.S. And prior to Opsalura's approval, an estimated 150 to 200,000 patients were motivated to seek treatment. As you know, Opsalura is the first and only product to be approved to help patients repigment their skin. And this provides us with an opportunity to activate many of the 1.3 million patients that are naive to treatment or who have stopped seeking treatment altogether. And in the next few months, we expect the approval of Opsalora and Vitiligo in Europe, where there are an estimated 1.5 million diagnosed patients living with the disease. Slide 14 shows a few examples of patient advocacy and consumer activity within the Vitiligo community. We are already seeing high awareness and excitement for Opsalora from patients, and we will continue to build on that momentum throughout the year, including the commencement of TV direct-to-consumer this quarter. And lastly, on Monjuvi, Minjuvi, and Pemizir. Monjuvi sales in Q4 were $24 million, up 13% year-over-year, and revenues were $89 million for the year. The launch of Minjuvi is ongoing in four markets, and we continue to gain reimbursement in other European countries. Net sales for the full year were $20 million, which includes a negative $2 million of foreign exchange impact. Tamizir grew to $83 million in net sales in 2022, with $20 million coming from outside the U.S. Again, negatively impacted by foreign exchange by $3 million. In the U.S., Pemizir continues to grow in total patients on therapy and is established as the standard of care for patients living with cholangiocarcinoma with FGFR2 alterations. With that, I'll turn the call over to Stephen."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Barry, and good morning, everyone. We made significant progress across our clinical development portfolio in 2022. We had multiple clinical and regulatory achievements throughout the year, And I would like to use the next few slides to highlight a few of the key programs. Starting with our LIMBA program on slide 18, key data were presented at the 2022 American Society of Hematology Annual Meeting, where we had 57 abstracts accepted for presentations. Highlighting two of those presentations, starting on the left, we presented initial results of the Phase 1-2 study evaluating our ELK2 inhibitor, Delurgicertib, in monotherapy and in combination with ruxolitinib, which demonstrated improvement in anemia and hemoglobin responses in patients with myelofibrosis. Additionally, we disclosed our discovery of 989, a novel anti-mutant calverticulin monoclonal antibody, which has been shown to selectively inhibit the proliferation and differentiation of cells harboring mutant cal-R while not affecting wild-type or normal healthy cells. On the right is a list of key updates across Limba that are expected this calendar year. Starting with ruxolitinib XR, we have a PDUFA date of March 23rd this year, and the expected approval is an important step towards fixed-dose combinations with paraclisib, sulurgicertib, and our BET inhibitor. In terms of data, we expect pivotal Phase III data for ruxolitinib plus paraclisib in suboptimal responders, as well as more mature data sets of ruxolitinib with ELK2 and BET in the second half of this year. Depending on what we see with ELK2 and BET combinations, we could potentially see the start of pivotal trials with one or both of these compounds. Early in the pipeline is our anti-mutant CalR monoclonal antibody, which will enter the clinic this year. With regards to graft-versus-host disease, we're expecting pivotal data mid-year from Agave201, study evaluating axotilamab in third line chronic graft-versus-host disease. Moving to the rest of our hematology and oncology portfolio, key data for the small molecule oral PD-L1 program were presented at the Society of Immunotherapy of Cancer Annual Meeting. Both 280 and 318 demonstrated clinical activity with tumor shrinkage and were generally well tolerated, and we expect to share more mature data set in the second half of this year. In addition, we plan to initiate combination trials of 280 with adagracib, CTLA-4, and an oral VEGF inhibitor in the first half of this year. INCB123667, our novel, potent, and selective oral small molecule inhibitor of CDK2, entered Phase I clinical development. Here we could see utility in cyclin E amplified or overexpressing cancers as well as in cancers that are resistant to CDK4-6 inhibitors. Now looking at our dermatology franchise on slide 20. In July of last year, Opsalura gained its second indication in vitiligo. This was a huge achievement for the vitiligo community and people living with the disease. As we continue to maximize the potential with ruxolitinib cream, we initiated multiple phase two studies in different conditions, including lichen planus, lichen sclerosus, and high adenitis suprativa. In each of these diseases, there are no topical or oral therapies approved. We have many important milestones in dermatology upcoming in 2023. Oloraxalitinib cream, the CHMP opinion in vitiligo is currently on track for the first quarter of this year, while data from the phase three vitiligo maintenance and withdrawal study and the phase three pediatric AD study will be available in the first and second half, respectively. Turning to polvositinib, we expect Phase II data in both vitiligo and prurigo nodularis later this year. And additionally, I want to highlight that later this week at the European Hieradenitis Superativa Foundation, we have an oral presentation of the updated 52-week data from our Phase II study in HS, which should provide some additional insights into the durability of response with this agent. And lastly, oromolimab. our newly acquired IL-15 receptor beta monoclonal antibody is expected to enter the clinic for vitiligo. As you can see on slide 21, we're looking forward to another busy year with multiple regulatory and clinical updates. With that, I would like to turn the call over to Christiana for the financial update."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Stephen, and good morning, everyone. Our fourth quarter results reflect continued strong revenue growth with total product revenues of $764 million, representing an increase of 18% over the fourth quarter of 2021. Total product revenues are comprised of $647 million for Jaka-Fi, $55 million for other hematology oncology products, and $61 million for Opsilura. Net product revenue growth was primarily driven by increases in Jaka-Fi and Opsilura net revenues. Other hematology-oncology net revenues, which include revenues from Iclousic, Pemazir, and Minjuvi, were impacted by untravellable changes in FX rates. On a cost-to-currency basis, other hematology-oncology net product revenues grew by 23% over the prior year period. Total royalty revenues for the quarter were $132 million and are comprised of royalties from Novartis of $91 million for Jacovi, and $4 million for Tabrecta, and royalties from Lilly of $36 million for Olumient. Jacovi and Olumient royalties for the quarter were negatively impacted by FX headwinds, while Olumient royalties were also impacted by a decrease in net product sales of Olumient for use as a treatment for COVID-19. Excluding the impact of COVID-19-related sales and currency fluctuation, Olumient royalties increased 23% compared to the prior year period. For the full year 2022, total net product revenues were $2.7 billion, and total revenues were $3.4 billion, representing 18 percent and 14 percent year-over-year increase, respectively. Moving to slide 25, Obsolura net product revenues for the quarter were $61 million, driven by robust demand and broadening payer access. As payers continue to add Obcelura to formularies and the share of covered claims increased, we continue to see improvement in the gross to net discount rate. The gross to net discount rate decreased from an average of 71% in the third quarter of 2022 to an average of 57% in the fourth quarter of this year, and we exited 2022 at a gross to net discount rate of 50%. While we will continue to work on reducing patient copay and in turn improving gross-to-net, an average gross-to-net of 50% is a good working assumption for 2023, with a gross-to-net discount in the first quarter of the year expected to be higher than subsequent quarters as plans reset patient deductibles at the beginning of the year. I would also like to take the opportunity to update you on the Obselura prescriptions data provided by IQVIA. As you see on slide 26, in Q4, we saw the gap between the actual number of total prescriptions and the number of prescriptions reported by IQVIA narrowing. While the IQVIA data continues to overstate demand, this overstatement has been reduced to a level of 5 to 10 percent, which is within expectations for a newly launched product. In addition, it is important to note that IQvia data reflects total demand, which includes both paid prescriptions and free drug. Going forward, free drug is expected to represent around 20% of total demand. When looking at IQvia data, one would need to adjust for this overstatement as well as for free drug in order to get a better sense of paid demand. Moving on to slide 27 and our operating expenses on a GAAP basis. Ongoing R&D expenses were $431 million for the fourth quarter and $1.5 billion for the full year 2022. Total R&D expenses, which include the upfront consideration of $70 million for our acquisition of Vilaris, were $501 million for the fourth quarter. For the full year 2022 total R&D expenses, which in addition to the Vilaris upfront payment also include $56 million in other milestone payments, were $1.6 billion, representing a 9% year-over-year increase. The increase was primarily due to the progression of our pipeline and was partially offset by lower upfront and milestone expenses in 2022. Total SG&A expenses were $273 million for the fourth quarter and $1 billion for the full year 2022. The year-over-year increase was driven by investments related to the new dermatology commercial organization in the U.S. and the related activities to support the launch of Hoxelura in atopic dermatitis and vitiligo. Moving on to 2023, I will now discuss the key components of our guidance on a gap basis. For Jakafai, we expect net product revenues to be in the range of $2.53 to $2.63 billion, which at the midpoint represents an increase of approximately $170 million over 2022, driven by continued growth across all indications. We expect our gross-to-net adjustments for 2023 to be approximately 23%, reflecting expected continued growth in 340B volumes. As a reminder, the gross to net adjustment in the first quarter of the year is always higher relative to other quarter and previous quarter and subsequent quarters due to our share of the donut hole for Medicare Part D patients. For other hematology oncology products, which include Pemazir in the U.S., EU, and Japan, and iClusic and Minjuvi in Europe, we're expecting total net product revenues to be in the range of $215 to $225 million. Turning to operating expenses on a GAAP basis, we expect COGS in a range of 7% to 8% of net product revenues, which is in line with 2022. R&D expenses are expected to be in the range of $1.61 to $1.65 billion, representing 3% year-over-year growth at the midpoint. SG&A expenses are expected to be in the range of $1.05 to $1.75 $1.5 billion, primarily reflecting continued investment in Opsalura and the full year impact of the investment in the vitiligo indication. Operator, that concludes our prepared remarks. Please give your instructions and open the call for Q&A."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Now we're conducting a question and answer session. If you'd like to be placed in the question queue, please press star 1 on your telephone keypad. A confirmation tone will indicate your line is in the question queue. You may press star two if you'd like to move your question from the queue. For participants using speaker equipment, it may be necessary to pick up your handset before pressing star one. One moment, please, while we poll for questions. Our first question today is coming from Salveen Richter from Goldman Sachs, your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning. Congratulations on the quarter. Two questions for me. One is, you know, I recognize you do not provide Opsalura guidance for this year. But can you provide any details on duration of treatment or number of tubes per year on average for an AD patient and how it might play out in vitiligo? And are there any inventory dynamics to highlight here? The second question is on the BET and ALK2 inhibitor combinations. Can you speak to your confidence in these programs now, given the early data? Do you think that represented proof of concept? And what do you want to see on the forward to move into later stage studies?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure, Salvina. I'll answer the first part of the question or the first question and get it to Stephen afterwards. So just in terms of duration of therapy for Opsilor and Vitiligo, it's obviously very early in the launch. So as far as continued duration of therapy, you know what the study has had continued through 52 weeks and beyond. And the tubes per year, we've said before that the average tubes per year we think will be about 10 for Vitiligo patients. In terms of inventory at the end of the year, it's actually very low. The inventory was more like two to three weeks, just the standard inventory that we would have on hand. Steven?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Selvi. And I'll just separate out both programs. So I'll start with the ELK2 program. You know, we are very excited at the end of the year to receive towards the end of the year the update in terms of ELK2 showing increases in hemoglobin. Prior to that, we had seen proof of mechanism in terms of hepcidin decreases, but we hadn't seen hemoglobin move. And then both in the monotherapy escalation and in combination with RUX, we saw a few patients with quite substantial hemoglobin increases, which gave us a lot more confidence in that program going forward. For this year, in the beginning of the year, we'll continue to dose escalate. We still had relatively low doses, particularly in combination with RUX. to get, you know, towards a maximum effect. We don't expect to see much in terms of tolerability, in terms of negative side effects at all. The populations that would be in scope for pivotal studies, to begin with, the obvious one would be anemic patients with transfusion dependence, to convert them to independence, but then standard anemic patients with, you know, anemia from the underlying MF, and then potentially all comers. And the reason is, you know, the dual effect. So both to treat the underlying anemia from myelofibrosis itself, and then to ameliorate or even reverse the ruxolitinib-induced anemia, which will allow you to maintain rux dose intensity. And we know when we do that, that we increase the efficacy of ruxolitinib. So, you know, we're extremely encouraged by what we've seen with ELK2. We'll continue to dose escalate. And then we'll make pivotal decisions on what population or populations to go after with their program towards the end of this year. In terms of the BET program, again, we know that pathway epigenetically is important in myelofibrosis. We see both spleen response as well as symptom responses. We also continue to dose escalate this year. particularly in combination with ruxolitinib, will continue to push the BET dose from 6 milligrams to 8 milligrams to 10 milligrams. We know that the on-target toxicity with BET will be thrombocytopenia. It's across the board with BET inhibitors. We've seen it with our own program, and that'll be dose-limiting. The likely population there to go after the pivotal study, at least to begin with, because of that profile, would be suboptimal responders. And just to note, that the competition is doing a first-line study at the moment, so the suboptimal population, we think, is wide open to go after. And again, we'll determine that towards the end of this year. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Thank you. Next question today is coming from Brian Abrams from RBC."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, good morning. Thanks so much for taking my question. I was hoping you could unpack the Jackify guidance a little bit more. It sounds like at the midpoint of your range, you may be expecting a little bit less contribution from both either demand growth or price growth. And it seems, for our quick math, that gross to net is going to be relatively stable there. So I was wondering if you could maybe talk a little bit more about some of the assumptions underlying that in terms of demand across different indications. and net price that shapes this guidance and whether, you know, if dynamics perhaps remain as they are today, we could potentially see upside to that. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, Brian. It's Barry. So, thanks for the question. Yeah, I mean, as you know, that Jacify is really the number one treatment for myelofibrosis, the number one treatment for polycythemia vera in the second-line setting. And for GVHD in both the acute and chronic steroid refractory setting, Jacofi is the number one drug. But in terms of, you know, our guidance, the appropriateness is we think it's perfectly appropriate for right now, given the fact that we'll have actually a third competitor in the middle of the year for MF. There's two competitors for GVHD now. If you remember last year in terms of GVHD, We had, you know, a bolus of growth in the fourth quarter of 2021 as patients transitioned from our expanded access program, about more than 300 of them transferred from our expanded access program to commercial drugs. So seeing that kind of growth again is not, you know, it's not likely to happen this year, but we'll continue to see the drug grow quarter over quarter, year over year in terms of new patients, total patients in MF, PV, and GVHD, but again, the guidance at this point is appropriate."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "That's really helpful. Thanks, Barry. Thank you. Next question is coming from Jessica Five from JP Morgan. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Good morning. Thanks for taking my questions. Looks like you hit the 50% exit rate on Opsalura growth to NETs in the fourth quarter. Can you talk a little bit about how we should think about gross to net in 2023 for that product and any quarter to quarter variability we should look out for?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, this is Christiana. So in terms of the gross to net in 2023, I think the 50% average rate for the year is a good working assumption. However, you will see variability between quarters and expect the rate in Q1 to be above that 50% average rate and above the rate that you will see in other quarters. And that's because, as I indicated, at the beginning of the year, you get the plans to reset deductibles for patients. And as a result, there is more for us to cover,"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "increases further the gross to net rate. Great. Thank you. Thank you. Next question is coming from from Bank of America."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi. Good morning. Thanks for taking my questions. On Opsalura, will the split between Vitiligo and AD influence what your gross to net will be for this year? And then secondly, longer term, do you expect any difference in compliance rates between patients on vitiligo versus AD? Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So I can take the first part of the question. No, we don't expect any difference in gross to net between the two indications."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So in terms of difference between compliance rates, no, we don't expect difference. As I said before, In vitiligo, we believe that the average will be about 10 tubes per year. So obviously, these patients are staying on it for a long period of time, as long as 52 weeks and beyond. And in terms of AD, patients use it until their inflammation and itch is gone. Then they generally will stop for a while. If their flare comes back, their itching comes back, their inflammation comes back, then they'll start using it again. I believe they're compliant. It's just different diseases, obviously, some needing short-term use and some, like vitiligo, that are going to use it probably for a long period of time."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks. And have you noticed any seasonality during holidays?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, seasonality during holidays, well, you know, in holidays, generally, across the board for all of our products, generally during holidays like Christmas and Thanksgiving, for example, you see prescription rates go down. But in terms of, you know, summer versus winter, we don't see any difference now and don't believe that there's really any evidence that there's a difference in seasonality for AD or vitiligo. Amongst individual patients, they may perceive the difference being that there's differences in the summer versus winter and so forth."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Next question today is coming from Vikram Parojit from Morgan Stanley. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning, thanks for taking the questions. But two on dermatology from our side. First, for the phase three data expected later this year for Ruxetrine in the pediatric AD population, what would you consider a strong outcome here and how do you size the commercial opportunity with the pediatric population versus the adult population? And then my second question is on povorcitinib. For the data expected in the first half of this year for vitiligo, Again, what would you consider a good outcome, and how do you envision povoracetamib being used if it's eventually approved versus Opsalura?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Vikram, hi. It's Steven."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So the pediatric atopic dermatitis study, as Barry said in his prepared remarks, addresses the population from two years of age up to 11 years of age, so outside the label currently. So that's its importance. That's about 2 million patients in the U.S. in terms of epidemiology and the opportunity there. You know, safety-wise, we expect – so efficacy-wise, firstly, we expect it to be, you know, the same as in adults. There's no reason that the pathophysiology of the disease is the same. We expect the same outcomes. And then safety-wise, we don't expect anything unusual either. You know, they separate the populations out for obvious reasons like, you know, this is a time when bone growth, et cetera, is occurring. So there are other things that are monitored from a safety perspective. But from our, you know, preclinical data and then data with oral RUX, which is at much higher exposures in pediatric patients, we don't expect anything unusual there. In porvacitinib, your second question in vitiligo, it's a different population to the RUX cream population. There's a slight overlap. But the porvacitinib indication that we go in afterwards is for patients with body surface area involvement of 8% or above. The current vitiligo label is 10% or below body surface area involvement, which compromises about 80% of vitiligo patients. Because of the slight overlap, it's not straight math, but the 8% or above is about 30% of vitiligo patients. And we think because of the more extensive vitiligo there, there will obviously be a different tolerability profile that would be accepted by patients and regulators in terms of therapeutic ratio. Every expectation of substantial efficacy given the mechanism of action. And also, you know, we know this will likely be treated as an oral JAK inhibitor in a quote-unquote inflammatory condition from a safety perspective. And so we're eyes wide open on that. So, again, substantial efficacy expected, and, you know, the safety labeling we'll deal with at the end."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, so Steven mentioned the commercial opportunity for children that are younger than 12, about 2 million. So, you know, when we think about pediatric patients overall, the percentage of pediatric patients that have eczema atopic dermatitis is greater than adults, but there's many, many more adults So, therefore, even a lower percentage, you end up with a higher number of patients that potentially have eczema. So, we think it's an exciting opportunity. We also think it's just great for patients because we believe that Opsalora is going to improve the lives of some of these patients with eczema who are younger than 12. Okay."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. Thank you. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Next question today is coming from Kripa Devarakonda from Truist. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, guys. Thank you so much for taking my question, and congrats on the quarter. I had a question regarding the survey results that you have for, you know, I think it's a doctor survey, and they talked about patient candidacy. Is that growth in what the doctors are saying about patient candidacy being reflected in new patient starts, or is there a lag? And also if you compare new prescriptions for atopic derm versus vitiligo, are you seeing the patient candidacy stats being reflected? It seems like there's more enthusiasm in the vitiligo. I mean, granted, it's the only drug approved. And just, I know you don't give up the Lura guidance, but I was just wondering if in the future there is any plan to provide some sort of visibility or guidance for Obzalura? Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure, Kripa. This is Barry. So, again, in terms of patient candidacies or surveys that we do of dermatologists, of healthcare professionals who treat these diseases, we think it does rapidly turn into increased prescription volume. For vitiligo, it just may take a little bit longer because, remember, we're encouraging patients to come back because now there is a treatment. for vitiligo where there never was, so to go back and see their dermatologist. So that might take a little longer period of time than patients who are actively being treated for eczema but aren't getting results that they expect. So is there more enthusiasm in vitiligo? I think there's enthusiasm for patients who are suffering with atopic dermatitis to use a drug that's as effective, particularly in terms of itch and inflammation, as Opsalura. There's people who are very excited about using Opsalura for vitiligo and potentially, you know, changing how they feel potentially about themselves. In terms of the guidance, I'll turn it over to Christiana."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure. So, Kripa, we would like to see a few more quarters of uptake before we provide any guidance on Opsalura, which would also include vitiligo, and especially around vitiligo. very indicated. We are looking at the inactive patient population and how quickly they will get activated and will come to seek treatment. So, we would like to see that before we are in a position to provide any guidance on Opsalura."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. Thank you so much."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Next question today is coming from Eva Privatera from Cowan & Company. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, good morning. Congrats on the quarter and thanks for taking your questions. So for Opsalura, based on the press release numbers for total units and the Q4 net sales, we calculated a gross to net of 62% to 63%. Can you maybe help us understand what may account for the discrepancy between that and your Q4 57% gross to net number?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So the 57% is the average Q4 gross to net rate."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "How is free drug accounted in that calculation?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So free drug is not included in the calculation of revenues and it's not part of the gross to net. So you need to look at paid demand and apply the net price, which would be the 2000, around 2000 gross price times the one minus the 57% gross net discount."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, thank you. And are you still comfortable with the 40 to 50% long-term guidance range? It sounds like in the near term it'll be closer to 50. Can you possibly narrow that guidance now?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "We will continue to work on bringing down the copay, which over time would continue to improve gross-to-net. Obviously, getting further improvements now is more difficult. That's why we're saying for 2023, a 50% average gross-to-net is a good assumption for the year."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Another question on ALK. ALK2 has the potential applications to other anemias outside of myelofibrosis. Are you interested in some of these applications and what do you need to see from the MF program in order to open up some of these other studies perhaps?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. It's a good question. Mechanistically, as I was saying in my earlier remarks, it works through hepcidin inhibition That is the main mediator, if you will, of anemia of inflammation and chronic inflammation, which occurs in many chronic conditions. So there's potential across the board in some of those conditions, including chronic renal failure. So we're starting some early work in some of these settings to see if there's potential there. We are encouraged by recent regulatory movement in the U.S. from the FDA in improving products to treat anemia in areas like chronic renal failure, which has been difficult in the past. So that may make us look a little further. But for all those indications and the look there, it's still very early days."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, Steven."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Next question is coming from Evan Siegerman from BMO Capital Markets. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, guys. Thanks so much for taking my question, and congrats on the progress. You know, it's clear that there are really no supply issues for Opsalura, but maybe talk to me about kind of what the sales team is focusing on this year to accelerate growth even further. I mean, you had a good 2022. You are getting growth to net more normalized. What is your commercial organization focused on to get sales to the next level and ensure that you have the highest number of paid scripts, you know, over the year? Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure, Evan. So the sales team is actively engaged with their dermatologist on a regular basis. Fortunately, we have very good access as compared to, you know, some other therapeutic areas perhaps. They're focused both on AD and vitiligo. It's exciting that vitiligo launched just a short period of time ago, so that's very exciting because it's the only drug used that's available for repigmentation in these patients. But there's so many millions of patients that actually could benefit from Opsalora or atopic dermatitis. So they're really focused on both. So their drive is to focus on itch and inflammation in AD and obviously on sticking with Opsalora to treat their vitiligo. So they're concentrating on educating healthcare professionals, for example, in vitiligo that you know, what they should see over a period of time, over eight weeks, 12 weeks, 24 weeks, and so forth, so that they reinforce the compliance and the need to use the drug for a while before they see, you know, a real big impact on repigmentation. And in the same way, you know, they're concentrating on making sure that patients do, in fact, get their refills for atopic dermatitis so they get complete relief from their disease. and know that, you know, if they have flares again, they should come back. So the sales team is very engaged and very excited about the opportunities that lay in front of them for both atopic dermatitis and vitiligo."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, great. Thank you. Thank you. Next question is coming from Jay Olson from Oppenheimer. Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Oh, hey. Congrats on the quarter, and thank you for the update. For the limber program, Can you talk about the differentiation of RUX plus paraclisib versus RUX plus a BAT inhibitor, since they're both targeting suboptimal responders? And then what will you be looking for in the phase three readout of RUX plus paraclisib later this year, and how will that impact your overall strategy for the LIMBAR program? Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, Stephen, thank you. So, you know, the LIMBAR program, obviously critically important to us and to patients, and we really I'm happy with the movement, particularly towards the end of last year, in our combination work. So, to start off with, you know, your Rux plus Paraclisib question, just a reminder, there are two pivotal studies ongoing there. The first one is the suboptimal study in about 212 patients, which we will get a readout on this year. That's on patients who've had at least three months or longer of Ruxolitinib and at least eight weeks of stable dosing. and are having an adequate response in terms of spleen or symptoms. We showed the, you know, final phase two data at ASH last year, both in terms of spleen response and symptom response. And very encouragingly, the symptom response was even, you know, from a quantitative point of view and magnitude was even better than the spleen response, which is really encouraging. Additionally, the safety profile in MF looks very clean thus far with quite long-term follow-up. So it's not what's seen in lymphoma, probably because the underlying disease is different. There is no B-cell suppressive therapies given long-term in MF. And also additionally, used in combination with RUX may ameliorate some of the side effects. So we're very encouraged by the profile there. It's a randomized study. It'll report out this year in suboptimal responders. If we replicate the phase two data, we really think the phase three will be positive and is set up to be positive there. And then it will be exactly for those patients who are, you know, been on RUX for a few months, stable doses and not having benefit, and then that would be the indication there. The first-line study will take about a year longer to read out, 440 patients, and that's an all-comer first-line standard in terms of endpoints, spleen volume response of 35% or greater, and improvements in total symptom scores. You need both. You mentioned the VET program. You know, that's earlier. As I said in some comments earlier, you know, we continue to dose escalate this year and push the dose as high as we can. We know we'll run into thrombocytopenia that'll be dose limiting. And that's why we think it may be best suited more to a suboptimal population. And, you know, again, it'll be similarly to both improve efficacy and, you know, make sure it's tolerable in that setting. And then the populations will segment based on the data there. The rest of the ELK program, as I said earlier, will declare towards the end of this year what programs we're going after there. Again, very encouraged by the hemoglobin responses we've seen. We really have proof of mechanism and want to chase that very aggressively because we're leaders in that field."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Thank you for the details. Thank you. Next question is coming from Mara Goldstein from Mizzou Hill."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Oh, great. Thanks for taking the question. So, firstly, on the covered prescription rate, you mentioned you anticipate about 20% free drugs, so that would indicate you're at 70% covered at this point in time, or 71%. How quickly do you expect to get to that incremental difference, and is it consistent among vitiligo and atopic dermatitis? And secondarily, can you talk a little bit about the expectations for the rollout of RUX-QD and how we should think about how that will affect JAKIFY?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure. So, Mara, this is Barry. So, the covered rate, actually, the commercial patients that have access to commercial drug through their insurance is about 84% right now. In terms of coverage beyond that, it's about 90%. But obviously, these numbers don't match up because there's a lag in getting utilization criteria written and so forth. But we're very happy with the coverage that has happened thus far. We're very happy with, for example, Medicaid coverage, which is covered in all 50 states. And like I said, the commercial insurance continues to get better and better. We still have some work to do in improving a variety of things, including copay and utilization criteria that might not be exactly where we want it to be. In terms of AD and vitiligo, the coverage is essentially the same. The commercial coverage is essentially the same. The Medicaid VA DOD coverage is essentially the same. The only thing about vitiligo is there's some less, but it's improving every day. the number of utilization criteria that have been written related to Opsalora and Vitiligo. But I have to say, compared to when we launched atopic dermatitis, the number of issues, problems with getting Vitiligo scripts filled is very, very low. In fact, we don't hear that much about it at all. In terms of RuxQD, I think we mentioned already that the PDUFA date comes in March. We plan on launching sometime after that, a few weeks after that in April. And when we announce the approval, we'll give you some more information about how we're going to roll this out, the positioning and so forth of RUX-QD. But we're very excited about the upcoming launch. We think it really gives an opportunity for better convenience for patients, which could lead to better compliance for patients. And at least for some patients, better compliance could lead to better outcome. So we're really looking forward to that."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "All right."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks so much. Thank you. Next question is coming from Ren Benjamin from J&P Securities."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Your line is now live. Hey, good morning, guys. Thanks for taking the questions and congratulations on a great quarter. Just looking at the GVHD market, can you talk a little bit about the split between chronic versus acute? And how is the drug being used, especially in comparison to, let's say, you know, Brutinib. And I guess I'm curious, where does AXA kind of fit into this program, especially after the pivotal, you know, data expected in mid-23? And if I can just squeeze one extra one, can you just give us some thoughts on TAFA and, you know, how you're thinking about the reduced expectations for 2023, at least in the U.S.? ?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure, this is Barry. So in terms of the split between acute and chronic, you know, there's about 1,500 patients in steroid refractory acute GVHD. As I said before, you know, we're the number one drug used there in steroid refractory acute GVHD, but there's much less patients, and they're treated for a shorter period of time. So it might be, for example, six months for acute GVHD. For chronic GVHD, You know, there's 14,000 patients, maybe 7,500 that are steroid refractory. So most of the growth is coming from chronic GVHD and a persistence in chronic GVHD. Now, most of the time, you know, the claims that would come in don't really differentiate between acute and chronic. But as far as we can tell, the vast majority of scripts that are coming in now are all for chronic TB-HD, and as I said, in terms of persistent population, their persistent population is much, much bigger than in the acute space. In terms of ibrutinib and Resiroc, for example, these drugs are used perhaps in the third-line setting. As far as we can tell, ibrutinib usage is declining, and Resiroc's use is third-line after But in terms of axotilumab's opportunity, we think it's a great opportunity. In fact, even the success of Resuroc in the third line setting, I think, bodes well for the success of axotilumab in that setting. And I think it's, you know, a uniquely different drug. And when we talk to people who treat bone marrow transplant docs who treat GBHD, they're looking forward to this product very much. In terms of TAFA, you know, it's TAFA-LEN combination. It's a great combination in the second-line setting. You've seen the results in terms of overall response rate, complete response rate to 40%, you know, a non-chemotherapy option in the second-line setting. I think the issue there is really that, you know, the second line and the whole diffuse large B-cell lymphoma Marketplace has changed dramatically with increased competition, particularly with the CAR T therapies moving into the second line setting. It becomes a challenging place for us to break through, but it's absolutely a very good product that can have complete responses with long durations of response. And we're continuing to try to expand the use of this drug because we think patients will really benefit from it, and it's really just the competition and the increasing competition in that particular setting, in the Second Line Plus setting, that's somewhat of a challenge."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Thanks, Barry. Thank you. Next question is coming from Allison Bratzel from Piper Sandler."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi. Good morning. Thank you for taking my questions. One from me on Oxalura. I know a determinant of the ultimate size of the vitiligo opportunity is going to be activation of patients who aren't currently seeking treatment. I know it's clearly early days in the launch, but I'm just wondering if there's anything you can say about how patient activation is tracking against your expectations, or is this not really expected to be a driver until vitiligo-specific DTC is underway? And then just a separate question on the other HEMOC franchise. Just, you know, the 2023 guidance range seems to imply somewhat limited growth compared to 22. So just could you expand on the growth areas for that franchise for the year and any sort of pushes and pulls you considered in the 2023 guidance range? Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, so I'll start and then I'll hand off to Christiana, I guess. So, in terms of patient activation for vitiligo, I think it's happening already. You know, we haven't started, you know, linear and nonlinear TB commercials, direct-to-consumer TB commercials for vitiligo yet. That will start very soon. But patients are being activated. There's direct-to-consumer activities going on online, on social media, on Internet searches. We work very closely with the vitiligo patient advocacy community. We work with healthcare professionals and even do live programming between healthcare professionals and patients. So that is occurring now, and it will continue to a much greater degree in the future. I think you can see by our presentations, you know, there's lots of excitement for patients who have gotten very good experience using the drug and are proud to share that. So that helps a great deal in informing patients who may actually benefit from this drug. And in terms of guidance, perhaps I'll hand it over to Christiana."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So in terms of the guidance for other Himong, the guidance range that we have provided is $215 to $225 million with primary driver being Minjuvi of the increase, yeah."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Our final question today is coming from Matt Phipps from William Blair."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Your line is now live."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, thanks for putting me in. Barry, you cited additional competition in MF this year as a reason for the appropriateness of your guidance today. But I guess I don't really expect those labels to directly compete with Jackify. So I wonder if you're starting to see maybe patients who were kind of suboptimal responders switching a little earlier or, you know, now having another option to switch off of Jackify than they would have prior, and if that is kind of the impact you're talking about."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure, Matt. Yeah, no, so we don't really know necessarily, but we do think that the two drugs that are available currently, Fidratinib and Procritinib, are used in the second-line setting almost exclusively. If there's any use in the first-line setting, it's hard for us to determine that. In terms of future, you know, obviously we're looking to, Momelotinib has a PDUFA date in June. And we don't know what GSK is necessarily going to do with that product. We don't know what the indication necessarily is. But we think that, you know, patients will benefit, continue to benefit from JAKA5 because of the differentiation of overall survival, unsurpassed symptom improvement, and spleen volume reduction. We think that will continue and the other drugs will be used in the second line setting. But we're not sure. exactly how this is going to play out, and that's why I think we gave the guidance that we did."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. We've reached the end of our question and answer session. I'd like to turn the floor back over for any further or closing comments."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you all for participating in the call today and for your questions. The IR team will be available for the rest of the day for follow-up. Thank you and goodbye."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. That does conclude today's teleconference and webcast. You may disconnect your line at this time and have a wonderful day. We thank you for your participation today."
    }
]