Good day and welcome to the International Money Express Inc. second quarter 2023 conference call. All participants will be in listen-only mode. Should you need assistance, please signal a conference specialist by pressing the star key followed by zero. After today's presentation, there will be an opportunity to ask questions. To ask a question, you may press star, then 1 on a touch-tone telephone. to withdraw your question, please press star then two. Please note this event is being recorded. I would now like to turn the conference over to Mr. Mike Galentine. Please go ahead. Good morning and welcome to our quarterly earnings call. I would like to remind everyone that today's call includes forward-looking statements, including our third quarter and full year 2023 guidance. and actual results may differ materially from expectations. For additional information on International Money Express, which we refer to as Intermex or the company, please see our SEC filings, including the risk factors described therein. All forward-looking statements on this call are based on assumptions and beliefs as of today. We should not rely on our forward-looking statements as predictions of future events. please refer to slide two of our presentation for a brief description of certain forward-looking statements. The company undertakes no obligation to update such information except as required by applicable law. On this conference call, we discussed certain non-GAAP financial measures. Information required by Regulation G under the Securities and Exchange Act for such non-GAAP financial measures is included in the presentation slides our earnings press release, and our annual report on Form 10-K, including reconciliation of certain non-GAAP financial measures to the appropriate GAAP measures. These can be obtained in the investor section of our website at intermexonline.com. Presenting on today's call is our Chairman, Chief Executive Officer and President, Bob Lissy, and Chief Financial Officer, Andres Bendy. Also on the call today, are Chris Hunt, Chief Operating Officer, Joseph Aguilar, President, Latin America, Randy Nelson, Chief Revenue Officer, and Marcelo Theodoro, Chief Digital Officer. Let me now turn the call over to Bob. Good morning, and thank you for joining. We appreciate your interest in Intermex. We had a solid quarter of growth as we continued to build upon the company's sustained track record of multi-year expansion and we continue the profitable integration of both LaNationale and iTransfer acquisitions. On slide three, revenue increased 23.5 percent to $169.2 million. Net income was $15.4 million, a decrease of 3.5 percent, while EPS increased 2.4 percent to 42 cents a share. Adjusted net income was $18.4 million, up 0.6 percent, and adjusted EPS increased 6.4 percent to 50 cents per share. IBIDEA increased 11.7 percent to $30.9 million. Our CFO, Andrew Spendi, will provide a more detailed analysis of these metrics during his prepared remarks. While we continue to achieve our aspirations of double-digit EBITDA growth, our results reflect the challenges of traversing some top-line end wins. We have seen a slowdown in year-over-year growth to Latin America and the Caribbean markets, and this has stimulated increased price discounting in the marketplace. These challenges have emerged as we focus on the integration of a valuable acquisition that has made us a stronger company to Latin America and expanded our footprint into dozens of additional profitable corridors in Europe and Asia. After several years of overall market growing in the middle teens and above, the year-over-year growth, although still positive, has slowed. During the second quarter of 2023 through May, based on the latest available data, the top five countries in LACA, Mexico, Guatemala, El Salvador, Honduras, and the Dominican Republic grew at a much lower rate than they did a year ago. As a result of this market slowdown, numerous competitors have resorted to more aggressive discounting, primarily in the form of reducing FX gains to attempt to sustain their growth rates. We have experienced this phenomenon in the past, but this round has been a bit deeper and longer sustained than previously experienced. As a high-quality service provider in the industry, we are evaluating and modifying our pricing position to find the optimal price point to maximize profitability. It is not our intent or strategy to align our price with the discounters, but we will be more aggressive in an efficient and strategic way that maximizes growth. Ultimately, we believe the pricing pressures will subside. In the meantime, we will execute a modified plan that enables us to capture share in the current environment. We have created a strong business that has generated double-digit revenues, earnings, and cash growth to deliver long-term shareholder value for years. In the prior three years that ended 2022, the business generated $150 million in net free cash. This strong free cash performance continues in 2023, where we expect to produce more than $70 million in free cash. Today Intermex has nearly $100 million of available cash, which enables us to invest in future growth by expanding our business in multiple areas, like our presence in Europe, the acceleration of our digital business, our card products, and potential acquisitions. Our unique value-added model has attracted an increasing number of consumers from the Latin American community who rely on Intermex for their money transfer needs because of the quality of the experience and the trust we have gained. Our customer-focused, omnichannel business model utilizes superior technology and an operating infrastructure that is difficult to replicate. Powered by our state-of-the-art proprietary technology, we deliver value-added services to our customers through our extensive network of highly productive retail agents. We are confident that the differentiated business model we have built will prevail and sustain itself through any short-term disruptions, and Intermex will emerge as an even stronger, more successful company, as we have done throughout our history. On slide four, as we noted in the first quarter earnings call, the La National acquisition has resulted in us reassessing how we discuss market share from the U.S. to Latin America. In our market share analysis, we now include the top five countries in Latin America and the Caribbean, of which the Dominican Republic is a part. These countries collectively account for 82 percent of the money sent from the U.S. to that region. With the inclusion of La National, our estimated market share in the second quarter of 2023 in these key receiving countries is 21.7%, an increase from 20.4% in the second quarter of 2022, further solidifying our position as one of the leading remittance providers in that market. A significant opportunity exists in the U.S. markets to drive continued growth in market share. Our priority is to expand our footprint in the most populated foreign-born Hispanic zip codes, both with Intermex as well as our La National brand. Based on the foreign-born population from the National footprint, we see a tremendous opportunity for expansion across the East Coast. Additionally, a total of over 2,000 zip codes representing an opportunity of 1.5 million wires per month exists in the Intermex business. In an effort to more aggressively target this market, we have restructured our Intermex sales force. We have added a sixth region and a new regional sales director. Additionally, we have created 10 new sales districts to address the unserved opportunity. We also have restructured the national sales team to better capture these opportunities. Historically, most of our transaction growth is produced by the same store locations with the balance coming from new agents. As important as same store performance is to growth, the recruitment of new stores may be even more impactful. A new agent retailer creates incremental transactions in year one. Additionally, that retailer will grow by even larger percentages in year two and three. A continued pipeline of quality new agents is critical to new store performance, but even more important is same-store growth over time. We're confident that based on Intermex's superior service, our share of remittances within the store will grow as we become the preferred provider over time. To ensure the company maintains the pipeline of new agents to drive future growth, we continually review and analyze our field productivity metrics to ensure we allocate resources most effectively and cost efficiently. Additionally, we set agent recruitment targets down to the zip code level. but this is only the start. Within each of those zip codes, agents will be carefully screened to make sure they possess the necessary attributes and the commitment to delivering the highest quality of customer service. Our recent realignment complete with an increase in regions and sales district will position the company to better access these market opportunities. Turning to La Nationale, with the completion of the acquisition, We're actively integrating LAND's U.S. business according to our plans. We're also starting to capitalize on the significant opportunities that lie ahead in Europe with iTransfer. We're investing significant time evaluating the opportunity in Europe, and we believe the business unit has significant opportunity for outsized growth over the next several years. This opportunity exists both at retail and on the online digital side, further accentuating our omnichannel approach. In the second quarter, iTransfer business grew approximately 14% in revenue and grew approximately 70% in EBITDA. This business unit has an excellent foundation and we feel it has excellent growth potential. Our business has only scratched the surface of the full opportunity in Europe. We operate primarily in Spain and Italy with one company store in Germany. In the middle run, we will look to grow these countries out and expand to France, the UK, and other opportunities. As we mentioned previously, we believe that the Europe market will present a big opportunity to grow digital online wires as well. There will be more to come relative to Europe, but we see a tremendous future here. Simultaneously, as we seize the opportunity in Europe, we have made significant progress integrating and rightsizing LaNationale's U.S.-based business. The upside potential for LaNationale in the U.S. lies in rightsizing the retail network and maximizing efficiencies while expanding our presence in zip codes along the East Coast that are currently unserved. On Monday, we announced a restructuring of the U.S. business, which will result in approximately $1.5 million in annual savings starting in third quarter. Andrus will provide more insight into third quarter restructuring charges incurred that would trigger the $1.5 million in annual savings. The growth ahead of us will be driven by careful, disciplined operating rigor and bringing intermixed agent recruitment, agent performance model to this business unit. There are many opportunities to expand LaNationale's footprint into new zip codes. With our formalized restructuring plan, we are confident that we will achieve a 9% to 11% IBIDEA margin run rate by late 2023 or early 2024. La Nationale has proven to be a valuable asset for Intermex, and we're just beginning to unlock its full potential. We believe the combination of increased profitability of La Nationale in the U.S., coupled with the significant growth opportunities of iTransfer in Europe, will translate into hundreds of millions of dollars of revenue and tens of millions of dollars of EBITDA and free cash from these properties over the coming years. Among the other areas we're optimistic about are our payroll and GPR cards. These will both compete in large attractive markets. The payroll card is a part of a $100 billion plus market and the GPR market is approximately double that size. Intermex has a significant distribution advantage due to our existing network of high traffic retailers and our check direct service that we provide to many of our agent partners. We have a great line of sight to the employers of our customer base. We can then target those companies to demonstrate the benefits of our payroll card product. Though not yet a large revenue contributor for Intermex, we have sized the market and feel we are well positioned to launch our upgraded payroll card to the market later this year. We can also leverage a similar distribution advantage with our GPR card. Our retail sales can leverage the relationships that exist with independent retailers and effectively demonstrate the benefits of adding our GPR card at their retail locations. We're adding a new program manager for the card product this year to assist in expanding and managing these products. The card products will not significantly contribute to revenues or profitability in 2023, but we are well positioned for meaningful growth in 2024 and beyond. Lastly, our digital business continues to grow at a high rate. We grow at a rate of 63% in second quarter, We're also delighted that our updated application has been receiving high marks from our users. A great opportunity for growth exists with Intermex Digital Business as well as our Wires as a Service product, in which we co-brand or co-host with a partner. In summary, it has been another great quarter of double-digit IBIDEA growth. There is much to be optimistic about in our business. We continue to deliver strong IBIDEA numbers with a high conversion to free cash. It adds to our already strong balance sheet where we have a base of $100 million of available cash to invest in our business. Growth opportunities abound, whether it is through our modified approach to retail with our intermix business, reorganizing of the national business unit, or the tremendous opportunity for growth that our EU license provides for us with e-transfer. Additionally, We are excited about our continued sales growth in our digital online business and the prospects for our wireless as a service offering, along with the opportunity to launch our online offering in Europe. Lastly, we believe we have made significant progress with our two card products and look for each of them to be meaningful revenue and profit streams in the future. With that, I'll turn the call over to Andres, who will drill down to the numbers and offer his perspective on second quarter operating performance. Andrews? Thank you. As Bob mentioned, we had another quarter of double-digit EBITDA growth. Still, our overall results were a little short of our expectations, driven by a slowdown in market growth, the pricing dynamic in the market, as Bob mentioned earlier, and several unhelpful items that converged during Q2 to make our quarterly objectives just that much more difficult to achieve. A large stolen safe, an agent that levered up for Mother's Day and absconded, and a settlement of a longstanding HR litigation in California are just a few that that worked against us in Q2. On slide five, the number of unique active customers increased by 41.1% during the second quarter to 4.2 million. These customers generated a record 15.1 million remittance transactions, 26.7% more than a year ago. This represents about 6.3% growth in transactions in our core business, plus the contribution of La Nacional's U.S. and international businesses. On slide six, we achieved a 63% increase in digitally originated transactions as strong customer acceptance of our mobile app continues. Moreover, we achieved this growth while being good stewards of the company's capital, not chasing customers with significant marketing spend that has an unproven payback. From a send and receive standpoint, 31% of our transactions are either sent or received digitally, up 480 basis points from a year ago. On slide seven, The total principal transferred grew 19.5% to 6.4 billion, driven by our core business and the addition of La Nacional's U.S. and international businesses. The average remittance within our U.S. core Intermex business was consistent with the prior year. It was $447, precisely the same send amount it was in Q2 2022. In the consolidated business, the average send amount was down 5.6% for the quarter, year-over-year at $422 per transaction. This is influenced by the average transaction amounts in our La Nacional US and Europe businesses, which are structurally lower. La Nacional US is currently at $297, and Europe at $270, bringing the business average to $422 for the quarter. On slide eight, total revenues company-wide increased 23.5% year-over-year, reaching $169.2 million during the first three months. Excluding acquisitions, revenue growth in our core business was 6.7%, fueled by organic customer additions through an existing agent. Our core revenue growth dipped below the double-digit level this quarter, impacted by the market slowdown and the current pricing environment. Our digital business is contributing an ever increasing share of revenue. While still in the single digits, we continue to thoughtfully pace spending around our app and online offerings to match or stay ahead of consumer acceptance. We're successfully growing the digital business efficiently and profitably with the revenue contribution from digitally originated transactions up just under 58% year on year in the second quarter. We keep a tight pulse on consumer behavior, which positions us to invest in digital intelligently ensuring the unique economics supported. Net income was impacted by a few key areas, top line growth slowing, high credit facility, and depreciation and intangibles amortization. The latter is driven from M&A activity, but also from hardware upgrades and some accelerated depreciation as we transition to a new headquarters building at year end. Higher effective tax rate, mostly acquisition related, also kept growth in check when it comes to net income. Net income was down 3.5% at 15.4 million, though GAAP EPS was better, up 3.4% at 42 cents a share, aided by our share buybacks. We'll see these same factors flow through the second half, as reflected in our guidance. Looking at slide nine, adjusted EBITDA increased 11.7% to 30.9 million, also impacted by this lower revenue growth and the inclusion of the national business, where margins are structurally lower. Note that as the top line in the core business load, we have and will continue to aggressively control costs, which is what allowed us to again achieve another double-digit EBITDA core. Adjusted net income was up 0.6% during the second quarter to $18.4 million, impacted by the same underlying drivers as gap net income, but excluding items like share-based compensation, transaction-related expenses, and amortization of certain intangibles, and the tax impact related to those items. From an adjusted EPS perspective, we were up 6.4% to 50 cents a share. Turning to the balance sheet on slide 10, Intermex continues to be an efficient operator and cash generator. The company ended the quarter on a Friday, peak activity for our business, where you would have seen the revolver drawn on the balance sheet to the tune of 116 million from our credit line. Net free cash generated, our internal measure, which excludes working capital cyclicality, dipped a bit to $13 million in Q2. However, if you exclude the $5.5 million net cash attributable to the closing of iTransfer in the second quarter, net free cash generated is closer to $18.5 million, a 7% increase from Q2 2022. During the quarter, we continue to be active in the market, purchasing 416,000 shares, for 10 million at an average price of $24 per share for authorized repurchase program. Additionally, we repurchased 500,000 shares from one of our beneficial stockholders for $25.28 per share, a 4% discount to the market price on the day of the transaction. The negotiated transaction totaled 12.6 million paid with cash on hand. We continue to see our buyback program as an excellent use of capital and anticipate remaining active. On slide 11, as a result of the slower market growth we're seeing, coupled with the price discounting in the market, we're adjusting our guidance for the full year. As mentioned in the first quarter earnings call, we're transitioning from net income to EPS guidance for the remainder of the year. Additionally, as Bob mentioned, we'll record a restructuring charge in the third quarter for La Nacional. We expect this will be approximately $600,000, which is captured within this guidance. As discussed, This restructure will generate over $1.5 million in annualized savings beginning in September. Our new guidance is as follows. For the full year, revenue of $644.9 million to $673 million, diluted gap EPS of $1.56 to $1.63 per share, adjusted diluted EPS of $1.87 to $1.94 per share, and adjusted EBITDA of $114.8 million to $119.8 million. For the third quarter, we expect the following revenue of $165.7 million to $176.8 million, GAAP diluted EPS of 40 to 43 cents a share, adjusted diluted EPS of 49 to 52 cents a share, and adjusted EBITDA of $30 million to $32 million. In summary, we continue to execute and are retooling to grow the Intermex core through the current market dynamics. At the same time, we're defining the path to 10x for Europe, positioning a size-up card in digital, and driving efficiency to perpetuate a strong EBITDA growth trajectory for La Nacional US. With that, I'll turn it over to the operator for questions. We will now begin the question and answer session. To ask a question, you may press star then 1 on your touch-tone telephone. If you're using a speakerphone, please pick up your handset before pressing the keys. If at any time your question has been answered and you would like to withdraw your question, please press star then 2. At this time, I will pause momentarily to assemble our roster. The first question comes from the line of Mike Grodel with Northland Securities. Please go ahead. Hey, guys. Thank you. Could you talk a little bit more about the U.S. sales force? It sounded like you restructured it. You created a sixth region. and I think you said added 10 districts. What about just the number of salespeople? Kind of how is that trended, and how do you think that's sort of feeding the agent pipeline that you mentioned? Yes, thank you, Mike, for that question. So we're doing a lot of things related to the sales force. I think, as we've talked about many times, we've seen over the years challenges arise relative to the market pricing that typically happens as the market slows down a bit, as we've seen. You know, the growth in the market has gone from last year in second quarter to about 15% to Mexico to 8%. So when that happens, we see a greater push from particularly people that are discounters in the marketplace with lower prices that cause a little bit more friction for our business. In response to that, we decided to add a sixth region. That region is added in sort of the southwest so that we have more emphasis now in terms of folks focusing on the business in the western states and then created those additional districts. In the past, we've had at times more what we called regional sales executives, which were people that were roving and had bigger geographies in which they could sell in. We didn't feel we got the return on investment for those. We feel like it's best when someone has a distinct geography, and that's why we created the additional sales districts. Now, in addition to that, we're spending a lot of time looking at the markets where we have a lower market share and a huge opportunity on the upside and looking at our pricing related to those. And as I said in the opening remarks, we're not joining the force of being a discounter by any stretch of the imagination. At the same time, we will be more aggressive at retail in opportunities where we're not necessarily excelling because there's not a lot for us to lose there, meaning there's not a big base of business we'd be discounting. There would be a bigger base of business to acquire. So all of those things together with more salespeople, more people dedicated to specific geographies, much more strategically placed, with a different approach to the marketplace, particularly related to those areas where our market share would be, let's say, less than 10%, and even there's some pockets where it might be less than 5%. There's a lot of places where you have a market share of 30% or 40%. So we'll focus a little different kind of energy and pricing in those areas that have great opportunity for the upside. Got it. And then maybe just secondly, how would you describe the pricing challenges or pricing pressure? Is that a... couple percentage points of overall growth like is there any way you can frame that a little bit yeah i mean i think it anything i would be guessing at right to say well it's this percentage of growth or whatever i think what what happens is when people particularly the smaller providers that general mo to start is to discount when they see a marketplace slow down their immediate reaction is the more exaggerated approach to what they normally do which is to discount And so, we're seeing that in a number of areas. But in some other areas, we also see opportunities, because even those discounters have markets where they need to be able to make money, and we need to attack those. So, it's hard to put a number on it. We think that clearly, though, what I talked about, rather than, you know, we've always made our success by focusing on what we do best, rather than just worrying about what the marketplace is doing. And from our perspective, We still have all those zip codes we talked about, 2,000, that are underserved or unserved, that we could gain about a million and a half wires, and that's only by getting about a 15% to 20% share in those zip codes, which is very much below where our best zip codes perform. And so really that's the area that we need to focus on. Now, what will be different? Because we've talked about that in the past. One thing will be different, we'll have more dedicated people to those geographies, and two, our population, Our sort of approach to the market is going to be different, where a gross margin, meaning what we get after we gain the fee and the FX minus what we pay the agent and the payer, we're willing to take a lower ultimate gross margin to gain wires in this more competitive time. We're not going to wait it out as... I don't want to say as passively, but as confidently as we have in the past, will be a little bit more proactive, quite a bit more proactive. We still think it won't sustain itself. We know that one of the big discounters will be on the market for sale next year. One of them is out on the market for sale now, two private companies. And so they're very aggressive in a down market, and that's affecting the overall. And then what you see is even some of the public companies start to join in that discounting because they joined the fray. So we need to be able to address that as we're doing, but we also believe that there will be some relief in that over time because whenever these sales happen, usually what happens is there becomes a change in the approach to the market. Hey, thanks for that color, Bob. You're welcome. The next question comes from the line of Maynard Tandon with Needham. Please go ahead. Thank you. Good morning. Bob and Andrus, I just wanted to get a better sense of when the market began to slow down incrementally from the time you gave guidance back in May. What really changed? Is it more just pure macro, or is there something else going on in the market beyond just the macro pressures? Well, the market grew in last quarter at 12%, and it grew at 8% to Mexico, which is our core business. So that is something that happened at a greater level. in the second quarter versus the first quarter. We've seen some slowing, but it's been a bit sporadic. If you look at the numbers from Mexico, you'll see that sometimes you'll have a an 8% growth month, and then sometimes you'll have a 13% growth month. And it's been sporadic. But the quarter as a whole in second quarter dropped about, you know, a third from 12% growth to 8% growth. And that was not fully anticipated. We thought that probably 12 was about where it was going to land. So I think that impact was what was not necessarily predicted. Okay. Understood. And then I just wanted to go back to the model. So as we look at the rest of the year, just sort of the building blocks in terms of the numbers, what are the expectations for transaction growth and principal growth and remittance size? If you could just give us some sense of what you have embedded in your guidance. Thank you. Yeah, I would just speak from a transaction growth standpoint in the core. We're in conservatively around 5% growth in the core business. And what are the other factors that I could dimensionalize for you? Principal amount. Principal amount. I think principal amount we've held in the core as well, steady year over year. We haven't modeled in any growth or haven't modeled in any attrition in that amount. And the remittance size would also be, just given some of the headwinds you guys talked about, Should we expect the remittance size to also come down just for the back half of the year to reflect the updated guidance? Yeah, I think not much. I mean, maybe a little less than a percent in terms of overall size, the part that's not impacted by the acquisition principal sizes. Okay. That's helpful. Thank you so much. Remember, the peso is trading at its strongest point, which we hadn't really talked about but that many times has an effect on the principal amounts. You would think when you get less pesos on the other side of the border, people would tend to send more because they have, you know, a stable amount they need, but what happens is when the peso is usually weaker, if it's in the 20s, people send larger principal amounts because they feel like the peso's on sale and they send bigger average transactions. So we're kind of, the whole industry's kind of, you know, those headwinds where the peso's been stronger than it's been in a number of years now. That's great, Carlo. Thank you so much. Again, if you have a question, please press star and then one. The next question comes from the line of David Scharf with JMP. Please go ahead. Good morning. Good morning, David. Yeah, good morning. Thanks for taking my questions. Maybe just to follow up a little more on the competitive dynamic right now. Bob, you called out a couple private discounters, but taking a step back and maybe compared to prior cycles, like you say, this ebbs and flows in terms of price competition, are the pricing moves by competitors better? would you describe them as fairly broad-based among most of the remittance providers you encounter in your stores, or is it concentrated within a couple of discounters? So the question is not broad-based geographically, but is it broad-based within the competitors? Exactly. Is this something? Yeah, I would say that it is. I would say that it is, and one of the large publics with their second or flanker brand, however you want to describe it, that's a deep discounter as well. And one of the other public companies is pretty aggressive as well. So I think we're probably by ourselves as the guys holding the line more. Our margins have been relatively stable, which is really good news because it gives us a lot of headroom to sustain the margins where we're strong enough to sustain them. but if you have an average margin to Mexico of $5 or over $5, and I'm just using that as an example, I'm not quoting that number, and you go out and aggressively go after business that's at a much lower rate, your blended gross margin is still quite attractive. So we've got a lot of headroom, and I think it's really, other than us, relatively pervasive. A lot of markets where we have such a strong market position in the eastern states, for instance, and I won't name the states specifically for strategic reasons, but it's harder for the competition to come in because we're so well entrenched. But where we're going in acquiring new business, and that's where I think our approach will change more because there's so much of an upside opportunity. You might look at a state in the Colorado. It has more foreign-borns than a state like Georgia. We have a fraction of the business there. So our opportunity there where we have really strong margins is to be much more aggressive because the upside is really big for us. And that's really the way that we need to be able to compete. in some of those areas, and you'll see us. We're not going to be necessarily, again, riding with the discounters. In some cases, we won't be at all. In some cases, our offering won't change at all because we don't really have an issue. But in other cases, we'll be much more aggressive. We're still going to ride on our value-added service, the fact that we pick up our customer service line in four seconds, that our technology works better and faster and more reliably than anyone else in the face-to-face transactions. the banking relationships, our check direct product, the quality of our customer service, all of those things, we're still going to sell on that value add, but we recognize that we might need to be a little closer to the discounter's prices in certain areas of the market for us to compete and grow again at rates that are in the teens. Got it. Understood. And, hey, a couple just follow-ups on that. more on the operational side. First, the sales additions, can you provide some just context in terms of the addition of a new sales director or a new region, new districts? Was this in the cards since the beginning of the year, or have you accelerated any expansion plans on the kind of agent acquisition front in response to what might be a persistent, you know, Yeah, I mean, I think we're constantly evolving, but the actual decision to add another regional director, a new region, happened probably in late sort of first quarter, early second, and added the person in late second quarter. As far as the sales districts, which are our folks that are on the ground, the closest to our retailers, We just recognize the increased productivity of having folks having a sign geography rather than selling on a floater basis. And, you know, when I say a floater, it doesn't mean all over the country. It just means that, you know, those what we call RSEs, Regional sales executives, they could sell maybe all over Southern California, but they didn't have accountability for geography. So we recognized that that was not working, and we'd rather create more districts, which we think puts us in a much better position to attack the marketplace with that geographical assignment. So that's really the move there. And I think it's been evolving, but I think it's mostly in response to the fact that we're seeing the market slow, we're seeing all the things we talked about, the discounters become more aggressive in discounting, and our response to that in an effort to really drill down better into the market and grow our business in some of those areas where we have a really big upside and not really a big base of business, and our willingness to do that in a way that will accept gross margins that probably were less than we accepted in the past. Still very profitable, but less than they've been in the past. Got it. Hey, just to close out, I'm assuming based on just 5% kind of organic transaction growth in the second half that the guidance reduction was pretty much organic related. Was there any downward revision to the LN, La Nacional forecast as well embedded in the second half? guidance reduction, or was it pretty much all the core business? No, it was pretty much driven by the core business. I think La Nacional and iTransfer are doing what we expected them to do, and I think that restructuring activity that we talked about is going to flow through nicely in the fourth quarter for La Nacional, so it's really driven by the core. Okay, got it. Thanks so much. Thank you. The final question comes from the line of Chris Vank with Credit Suisse. Please go ahead. Hi, good morning. Thank you for taking my question. I have a question on the new Florida immigration law, so specifically the Senate Bill 1718, which was passed in May and came into effect on July the 1st. Have you seen any impact so far in the first month of implementation, and what are your expectations for any potential impact or any potential offset to that? Thank you. Yeah, I think what we saw initially was a response that was relative to protest. Whether there will be a long-term effect or not, what we see usually when these things kind of happen is it sort of wanes over time, and there's really not a big effect. We also will see, I think, in some of these cases, where there's been difficulty in the past of a state making it more difficult for immigration is for farmers or those that need the labor to begin to work directly with the work visa folks to be able to bring people in on a more less undocumented basis and more documented basis. So there are lots of crops to pick in Florida, and we don't anticipate that in the long run that it's going to have a big impact. We've seen municipalities, not typically states, but municipalities do different things over time. We've even seen states put a tax on remittances, on every remittance. And it's not had an impact over time because of the need for labor and the willingness of folks to provide it. So I think some short-term kind of days of protest and stuff occurred, but I think it's too early to tell What's going on is we have a market that's slowing a bit anyway, so it's difficult to see. And we're not seeing Florida grow or slow at a rate that would be greater than the greater market. And we wouldn't expect that it would be something that would hamper the ability of people who require labor to hire it and labor who wants to provide labor to provide it. All right. Very helpful and very comprehensive. Thank you so much. You're welcome. This concludes our question and answer session. I would like to turn the conference back over to Bob Liffey for any closing remarks. Yes, thank you all for joining us. We look forward to talking to you all soon. Thanks again. The conference has now concluded. Thank you for attending today's presentation. You may now disconnect.