Good morning and welcome to the International Money Express Inc. fourth quarter and four-year 2022 earnings conference call. All participants will be in listen-only mode. Should you need assistance, please signal conference buses by pressing the star key, followed by zero. After today's presentation, there will be an opportunity to ask questions. To ask a question, you may press star then on your telephone keypad. To withdraw a question, please press star then two. Please note this event is being recorded. I would like to turn the conference over to Mike Gallantine, Vice President of Investment Relations. Please go ahead. Good morning, and welcome to our quarterly earnings call. I would like to remind everyone that today's call includes forward-looking statements, including our 2023 guidance, and actual results may differ materially from expectations. For additional information on International Money Express, which we refer to as Intermex or the company, Please see our SEC filings including the risk factors described therein. All forward-looking statements on this call are based on assumptions and beliefs as of today. You should not rely on our forward-looking statements as predictions of future events. Please refer to slide two of our presentation for a description of certain forward-looking statements. The company undertakes no obligation to update such information, except as required by applicable law. On this conference call, we discussed certain non-GAAP financial measures. Information required by Regulation G under the Securities and Exchange Act for such non-GAAP financial measures is included in the presentation slides, our earnings press release, and our annual report on Form 10-K, including reconciliation of certain non-GAAP financial measures to the appropriate GAAP measures. These can be obtained in the investor section of our website at intermexonline.com. Presenting on today's call is our Chairman, Chief Executive Officer and President, Bob Lissy, and Chief Financial Officer, Andres Bendi. Also on the call today are Chris Hunt, Acting Chief Operating Officer, Joseph Aguilar, President, Latin America, Randy Nelson, Chief Revenue Officer, and Marcelo Theodoro, Chief Digital Officer. Let me now turn the call over to Bob. Good morning, everyone. Welcome and thank you for your interest in Intermex. With yet another year of exceptional performance behind us, we are proud to have established Intermex as the public market's fastest-growing omnichannel remittance company. The number of industrious and hardworking Latin American immigrants working in the U.S. that rely on Intermex transfer money to support their families and loved ones back home continues to grow. With our state-of-the-art proprietary technology and our carefully chosen, highly productive network of retail agents, Intermec stands apart from its peers by delivering a value-added service for our consumers and a value-added partnership for thousands of retailers across the country. Our unique, customer-focused, omni-channel business model drives sustained long-term growth in value for the company and its shareholders. Looking at the fourth quarter, we finished another strong year on a high note. We delivered double-digit growth without interruption. Additionally, we produced online digital growth of 80% in transactions in Q4. We continue to efficiently develop our offering with a focus on unit economics and sustainable profitability. On slide three, for the quarter, we generated revenues of $154 million, up 21%, net income of $13 million, down slightly, adjusted net income of $18 million, up 10%, and adjusted EBITDA of $29 million, up 22%. And for the year, revenues of $547 million, up 19%, net income of $57 million, up 22%, adjusted net income of $70 million, up 22%, and adjusted EBITDA of $105 million, up 21%. During the quarter, we also set a single-day record with almost 250,000 wire transfers on December 23rd, as customers in large numbers turned to Intermex to send money home for the Christmas holidays. We believe this supports our belief that when remittances absolutely need to arrive without a hitch, senders have the greatest trust in the Intermex brand. We appreciate the confidence our customers and retail partners have in us, and we recognize the important role we serve. Intermex is outperforming the industry because of the focus we place on the fundamentals of our business. Our unique approach to retail expansion, as well as our metric-based model, provides for profitable growth well above the market. We concentrate on growing transactions at margins that make sense, enabling us to deliver world-class service through our expanding network of retail partners and our online digital products. where I'm making efficient and productive investments in people, innovative new digital products, and scalable technologies. Driven by our Capital Light model, we consistently achieve operating efficiencies that enable us to generate significant cash to perpetuate growth and make investments that create value for our shareholders. It has been and continues to be a historic and unparalleled track record of success. On slide four, Our share of the fast-growing market where we compete has increased significantly throughout the year, including during the fourth quarter. In the top four Latin American markets of Mexico, Guatemala, El Salvador, and Honduras, we increased our market share by 90 basis points to 22%. On slide five, including the Dominican Republic, these five markets represent 87% of all money sent to the region from the U.S. Subsequent to the national acquisition, we have a 21 share in these critical markets. Our integration of LaNationale's US-based operations contributed to our market share, adding more US-based retail locations and capitalizing on LaNationale's strength as a superior brand to the Dominican Republic. Since completing the US portion of the transaction in November, we have been working to optimize LaNationale's agent footprint and reduce the number of underperforming locations. We are in the latter stages of formalizing a plan to improve operating efficiencies and margins as we transition the business model to one more consistent with the Intermex approach. As for the Europe portion of the acquisition, we continue to make progress with the regulatory approval process. We anticipate regulatory approval in the coming weeks and expect to close the transaction in the second quarter. As we have become more familiar with the European business, we are even more optimistic about the growth potential in the future. In anticipation of completing this transaction, we have begun an executive search for the leader to serve as president of our European division. We believe it is a promising market rife with opportunity for Intermex, both at retail and at the online digital area. Aside from retail, which we believe has the opportunity to be many times larger than it is today, we see a great opportunity relating to the online digital. European remittance customers are more likely to be banked for a number of reasons. We believe we have an opportunity to accelerate our online digital growth in Europe. We feel we can efficiently build a digital presence that is transportable throughout the EU, and we are looking forward to getting it underway. In the US, our digital business is benefiting from an increased consumer acceptance of our mobile app. Our application has gone from an app store rating of 2.7 to 4.7 over the last several months, since we have upgraded our user experience. Our strong brand equity in Latin American community is a large asset driving digital transactions profitably. On slide six, our digital transactions increased 84% in the fourth quarter. Currently, 28% of all transactions are either sent or received digitally. That is up 480 basis points from last year. We continue to maintain positive margins and keep a close eye on unit economics of our digital offering. Our mobile app has been a success enabling Intermex customers to prioritize fee, speed of delivery, or exchange rate to suit their needs. The app combines the best features of choice and ease of use. Importantly, as with retail, our mobile app is supported by our best-in-class customer service. Everything we do is enabled by our rock-solid foundation we have created in the U.S. with a large ecosystem of retail agents. This part of our strategic growth story gives Intermex a true competitive advantage. We have created an extensive, highly productive group of retail agents that have chosen to partner with Intermex because of the value add we offer to both them and their consumers. What we have established in the marketplace is hard to replicate and presents a significant mode around the business to ward off potential competitors. We continue to expand our retail network through carefully chosen, high-performing, profitable agent additions. Our expanding business includes same-store organic growth from our existing agents, and the growth we generate by carefully targeting and recruiting the best retailers to serve our consumers. We focus our recruiting efforts and opportunity geographies across the U.S. with the largest population of Latin American foreign-born individuals. While we continue to grow our agent base in the eastern states, much more of the development efforts are focused on the western U.S., where the opportunity is much more significant. We take great care in the selection of top-notch retailers in neighborhoods that are convenient to where our consumers live and work. We often remind people that to understand our retail business and growth potential fully, you need to consider the profile of the typical Intermex customer. Most are either paid in cash or by paper check and are unbanked. Traditional retail banks are often not conveniently located and do not always welcome these consumers with the same cost-effective convenience service and cultural fit that our agent network can provide. Intermex offers and delivers a time-tested solution that works for our consumers and for our agent partners. It truly sets Intermex apart and well positions us for success and sustained growth. One other update on our technology before I turn the call over to Andres to go over the numbers. Software and hardware upgrades that we initiated during the second half of 2022 are progressing nicely. We are on track to complete the enterprise-wide project during the third quarter of 2023. These upgrades will position Intermex for a rapid rollout of new digital and card products and improve consumer experience at thousands of retail locations and enhance and upgrade AML capabilities. Agents often choose Intermex because of our technology, and the new hardware and software we have launched will further simplify the process for our neighborhood retail agents. They will be able to complete money transfers even more efficiently than they did before, solidifying our position as their partner of choice. For the consumer, it means faster counter service and an enhanced customer service experience. Intermex continues to grow at a sector-leading pace. We had an outstanding 2022 and are anticipating continued exceptional performance in 2023. This will be fueled by the strength of our growing network of retail agents and our upgraded and much improved online digital application. Both areas will be given our best in class customer service. We will continue to make financially sound and metrically smart decisions as we continue to invest in people and technology that will deliver the best products and service in the industry. Here's Andrews to go over the numbers. Thank you, Bob, and good morning, everyone. I'll provide some context for the fourth quarter and full year 2022 results, followed by a review of the guidance for 2023 that we provided this morning in the press release. The competitive advantage we've created for ourselves, combined with highly efficient management of our growing lines of business, continues to drive strong operating results. As Bob mentioned, we're making intelligent investments in people, innovative new products, and scalable technologies that position the company for the sustainable double-digit growth that our shareholders have come to expect. We continue to execute on our omnichannel strategy, expanding our ecosystem of productive and profitable network retail agents, while rapidly growing what we feel is a best-in-class digital offering. On slide seven, building on the strength of our retail business, the number of unique active customers grew 31% during the fourth quarter. These customers generated a record 14 million remittance transactions, 23% more than a year ago. Contributing to this growth in total remittances was an 84% increase in digitally originated transactions as robust customer acceptance of our mobile app continued. These numbers reflect double-digit growth in our core business and the contribution of two months of activity from La Nacional, which is a thread which runs through our fourth quarter results. On slide eight, the strength of our business fundamentals drove a 19% increase in total principal transferred to six billion for the three month period. For the full year, total principal transferred increased 21% to 21 billion. The average remittance amount was down 4% for the quarter at $421 per transaction. Intermex's core business average send was down only slightly but the broader trend was fueled by La Nacionale as transaction amounts to the DR are an average lower than the majority of the Intermex core business. On slide 9, looking at the top line, agent and customer growth contributed to the 21% year-over-year increase in revenue, reaching $154 million during the fourth quarter. Full-year revenue was up 19% to $547 million. While achieving these consistently strong results, we continue to efficiently manage banking and payer fees while structuring smart retail incentives so Intermex and our Asian partners both win. Additionally, we're thoughtfully pacing spend around our app and online offerings to match or stay ahead of consumer acceptance. We're successfully growing the digital business efficiently and profitably with transactions up over 80% year on year in the fourth quarter. Our tight pulse on consumer behavior positions us well to invest in new digital products and services when the unit economics are there to support it. On slide 10, it was a very good fourth quarter and core growth in the business was strong. However, over $2 million in deal-related costs and higher interest expense had our net income down slightly at $13.1 million. Important to mention that despite these headwinds, our GAAP EPS was still positive by about 6% due to our opportunistic activity this year on the buyback front. Net income before the full year finished at $57 million, up 22%. On slide 11, excluding certain intangibles like share-based compensation, transaction-related expenses, amortization of intangibles, and the tax benefits related to these items, adjusted net income was $18 million, up 10% for the fourth quarter. But again, like on the previous slide, from adjusted EPS perspective, we were up over 15%. For the full year, adjusted net income was 70 million, an increase of 22% for the full year. On slide 12, adjusted EBITDA increased over 22% to 29 million for the quarter, and it was up over 21% to 105 million for the year. Both measures benefit from strong revenue growth, operating efficiencies, and an exceptional focus on cost management which is part of the Intermex DNA and rare among companies growing adjusted EBITDA at over 20%. On slide 13, turning the balance sheet in cash, Intermex is an efficient operator and strong generator of cash. The company ended the fourth quarter and the year with almost $150 million in cash and an undrawn revolver position of $74 million. Our total revolver capacity is $150 million, which we utilize on peak weekends. And since the quarter ended on a Saturday, we had about half of it drawn at the time. Had we closed on a Thursday, for example, that revolver would have been undrawn. Our internal measure, which removes working capital cyclicality, net free cash generated, remained strong with over $60 million generated for the year. During the fourth quarter, we repurchased 465,000 shares for just under $10 million at an average price of $21.48 per share, and we see the opportunistic buyback program as an excellent use of capital. Based on the success of our program to date and the inherent value management and the board season in MEC stock, the board has recently approved an additional $100 million for share repurchases. Including 2023 activity, the company has repurchased over 3 million shares for about $65 million. This includes the original $40 million authorization in 2021 and amounts we purchased directly from a significant shareholder in the third quarter of 2022. On slide 14, turn to the guidance for 2023. We will now guide for both the full year and the current quarter. For 2023, we expect the following. Revenue to be in the $667 million to $688.5 million range, an increase of 22% to 26%. net income of $66.5 million to $69 million, an increase of 16 to 20%, and adjusted EBITDA in the $120 million to $124.5 million range, an increase of 14 to 18%. For the quarter, we expect the following, revenue to be in the $140.9 million to $145.5 million range, an increase of 23 to 27%, net income of $11.6 to $11.7 million, a decrease of 1% to flat, and adjusted EBITDA in the $22.5 million to $22.8 million range, an increase of 9% to 10%. This guidance takes into account the full impact of La Nacional, the U.S. business that closed in the fourth quarter, and the international business which we expect to close in the second quarter. In summary, we continue to execute as a company and feel well-positioned to deliver another strong year for our shareholders. With that, I'll turn it over to the operator for questions. We will now begin the question and answer session. To ask a question, you may press star then 1 on your telephone keypad. If you're using a speakerphone, please pick up your hands up before pressing the keys. To withdraw a question, please press star then 2. At this time, we will pause momentarily to assemble our roster. Our first question will come from Mike Grondahl with Northland Securities. You may now go ahead. Hey, guys. Two questions. The first one, just any update on the sales force and kind of your outlook for agent growth? And then secondly – Can you talk a little bit about pricing trends that you're seeing and what kind of pricing is embedded in your 23 guidance? Yeah, I'll take the first part of that for a second. I'll take the second part of that first. Let me put it that way, Mike. So in terms of the pricing, we have seen, particularly in fourth quarter, more aggressive behavior by the small competitors and maybe one or two of the larger companies, public companies, relative to price at retail. We have not, if you would look at our numbers, we haven't had any real decline in terms of our revenue per transaction or our gross margin. As usual, we haven't really responded to that in broad fashion. We're doing it very strategically. We've seen that kind of come and go many times throughout the years. The industry that I've been around many, many years, you see small competitors flurry and get aggressive with price in certain regions of the country, and then others will join in. And the challenge is to kind of hold that line because you'll end up kind of driving prices down permanently. So we've seen some of that. As we look towards our 2023, We see a small reduction in revenue per a little bit relative to the FX gain. And as we see that coming down, the fee itself, though, is remaining stable, generally stable. So we don't see a big degradation. There will be markets where we need to be more aggressive, particularly in markets in the Very, very aggressive markets in the West, like California. We continue to see very aggressive behavior there, along with the whole West Coast. And so we'll respond to that, but again, more strategically than we will on a broad fashion of lowering our overall sort of revenues and gross margins. Relative to Salesforce, and I'll ask Granny to chime in, but we are... We're almost at full capacity with our what we call district managers. I think yesterday we reviewed we had one position open. We are adding a number of people, rovers, to what we call regional sales executives, which are people that are, in addition to the district managers, they're going out and doing nothing but adding new retail locations strategically. They'll be heavily weighted towards the western states because that's where we're more underrepresented in terms of agents per foreign borns and wires per foreign borns. So we'll be working against that. As we've talked about many times, that's sort of a crop, if you will, and the seeds that we plant today will manifest themselves beginning later in the year, but really be really impactful in 24 as those folks are up and going. Randy, anything to add to that? Yeah. Hi, Mike. Just really quickly, as Bob mentioned, that we're in the process of rolling out new hardware and software to our agents, and As we got into the thick of things, the back half of last year, it caused us to really take a look at our agent base and the productivity of our agent base, specifically the new agents that we had brought on over the course of the year. And we realized that we got a little bit away from the focus that we like to have in terms of high quality agents. So we have taken a hard look at the number of agents we're bringing on versus the quality of agents we're bringing on. And you'll see, hopefully, our plan is to bring on higher quality agents throughout the course of 2023. And we may even churn. I wouldn't be surprised at all if we churn some of the lower producing agents out of our network simply because we don't want to be putting the cost of new equipment and software if we're not going to get the return out of that investment. Got it. That's helpful, guys. Thank you. Our next question will come from David Sharf with JNP. You may now go ahead. Great. Thanks. Good morning, and thanks for taking my questions. Hey, I wanted to follow up on Mike's question regarding Salesforce and specifically agent growth. You know, I know in years past you – kind of shied away from providing an agent count number. You've spoken more broadly about the opportunity in various regions. But it is kind of one of the most tangible ways for investors to kind of visualize those seeds that you're planting, as you noted, Bob. Can you provide us with a framework for thinking about the growth in the footprint that's embedded in your guidance, or the growth in the productivity per agent that's embedded in your guidance based on the comments about refocusing on agent productivity? Yeah, I think the first piece of it is that we need to drive same-source sales. We've got a base of agents, and for instance, if you could drive same-source sales with the core of agents, of in the middle teens, for instance. Now, I'm not saying it's there today, but it has been in our highest growth times. Then that's going to drive and provide the base. You're always going to get more growth from same store than you are from new. You'll get the growth from the new agents in their second year, which by definition is same store. So what Randy was talking about is a focus not so much on new agent locations. Certainly there is. But to bring up new agent locations, and them not be as productive is not a great thing. Our average retailer averages, you know, well over 400 transactions a month. So you could kind of calculate back from our transactions to get a number of how many, you know, how many retailers we have. That number is the number we'd like to drive to well over 500 per month. Now, the mix of that means you're bringing in new retailers that are kind of early stage that may be only producing, 50, 100 wires at the beginning, or even 200 wires, and that mix kind of brings you down a bit, but the really driving force will be the performance from the existing and that rifle shot approach. We think, though, let's take, for instance, somewhere like California. We think that we could easily double our agent network there, and we're putting the resources there to be able to do that. We're going to have on the ground there 10 or 12 people that are selling, which in the past we've had maybe as many as only six or seven or eight. So we're going to be increasing resources, driving more agents. But In the end of the day, as Randy said, we're going to be also looking at productivity. So it's not so much about the number we add, it's in terms of the productivity of them. And we haven't really been disclosing the number of new ads we have or the number of new ads that we're targeting. But I can tell you that 80% of our growth will come from same store, and the remainder of the growth comes from new agents. Got it understood. And I know in years past, you know, you used to have some slides that actually broke out kind of the percentage of your agents that were one to three, maybe three to five years old and over five, you know, given that they had different growth trajectories. And, you know, any more kind of granularity into that just visually, I think, provides a – healthy window into how much we're gaining. Yeah, I understand. And we'll take a look at that. I think part of our challenge is that we compete against a lot of companies that are not public and have access to a lot of data. And we look at the other public companies and what they're sharing. And we sometimes may be overshared. And then it made us a really great target for competitors. So we don't want to overshare. We want to give the market as much as we possibly can and give our competitors as little as we possibly can, right? So that's that fine line that we walk. Absolutely understood. Hey, one follow-up. Regarding the buyback, $100 million is a formidable figure. I'm just curious, what is the – analysis that goes into coming up with that figure precisely versus $75 million or $125 million? Is it covenant restricted based on how much of net income you're allowed to buy back based on your loan agreements? Is it based on an internal formula as a multiple or percentage of free cash flow over a certain period of time? Just a little color on how that $100 million figure is derived. Yeah, David, this is Andrew. You know, I'd say with that, we've proven that the buyback's been a good use of capital. And I think the program that, you know, we're buying under, we don't plan, I guess, in the short term to change much. But we did think having an allocation of, as you said, a formidable number like $100 million gave us the opportunity that, hey, if we wanted to kind of relook how we think a capital allocation would we have then the flexibility to go and increase the buyback if it makes sense. So I think the point is we wanted a number that allowed us to run with the current program for a while and also allowed for the latitude if we wanted to rethink capital allocation for the company. Understood. Great. Thank you. Our next question will come from Alex Marksgrass with KeyBank Capital Markets. You may now go ahead. Hey, everyone. Thanks for taking my question. I actually had a couple. First, just on the principal send amount, I appreciate the kind of breakout between Core, Intermax, and La Nasa now. I guess just curious, in the 23 guide, maybe just a bit more detail as to what's embedded in your assumptions around principal send amounts. Yeah, I would say we're planning in relatively flat so for the intermex send amounts, you know, well, I'll just tell you where we ended for the fourth quarter. The intermex average send was 434, and La Nacional was right around 300, and we planned those in to be relatively flat. Now, it's not flat sequentially, so it's going to be flat when you compare quarter to quarter in the years, so we're planned flat. You know, the good thing about Mexico is Mexico's actually... you know, growing a bit, so that could help us a little bit, but we're not going to bank on that, because in general, send amounts are, for most geographies, are not increasing. Okay, thanks. I appreciate the detail there. And then just one more around the guidance. You know, if you consider the midpoint of revenue and just EBITDA and the margin implied there, I think it's maybe 100 basis points of compression from 22. I'm just kind of curious. I assume a lot of that's related to La Nacional. Any sort of commentary in terms of organic margin expansion? Go ahead. I think you got it, Alex. I know we'll get the question in the callback, so it's better to address it here. Within our guide for the year, we've got revenue for La Nacional, and this is for four quarters of the U.S. business and three quarters of the European business, revenue about $85 million, EBITDA about $4 million, and then net income about $2.5 million. And you'll see in our K, which we've released previously, we're going to update the number in the K that's going to say that we expect that business once fully integrated, which is going to take a little bit of time, about $80 to $90 million in revenue, and then that same 9% to 11% EBITDA margins that we had mentioned in previous case. So it's going to take a little while for us to work it up there, but I think we're optimistic and excited to get started. Okay, that's great. Yeah, that was my follow-up. So just to kind of clarify on that last point around some of the optimization that's going on, it sounds like there is within the guide you provided today some information conservatism or some potential revisions to that as you kind of optimize the integration. Is that a fair summary? Yes, that's fair. Yeah, I think this is Bob. If the integration goes along faster, then that'll certainly happen. I want to make clear what we have with LaNationale is exactly what we expected. We knew that it was a business that had a lot of upside potential in the U.S. and that it had to be right-sized. It had a lot of, I think, things that were being invested in that were probably in their minds great for the future, but were not necessarily things that we thought were consistent with how we saw the business in the future. So we've already started to cut some of those expenses. And you'll see some of that even affect the revenue year over year. So the revenue over time for the U.S. business could go down year over year, but the EBITDA will come way up. And then when the European business is really the trump card, I mean, that's a a solid business that, from everything we understand, is making money today, a small amount of money, but has an opportunity to grow many times, and then it's over. In addition to that, the European business, which we haven't talked much about, but I want to take this opportunity, provides us with a bigger opportunity in the online business than we have in the U.S. Our core strength in the U.S. is in countries where businesses the digital online business is not as big a driving force as it might be with other countries. And the destinations from the U.S. are much more retail-oriented. But when we get to Europe, there's two factors. One, the countries that would be receiving the money are ones that do more or greater percentage of their business digitally. And then secondly, in Europe, there's a lot less folks that might find themselves there undocumented. So they have a much greater percentage of folks that are paid online on payroll and are paid with their bank accounts. And so they become candidates for the digital side. So we're excited about that. You know, there were many facets to the national acquisition and investment that we saw, and it's kind of in stages. And what you see today is very, very much the, the unrefined piece of the business. There's all these other things in terms of the, creating the right-sizing and then the opportunities in Europe and online that will fall in with national over time. Great. Thank you both for all the commentary. Appreciate it. Again, if you have a question, please press star then 1. Our next question will come from Chris Young with Credit Suisse. You may now go ahead. Hi. Thanks for taking our question. And also appreciate the great color on the national now include the 2023 contribution and also the margin profile and the opportunities there. Both in Latin America and in Europe, I just wanted to dig in a little more as the right now the the national margins are lower, and you mentioned they're optimizing the Asian locations, but I just wanted to understand structurally, are the margins lower because of some of the legacy Asian commission contracts, or for some of the reasons, and then if you could probably just break down the contribution from the Latin America versus the Europe from the national, and then at what level of the revenue would you think will bring the business to Latin America to the right margin profile that you desire. Okay. So let me, hopefully I'll remember every one of those questions. Those are pretty extensive. But on the first piece, you asked about margins. So La Nationale, the U.S. piece, is driven by their business to Dominican Republic, which is a country where most of the money is sent in U.S. dollars. So there doesn't, there is not a any profit made on the exchange rate or very little. Some of it goes in local currency. And so as a market throughout the U.S., outbound, the Dominican market is not as profitable as Mexico for sure or even Guatemala. So you're going to see smaller margins there. The other piece is, is until it's right-sized, is the business still has all of the overhead that that any business would have with much lower revenue. And so that's part of what we're doing in terms of that sort of SG&A cost, right, in making it right-sized and making sure that it makes – go ahead. Were you saying something? Oh. And in making sure that it's right-sized. So that has a lot to do with it. What was your – tell me what the other questions – what was the next question? I was just wondering how big is the Dominican Republic – portion versus the Europe portion? And then when the business is right-sized, what do you think is kind of a round rate revenue there before you kind of start growing the revenue again? Well, the opportunity with the U.S. business with LaNationale has always been about making it more profitable and increasing the margins. It's never been one that we've talked about having great growth opportunity. We do believe we'll grow it. It may grow slower than our core business in the U.S. The big growth opportunity with Le National is in their European division. We've always said that, and in which we haven't talked anything about Canada. which we also have a small business in Canada. Now together we'll have a more formidable business in Canada that opens up. Today they're in the Quebec province. We're not. So that growth will come from off U.S. shore. La Nationale in the U.S. will be our brand that drives business primarily across the eastern seaboard where most Dominicans are to the Dominican Republic. Now in those stores, for instance, or in our agents, We'll offer other countries, but it's a very, very small mix. Second largest country is probably Colombia, but it's very, very small compared to the Dominican Republic. So it really is a company focused primarily in the U.S., to Dominican Republic. The rest of the world opens up even more countries than we even currently serve. You know, the European business sends a lot of money to places like Morocco and Africa and other parts of Africa, sub-Saharan Africa, to Asia, to Eastern Europe. So it's a broader business that has huge opportunity for growth over time versus the U.S. business, which is a stabilizing sort of mission and making it more profitable with more mild growth over time. And allow me to just elaborate a little bit on what's in the guide, too. As I mentioned, the guide revenue is about 85 from the U.S., contribution about 70 to 75 million, and Europe about 12. EBITDA from the U.S. about 3 million, and Europe a little over 1 million. And then from a net income standpoint, about 1 to 1.5 in the U.S. and 1 to 1.5 in Europe. In our guide, and obviously that's before we're putting our playbook to work. All right, thanks a lot to both of you. Really appreciate the very thorough and very helpful color. Our last question will be a follow-up from Mike Grondahl with Northland Securities. You may now go ahead. Hey, thanks, guys, for taking the follow-up. My question was just about the software and kind of hardware upgrade that you mentioned in 3Q of this year. One, kind of curious, like, the cost of that upgrade. And two, Bob, you know, what are the two biggest benefits we should watch for or think about related to it? Well, I think there's – and Chris will chime in on this because he certainly are now COO but comes from the CIO position. But for me, there's a number. One is that to put a new piece of equipment in the agent locations where much of the equipment is old and obsolescent and like that is a really big plus. And to increase the software quality is also a big plus. Now, that's just from an aesthetics perspective and optics perspective. But in addition to that, it does a number of things. One is it makes it easier for them to process check direct. It's going to make it easier for us when we roll out our GPR card at retail. It also enables us enhancements related to our other online activities. It makes our AML, which is an important perspective, better and faster and more efficient. It makes sure that the already quality service that we have at retail not only stays at the speed it's at, but is actually even a little faster, even though the requirements for regulatory changes sort of behaviors are going up. So it does a lot of things to continue to put us or keep us in the forefront of the highest quality of hardware, software mix at the retail locations. The fastest in terms of processing, the highest level of reliability, the easiest of use that then dovetails with our world-class customer service. And that makes it, I think, very appealing for our retailers. And I'll turn it over to Chris from a technical perspective of anything that I might have missed. I think the biggest advantage we have is we think about our omnichannel strategy and being able to go to market with new products. Building and releasing this new software on the new architecture and new platform allows for that scalability. So we have a lot of ways that we're going to be able to interact with consumers, not only in a retail location, but also tie that into further strategy. So it's going to be a big benefit. It is a big benefit already. We're seeing some very positive numbers from the growth from agencies that are using it, so we're very excited about it. Got it. Okay. Hey, thank you. This concludes our question and answer session. I would like to turn the conference back over to Bob Lisi for any closing remarks. Yes, thank you all for joining us, and we look forward to talking to you all soon. Have a great day. The conference is now concluded. Thank you for attending today's presentation. You may now disconnect.