Good morning and welcome to the International Money Express third quarter 2022 earnings conference call. All participants will be in listen-only mode. Should you need assistance, please signal a conference specialist by pressing the star key followed by zero. After today's presentation, there will be an opportunity to ask questions. To ask a question, you may press star then one on your telephone keypad. To withdraw your question, please press star then two. Please note, this event is being recorded. I would now like to turn the conference over to Mike Galentine. Please go ahead. Good morning and welcome to our quarterly earnings call. I would like to remind everyone that today's call includes forward-looking statements, including our 2022 guidance, and actual results may differ materially from expectations. For additional information on International Money Express, which we refer to as Intermex or the company, Please see our SEC filings, including the risk factors described therein. All forward-looking statements on this call are based on assumptions and beliefs as of today. You should not rely on our forward-looking statements as predictions of future events. Please refer to slide two of our presentation for a description of certain forward-looking statements. The company undertakes no obligation to update such information except as required by applicable law. On this conference call, we discuss certain non-GAAP financial measures. Information required by Regulation G under the Securities and Exchange Act for such non-GAAP financial measures is included in the presentation slides, our earnings press release, and our annual report on Form 10-K, including reconciliation of certain non-GAAP financial measures to the appropriate GAAP measures. These can be obtained in the Investors section of our website at intermexonline.com. Presenting on today's call is our Chairman, Chief Executive Officer and President, Bob Lissy, and Chief Financial Officer, Andres Bendy. Also on the call today are Joseph Aguilar, Chief Operating Officer, Randy Nelson, Chief Revenue Officer, Chris Hunt, Chief Information Officer, and Marcelo Theodoro, Chief Digital Officer. Let me now turn the call over to Bob. Good morning, everyone. Thank you for joining us. We appreciate your interest in Intermex. Our strong growth continues as we build on our market-leading position as one of the world's premier remittance service companies. On slide three, The company achieved record performance during the third quarter in every way we measure success. Total remittances, revenue, net income, and adjusted BDA all set records in the quarter. The number of customers, total dollars sent, and the market share all reached new highs. This strong performance reflects the company's ability to sustain exceptional growth that our unique omni-channel business model affords us. Intermex remains one of the fastest growing companies in the sector. We are creating tremendous value for shareholders by delivering on our highly strategic and very profitable business plan. We are focused on maximizing the performance of our existing base of highly productive retail agents by carefully and strategically expanding our presence and opportunity zip codes through high volume neighborhood retailers. We do this intelligently and profitably as we advance the development of our state of the art digital offering. We provide customers with the choice to send money home to their loved ones by any means they choose, ultimately delivering convenience and, most importantly, choice. Strategy is clearly working. Intermex is outperforming its peers in top-line and profitability growth, and the company continues to capture market share at an impressive rate, outpacing the growth of the market overall. On slide four, in the four key markets of Mexico, Guatemala, El Salvador, and Honduras collectively, which account for 75 percent of all money transferred from the U.S. to Latin America, the market grew by a very healthy 13 percent during third quarter. Intermex continued to grow faster than the market, reaching a market share of more than 22 percent, an accomplishment we are very proud of and a growth trend we will work hard to sustain. As you see on slide five, with the U.S. portion of La Nationale transaction completed, Intermex is a market leader in all top five Latin American and Caribbean markets, adding Dominican Republic to our portfolio. If we add Nicaragua and Ecuador into the mix, these countries collectively represent 87% of all money sent to the region from the U.S. In aggregate, we have more than a 20% market share in these key corridors, and we continue to grow. On slide six, on the digital front, our consumer-facing mobile apps and online platform continue to grow in triple digits. Consumer acceptance of our digital platform and services is increasing, and we're achieving this efficiently and profitably. We have grown the total number of transactions that are deposited directly into bank accounts to 28% as a result of expanding our digital penetration on the receive side. The adoption rate of our mobile app that we launched earlier this year is showing great promise. The app combines the best features of choice and ease of use, allowing the consumer, using their smartphone, to select between the best transaction fee, speed of delivery, or exchange rate to suit their preferences. We see a tremendous opportunity to empower our customers to participate in the e-commerce economy. That includes products such as our general purpose reloadable card, which bridges the gap for customers who have easy access to digital platforms and devices, but not necessarily to banks. As we improve the digital consumer experience, we're keeping a close eye on unit economics with the intent of maintaining healthy gross margins. We continue to leverage our strong brand equity in Latin American community to drive our growth in digital online transactions. Another important component of our strategy is the investment we're making to upgrade our proprietary, enterprise-wide technology platform. We're making software and hardware upgrades that will enable the rapid rollout of new products and continuous improvement of the consumer experience at our thousands of agent locations across the U.S., while enhancing our digital offering as well. We have been rolling out our IMX Direct software package, which is our retail technology along with new upgraded hardware that will simplify the wire transaction process for our neighborhood retail agents and enable them to complete transactions even more quickly than they did before, while upgrading our AML capabilities. Many of our agents manage small retail establishments with limited staff and by necessity have to multitask. Making it easier for them to complete transactions enables them to focus more on their core business, which also provides faster counter service for our consumers. IMX Connect unifies all the company's retail software, mobile, and online applications on a single enterprise integration platform. The system upgrades fully integrate all consumer-facing B2B digital offerings, streamlining the development or rollout of new digital products. The improvements will enable the onboarding and activation of new digital customers and cross-selling across all of our product lines. We expect our retail agents to be converted to the new platform by the end of the second quarter of next year. For those who have already made the transition, we're seeing early indications that the upgrades are facilitating a sale of more transactions at a greater speed. Through this combination of hardware and software development, we're solidifying our competitive advantage as preferred remittance provider for our retail partners. This is important because our retail network drives large transaction volumes at a very profitable margin while delivering an excellent return on investment. We have developed this growing network of highly efficient, best-in-class agents through our strategic approach to agent selection development. It requires time and a lot of hard work, which makes it difficult for new or existing competitors to infiltrate and replicate. On slide seven, Expanding our agent network is one of the keys to the company's long-term success. The opportunity we see ahead for the retail side of our business is significant. Our retail network is a dominant presence in the industry and provides Intermex with an exceptional baseline for growth. That includes both same-store organic growth from our existing agents and the growth we generate by carefully recruiting the best high-performing targeted retailers. We have been consistently expanding our retail network by recruiting high-performance retailers throughout the country by zip code. The largest opportunities exist in the western United States. We focus on zip codes with the largest foreign-born population of Latin Americans. That strategy resulted in a 9% increase in year-over-year growth in the number of Intermex agents during third quarter. Each of our new agents is carefully recruited in neighborhoods convenient to where our customers live, work, and transact business. To fully understand the growth potential of our retail business, it's important to remember that the vast majority of our Intermex customers are paid either in cash or by paper check. Most are unbanked. Traditional retail banks are often not conveniently located and do not always welcome the consumer with the same cost-effective, convenient personal finance solutions and cultural fit that our agent network can provide. On payday, it is easy and convenient for our customers to drop by their local retailer, cast their check, and send money home. It is an environment that they are comfortable and familiar with, and they are transacting business with someone they trust and in their native language. Our attention to personalized, best-in-class customer service combined with scalable, proprietary technology that powers our business is why Intermex stands out from its peers. Intermex is the only omni-channel, remittance provider that continues to grow revenue and profitability through our retail network each and every quarter by more than double digits while achieving triple-digit growth in our digital online division year over year. We believe this omnichannel strategy and willingness to meet the consumer where they choose, combined with our customer service approach and world-class technology, place Intermex in an excellent position to continue to grow and flourish for many years to come. With that, I turn the call over to Anders. Thank you, Bob. Good morning, everyone. I'm sure by now you've had the chance to read through our press release and deck, so I'll just go over some of the operating performance highlights and provide a little more detail and context around our third quarter results. The positive results we reported this morning underscore the clear competitive advantage we've created at Intermax. We continue to outpace the market and are doing markedly better than our competitors with sustained strong pricing and margins. Our consistent outperformance demonstrates the effectiveness of our operating efficiencies and the intelligent investments we're making in people, innovative new products, and scalable technologies. We believe the strong growth the company is achieving is sustainable, driven by expansion of the company's growing ecosystem of neighborhood retail agents, a focus on agent productivity and performance, and the accelerating rollout of new digital products. we fully expect to continue to significantly outperform in the sector as we've done historically. On slide eight, building off the strength of our retail business, the number of unique active customers grew 11% in the third quarter. That customer growth generated a record 12 million remittance transactions, 16% more than a year ago. Contributing to the growth in total remittances was a 110% increase in digitally originated transactions, as customer acceptance of our mobile app continued at a triple-digit pace. On slide 9, you can see these fundamentals driving a 17% increase in total principal transfer to $5.5 billion for the three-month period. The average remittance amount was up just slightly at $450 per transaction. With the strategy of capturing share through efficiency, technology, and service, the company has continued to grow faster than the markets in which we competed. And as Bob noted, adding La Nacional's U.S.-based business to the mix increases our presence in the Dominican Republic, now making us a market leader in the key markets that account for 87% of U.S. outbound money transfers to Latin America. On slide 10, when we look at the top line, agent growth and customer growth all contributed to the 16.6% year-over-year growth in revenue, which reached $140.8 million during the third quarter. As always, we're focused on unit economics with a laser focus on efficiency within our business. We continue to have success leveraging our growth to better manage banking and payer fees while we continue to smartly structure agent incentives so Intermex and our agent partners both win. Additionally, we're thoughtfully pacing spend around app and online offerings to match or stay ahead of consumer acceptance. We believe in rational unit economics and keeping a tight pulse on customer behavior. So we prudently allocate spend wherever we believe the economics best support it. As a result, combined with the strong growth and efficient top line growth, third quarter net income grew 44.5% to 16.6 million. The growth in net income also reflects measured increases in salaries, general administrative expenses, and higher interest expense partially offset by lower amortization costs for the quarter. We also had three exceptional items this quarter you would have read about in the press release. First, an additional $1.6 million provision on the reserve we took a year ago on a closed Mexican banking partner. Next, a $1.1 million charge coming from updated vesting assumptions for one of our PSU grants. And finally, a $2.9 million tax benefit arising from equity awards exercise during the third quarter. Moving on to page 11, adjusted EBITDA increased 21.5% to $27.8 million, and adjusted net income increased 32.3% to $20.7 million. Both of these measures benefit from what we discussed previously, strong revenue growth, operating efficiencies, and focused cost management. These measures would, of course, exclude the additional reserve for the Mexican banking partner and the charge related to the updated investing assumptions I mentioned a moment ago. Turning to the balance sheet in cash, Intermex continues to be an efficient operator and strong generator of cash. The company entered the third quarter with $105 million in cash and an undrawn revolver position of $107 million. We always underscore that our cash position depends on the day of the week of the close, and this quarter we closed on a Friday when our cash needs are at their peak. However, any way you look at it, we have great liquidity and a balance sheet that is in excellent shape. Net free cash generated, our internal measure, which removes balance sheet cyclicality, remains strong with over 67% of EBITDA converted to cash. During the third quarter, we completed a repurchase of 1.2 million shares from one of our beneficial stockholders at a price of $23.50 per share. The negotiated transaction totaling $26.7 million was paid for out of cash on hand. We view the transaction as an excellent use of capital that supported value for shareholders. It's also worth mentioning that we're in the late stages of amending our credit facility, so we expect to have additional capacity to execute buybacks opportunistically and when it makes sense for our shareholders. A quick update on the La National transaction. As we noted in our press release last week, we chose to execute a split close, completing the U.S. portion of the transaction last week while we continue to work to finish the EU regulatory process, which will take a little longer. All the U.S. change of controls approvals were in place, allowing us to close on that portion of the business now, rather than having to wait. We're looking forward to closing on the European business in the coming months. We closed the U.S. La Nacional business for cash, and we feel it is a solid investment that will help us continue to drive growing shareholder returns. As you saw in this morning's press release, we reaffirmed our full year guidance. To recap guidance, we expect revenue to be in the $542 million to $551 million range, net income of $60 million to $61 million, adjusted net income of $68 to $69 million, and adjusted EBITDA in the $104 to $106 million range. So great momentum for Intermex and its shareholders. With that, I'll turn it over to the operator for questions. Thank you. We will now begin our question and answer session. To ask a question, you may press star then 1 on your touch-type phone. If you're using a speakerphone, please pick up your handset before pressing the keys. To withdraw your question, please press star then 2. At this time, we'll pause momentarily to assemble our roster. And the first question will be from David Scharf with JMP Securities. Please go ahead. Hey, good morning, and thanks for taking my questions. Maybe just two for you. Bob, the first, I'm guessing, is a question you've been getting a fair amount lately and you're tired of responding to, but I'm going to ask anyway, and it regards some of the commentary coming out of Western Union a few weeks ago at their investor event on more aggressive pricing actions they plan on taking. It sounded like it was framed primarily to kind of reaccelerate their digital growth, but obviously there's always the risk it sort of expands to their broader in-person business as well. So in general, you know, are you seeing any – you know, noticeable changes either now or on the horizon in the LATAM markets and on the broader, you know, pricing front. Recognizing Intermex does not compete based on price, but nevertheless, just wanted to sort of get a sense for whether it's something that, you know, we might be encountering during 23. Well, you know, I don't necessarily want to comment on Western Union Strategy, but their subsidiary, Vigo, which happens to be the company that my partners and I sold them years ago, has been in recent years probably the deepest discounter in the marketplace. So there isn't really much room for them to do much related to price as it competes with us in the retailers we compete against Western Union in. The Western Union yellow and black is typically in the big box stores. We don't compete with them at retail very often. So it's really Vigo that's out there in the mom-and-pops, zip code by zip code, where the ethnic population exists. And they've been a deep discounter for years, and I would say I doubt that there's much room for them to discount much more. We're befuddled sometimes by the pricing they have, and it hasn't really been a – It, like other discounters, has not been as big a problem as you might think because of the value-added proposition that we've built, the superiority of our technology, the superiority of our customer service. I mean, we're still, we test it all the time, picking up the customer service line in four seconds where other competitors are in the minutes and longer. The quality of the technology in terms of its ease of use, the speed of use, how quickly one transaction in front of a customer works, So all those things have held up very well already to that deep discounting, and I think we've seen a lot of it already from the folks that you indicated through their Vigo brand. Yeah, that's very helpful. I appreciate the color. I think we sometimes forget you really don't compete with the core Western Union brand. And Vigo, by the way, is their core to Latin America, as I would understand it. Again, I'm not an expert on Western Union, but you asked the question. I'll try to be as helpful as I can. But I would think Vigo is their core to Latin America because the immigrant population is in the neighborhoods, and that's where Vigo competes. But we, you know, certainly deep discounters can cause a challenge at times, but the quality of the product ultimately also has a lot to do with it. And we've been living in that world for a long period of time and been able to combat against that with the superior offering we have from a lot of the perspectives that I mentioned to you. And there's more. David, this is Andrew. I'd add if you looked at the margins year over year for the third quarter, we held up really well. So certainly not seeing anything right now that's concerning. Hey, just as a follow-up, you know, speaking of margins, you know, the average remittance size is starting to sort of flatten out on a year-over-year basis. And I realize the comps are difficult. You went through a period last year where it was a significant tailwind. and it was helped by, obviously, the rise in the dollar versus the Mexican peso primarily. You know, Anderson, I'm wondering, should we interpret sort of the topping off of that average send as really just a reflection of, you know, the comp's getting tougher, not a whole lot of currency movement since then, Or do you sort of look at that metric internally as one of the potential leading indicators of consumer health, potentially the impact of inflation and how much disposable income to remit back home is left over? How should we primarily be looking at that metric? Yeah, I wouldn't say we've looked at it as an indicator of consumer health. I think there are other things that we keep an eye on to go and get a sense of what we'll take in terms of credit losses. But I would just make it so that we couldn't count on that rise going on forever. There was a lot of stimulus in the economy. You know, I'd say in our guidance, we've actually quite conservatively baked in about 2% of that principal coming down in the fourth quarter to be on the safe side. But we don't see that as an indicator of credit concerns at this point. I think we've been, you know, even this year when we originally issued guidance this year, we did keep principal flat just because it was such an outsized group last year. But, you know, if it came down a bit, we've kind of planned for that. Great, thanks so much. I'll get back to you. Sure. And our next question is from Mike Grondahl with Northland Securities. Please go ahead. Hey, thanks, guys. The first question, Bob, on IMXI Connect, it kind of sounds like an upgraded platform or processing system, and you made it sound like the early indications were pretty good. Ultimately, when you get that rolled out, by 2Q23. Any way you can roughly, broadly quantify what you think the pickup in transactions could be or the enhancement in speed? Just trying to think through the benefits of that. Yeah, I think, first of all, it's a little faster. It incorporates a greater accessibility to our ancillary products. So things like our Check Direct makes it easier to operate Check Direct and also to sell things that we might sell on an ancillary basis with the retailer, like money orders and bill payment. It also enhances our AML capabilities, which is really important. It puts us in a better position to remain ahead of the regulations in certain states that might have certain regulations related to certain ancillary products. As far as driving, early stages now, we've seen a little bit of an increase, a little separation from the core agents with those that we put the new software in. But it's too early to say that it's going to drive a lot more wires. Clearly, we know that one of the advantages we have in retail is our ease of use and the speed of how we process. So putting a brand new unit hardware in front of an agent's location front of that retailer, in front of that clerk, along with easier and faster to use software is certainly going to be beneficial. We haven't baked into any existing growth from that. We see that as just an overall to make the business better, ancillary products. And really, and I'll have Chris comment a little bit, Chris Hunt, who's our CIO, and how that really brings together all of what we're doing, the whole system, both digital and retail. Chris, you want to? Yeah, I think we'll clarify a couple things. First off, there's Intermex Direct, which is the agency retail software, which is discussed. And then we've got IMX Connect, which is really our integration platform. So we spent the better part of a year since I got here in really modernizing our back end and unifying everything that we're going to be delivering our software and technology platforms on. I think that IMX Connect, it's what we're building IMX Direct on, our mobile platform. and ultimately will extend into Marcelo's strategy in offering those as services, which we have not done at the company yet. So really providing an enterprise-ready integration platform, not only for ourselves, but for any third-party and B2B services we're going to offer in the future. Got it, got it. And maybe my second question, I think you guys said with La Nationale, you closed the U.S. part of it. The European close is going to be a little bit delayed. Can you kind of break out the revenues between the U.S. piece and the European piece? How do we think through that? I'm kind of asking in relation to the guidance being reiterated. I would have expected maybe a little bit of kiss to the guidance from the acquisition, but maybe it's because you only closed part of it. Yeah, but, Mike, I'd say this is Andrews. We only closed part of the acquisition. We only closed it for part of the quarter acquisition. We're not going to be breaking out as a separate reporting unit, so we're not going to deliver that next little detail that you're asking for. I would just say, though, for the quarter, we did reiterate our guidance with part of the acquisition in for part of the quarter, which isn't terribly material. But I'd say look at our guidance over the past several years. You know, I think if there's a good chance that we could end up on the higher end of that guidance, things go well, we could beat it. So, you know, I'd say at this point we're comfortable with part of the acquisition and for part of the quarter, reaffirming our guidance, and we'll see how we go. Yeah, and just to add to that, Mike, I think all along we've said with the LaNationale acquisition and talking about both sides of it, the U.S. side and the international piece, that it will take a period of time for us to kind of get our arms around that and that it'll bring in some revenue, but the FDA will be kind of something we're working through as we sort of, you know, create the same kind of metrics and the same kind of operating procedures and the same kind of right sizing that we have in Intermex. So for only being part of the quarter and only part of the acquisition, that's why you don't see noticeably any bump from it. But over time, that's going to become a bigger contributor, both at the top line and at the bottom line as well. But, again, just part of the quarter and not the whole acquisition and also just us really beginning to get our arms around it from an operations perspective. Remember, we kind of understood the business well from a due diligence perspective, but not able to actually operate it, and that just started now. Got it. Fair, fair. Hey, thanks, guys. Thank you. And the next question is from Tim Chiodo from Credit Suisse. Please go ahead. Great. Thanks a lot. Good morning. Also a question related to something that Western Union recently mentioned, and we actually mentioned on their earnings call that it did seem like they were attempting to, in some ways, replicate your approach of going after the high-quality agents. And we mentioned on their earnings call that that's been a very successful strategy for Intermex. In their approach to attempting to go after those same locations, I know you've mentioned in the past that You don't require exclusivity. You're happy to be alongside other competitors and compete. But just if you have a sense of what portion of your agent locations in the U.S. are operating only sort of exclusive with you or what portion of them are having other competitors alongside in the same retail location just by their choice to realize it's not demanded by contract. Yeah, so in the industry-wide, not just our agents, but in the industry-wide, you'd have a really hard time, other than big box stores, and even that's changing, finding exclusive retailers. It's just the dying breed. There are almost none of them. Our own corporate stores are exclusive, but when you look at anybody's agents, whether it's any of the competitors, I'm not going to mention names here, they're all going to have more than one and typically two or three competitors per retailer. Again, I don't want to spend a lot of time commenting on Western Union. You're asking the question. It's not our place to comment on them. It's their business. But we've faced head-to-head competition from Vigo Division, again, that I mentioned earlier that I know well. I was part of the group that bought that from the initial owner and then sold it to Western Union. And that is a very aggressive brand today at retail and is what we would refer to as more of a discounter. They're not a value-added service. And the way we compete with that service as we do any other discounter is, as our main values are, is that we're a value-added provider. And that is through a number of things that we do better than those competitors that only offer a pricing discount. And it would certainly hold true with the Vigo brand of Western Union. Our customer service qualities. We pick up the customer service line in four seconds. Our ability to be able to process face-to-face a transaction much faster. Our technology versus the competitors. The availability of us providing bank accounts, our check direct product. So we go through that whole list, and this isn't new to us. Anybody can talk about coming in and competing at retail and in the zip codes. The fact is that that brand is already there. That brand is there very, very aggressively. And very much a discounter, I don't think there'd be much room for them to discount any more than where they are with their Vigo brand. So it's not news to us. I'm not sure what they mean by it. You'd be better off asking them than us. But we feel like we've been holding up to the discounting challenge for really literally decades. between this business and back when we owned Vigo, Vigo was a value-added provider until Western Union bought it, and then it became a discounter. So we feel like we have the right prescription to be able to compete against people that are discounting at retail, and the consumer makes the choice and the retailer makes the choice. Great. Thank you for taking the question. Thank you. And it appears our last question today will be from the line of Alex Margraf with KeyBank Capital Markets. And if you should happen to need to ask another question, please press star 1. Thank you. Hey, all. Thanks for taking the question this morning. Actually, maybe just a couple. First, around agent location growth. I think this quarter, the growth rate was a bit of a, I don't know, I'll call it step down to the high single-digit range from low single-digit, or sorry, low double-digit. in prior quarters. Just a couple of questions here. Maybe how does it compare? Sorry, you said it was low double digit? It was well into the middle. Yeah. I just want to make it clear because it wasn't, yeah. It's more than 16%. Agent growth. I'm sorry. I thought you were talking about, okay, go ahead. Yep. That's good. Agent growth, you know, call it 9%. more kind of the low double-digit range in prior quarters. Just curious how that compares to internal expectations and how we should be thinking about that agent growth rate going forward. I know you don't all share the absolute number of agent locations, but any color would be helpful. I don't know if that's a large number of things coming in. Our focus has always been on agent performance and not necessarily on the number of agents. So our focus is much more on their productivity. I mean, adding agents is really easy. We could add another, we could add 15% more agents, but the question is how productive would they be? So today, I'm pretty sure that we have the most productive agents in the industry. We don't disclose that number, but it's many times, we believe, the average in terms of the industry. And so that's really our focus. Our number of agents added has gone up and down over time, but really the key factor that we're looking at is the cohort group in terms of new wires that our new agent universe is bringing in. and then focused on the agents that are relatively new, those that are in year two and year three, and driving new wires at those locations. Okay, that's helpful. And then maybe just switching over to IMXI Direct, the upgrade there. I'm wondering how impactful you all see this to sales team effectiveness, just kind of maybe helpful to describe, you know, when the sales team is out working with kind of potential new agents, you know, what are some of the kind of key challenges that they're facing today? And, you know, how do you see this tech upgrade making the effectiveness greater of the sales team? Yeah, a couple of things. Let me, if I may just add a little perspective to your first question. If we compare the results of our new agents added Q3 this year versus same quarter last year, we had slightly more salespeople on the street selling and their deliverable was slightly higher than last year. So Q3 is typically a quarter where there's a lot of sales reps on vacation and not typically working as consistently as they do some of the other quarters. Don't take that as less productive. But Bob really makes the most important point there, which is we are far more focused on how many wires are being sold out of our new store agents than how many new agents did we add. And likewise, Q3 this year versus Q3 last year, that group of new agents, 12 months or less, were more productive. So I think that's the right perspective to have. With respect to your second question, we've been rolling out the new software to our new agents for quite some time now. That really was our test bed. And it's been well received right from the very beginning. So that has been going, I think, Chris, for over a year now and very, very successful. I'll just add that Now, as we roll out the phase to existing agents, we are tracking. I think Mike asked the question, are we going to have more productivity out of our current agents with the software? And we're just to the point now. We've got a big enough base that we're surveying those agents. We're understanding what their real thoughts are in terms of are they going to use it more or less. We think it will be a couple. Yeah. Okay, and thanks for the color on the initial question as well. Yep. Ladies and gentlemen, at this time we have no further questions, so I would like to turn the conference back over to Bob Lissy for any closing remarks. Yeah, thank you all for joining us again. We appreciate your time. We'll look forward to talking to you all soon. Have a great day. Thank you, sir. The conference has now concluded. Thank you for attending today's presentation. You may now disconnect.