Good day and thank you for standing by. Welcome to the International Money Express, Inc. First Quarter 2024 Earnings Conference Call. At this time, all participants are in a listen-only mode. After the speaker's presentation, there will be a question and answer session. To ask a question during the session, you will need to press star 1-1 on your telephone. You will then hear an automated message advising that your hand is raised. To withdraw your question, please press star 1-1 again. Please be advised that today's conference call is being recorded. I would now like to hand the call over to your speaker today, Alex Sadowski, Investor Relations Coordinator. Please go ahead. Good morning and welcome to the Intermex First Quarter 2024 Earnings Call. I would like to remind everyone that today's call includes forward-looking statements, including our 2024 guidance, and actual results may differ materially from expectations. For additional information on International Money Express, which we refer to as Intermex or the company, please see our SEC filings, including the risk factors described therein. All forward-looking statements on this call are based on assumptions and beliefs as of today. You should not rely on our forward-looking statements as predictions of future events. Please refer to slide 2 of our presentation for a description of certain forward-looking statements. The company undertakes no obligation to update such information except as required by applicable law. On this conference call, we will discuss certain non-GAP financial measures. Information required by Regulation G under the Securities and Exchange Act for such non-GAP financial measures is included in the presentation slides. Part earnings press release and our annual report on Form 10-K and quarterly reports on Form 10-Q, including reconciliation of certain non-GAP financial measures to the appropriate GAP measures. These can be obtained in the Investor section of our website at intermexonline.com. Presenting on today's call is our Chairman, Chief Executive Officer, and President Bob Lissie, and Chief Financial Officer, Andrew Spendy, as well as other members of the Senior Leadership Team. Let me now turn the call over to Bob. Good morning, shareholders, analysts, partners, and media representatives. Thank you for joining us today. It's our pleasure to report that International Money Express has not only delivered a strong start to 2024, but has also achieved record-breaking performance. The company's revenue of $150.4 million and adjusted EBDA of $25.4 million are first quarter milestones. EPS and adjusted EPS have surged to new first quarter records of $0.35 and $0.43, respectively, surpassing market expectations and demonstrating our exceptional operational efficiency. Despite slower than expected market growth, particularly in Mexico, we have definitely navigated some top-line headwinds to deliver exceptional results in double-digit earnings growth. We delivered results within all guidance ranges and exceeded expectations on multiple metrics demonstrating our exceptional market command, strategic agility, and unwavering commitment to financial discipline. This quarter, we have continued to set records across various metrics, including revenue highs in 10 countries, which showcases the effectiveness of our global strategies, and the strength of our market presence. The integration of the national business has been a standout success with a four-times increase in EBDA, which speaks volumes about the strategic merits of that acquisition. We completed 2023 having generated $62 million in free cash, the highest annual amount ever for us, primarily driven by our retail operations, where significant growth opportunities remain. This success has further underscored the payback received from leveraging the cash and investing in our digital technologies, highlighting our efficient financial management and strategic initiatives. Our digital channels, cornerstone of our growth strategy, have reached all-time high user engagement and profitability levels. This success reflects our disciplined approach to growth focused on sustainable profitability through strategic and mindful investments in our technology and marketing efforts. We continue to expand and strengthen our digital offering through our strategic partnerships, particularly within our Wires as a Service platform. The successful rollout of new partnerships this quarter has not only enhanced our capabilities, but also set the stage for sustained future growth. The burgeoning European market remains a key focus for expansion where we anticipate our advanced digital solutions will be especially effective in driving growth of our business. The International Money Express is a fintech company at the forefront of the Omni-channel remittance model, which defines our approach to offering versatile financial services. This model is anchored by a highly profitable retail network, the backbone of our operations, and a rapidly expanding digital sector poised for substantial growth. Our Omni-channel strategy ensures seamless integration of traditional retail transactions with cutting edge digital solutions providing comprehensive coverage across various customer touch points. At the core of our identity is our surgical approach to growth in everything we do. At retail, we focus on specific agents and geographies to maximize profitability. The strategic targeting allows Intermex to navigate markets more efficiently and properly while delivering exceptional growth. Our ability to price services efficiently down to the zip code level showcases our sophisticated operational capabilities, enabling us to tailor our offering precisely to market demands. Our retail operations are noted for their cost efficiency and allowing us to strategically nurture our digital ventures. This balance helps avoid unnecessary expenditures, safeguarding the company capital while fostering substantial business growth. As a gold standard and quality service, we leverage cutting edge proprietary technology to deliver exceptional value added services. These services enhance our relationship with a productive network of retail agents, usually locally owned businesses, providing them with tools and solutions typically beyond their reach. This distinctive operational infrastructure sets us apart in the marketplace, makes our business model difficult for competitors to replicate. But blending the strengths of both traditional retail and digital technologies, Intermex uniquely captures diverse market opportunities, thriving our future growth. The strategic equilibrium not only expands our service capabilities, but also solidifies our position as a leader in the financial technology landscape. The first quarter of 2024 has been transformative for MSI. Underscored by significant strategic breakthroughs and substantial operational advancements, our current entry into the European market is anchored at the retail level, layering the groundwork for what we expect will be a significant expansion. While our advanced digital platform have yet to be deployed in this market, they represent a key opportunity for future revenue growth and are poised to transform financial services we provide as we extend our digital reach. Our enhanced partnership with Visa is set to expand our digital footprint and enrich our digital services offering, aligned with our goals for extensive market penetration and superior customer service. This expansion into at least a dozen new markets signifies a major stride in our commitment to broadening our reach and enhancing our technological capabilities. Domestically, the recent expansion of our outside sales force by 11 new positions demonstrates our commitment to strategic growth and enhancement of our market presence. These roles, while still in the early stages of impact, symbolize our fulfillment of the promise made to our stakeholders, setting the stage for substantial future contributions as the team members ramp up. The full operational capacity of the upside inside sales team, which now represents a tripling of our overall inside sales force, is revitalizing our sales approach. This significant expansion is a strategic enhancement of our capabilities, poised to elevate customer service levels and transaction volume as their integration experience progresses. As we move into the second quarter, we do so with a reorganized sales team led by new and upgraded management. This expansion is further bolstered by the launch of our new bill payment services equipping us with additional tools to enhance our market engagement and service delivery. While our growth does not solely depend on market conditions, any renewed vibrancy and remittance market will further amplify the impact of our enhanced sales force, boosting our future growth prospects. This quarter, we faced a series of economic and market-specific challenges, particularly in Mexico, where market growth did not meet our expectations of 3.5%. Despite these headwinds, our strategic preparation and adaptive business model enabled us to not just cope, but to excel, achieving robust earnings results across the board. Our success demonstrates our deep understanding of market dynamics and our ability to swiftly adjust our strategies to maintain momentum and deliver profitability. We have managed to achieve our key financial targets through diligent management and proactive approach to market fluctuations. I'll now hand it over to our CFO, Anders Bendi, who will delve into the details of our financial performance and the significant strides we have made this quarter. Thanks, Pop. In this first quarter of 2024, Intermex has not only continued its trajectory of robust financial performance, but has also set several new records, which underscores the strength and resilience of our diversified business model. Our first quarter revenue reached $150.4 million, a .5% increase a year over a year, despite softer than anticipated market growth in Mexico. The customer base on the Intermex platform continued to expand, up 3% to 4.2 million customers, showcasing our strong grand loyalty and the successful enhancement of our customer engagement strategies. Our digital channels have seen exceptional growth and enhanced profitability, with roving it up by almost 60% compared to the same period last year. This strong trend reflects our focused efforts on expanding our digital footprint and enhancing user engagement through innovative offerings. Our measured approach to digital, underscored by a thoughtful investment, is allowing us to really monetize the successful adoption of our services. Adjusted EBITDA reached the first quarter record of $25.4 million, representing a .5% increase, while the EBITDA margin improved to 16.9%, up 30 basis points from one queue last year. Also worth mentioning, we achieved this improvement in EBITDA margins despite the consolidation of the iTransfer business, an inherently lower margin business, which is not consolidated until the second quarter of 2023. These figures illustrate not only our profitability, but also our ability to optimize and scale our operations efficiently. Net income and adjusted net income both achieved new first quarter records, reflecting our disciplined financial management and strategic planning. Our growth and earnings per share is particularly noteworthy, with diluted EPS up .9% to 35 cents per share and adjusted diluted EPS also increasing by .2% to 43 cents per share. Our tax rate remained stable at 28.3%, close to where we were one year ago and a bit better than the fourth quarter. Our earnings performance highlights our commitment to delivering shareholder value and the nimble nature of the InterNex business model, allowing us to quickly lean into efficiency in the face of market softness. On the operational front, interest expense rose to 2.7 million. This is driven by a higher rate environment, but also higher usage of our revolving credit facility during the weekends. Versus one year ago, we have deployed a lot of cash that would have otherwise sat idle during the week towards stock buybacks, investment in technology, M&A, mainly the closure of the iTransfer acquisition, and investment in our new headquarters facility. The appreciation rose by .7% due to our new headquarters and ongoing investment in our technology infrastructure, while amortization expenses saw a decrease of 12% down to 1 million for the quarter. As it pertains to cash, our business model remains highly efficient and continues to generate a lot cash. When you look at our free cash generated measure for 1Q, remember this is our internal measure that attempts to exclude balance sheet cyclicality. It's a little unusual in 1Q. The lower number is mostly driven by the investment in the headquarters building, along with the timing of several technology investments. Excluding those items, our free cash generated metric continues to grow. As for usage of free cash, our commitment to returning value to shareholders was evidenced by a record buyback of shares, totaling over 949,000 shares for the quarter. As our financial results indicate, the quarter saw significant efforts in cost management, particularly in terms of SG&A expenses, where we implemented strategic measures to protect earnings and margins. This drive for efficiency is what we're good at, and core to the NMX DNA. As part of our strategic plan to further optimize the L'Inas Nile business, in the second quarter we launched a strategic restructuring initiative aimed at maximizing the efficiency of our offshore support entities. We'll complete the project by the end of 2024 and expect to generate over 2 million recurring annualized savings. With this program, we anticipate a roughly 2.4 million dollar restructuring charge in the second quarter. This move underscores our continued commitment to operational excellence in every area of the company. As we continue our journey in 2024, our financial strategy remains focused on leveraging our strong cash generation to invest in growth initiatives while maintaining rigorous cost control and financial discipline. Our balanced approach ensures that we'll remain well positioned to meet our financial goals and continue delivering exceptional value to our shareholders. Looking ahead, the outlook for our company is promising. Our ongoing investments in technology and strategic market expansion are laying a strong foundation for our long-term success. We're eager to enhance our service offerings, expand into new markets, and deliver exceptional value to our customers and shareholders. Additionally, we have realized and expect to continue to realize synergies through our recent acquisitions, particularly with L'Inas Nile, as we streamline their operations and ramp up their sales. Aside from the cost impact of the approximately 2.4 million restructuring charge on GAAP EPS, the rest of our full-year guidance will remain unchanged. We're optimistic about our ability to deliver earnings within the ranges we guided to, though we recognize revenue may be toward the low end of our guide should a soft market in Mexico persist. So for the full year 2024, we anticipate revenue of $681 to $701.8 million, fully diluted GAAP EPS of $1.77 to $1.92, adjusted EBITDA of $124 million to $127.7 million, and adjusted diluted EPS of $2.13 to $2.31. And for the second quarter, we anticipate revenue of $171.5 million to $176.8 million, fully diluted GAAP EPS of $41 to $45 per share, adjusted EBITDA of $31.7 million to $32.7 million, and adjusted diluted EPS of $54 to $58 per share. In conclusion, the first quarter of 2024 has been extraordinarily successful for International Money Express. We have exceeded many of our strategic and financial goals, setting a solid foundation for continued success and growth. We appreciate your steadfast support and trust in our strategic vision. We look forward to sharing our continued progress and achievements. We're now ready to take your questions and provide further insights into our performance, strategic initiatives, and optimistic outlook for the future. We welcome your inquiries and are eager to discuss our future plans and projections. As a reminder, to ask a question, please press star 1-1 on your telephone and wait for your name to be announced. To withdraw your question, please press star 1-1 again. Please stand by while we compile the Q&A roster. And one moment for our first question. Our first question will be coming from Gus Gala of Manes, Crespe, Hart & Company. Your line's open. Hi, Bob. Hi, Andres. Thank you for taking my questions. Can we talk about the growth assumption for the year in Mexico and maybe what you're seeing from maybe strengthening USD versus the Mexican peso again? And also just general touch on what you're seeing for your remitter customers in terms of their health, in terms of jobs, wages, all that. Thanks. Yeah, so there's been a reasonable amount of volatility in the Mexico growth numbers. So we try to look at the trend line. The most recent month, the numbers had dipped overall marketplace to negative numbers to a minus three. That most recent month that's final is March. So the previous month before that was a positive three. I don't think there was a 6% swing in one month. Sometimes that's just the way the months kind of fall and how the Mexico banking system reports them. But we do expect, I think, the market to get a little bit better as the year goes on. But we can't, we don't really have that in our projections. As we talked about, if the market rallies and comes back a little stronger, then the things that we're doing related to our increased investment in sales, particularly at retail right now, where we still believe there's a lot of life. And also what we're doing with the partnerships related to digital, we think that the numbers will be stronger if the Mexico market comes back. It's difficult to know because there's a lot of really complicated factors. A lot of it has to do with today, we believe the strength in the peso, as you noted, hard to figure out or the weakness in the dollar, whichever way you want to look at it, harder to really get a sense about how long that will go forward. What I can tell you is I think it's a highly resilient set of workers. And that are resourceful because they're here to work. They're here to send money back home. Their whole purpose for being here is that. And so even when we had COVID, back in 2020, we found a movement from workers, even if they were in the service industry, to move to industries that were still able to work, whether it were car washes or whatever, we didn't see really a huge downturn in the overall market that was sustained even in the period. So I don't think that there's jeopardy in terms of related to the viability of the work careers for our customers. The most area that is probably the most economically, I think, influenced would be housing starts with the effects one segment of our workers. But we're very heavily into the agricultural component, particularly in certain areas in the West and even in the Midwest. And those areas are going to be stable that there's nothing changes relative to our agriculture related to the economy. The service industry housing starts to get affected there a little bit. But I think we don't think there's huge instability related to a decline in the number of customers. Are customer base still growing? We just think that Mexico, for one, has been on such a high rate in terms of growth for so long, such a really great track of growth that's inevitable to have a little bit of plateauing or even a slowing. But we don't expect it to last a long time, but we don't have any resurgence in our plan for the second half of the year. Great. Appreciate that color. And pivoting a little bit, can we talk about performance of your agent advantages, maybe talk about those that are still ramping in terms of that wires per month per agent versus those already at scale? And just a clarification, how are we doing versus that top five countries market share that you used to share? I'm not sure I saw it in the slides. Thank you. Appreciate all the color. Yeah. For us today, the top five market share has been affected by a number of factors. One, the acquisition of La National, where in certain countries, it's been really impactful and other ones not as much. Additionally, we believe that we would, and it's hard to tell because you can't separate out digital and retail. We would believe that based on the numbers we see, we're beating the market and gaining share at both of those, but our weighting is such that we don't have the same weighting as the market related to digital, which is the faster growing component and versus how we are heavily weighted in retail. And as we continue to grow our digital, which is growing much faster than our retail, our weighting will continue to shift and that the market share numbers will flow with that. So we don't believe today that's as indicative of how we're doing because of the acquisition, because of the sort of shift related to retail and digital. And so we really didn't think those were helpful in an indication of how we're doing versus the market at this time. Gotcha. And on the performance of agent vintages, if you don't mind some call it there, like the ones that are still ramping up in terms of wires per month for agents. You mean there's always, you know, typically I can tell you that typically and today as well, that you always have a segment, our business is comprised of three components. There's same store sales, there's the churn, those are agents that had been with us the previous year that are no longer there, and there's new store sales. And they each contribute to the overall sales number. Today our agents continue to perform well in terms of the new agents, they perform better than they have in the past at an average per agent. There still remains a huge opportunity and that's why we've been ramping up our sales efforts to put up more new agents. The opportunity for us isn't that the new agents that we have typically are up and we would consider a successful agent over 150, 200 wires per month. Depending on the gross margin, they could be much more successful at a lower number, but those are achieving that on the average within two or three months. What we need to do is, that's why we're adding 11 people out in the sales force, is to be able to put more resources in areas like Texas, California, which we've been building for a long time, but even have greater opportunities to put more people out in what we would call underserved or opportunity zip codes. We may be in those zip codes, we may be delivering wires today, but it might be a zip code of 40,000 foreign borns in the West where we have a few thousand wires where the opportunity is to pick up another 10,000 wires. And so we need to put up more retailers, quality retailers in those locations. And so that's really the focus of the business. We're really expanding out with 11 more sales reps doing some other things that will, as we invest it into a greater effort in our digital, excuse me, our inside sales team that can take some of the weight out of the outside team. So the outside team can focus more greatly on adding new locations. So the opportunity there is still great. They're performing well. We haven't shared specifics about what shares those are of the business, but it's a critical to have same store producing new store and then obviously minimize the churn. And those are all aspects that continue to be proportionally healthy for the business. We just need to put up more new retailers in places that remain opportunities for us, which are primarily the Western States, which I know it's a sort of a broken record if you've been following us, but it will be a broken record for another five or seven years. Because before we get fully ramped up there, that's how it'll take. Unless we put another 50 people out in the street, which might be a sharp impact to our bottom line quickly, this will be a ramp that will take a while because we need thousands of more retailers in the Western States relative to population. Great. I appreciate all the color. One moment for our next question. And our next question will be coming from Alex Markra of KBCM. Your line is open. Hey everyone. Thanks for taking my question. Actually two questions. First on slide 13, just looking at this gross profit per transaction and digital. I'm just curious if you could sort of expand and we look at the Intermex bar, what has sort of allowed for that expansion there? Expansion of what? Revenue per transaction? Gross margin. Gross margin. Yeah, we estimate a little bit of expansion because we have other initiatives for cost reduction lineup. However, as we keep growing and we hopefully start making more investments in marketing, we might see some change in the long run. But in the short term, yes, we expect some expansion too. Yeah, let me add to that. I think what we found out is that some of the competitors and the leaders in the digital marketplace after entry level transactions have some really pretty rich margins which we've been able to be competitive and still get a better margin than where we got. We've also been able to increase those gross margins relative to how we've been able to lower some of our costs that go into the cost side of the gross margin. So part of that's pricing, part of that's been able to reduce, Marcelo was speaking and Chris Hunt who really are focused on our digital side, some of the costs that go in before you see that gross margin number. So we think that now we're in a great place because the unit economics works so well and they're so strong. We have the ability to look at this and be a little bit more nimble and maybe at times for growth reasons take a little bit lower of a margin to tweak that, the price quantity continuum or interaction. But the first thing we needed to do is to be able to take that and make that unit economics really work. Back in the old days, which is a few years ago for us, two, three years ago, the unit economics, not only did you have the challenge related to digital, which was the customer acquisition costs, you also had the unit economics challenge. So now we've erased that. The quality of the technology is now we feel holds up with anyone. At the same time, we've got unit economics that make a lot of sense and is really profitable that we can tweak one way or the other. Now we're just now with our last piece is to wrestle a little more with the customer acquisition costs that can help us drive more people to the site, we'll enjoy a quality app at the same time where we make a good unit economics per wire, if that's helpful. Yeah, that's great, Bob. Thank you. And then just a quick follow up on the Felix Pago partnership, just sort of if you would speak to the rationale there, maybe if there's any sort of indication of how the economics look of that type of transaction. I don't know if there's any commercial agreement details that you're willing or able to share, but just any sort of extra color around that would be helpful. The rationale is to expand our wires of service solutions without the cost and the challenge to acquire new consumers. So we can leverage our platform, we can leverage our license, we can leverage our expertise, but Felix Pago is the one who's really making the large investment to acquire consumers. It's a great combination of our strength versus their innovation, which doesn't block us to have similar solution in the future. However, in the short term, we can increase the bottom line significantly by offering and leveraging a platform that is already existing. I would add that this is Chris Hunt, one of the things I would add is pursuant to our omnichannel strategy. One of the things that's unique about Felix Pago is obviously the interface being in WhatsApp primarily, and that's a channel that a lot of our Latin consumers like to use and are very comfortable with. So it also gives us expansion into meeting our consumer needs where they would like to send wires as well. So strategically overall also plays into the omnichannel strategy. Okay, thank you both. One moment for our next question. And our next question will be coming from Mike Grandel of Northland Securities. Your line is open. Hey guys, a couple questions. First off, just on the recent expansion in the outside Salesforce and inside Salesforce, how is that going kind of compared to internal plan, productivity, and growth that you're getting from that new investment? Yeah, Mike, it's going well. You know, these things do take some time to ramp up and we, let me start with the inside sales first. So we did with the inside sales, we had a team that was typically around 13 people that were supporting our outside sales efforts, primarily almost exclusively with same store locations. So they were calling the same store guys and making sure that everything was going smoothly as we compete against our competitors, particularly over the weekends related to if we needed to make an adjustment in pricing or whatever it might be to drive as many incremental wires in our same store as possible. What we decided is, is we could triple our reach with a very small investment because the cost of the team in Guatemala, and by the way, many of them are just as bilingual as people we have here in Miami, we were able to invest and add 24 people that tripled the reach. So now we're able to talk to more agents, we're able to on a Friday afternoon, look at in real time where we're struggling, if we are, or where the opportunities are related to what countries, what geographies, and direct our team of people, which is now, you know, close to 40 people, to where we're going to make calls, and where we're going to go after those wires. So that's working really great. There's a time period that needs to kind of ramp up and we're still in a ramp up period. We only made the decision to invest late last year. We only had the team really fully ramped up in terms of personnel is sort of in the right spots early in 2024. So we're early on in the program, we're really pleased with the activity and how on a Friday, the same room we're sitting in becomes a real sort of war room, if you will, where we're able to look at where the opportunities are and direct those efforts with resources that most of our competitors don't marshal or don't choose to marshal. Now on the outside piece, we're also looking at in a creative way, putting people in right markets. We've divided territories relative to opportunities. We're putting more people out in certain markets where we have, like for instance, in Chicago, in Illinois, we've only had in the past two sales reps. We know that the number of retailers we need relative to foreign borns, that's a metric that we use at KPI, foreign borns per retailer, wires per foreign born, that these are huge opportunities. So we're putting down a roving person in Chicago that would do nothing more than ad agent retailers. We're doing that on other areas of the country. That's very early on. Some of those positions, as a matter of fact, many of those positions are still in the process of being filled. And we're going to feel that impact as the year goes on. But we feel really good about all of it. I think we've re-calibrated our sales effort. We've taken it and gone back to what I think has been a unique and proven success with Intermex, that no one's ever grown the Latin American business as quickly or as well as we had. And we're back to the days of the very much the Intermex way. That was something that took us from a small regional player to being a leader in the market. And I expect those results to be usually impactful as we move into the second half of the year. Got it. Got it. And then earlier in the year, you said that your 24 guidance assumed like .5% industry growth, US to Mexico. Is that .5% still kind of embedded in the 2024 guidance? Yeah, Mike, I would say, this is Andrew. I would say for now, it's still close to that. You know, we've bumped it down a little bit. You know, fortunately, from an earnings perspective, we've done a great job on costs. We're able to make up a lot to get through to EBITDA and EPS. But, you know, I'd say it's near what we had communicated before. You know, we do have coming up in the second half of the year, we do have some softness that we think we're going to be able to get some uplift in terms of grow over that was more execution related that we think we've remedied. So, you know, we think we've still got a good shot to deliver. Got it. And then, Andrew, did you rank out, you know, with the acquisition of La Nationale and iTransfers, I don't know, the last four or five quarters, we've gotten a core or an organic growth number in addition to the revenue growth number you guys reported, the 3.5%. Do you have the organic number? Yeah, I think since we've had them in the portfolio long enough, we're moving away from the breakout of those separate units. Okay. And then maybe lastly, guys, any comments on April and how that month went? I think the most we could really say because we, you know, it's obviously not final for us, but for ourselves, we saw more a little bit of a resurgence related to our growth numbers, which we expect, because as I said, we've kind of gone back to fundamentals in a way that we have been doing for years, and we're seeing a turn of the tide. It's way too early to declare victory or even to declare that we're, you know, absolutely solidly have everything in line for the resurgence because I think it'll take some time, but the numbers are encouraging from a transactional -over-year perspective more than they've been, particularly if we weigh into the fact that February market was a plus three, March was a minus three. If that trend is continuing into February, we departed from the market significantly in a positive way as we moved into April. So we're very encouraged, but you know, more to come and more for us to watch that. I just also want to be clear that we've never been a company, and Andres has laid this out clearly as well, that's been exclusively dependent upon what's happening in the market. And I know that the numbers that you see today reflect a lot of what's going on in the market, and we're not immune to that, as no one is, but this company was built in 2009 through 2013 or 14 when the market didn't grow at all. And we still believe that the way we apply our business at retail with the new adjustments in terms of people and back to the very unique and different way that we go about consumer acquisition through our retailers, that we can grow much faster than the marketplace. And I think the early results on April are kind of indicative of that. But again, you know, we need a little bit of a trend line here to see that for a few months before we declare that it's but we're very encouraged. Got it. Okay, thank you. One moment for our next question. And our next question will be coming from Rufus Holm of BMO. Your line is open. Hey, good morning, guys. Thanks for the question. Just coming back to the detail you gave on slide 13 on the gross profit per transaction and digital. Any way you could sort of frame what percentage of digital transactions are those intermex branded and what percentage are unbranded? Just trying to get a sense of the blended gross profit per digital transaction. Thanks. Intermex branded transactions pretty much 40 to 45 percent of the total. The other 55 is a nation of different partners that we have. And by the way, when you say unbranded, I don't want to correct that, but just want to make sure that we have all the data there. They are co branded. They require that, you know, so they we still are co branding with the partner on those exclusively branded us is the 45 percent. Okay, got it. Got it. And do you think you can keep driving that gross profit per transaction up over time? I guess what gives you confidence about that trajectory? Thank you. I think that the key isn't really driving gross margin up. It's now leveraging what is a really strong gross margin to drive more wires. You know, we want to make sure that we're reflective of the marketplace, which we believe the Latin America is more like an 80 20 today, meaning 80 percent at retail and 20 percent at digital. And we want to move that number there that we don't want to sacrifice or give back gross margin. But I was I spoke earlier, the key to this was first is a stake out of place where gross margin was very healthy. And then we can start to move from there and decide how we create programs, how we create repeat usage that leverages the high gross margin to drive even higher growth. So I think that'll be the place you see us go. I don't think you see us try to get from a from a five dollar margin to five fifty or five point a quarter. Even it's more about trying to drive a much higher growth rate that will drive the business overall now that we're in a very healthy position with gross margin. Thanks very much. And I'm showing no further questions at this time. I would now like to turn the call back to Bob for closing remarks. Thank you all for joining us. We look forward to talking to you soon and have a great day. Thank you. This concludes today's conference call. Thank you for participating. You may now disconnect.