Good day, and thank you for standing by. Welcome to the International Money Express third quarter earnings conference call. At this time, all participants are in listen-only mode. After the speaker's presentation, there'll be a question and answer session. To ask a question during the session, you'll need to press star 11 on your telephone. You will then hear an automated message advising your hand is raised. To answer your question, please press star 11 again. Please be advised that today's conference call is being recorded. I would now like to turn the conference over to Alex Sadowski. Please go ahead. Good morning, and welcome to the Intermex third quarter 2024 earnings call. I would like to remind everyone that today's call includes four looking statements and actual results may differ materially from expectation. For additional information on International Money Express, which we refer to as Intermex or the company, please see our SEC filings, including the risk factors described therein. All forward-looking statements on this call are based on assumptions and beliefs as of today. You should not rely on our forward-looking statements as predictions of future events. please refer to slide two of our presentation for a description of certain forward-looking statements. The company undertakes no obligation to update such information except as required by applicable law. On this conference call, we will discuss certain non-GAAP financial measures. Information required by Regulation G under the Securities and Exchange Act for such non-GAAP financial measures is included in the presentation slides, our earnings press release, and our annual report on Form 10-K and quarterly reports on Form 10-Q, including reconciliation of certain non-GAAP financial measures to the appropriate GAAP measures. These can be obtained in the investor section of our website at intermexonline.com. Presenting on today's call is our Chairman, Chief Executive Officer, and President, Bob Lissy, and Chief Financial Officer, Anders Bendy, as well as other members of the senior leadership team. Let me now turn the call over to Bob. Good morning, everyone. Thanks for joining us. I'll get straight to the point. This quarter is a pivotal one for International Money Express. We have achieved strong results that underscore our position as a leader in the remittance marketplace. Additionally, we are making significant strides in executing our strategy shift to fully realize the market opportunity relative to our digital channels offering and ultimately creating greater balance and sustainability in our overall business model. We continue to deliver exceptional performance across all metrics. Our gap EPS for Q3 hit a new high of 53 cents, up 29.3% year-over-year, and our adjusted ETA hit an all-time high of $33.9 million, growing 7% year-over-year. This quarter's results demonstrate our ability to perform through both the retail and digital channels, underscoring our role as a multi-channel company, espousing an omni-channel, designed to meet customers wherever, whenever, and however they choose to send money. We have expanded our send capabilities to more than 90 destinations, including 14 of the top 15 corridors worldwide. This quarter was not only about short-term results. It was about building for and securing the future of Intermex. Today, we stand as a profitable, highly digital-ready company with a powerful and extremely profitable retail network backing us. As our digital channels margins have surged past those of retail, the proposition is now many times more economically promising than just a few years ago. Additionally, the remittance market is becoming increasingly digital, and we are working to balance our company's portfolio accordingly. As a result, we'll be in the best position to maximize our market share and profitability in the market that today is estimated to be about 30% digital to Latin America. We hold an important place in the lives of over 4 million Latin American consumers who use Intermex each year. These consumers trust Intermex to send their hard-earned money back home to loved ones. Equipped with highly profitable proposition on both segments of the market, the timing is now ideal to execute a more substantial but highly efficient investment in our digital channels and extended new business lines that can further benefit our senders in the U.S. and a similar number of receivers in Latin America. The company's board of directors and its management team firmly believes that our current market valuation does not fully capture the company's performance, superior positive cash flow, intrinsic value, or growth potential. We're committed to acting in the best interest of our shareholders, and to that end, we are initiating a process to assess strategic initiatives, which could include, among others, a potential sale in a private transaction. The company has retained FTP Securities, known as FT Partners, as a financial advisor. We believe this move will create flexibility to optimize our growth and better fulfill our potential as an industry-leading fintech. We feel the optimal time is now to unlock the company's opportunity with regard to its digital channels offering. Our app has been highly regarded by our users, demonstrated by a high level of retention and recurrent usage per cohort. and we feel that our app is good as any in the industry. Combined with the highest standard of superior customer care and our strong reputation in Latin American corridor, Intermex is an ideal position to compete and to win. From a financial perspective, we have successfully improved our digital channels unit economics, and today a digital-initiated transaction delivers a superior gross margin on average than a retail transaction. Digital channels have never looked more promising for Intermex. All that remains for us is to invest in the customer acquisition strategy that will build our business. We will bring the same efficiencies to the digital-based business that have made us so successful in our retail portfolio, reducing the digital consumer acquisition cost even further. In support of delivering against that full opportunity, our approach is to ensure we unlock the full potential of the business and deliver maximum value to shareholders and stakeholders alike. We believe this is the right time to become much more active and aggressive relative to our digital channels and new business lines. And as stated earlier, the board of directors and the management team jointly feel the opportunity will best be assessed through reevaluating the strategic options through the initiation of a formal process. During this quarter, we encountered some headwinds in the form of slower market growth and economic shifts, which continue to put pressure on retail. Yet, we are in an excellent position to navigate this transition effectively. Our adaptability remains a hallmark of our operations, and we continue to pivot smartly to respond to those dynamics. We believe that we will continue to grow our retail business faster than the market and gain share at retail. I want to reinforce that our retail business remains highly profitable and produces tremendous free cash flow. And importantly, when it comes to certain markets, such as Mexico and Guatemala, the majority of remittances still originate from retail market-wide. Our digital channels have become the real success story. Not only are we seeing strong transaction growth, but as I indicated earlier, our gross profit per transaction from a digitally initiated transaction has now surpassed that of retail. This represents a huge advantage. It's one of the main reasons we're leaning so heavily into digital as a core part of our strategy going forward. We are meeting the consumer where they are, and increasingly, they are choosing digital solutions for speed, convenience, and security. Meanwhile, our retail base, which brings in about $600 million in annual revenue, remains a crucial part of our business. As other competitors pull back from retail, we are capturing more of the market, maintaining a profitable retail operation that helps fuel our growth in digital. This balanced omni-channel strategy enables us to capitalize on diverse opportunities and ensures that we are not leaving any potential customers behind. Retail has shown remarkable resilience and continues to support our growth, especially as we escalate digital. At this time, although the digital market is growing faster, for many of our core customers, cash is still paying, and it is not going away in the foreseeable future. This fact helps keep retail relevant. About 70% of the outbound remittance business are sent from retail in the overall Latin American market. We feel deserting this segment of the market prematurely would not be wise for our customers or our shareholders. At Intermex, we do not just run a network of retail locations or offer digital solutions. We're in the business of facilitating the movement of money for our customers faster, more reliably, and more safely than anyone. That is who we are. and that is what sets us apart. We have built a strong, reliable brand that customers trust. Our operations are robust, and our call centers are world-class. Our customer service has set the industry standard. We also have a top-notch banking and payer network that ensures transactions happen seamlessly every time from cradle to grave. We never fail to honor or pay out a transaction on time, and that is a trust we protect fiercely. We have an efficient, productive retail network that is highly cost effective, which enables us to strategically expand our digital channels offering. It is worthwhile to mention that our retail sales and marketing costs are well below 10% of gross margin, making this business highly profitable. Our digital solutions provide the best-in-class user experience that is fast, secure, and designed to meet the needs of today's consumer. By blending the strength of both our retail and digital operations, we are positioned to maximize growth and profitability while meeting our customers' needs with flexibility and convenience. Q3 has been a quarter of achievement. Digital channels are performing better than ever with customer acquisition costs down and retention at record levels. Our digital transactions have increased significantly, outpacing the market by a large margin. These are metrics we're excited about, and they point to the growth potential ahead of us. Internationally, Our licenses that include EU as well as the United Kingdom are an important step forward in fulfilling our strategy and providing a base from which we can grow in Europe. As we have indicated previously, we believe that the digital channels opportunity will be significant in both geographies. This expansion into new corridors aligns perfectly with our vision for a truly omnichannel future. Domestically, we have streamlined operations to reduce backroom costs significantly to be more efficient. Those cost reductions will be fully realized in 2025. Additionally, we have successfully refinanced our credit line on very favorable terms, giving us greater flexibility to fund our growth initiatives. Our staffing costs are also down as we continue to shift tasks offshore to maximize efficiency and lower our cost basis, bringing up more capital to invest in strategic initiatives. When National and I transfer to pay acquisitions, remain on track, and we are confident they will reach their margin targets by 2025. Both continue to expand their year-over-year EBITDA performance. In summation, we are proud of the results in Q3, but even more optimistic about the future we are building for the company. With that, I will turn the call over to Andrew Spendi, our CFO, for a deeper dive into our financial performance. Thank you, Bob. On the financial side, in this third quarter of 2024, the National Money Express continues to demonstrate the resilience and adaptability of our business model. In a challenging retail backdrop, we posted total revenue of $171.9 million, with exceptional digital revenue growth climbing over 66% year-over-year, as we see growing adoption across our digital platforms and the success of our digital partnerships. With a consumer base now reaching 4.2 million, a 5% increase from the previous year, our expanded market reach underscores the effectiveness of our omni-channel approach. Our adjusted EBITDA reached 33.9 million, up almost 7% from a year ago. Importantly, our adjusted EBITDA margins remain strong at 19.7%, a testament to being the player best positioned to capitalize on the omni-channel opportunity with the premium product to Latin America. That being said, Intermex's relentless focus on efficiency continues to serve us well and further bolster our margins, as staff costs and G&A are both down year over year. As Bob mentioned earlier, we're very pleased to report that we're in the very final phases of the La Nacional and iTransfer integrations, and in 2025, we expect fully realizing the synergies and margin expansion anticipated when we enter the deal. The contribution from that deal is on target to deliver the EBITDA margin potential we saw before the acquisition. As for EPS, on an adjusted basis, earnings per share came in at $0.61, up 19.6, while diluted gap EPS reached $0.53, representing a 29.3% increase from the prior year. These results reflect our commitment to operational efficiency and profitable growth. Interest expense rose to $3.2 million, marking a 14% increase. However, most of the year-over-year increases due to fees from a highly successful refinancing we completed in August. Our tax rate came in at 30%, down slightly from a year ago. Net free cash generated, again, our internal measure that attempts to remove working capital day-of-the-week cyclicality, came in at $17.6 million this quarter, underscoring the strength of an efficient highly productive model as it pertains to cash. Much of the cash we generated was used to repurchase over 1 million shares this quarter as we leaned heavily into the buyback after our share price pulled back. As I mentioned earlier, we successfully refinanced and upsized our credit facility on favorable terms, enhancing our financial flexibility as we entered the next phase of growth. As we close the third quarter, our financial strategy remains focused on fortifying our position and outpacing the market at retail, the highly profitable, cash-generating heart of our business, managing costs down above any macro headwinds, and accelerating our journey in digital as we patiently set the stage to grow profitably with the best-in-class product. And with that, I'll turn it back to Bob. In closing, Q3 has been a meaningful quarter for Intermex with strong results and a clear strategic direction. We are moving forward with purpose, with the needs of our customers and our investors at the forefront of our decisions. We're excited about what lies ahead, and we're ready to take Intermex into the next chapter. Thank you for your support and belief in our vision. We look forward to your questions and to diving deeper into our progress and plans. We are now ready to take your questions and provide further insights into our performance, strategic initiatives, and the outlook for Intermex's future. Thank you. Thank you. As a reminder, if you would like to ask a question, please press Star 1-1 on your telephone. We also ask that you wait for your name and company to be announced before proceeding with your question. And our first question for the day will come from Gus Gala of Moniz, Presby, and Hart. Your line is open. Hey, good morning, Bob. Good morning, Andres. Can we talk a little bit more at about competition in brick and mortar retail here? I mean, where are we seeing the most aggregation that retail? Is this the pricing of the ramping agents? Or maybe in the existing agents, you're seeing more competition at the margins there for wireshare? I just want to clarify, should we take your commentary throughout as in the prepared remarks to mean Digital share in LATAM is accelerating beyond what we expected. And anything you can share on what you're seeing in terms of changes, maybe in terms of habituation or behaviors of bankification maybe in the U.S. as proliferation of digital endpoints in Latin America? Thank you. I'm going to try to remember all those questions first now. Let me start with the, no, no, that's cool. Just help me out if I've missed something. So I'll start with the talking about the competition. I don't believe that there's any competitive issues at retail that have existed for the whole entirety of our time in the industry. There's a pocket of guys that operate strictly on price. There are others that operate on a bit of price and quality. We tend to be more towards the quality side of the equation. Any what you would perceive as softness in retail, we're growing faster than the retail market is growing. The challenge that we have related to these days, you know, related to growing our business faster, is number one is that the market that just two years ago was growing in double digits, about 12%, is now growing somewhere around flat to 2%. So that along with the fact that the digital business now to our core countries is It's about 30% or more. So it's growing. It's not accelerating or absorbing or overtaking retail. Retail is more than still two times as big as the digital side. But the digital now is a significant piece of the business to Latin America. And that piece is growing faster than the retail piece. That is really absorbing almost all of the industry growth. Really more than all the industry growth, retail is actually negative. So when you look at the two pieces, we're beating the rate of growth at retail, and we're beating the rate of growth at digital by a large margin. The difference for us is that whereas the mix is about 70% or so in the industry at retail and 30% digital, in our mix is a fraction of that. We're more like a little less than 10% digital and about 90% retail. So as the market has softened a bit and as digital is taking a bigger share, you'll see our retail numbers look a little weaker, although we're continuing to gain share at retail versus the competition. Is that on that first question? Does that kind of hit that or is there... Yeah, it does. And I want to, if I could clarify one thing, is the margin that you guys were beating retail, you know, last couple of years, last call was kind of clear. It's compressed. Can you talk about that Q over Q? Did that further compress? I mean, or is it, you know, have dynamics that have gotten better? Your question is our margin per transaction or the margin we're beating? No, your spread versus what the industry grows in retail. Our growth. Okay. I think that we're also sort of calibrating ourselves in retail. And I think that... Our spread and our difference between us and the rest of the market is smaller today than it was. That's not unusual in a market that's starting at the growth numbers that are flat, because what you'll see is more desperation from the small guys who are going to get more aggressive in retail. And so, you know, it's not, we're still beating retail, but that difference can get a little smaller during a down market. and that difference will be accelerated in an up market. People tend to be optimistic, meaning the competitors, and even if they're growing less than the market, when the market's grown at eight or nine, as long as they're growing five or six, they're less aggressive. They're more aggressive in a down market, even though the market might be down. So you see some of that, and it's not unusual in a tougher market to have a smaller spread between us and the competition. Okay. Okay. I appreciate all that call it my fault. Yeah. No, no, that's fine. Your next Can you just read? Just rephrase again, your your second question. Can you talk about what you're seeing domestically, in terms of, you know, more bank accounts amongst your centers, and then insofar as you have visibility, and then considering endpoints in Latin America, I mean, Are you seeing increased digitization kind of changing behaviors? And maybe I'll squeeze in another one that wasn't even in the original question. But anything interesting on endpoint diversification at retail in Mexico? I think OXO, owned by FENSA, is looking at doing work there. Is there an opportunity for pricing to be favorable to you there? Yeah, I mean, I'll start this out and then I'll ask Marcelo Theodoro, who's our head of digital and product, to kind of chime in because he's certainly the resident expert. We're seeing steady movement, right, of more consumers having accessibility to banking on the US side, but one of the biggest hurdles that remains is the fact that many of our consumers, many of the consumers in the marketplace, particularly to places like Mexico and Guatemala, are not necessarily bank account eligible in a traditional sense. Even ourselves, in our own card products, We have challenges to make sure that we can get people banked that are not traditionally having a social security number or an ITIN number and have a foreign ID. So that's a challenge. There's also not a huge willingness on a lot of the parts of those consumers where we kind of talked about a little bit in the prepared remarks that Cash is still king, and then retail's got a lot of resilience. And so we're seeing on the edges maybe people that more consumers that are coming in when they're coming in documented, when they're coming in with a work visa, when maybe they're a younger generation, whatever might be the case. I don't think there's every consumer... that's at retail is an eligible consumer today for digital, nor do I think everybody that's digital is someone who came from retail. I think many of those consumers are different. They may have been people that were using bank wires in the past. Now, on the other side of the border, we're seeing, and we've been seeing this for years, and a huge amount of our wires that we pay through major payers like Electra, which also has their bank, which is Banco Azteca, through Copal, which is also Bank Copal, and in Guatemala through Banco Industrial and Bank Rol, we're seeing a larger share of the wires beginning to be deposited into bank accounts. that's digital on that side and sometimes we just you know talk about that a little bit more clearly than we did this time but that's a higher share of our business on the digital on the pay side in some cases 25 30 percent and some of those payers that wires are actually going to bank accounts slower on this side remember still 70% about you know we don't know for sure no one has an exact number But somewhere 30, 31, 32% of the market's digital. The remainder is retail. And it's moving, but I don't see that as something, when we look at our projections, we're not looking at a retail market that we think goes away in five years. As a matter of fact, our projections, look at the retail market, might still be bigger than the digital market in five years. But there will be continued growth, faster growth in digital than there is in retail. Okay, that's super helpful. And my last question will be, you guys removed the guide, can we talk about decisions is that in the conflict? What does that have to do with a strategic review? Is there any connection there? And, Bob, you were around for one, I think it was oh, seven to 2016, when you were held by Lindsay Goldberg. Can you talk maybe about the environment of like maybe approaches you got from potential different homes back then versus what you've seen in the past couple of years. We don't even have to go past 2022. But just help me think about it. Thank you. Approaches from what? I didn't hear that. Approaches from potential acquirers back in the day, 07, 2016, when Intermex was held by Lindsay Goldberg, you know, privately held, right? Well, when I walked in in 2008, probably through 2012 or 13, we weren't exactly the prettiest company, right? So there weren't a lot of people trying to buy remittance companies, and certainly Intermex wouldn't have been at the top of the list. We went through a large transformation that took a company that was a million dollars in IBDA to where it sits today. So as we became more successful. We've had a number of inquiries in recent years. We won't disclose who those are or what. Some strategic, some sponsors that have come around the business because of the quality of our performance. And we think that when you look at our business and you look at the cash that we throw off, And the fact that, you know, our, you look, think about if we looked at where we were trading in 2000, third quarter of 2021, and you applied the increase in earnings per share, we'd be a 25 or $30 stock right now. So very, and we were underpriced then. So very, very unappreciated right now in the marketplace. And I think from my perspective that that appreciation will be greater potentially in a different environment. And that's why we're looking at those strategic alternatives. We also find ourselves at a time where we've now maximized, we believe our app is as good as anybody's, including the people at the very top of the success ladder in digital. We believe it's just as good as anybody's. And we also believe that our unit economics now make us incredibly competitive in terms of it being financially lucrative. But we also understand that we need to make an investment. The most challenging thing on the digital side of the house is the customer acquisition cost. And so we need to – and the point is is that, you know, with the kind of cash we throw off, we have the cash to do that. But we have to be able to be able to do that freely, right, and in some ways affect our bottom line to be able to build the company for the future. And we think the company will be bigger, stronger, much more financially lucrative, and much more sustainable – When we do that over the next three to five years, and all of that obviously impacts the decision to look at how do we take the company forward for the shareholders to maximize their shareholder value going forward. I don't think that answers your question. No, no, that's super helpful. And anything on the removed guidance, not even in the context of strategic review, just like anything to help us frame up. I mean, I think there's two main points. Well, that would be guidance, which we're not getting. So there are two components to it. I mean, it's not unusual to not guide when you go into a strategic process. You know, we carefully examine that with our board and with our council. And then secondly, some of the things that we talk about, we're going to begin immediately some of that investment into the digital and things like that. So it's not going to be something we're going to do right now in giving guidance. And so those are the reasons for it. Okay, that's all. Thank you. I appreciate the clarification. I'll jump back in. Thank you. One moment for the next question. And our next question will be coming from Raina Kumar of Oppenheimer. Your line is open. Good morning. Thanks for taking my question. It's good to see that the digitally-sensed money transfers increased 76% in the quarter. I was wondering if you can walk us through how the economics of digital money transfers versus retail transfers deal. Okay, so you mean that you want to talk about the unit economics? The unit economics and margin profile. Okay, so I'm going to do a Mexico wire, so that'll be a little easier, and I'll do the retail side, and then I'll ask Marcelo to do the digital side. So on the retail side, essentially we have about a $10 fee. It's $10 almost everywhere up to a $1,000 cent. And then with that, we gain an exchange profit for an exchange. And that's typically, let's call that about 60 basis points. And we'll do a round number. It's a little less than we send, but on $400, that would mean a revenue stream of a $10 for the fee and about 60 basis points on $400 or about Or about two to $12 and 40 cents from that the agent retailer it's a blend most of them around 50% some get more let's call it about 525 a payer fee that's a little over $2 that will bring you down to a margin that will be a little over $5 for Mexico wire. And that's sort of the retail side of things for Mexico, which is our most profitable. Other countries that are dollarized, for instance, would be much different because you wouldn't have that FX component. And in those cases, the unit economics could be as low as $3 or less. Guatemala is a little more than those countries without an FX, but not nearly what Mexico. If I took you through that, you'd come to a bottom line of around $4 on a Guatemalan wire. And that would be the exchange of dollars to Quetzals. plus the fee, minus what we pay the agent, minus what we pay the payer, and then that's what we call gross margin. We don't include the banking fees in our gross margin because those are very – they differ, you know, depending on how the agent banks. So we don't include that. That's the next level down. But that's how we would get to our gross margin number. And I'll have Marcelo talk about the same thing with digital. Thank you, Paul. On the digital side, we have a gross revenue per transaction around $11. It's important to highlight that, different from what Bob said, we don't have to pay any fee to agents, which helps a lot with the cost of it. But on the cost side, the main one is related to the card processing cost. We have around $2.50 when we think about our average ticket. Then you have costs related to chargeback losses and payer's commission, all together around $3.20, which brings us to something between $6 and $6.50 per transaction. Understood. Thank you for that color. That's really helpful. I understand you're not giving 2024 guidance, but I'm wondering if you can say anything about what you're seeing so far. as for fourth quarter trends, maybe on transaction growth or active customer growth? Yeah, I mean, again, we're not – I think it's difficult to start commenting on parts of guidance, right? But I'll try to do the best I can here. We believe that the top-line growth in the industry to our core market – especially Mexico, will remain soft in fourth quarter. We might start to see some acceleration, but those are driven by a number of factors, which have been mainly driven by a stronger peso, low housing starts, and the fact that we've had a long bull market in Mexico. So we're lapping a long history of sort of high single-digit growth. So we expect that to be relatively flat in the overall industry growth. We expect that the digital business continues to grow at a high measure. And if you've got the digital business, and we'll use a round number of 30% of the business, I'm talking market-wide to Mexico, and that piece of the business has grown at 30%, and if the industry is flat, you get a 9% lift from the digital, it means that retail will be kind of negative still. And so we're expecting that challenging retail market, but it's not, I want to reemphasize, and I do it a lot, but... I don't think it's always clearly heard. This is not a simple factor of that digital has accelerated to a level that retail can never be positive again. If we were to plop in the growth that we had at the market overall two years ago, I think digital, the retail market would be growing slowly, but it would be growing. So it's a factor of slow top line growth with the migration to digital where the digital is a disproportionate share of that high growth. And so when you look at it, digital might be growing at 30%, which then leaves the retail market growing at maybe a minus 9% or minus 10%. We are beating each of those. We're doing much better than the retail market, but we're even doing much better as a differentiator related to the digital market. As you see, our numbers were in the 60s. We're probably doubling the rate of growth in the digital side of the marketplace. Got it. Very helpful. Appreciate that. And if I can just sneak in one more, um, this, your early thoughts on how a Trump administration could impact your business speed with, um, policies surrounding banking regulation and immigration. Thank you. I hope that he impacts our business the same way he did last time. Cause we had the best four year run we've had in the industry. Um, I think this is an economics issue. I think when our economy's strong, the challenge we've had to Mexico for the last few years is that we've had a very weak dollar. And so it became less attractive for someone to go through the trouble to come across the border, either in a documented or undocumented way, because when you send $500 home, you're getting far less pesos. Maybe, you know, you're getting maybe 24, and now all of a sudden you're getting as low as 16. So that was actually a disincentive to come across economic factors. And then the fact that about a third of our constituents work in the housing industry, which is picking up a bit now, but it's been really slow. Part of that is due to high interest rates, which is also tied to the fact that the peso, you know, it made a lot of ground against the dollar in terms of the dollar's weakness. So from our perspective, you know, we feel like that it hadn't had – I don't want to make this political at all, but it did not have a negative impact on our business last time around. It actually had a very positive impact. If we look at the time that I was here at Intermex, which started in 2009, and I guess 2009 would have been the end of the Bush administration through President Obama's through Trump's first administration, through Biden's first administration, the strongest period we had was during the four years of Trump administration in terms of growth. Appreciate all the color. Thank you. One moment for the next question. And our next question will be coming from the line of Mike. Dollar of Northland, your line is open. Hey, guys, thanks. First question, Bob, I just want to make sure I understand your or IMXI's response to the challenges on the retail side. Are you adding salespeople? Are you pushing more incentives? What's your response to that? Well, I don't know what you mean. The response to what? Well, the challenge is the retail. I mean, we can't change the market. I mean, the market's growing flat. And so we're still gaining share at retail. I mean, so we are trying to be more efficient and being more efficient related to targeting the right zip codes and also being more aggressive where we don't have wires and we have an opportunity to get them. We'll be much more aggressive on price. But I want to be clear, this isn't our frailty or our failings at retail. This is a marketplace condition where the Mexico business is about 12% slower growth than it had two years ago. And when we sort of model in the digital side in that growth, it means the retail growth today is negative. And so I don't think that's permanent, but I think – As the Mexico growth as an industry stays flat, the retail market will have more challenges. Now, I'm happy to address what we're doing to that. We focus in now on retailers where we have wires, but we don't have the bulk of the wires and we have a high margin. We have an opportunity to go in and lower our margin with a huge amount of upside in terms of transactions. And that's working really well for us. We also have some other strategies I don't want to give too much detail on because competitors will understand, but incentives for retailers to sign longer-term agreements, things like that that we're executing against. But I want to be clear that it's not us underperforming the market. We're still overperforming the market at retail. Yeah, no, hey, I get that. I just wanted to make sure you weren't just waiting for Mexico to come back either. How long you know me, Mike? What do you think? For many quarters, you talked about hiring sales. This call, you didn't spend a lot of time talking about your response. And I'm happy to address that. I mean, I think the reason there's only so much, you know, you guys don't want to hear me drone on too long, right? So we could talk longer about everything we're doing, but this was much more about this digital opportunity that we think is very ripe for us today. But we do have now a team of 50 direct salespeople at retail. We've really bolstered our retail sales management. You know, as we've introduced you to Chris Koala in the last call, brought in a new regional manager, regional VP in the southeast. And we have more people customer facing than we've had in ever. You know, we have 50 direct salespeople then rolling up to, in some cases, a middle manager onto the regional VP. So we've increased the level of people in places like California. I think we've had as few as six people on the ground in terms of sales. Now I think we have 11 people on the ground. In Texas, we've increased that group. And it's more important than people of the strategy we work. Because remember, we're rifle shot. Anybody can go out and discount across the board and discount on the the four million wires we already have. It's really more important in this strategic way to discount at the margin so these wires are a net add and we're not giving away discounts on wires that are already in the house. And I think we're executing against that quite well, although I don't think we've fully hit our stride. I think there's a lot more to do there, and I think we'll continue to work against it. Fair. That's helpful. And then, hey, pivoting to the digital side, What does that investment look like between now and the end of 25? Is that five to 10 million bucks or more? And then if you could talk a little bit about the CAC and the payback, like, hey, if you spend a million dollars, how many new customers does that get you? And what is the payback on that? Yeah. So, first of all, I mean, at this time, we're not going to disclose what we plan on spending in, you know, 25. We haven't even talked about 25's plan, but we will begin to invest immediately. The digital business is something that, you know, everything I think today, and, you know, just in case someone would just say, well, geez, Bob, you were kind of negative on digital. When we were negative on digital, the the gross margin on a digital transaction was about $1.50. Now it's over $6. So we've done a huge amount of work to make that profitable on a unit economics perspective. At that time, we also had an app that wasn't – was not one of the best apps in the industry. Today I think we have one of the best, if not the best app in the industry. And we've been able to be successful in working particularly with partners – to be able to bring down our tech. And I'll have Marcelo talk a little bit more about that. But we think that there's a great opportunity to build that business. It will take a bit of an investment, and that's partly why we made the announcement of looking at strategic alternatives, because there is a short-term period where you need to invest to build that business up. And Marcelo, would you like to comment more on that? All right. Thank you, Bob. I agree 100% with Bob. I think we have the best solution in the market today. We are set up to success when you think about unit economics. And once we are able to make the necessary investments, considering the current CAC that we are seeing, the current acquisition cost that we are seeing, the opportunity to grow exponentially is ahead of us. So we are very comfortable and confident about the future. Got it. And can you give us roughly what is that CAC today? Is that down to $40, $50, $60 per customer? I think we're closer to the number. We prefer to don't disclose it right now. But what you're saying is a reasonable number versus our reality. And I also think it's important to understand that the more that we can leverage, and again, we don't want it, that's also not something we disclose because, you know, these same Payers work with other folks, that the more we can leverage co-oping with partners, right, to do that, I think that helps us build that faster because there's a joint effort. I also think, which we haven't really talked about, we talked about uniformly in my remarks, the digital business or digital solutions, and we kind of did said plural, and a big part of our strategy is also wires as a service, right? with third-party partners. And we've got a couple now that are really successful and a lot more in the pipeline. And we believe that that's really a software solution that's working quite well for us, where the margins aren't quite as high as our own product, but we do so much less of the work. And there's really not any need to go out and actually spend money on a customer acquisition cost because someone's bringing us that who already has that relationship with a consumer. And what we're bringing then is the things we do really well, which is a license in 50 states, which is banking relationships, which is payer relationships and technology and compliance. So we have all of those factors that make it easier for us then to be the wires as a service solution for others that can bring those customers and actually lowers our customer acquisition costs dramatically. Got it. Hey, guys, thank you. Thank you, Mark. Thank you. As a reminder, if you would like to ask a question, please press star 11 on your telephone. One moment for the next question. And our next question will be coming from the line of Chris Zhang of UBS. Your line is open. Thanks for taking our questions. So I have two questions. The first one relates to your near-term investment needs. I think from the Q&A so far, I think you've touched on a number of areas. I appreciate digital is still an important area, but I just wanted to see if we could maybe discuss some of the other specific areas and if it could also rank order the areas of your near-term investment needs. in the fourth quarter and going into 2025, and also related if there's any change in your needs, priorities, or timelines during the strategic review process. I want to make sure I understand your question. You're talking about investments in the business separate and apart from our digital investment, or what's the question? Just make sure I understand. Just overall investment needs. Yeah, there really aren't. There really aren't. I mean, our sales team is fully staffed. It's about greater efficiency today. We certainly won't need to expand that. We really don't have necessarily investments. Our investment is all about the fact that we're ready now, and we think the market is ready with the unit economics that it brings, to be more assertive and more aggressive in a very efficient and effective way on the digital side of the house. Other pieces of the business don't really need, if anything, their investment there will somewhat come down over time. As we do a lower share of our wires at retail, our call center, which is a pretty big expense, even though it's offshore, will actually be reduced because some of the biggest sort of customer care we have is with certain components of our retail business. So there's going to be cost structure that's going to be reduced over time with the digital side of the house getting bigger as a bigger percentage of our business. So the really only core investment that we're making, and it really – I mean, obviously, we can continue to always evolve our app and have more products available. That's the big opportunity. But the 4 million customers we have today is to be able to sell more things to them, right, not just the digital remittances, but more things to them. So there's going to be opportunities to continue to evolve our app. But as far as the utilitarian nature of it today, it's among the best. So we don't need a lot more investment into the app. What we just need to spend money on now is customer acquisition, which is putting ourselves out there related to various ways to promote our business. We think we've got different ideas than what has standardly been done, which has delivered in some cases, you know, very, very high expenses for many years for many of the elite players in the digital side. But we still do need to invest in that customer acquisition and bringing customers to the digital site. All right, thanks a lot for the call, Bob. My follow-up question is around retention and loyalty terms. I appreciate there can be some near-term benefits, but I guess just from what you're saying, is there an impact on your retention, or is there any customer response to that you've been observing in early days? You're breaking up a lot, so I'm going to try to think I'm hearing what you're saying. I'm sorry. Can you hear me better? Basically, I was talking about the impact on customer retention or any customer response to that. So the loyalty term, what do you mean? I'm sorry. Okay. Basically, the expiration of the loyalty point changing from 180 days to 90 days. Yeah, I mean, we took a look at that, and we did it with a lot of analysis, and we found that the loyalty program wasn't necessarily working to its optimal in the way it was put, and we restructured that. We don't expect any impact from that. We had a very low redemption rate on the loyalty points. We think it was more of a fact of the speed of which we were able to handle a wire because you're a loyalty customer, and that remains intact. So we don't expect any impact from that at all. Great. Thanks for the color. Appreciate it. Thank you. One moment for the next question. And our next question will be coming from the line of David Schwab of Citizens. Please go ahead. Hi, good morning. This is Zach. I'm for David. Quick question first on the 10% share for digital. Just wanted to first check if that's on the send side or what the send ratio is for digital. And then just on a broader sense, any kind of guidance or insight into trends in the Mexican market, particularly with volatility in the currency. Thank you for that. Yeah. So the first piece is, is that I talked about that it's under 10% and that is the send side of the house. If we were to consider the payout side, it would be much higher, more in the 30% range or more. Many of the wires for years have been migrating to bank deposits, and that would be considered digital on that side of the house. So we're talking about the send side, and it's not quite 10, but it's getting closer to 10 as we go forward with the digital capture side. On the Mexico side of the house, I think as the peso weakens, which is likely to happen, but we saw a little weakening of it for a day or two there, but you will see stronger wire service. There's more of an incentive for people to come to the U.S. and work when the money being sent home is worth more money, worth more pesos. You know, hard to say how quickly that will have an impact or whether when that will happen. We saw a little bit of it right after the election. We'll see if that continues. But I think there's some fundamental other pieces of the marketplace today, not just the weakening peso that helps us, a weaker peso helps our business typically. but also the fact that as interest rates might come down, then that might have a greater effect on housing starts, which are a little better than they were, but still far off where they were a couple of years ago. And remember, a lot of our consumers, the people that send money, work in the housing industry, and they're probably some of the highest paid of our consumers, much higher than agriculture and service. Got it. Thank you. Thank you. This does conclude the Q&A session for today, and I would like to turn the call back over to Bob for closing remarks. Please go ahead. Yeah, we thank you all for your time and attention, and we look forward to talking to you all soon. Thanks again. This does conclude today's conference call. You may all disconnect.