Good day and welcome to the International Money Express Inc third quarter 2023 earnings and conference call. All participants will be in list aligning mode. Should you need assistance, please signal a conference specialist by pressing the start followed by zero. After today's presentation, there will be an opportunity to ask questions. To ask a question, you may press star and one on your telephone keypad. To withdraw your question, please press star and two. Please note this event is being recorded. I would now like to turn the conference over to Mike Gallantine, Head of Investor Relations. Please go ahead. Good morning, and welcome to our quarterly earnings call. I want to remind everyone that today's call includes forward-looking statements, including our fourth quarter 2023 guidance, and actual results may differ materially from expectations. For additional information on International Money Express, which we refer to as Intermex or the company, Please see our SEC filings, including the risk factors described therein. All forward-looking statements on this call are based on assumptions and beliefs as of today. You should not rely on our forward-looking statements as predictions of future events. Please refer to slide two of our earnings presentation for a description of certain forward-looking statements. The company undertakes no obligation to update such information except as required by applicable law. On this conference call, we discussed certain non-GAAP financial measures. Information required by Regulation G under the Securities and Exchange Act for such non-GAAP financial measures is included in the presentation slides, our earnings press release, and our annual report on Form 10-K. including reconciliation of certain non-GAAP financial measures to the appropriate GAAP measures. These can be obtained in the Investors section of our website at intermexonline.com. Presenting on today's call is our Chairman, Chief Executive Officer and President, Bob Lissy, and Chief Financial Officer, Andres Bendi. Also on the call today are Chris Hunt, Chief Operating Officer, Joseph Aguilar, President, Latin America, Randy Nelson, EVP of Retail Sales, and Marcelo Theodoro, Chief Digital Officer. Let me now turn the call over to Bob. Good morning, and welcome to our third quarter earnings call. We thank you all for your interest in Intermex. We have achieved another productive quarter, building on our history of profitable growth. We continue to grow revenues in EBITDA while generating free cash. Although EPS metrics were skewed by non-recurring items this year and last, these metrics did meet expectations. We have accomplished this all and continue to invest significantly in the future through our revenue streams such as digital service and our European iTransfer division. Looking at the consolidated company results on slide three, revenue increased 22.5% to $172.4 million. Fully diluted earnings per share decreased 4.7% to $0.41 per share on net income of $14.8 million. Adjusted EPS decreased by 5.6% to $0.51 per share on adjusted net income of $18.4 million. Our adjusted EBITDA grew 14% to $31.7 million. Andrew Spendi, our CFO, will expand on these metrics in greater detail during his prepared remarks. I will focus my remarks today on primarily growth drivers impacting our business this quarter and what we anticipate in quarters to come. I will talk about our existing agent retail business, our actions to accelerate growth, the improved efficiencies we are already seeing in the national business. I will also discuss our growing momentum with our digital business and our European acquisition iTransfer. The bedrock of all our offerings lies in the distinctive foundation anchored in our value-added omnichannel strategy that attracts a growing customer base. The trust we have garnered from our customers has positioned Intermex as their preferred choice for money transfers. Our customer-centric omnichannel business model thrives on a cutting-edge technology and our operational infrastructure that is difficult to replicate. Powered by state-of-the-art proprietary technology, we deliver value-added services to our retailers and customers through our highly productive network of retail agents. One of the primary ways we provide value-added service to our agents is through our extensive banking relationships. Recognizing that many of our agents are small, locally-owned businesses and that they are dealing in substantial cash transactions, many financial institutions prefer not to bank these businesses. We have leveraged our relationships with 12 regional and national banks to help these small businesses establish depository access with our banking partners, easing the process for the retailer. In addition, our ability to process checks through our Check Direct product provides another level of convenience to the retailer. Our recent addition of Fifth Third Bank as a key banking partner further fortifies our commitment to supporting our agents in this regard. Our agent retail business forms the crux of our present operation, contributes significantly to our revenues, profitability, and net free cash generated. This channel is a critical asset fueling our current and future growth. The retail network's relatively low cost and efficiency enables Intermex to invest and grow our digital transactions and other new revenue streams while the overall company remains very profitable. As a result, no burn of investor funds will be needed to supplement the cost of building our digital business. The efficiency of our retail model burns less than 7% of total gross profit on sales and marketing efforts for customer acquisition. This omni-channel approach enables Intermex to participate in high-margin retail transactions while utilizing that model and a portion of its profits to perfect and grow our digital business. All this occurs while Intermex remains highly profitable and produces significant free cash. Last quarter, we commented on Mexico's market's growth slowing, partly due to the dollar to peso exchange rate. This stagnant growth produced a ripple effect through the retail market, and as a result, our growth slowed. We have modified our approach to certain market components, and the early results have been quite encouraging. we have taken a rifle-shot approach to specific targeted opportunities for growth with alternative pricing. We have accomplished this while retaining margins in our highly profitable base. The early results have been encouraging. After the second quarter, we guided to 5% transaction growth in our core business for the rest of the year. In Q3, we delivered approximately 6%, and we're trending higher as the quarter ended. The early indications suggest that transactions in our core business will grow eight percent in fourth quarter. Not only are we capturing wires faster than projected, we are doing better relative to margin. Where our wires grew at six percent in Q3, our margins grew at seven percent. This is driven by a more efficient pricing model. We expect this strategy will continue to create a lift to our year-over-year growth going forward. We are proud of our progress, but recognize we have many more opportunities to access. This is all consistent with Intermex's surgical approach while focusing on specific agents, geographies to maximize profitability while navigating more efficiently and profitably to deliver growth. Our ability to price efficiently down to the zip code level results in our core business delivering approximately 20% EBITDA margins. On slide four, you can see our growth and share over time in the top five countries in Latin America and the Caribbean. which account for approximately 82 percent of the money transferred from the U.S. to that region. In third quarter 2023, our estimated market share in these key receiving countries increased to 21.8 percent, compared to 20.6 percent in third quarter of 2022. Shifting our focus to La Nationale, we have made significant strides in integrating and rightsizing its U.S.-based operations. The restructuring actions to date will yield an expected annualized savings of approximately $1.5 million starting this past quarter. We originally thought that opportunity related to LaNationale was only about right-sizing the retail network and maximizing operational efficiencies. We have made significant strides to that end. However, after more than a year with the business, we see a clear opportunity to grow the top line as well when we apply the Intermex playbook. During his remarks, Anders will discuss third-quarter restructuring charges and financial profile. The national is proving to be a valuable asset for Intermex and will likely contribute significantly over time. We are even more optimistic about the iTransfer acquisition in Europe. That division continues to exceed our expectations, both in terms of performance and its potential. We plan to expand the iTransfer footprint in our existing markets where we have a base from which to grow. These countries include Spain, Italy, and Germany, and the markets with significant potential where we are licensed but not yet present, such as France. Additionally, we believe the UK will be a substantial market opportunity, although it requires a separate license since it is not part of the EU. The European market holds significant potential for growth, and we are investing thoughtfully and efficiently to capture profitable market share. We also believe the European market has greater potential for online digital wires due to the larger percentage of senders owning bank accounts. In third quarter, the iTransfer business grew at 15%. We feel that is merely a starting point and expect much higher growth over time. Transitioning to digital, we are growing the digital revenue at about 65%, but more importantly, this is happening at a greatly improved margin. We have carefully and efficiently upgraded our digital product offering. We have assembled a world-class digital team and made significant strides to improve the unit economics as well as our digital app. All of this has come together at a perfect time. Our recently signed agreement with Viso will enable us to expand our digital service to 20 additional countries worldwide, including Jamaica, India, the Philippines, and Vietnam, and with further expansions slated for 2024. We have created significant momentum with our digital business, and again, best of all, we are doing all this profitably from both a unit economics and a bottom line perspective. We will share more on our investor day in 2024, but we would like to say that we're more bullish than ever relative to our digital opportunity. Finally, a few words on our payroll and GPR cards. These products are strategically positioned in large and attractive markets. The co-branded cards prominently feature MasterCard and Intermex brand and will align perfectly with our extensive high-traffic retail distribution network. In addition, both our payroll and GPR cards are a great bridge to our digital product. They will create an opportunity to bank previously unbanked consumers. Versus last year, we have seen digital remittance transactions that were settled from the Intermex payroll card grow five-fold in third quarter. We believe this is a testament to the power of the Intermex brand once the customer is banked, especially once the customer is banked with Intermex. In summary, I believe it has been a special quarter of accomplishment for Intermex. Our targeted plan at retail is beginning to work, and we're seeing a reversal of what has been some slowing in our year-over-year trends. Additionally, we have positioned ourselves in the Le National and iTransfer business to become more efficient while growing and driving increased DVDA. As always, we accomplished all this profitably, enabling the company to invest in our digital solution and other growth opportunities. We are well-positioned and poised to grow our digital business and grow it profitably. Our recent agreement with Visa and MasterCard will broaden our receiving country service list and reduce our cost structure. This is all very exciting. We believe our omni-channel strategy is the best and most complete way to go to market. This approach continues to enable Intermex to capture millions of high-margin retail transactions that drive profitability, enabling us to invest in and grow our digital side of the business while remaining highly profitable. I will now turn the call over to Andres, who will discuss our financials. Thank you. We had another quarter of double-digit EBITDA growth and finished ahead of our projections for the core, successfully executing on an important pivot for the business. On slide five, unique active customers increased by 35.1% during the third quarter to 4 million. These customers generated 15.4 million remittance transactions, 25.7% more than a year ago. While guiding at 5% transaction growth in the core after Q2, our successful execution allowed us to achieve 6% in Q3, and early indications are that we can deliver 8% in Q4. On slide six, we achieved a 63% increase in digitally originated transactions, and as before, we achieved this through brand recognition and with minimal marketing spend. Strong customer acceptance of our mobile app continues, and I'm pleased to say that the work we've done on enhancing the profitability of digital puts us in a great position to grow this business faster and more profitably than ever before. From a send or receive perspective, 33% of our transactions are either sent or received cashless at either end, up five percentage points from a year ago. On slide seven, the total principal transfer grew 19.8% to $6.6 billion, driven by our core business and the addition of La Nacional's U.S. and international business I transfer. The average remittance within the U.S. core Intermex business was consistent with the prior year. It was $454, up slightly from one year ago. In the consolidated business, the average send amount was down 4.7% for the quarter year-over-year at $429 per transaction. As mentioned before, this is due to structurally lower average transaction amounts at La Nacional and iTransfer. La Nacional averaged $298 per transaction and iTransfer $295 for the third quarter. On slide 8, total revenues company-wide increased 22.5% year-over-year, reaching $172.4 million during the three months. Excluding acquisitions, revenue growth in our core business was 5.8%, fueled by organic customer additions through new and existing agents and our successful pivot to capture incremental wires at lower margins than in the past. Again, we've seen an inflection point in our growth rate and are now anticipating transaction growth in our court around 8% in the fourth quarter. Net income was impacted by a few key areas. Q3 last year benefited from a $2.9 million tax benefit that did not recur in 2023. The year-over-year comparison was also challenged with $1.1 million this quarter in restructuring costs for the Absolutely the right investment as those actions are expected to improve the cost trajectory of that business immediately and resulting in about 1.5 million savings annually. Higher interest rates on our credit facility, depreciation, amortizations of intangibles, and a higher effective tax rate all kept GAAP net income growth in check. Net income was down 10.8% at 14.8 million, though GAAP EPS was better, down 4.7% to 41 cents per share aided by our share buybacks. We anticipate EPS to return to a growth trajectory in Q4. Looking at slide 9, adjusted EBITDA increased 14% to $31.7 million. As anticipated, even with our tactical pivot to capture incremental transactions, margins in the core business held up great at around 20%. Aggregate EBITDA margin was down as in the previous quarters, and this was heavily driven by structural lower margins within the La Nacional acquisition. Adjusted net income was down 11.1% during the third quarter to $18.4 million, also impacted in Q3 last year by the $2.9 million tax benefit that did not recur in 2023. Adjusted net income was impacted by the same underlying drivers as gap net income, but excludes items like share-based compensation, transaction and restructuring related expenses, amortization of intangibles, and the tax impacts related to those items. From an adjusted EPS perspective, we were down 5.6% to 51 cents per share. And as with GAAP EPS, we anticipate adjusted EPS to return to a growth trajectory in the fourth quarter. Turning to the balance sheet on slide 10, Intermex continues to be an efficient operator and cash generator. Net free cash generated, our internal measure, which excludes working capital cyclicality, was impacted by the same drivers of net income growth as mentioned earlier. That, coupled with increased capital spend to upgrade our agent technology, caused the metric to decrease by 4.6% to $17.6 million for the third quarter. Net income is the basis for this measure, and as we mentioned with the net income earlier, we expect this measure to revert to growth once again in Q4. During the quarter, we continue to be active in the market, purchasing 502,000 shares for $10 million at an average price of $19.90 per share through the Board-authorized repurchase program. We continue to see our buyback program as an excellent use of capital and anticipate remaining active. Finally, on slide 11, based on the improving metrics we're seeing in our operations, we're providing the following fourth quarter guidance. Revenues of 170 to 181 million, up 10 to 17%. Gap diluted EPS of 43 to 46 cents, up 22 to 30%. Adjusted diluted EPS of 51 to 54 cents, up 6 to 12%. And adjusted EBITDA of 31.4 to 33.4 million, up 8 to 15%. In summary, we're pleased with the quarter and the growth we've delivered. Our retail execution pivot is paying dividends and we expect more of that in the fourth quarter. This growth will continue to fund the exciting future ahead of us in digital, Europe, and other products. With that, I'll turn it over to the operator for questions. We'll now begin a question and answer session. To ask a question, you may press star then 1 on your telephone keypad. If you're using a speakerphone, please pick up your handset before pressing the keys. At any time your question has been addressed and you would like to withdraw your question, please press star then 2. The first question comes from David Shaw with JMP. Please go ahead. Great. Good morning, everybody. Thanks for taking my questions. Hey, first off, Bob, I was kind of curious, you know, I'm just looking at the first paragraph of your press release, and it has the comment, we are ahead of schedule in our plans to capture incremental retail transactions in the U.S., and I just want to make sure I'm not overthinking that. Is that sort of a very focused comment related to the core transaction growth that you expect in Q4, or is that a broader comment about, you know, just what you're seeing on the ground in terms of agent sign-ups, you know, salesperson? It's a direct comment on what we produced in third quarter and what we expect to produce in fourth. If you recall on our guidance in terms of transaction growth, when we finished the second quarter, Earnings, we projected 5% growth, and we delivered six in the quarter, and it was increasing as the quarter ended. We expect higher growth, as I said in the prepared remarks, in fourth quarter. Additionally, that's not really put a ding in our overall margins. So in third quarter, where we grew transactions 6%, we actually grew our gross margins 7%. and that was due to a more effective way to price. So we really set aside our core business and kept that stable, and at the margins where we get incremental wires is where we're aggressive, and that has been working really, really well, and we think we're well ahead of where we expected to be, both in terms of picking up more wires than we expected, or at least told the market that we would bring in, but also in the sense that the margins have held up and actually have produced a higher margin than transaction growth. Got it, got it. That's helpful. Hey, follow-up. You know, I know last quarter the topic of increased pricing pressure to a lot of markets to Latin America was sort of top of mind, and you noted a little more maybe resiliency in some of the private discounters this time around. Can you provide just a sort of broad update whether anything has changed or if kind of the existing pricing environment, particularly... Yeah, I mean, I think that the big news for us is that we've adjusted to that well related to our plan and the way we're going at the incremental growth. So regardless of whether that pricing pressure is there, we're doing a really good job holding our base and keeping that at the high margins where it's been, and then going out aggressively at incremental wires. But those incremental wires are still wires that are coming in very profitable, just not at the same margins as the original wires would come in. But the adjusting that we've done, becoming more efficient in our base business, has, again, delivered a greater gross margin growth than transaction growth. Now, I'm not trying to evade the question. I think there's always price discounters out there. I think it's the method which people think they grow the business. And I think that it kind of comes and goes. And I think as long as we're executing our plan the way we're executing today, we can work right through that. I think we're now well positioned with the way we're approaching the market relative to pricing and attacking incremental wires to meet any challenges that pricing might might bring to us. Got it. Just last question. I'd kind of be remiss if I didn't ask sort of the general commentary on what you're seeing or expecting from your consumers. I imagine with a flattish average send in your core business that inflation isn't impacting you know, remittance demand too much, but if there's any color you might want to provide. Yeah, I think one of the big factors is the peso is strengthened, right? So you don't need to send as many dollars to get as many pesos on the other side of the border. So that's going to be... A big counterbalance to any inflation, really, because we're thinking of inflation here, but yet you're now getting, you know, the peso is much stronger than it was previously, and that's going to cause people to be able to send less to get the same amount of pesos on the other side of the border. So we're seeing it kind of flat right now, but it could go up if the peso started to weaken, for instance. Got it, got it. Perfect. Great. Thank you very much. You're welcome. The next question is from Mike Grundle with Northland Securities. Please go ahead. Hey, thanks, guys, and congratulations on the progress. Bob, you kind of talked on the last call about it like a targeted plan. I think one was these pricing offers to agents where you lost volume. Two, you were targeting new agents. three, some pricing actions, and four sort of new markets. Could you kind of rank where you've been the most successful and where you think you still have a little bit of wood to chap on those four items? Yeah, I think the place that we've been the most successful is going after a opportunities where we've lost wires in the past because of discounting, and being able to go after those wires aggressively, still profitably, while protecting the base. So again, not going in if a And I'll get a little bit into the weeds here with you because it's, I think, the only way to really answer this. If an agent used to do 2,000 wires with us and now does 500, we're really going to discount and give them a better pricing on wires 501 and up. So we're protecting that base. We're not decreasing the margin at that retailer on the core that they already have. And certainly not in agent retailers where we haven't lost anything at all. The easiest thing to do and the mistake that the market makes is, and we're happy most of our competitors do this, is they take a sort of a sickle to a surgical event, right, and they just go in and they lower their margin across the country. But we have a huge core of business that's performing quite well at the margins that we already have. And so that's been the best piece of that, and we have a lot more to do. That project is probably responsible for about a 1.5% lift on our trend line over the last few months, and we believe that we can continue that project producing that 50 basis points or so of lift month over month for a number of months still, not into perpetuity, but clearly to bring our our transaction growth numbers up quite a bit. New agents, I think, is the total of new agents that we're bringing in is not as big as it's been in the past, but we've never really been focused on the number of agents as much as we are the performance and the total amount of wires, and the new agents have been performing quite well, and so that's been helpful. I think, what was the other things you asked? I'm sorry, I want to make sure I touch on all the points. Yeah, I think three was you were looking at some pricing and maybe selectively able to increase it in certain markets, and the last one was just any new markets that you've added or targeted. Yeah, I mean, the pricing, the macro pricing, we've thought better about, so we're not doing macro pricing and getting more aggressive, let's say, in a whole state like Arizona. Everything we're doing is rifle shots because that is really the key to us maintaining those margins and actually – extending our margins bigger than the growth of transactions. So I would say we haven't done much of the macro with any at all. And then new geographies, you know, there's some states for us that are growing quite well, I won't name them, that are not necessarily new because we've been in every state, but they are underdeveloped states that we've made some turns in that have been helpful, mostly in the western states. California is now growing and the trend is turned around significantly. And there's a few other states out west that are performing quite well. And I'd be remiss if I didn't say that we're getting a significant lift in our overall number from our digital business. And I want to make sure that everybody's clear that we believe our omni-channel approach is the absolute right way. I mean, there's no blood in the street with our approach. We continue to throw off an extreme amount of cash. We're highly profitable. And we're growing our digital business quite well. The recent views on our app is that it's working quite well and it's amongst the best. And we're now making on an individual basis. unit economics basis money on wires on digital. Yes, still that acquisition of the customer is expensive, but we have this wonderful model at retail where we spend only about 7%, 7%. of our gross margin to acquire a customer for our total sales and marketing costs compared to some of the moves that are out there if you're strictly digital and how expensive that is. We really believe this model will prevail over time, and the way to grow this business is to have that solid omni-channel approach with the beachhead of retail and to grow digital from that perspective, and it's working perfectly for us. Great, great. And then just secondly... Any update on number of salespeople from, say, maybe July 1st to today to kind of what you're thinking about for next year? Yeah, I mean, we have re-looked at that. We have about three more salespeople than we had last time we spoke in the field. but we have put six folks in Guatemala, and we're going to put another six people in Guatemala that are basically part of our telemarketing program. And we have a much more extended reach because we can call a lot more people, as you can imagine, than we can visit in person. So those six people that we've added are bringing us literally thousands of more customer contacts, meaning retailers, on a monthly basis, and we're going to double that. We think that's the best way right now to extend our reach to more retailers on a daily basis, although we have grown our number of people actually on the ground at retail by three from second quarter. Great. Hey, thanks a lot, Bob and team. You're welcome. The next question is from Sam Silvas from Nadam and Company. Please go ahead. Great. Thanks guys. Thanks for taking the questions here this morning and good to see the results. Just wanted to ask on competition, are you guys seeing any changes in the competitive dynamics whether it's on the retail or digital business? And could you just talk about that a little bit and how that's maybe evolved since last quarter? I don't believe there's any real evolution. I think people that have been discounters continue to be discounters. I think it's been our approach to it that's really changed. I think we've gotten this plan that we put in place that has been very intricate and that we're working every day. related to preserving the base. It's almost like redundant to keep saying, but preserving that base, which is a really solid base of wires at a really high margin, and then going out aggressively where we've seen competitive infringement people coming after our wires. And it's working really well. So I don't think there's a big change. I think, you know, discounters have always been there. They're always going to be there. And over the years, we've held up really, really well consistently with our pricing. And, you know, now... I think we're doing that even better than we have before because of how thinly we're slicing it and the ability to really reverse the trend a bit. Not anywhere near where we're necessarily happy with, but reversing the trend, bringing a higher growth than we had projected for third quarter transactionally, but doing that at a higher margin. So to me that kind of, it says if we can apply ourselves properly on a zip code by zip code level with a rifle shot approach, we can combat against the discounting at retail quite well. On the digital side, I'll let Marcelo, would you like to comment on the pricing in digital, you say? Of course. Our pricing has increased significantly, combining a better pricing strategy with a more efficient cost management. So, per Bob's comment, I'm very confident we are for sure on the top of the profitability versus digital players, which give us the foundation to grow and to have a better return on investment. Got it. That's super helpful color. Appreciate that. And then just a quick follow-up, you know, obviously you guys aren't providing any guidance for 24, but I guess, is there any, you know, any kind of color you guys could provide, whether it's around, you know, transaction expectations relative to the fourth quarter, the third quarter, you know, any kind of preliminary thoughts kind of as we head into 24? Yeah, I think this is Andrew. I think not at this time. I think that we did mention that we will be doing an investor day that will be coming together in February where we'll go through the year-end results and also give a broader picture of our strategy and the financials that will come behind that. So not at this point. Yes. Okay. Yeah, fair enough. All right. Thanks, guys. Thank you. As a reminder, if you wish to register for questions, please press 1. The last question comes from the line of Alex Markrath with KeyBank Capital Markets. Please go ahead. Thank you, and thanks for taking my question this morning. Just, you know, there's been a lot of commentary on pricing and some of the observations this quarter. I'm just curious to kind of boil it down, and maybe I'm oversimplifying it, but, you know, if I look at one of the model outputs being revenue per transaction fairly stable sequentially, I'm just curious if you all kind of think about this as the right level for the model, just for modeling purposes for the near term, considering some of the industry-level factors around pricing, the success you've had more recently, and then just general mix of the business considering Binance Now and iTransfer. Any thoughts on that would be helpful. Yeah, I think we believe that we've made headway into being, as we've been able to on one side be aggressive to go after incremental wires, that it may have been lost to the competition previously and We've been really good at making sure that we're maximizing our margins related to our base business in our stronghold areas. So I think where we are today is probably a really good view of where the revenue per transaction and margins would sit going forward. Obviously, that's not guaranteed because we're not guiding on that, but I would tell you that we think that we have a good perspective and a good strategy today that should carry us through the near term. Thank you. That's very helpful. And then just one on the product side, thank you for the payroll and GPR comments. But I think last quarter you had mentioned a payroll card upgrade launch later this year. Just any sort of updates or thoughts or kind of details as to what that entails would be helpful. Yeah, the evolution of our payroll is happening. We are about to launch in two weeks a completely redesigned program that connects even more the card program with the wire sending product. I think Andrew has mentioned in his notes that we are growing this cross-sell five times, which is exactly what we are looking for because then it makes an extremely profitable wire and still we make money out of the cards business. So that's the direction we are going. One, we are launching the DPI card, another huge cross-sell opportunity for retail. We know that our consumers are unbanked or underserved. So this will bring them to a very expanded reality regarding purchases in the U.S. They can go to e-commerce. They can go to subscription business, a bunch of services that they don't have access to today, and we believe they are heavy users due to their situation in the U.S. Great. Thank you. This concludes our question and answer session. I would like to turn the conference back over to Mike Gallantine, Head of Investor Relations, for any closing remarks. Yeah, actually, this is Bob Lissy. Thank you all for tuning in and your interest in the company. We'll look forward to talking to you all soon. Thanks again. Have a great day. The conference is now concluded. Thank you for attending today's presentation. You may now disconnect.