[
    {
        "date": "2024-02-27T09:00:00-05:00"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good day and welcome to the International Money Express conference call. All participants will be in a listen-only mode. Should you need assistance, please signal a conference specialist by pressing the star key followed by zero. After today's presentation, there will be an opportunity to ask questions. To ask a question, you may press the star then one on your telephone keypad. To withdraw your question, please press the star then two. Please note this event is being recorded. I would now like to turn the conference over to Alex Sadowski, Investor Relations Coordinator. Please go ahead, sir."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning, and welcome to our quarterly earnings call. I would like to remind everyone that today's call includes forward-looking statements, including our 2024 guidance, and actual results may differ materially from expectations. For additional information on International Money Express, which we refer to as Intermex or the company, please see our SEC filings, including the risk factors described therein. All forward-looking statements on this call are based on assumptions and beliefs as of today. You should not rely on our forward-looking statements as predictions of future events. Please refer to slide two of our presentation for a description of certain forward-looking statements. The company undertakes no obligation to update such information except as required by applicable law. On this conference call, we discussed certain non-GAAP financial measures. Information required by Regulation G under the Securities and Exchange Act for such non-GAAP financial measures is included in the presentation slides our earnings press release, and our annual report on Form 10-K, including reconciliation of certain non-GAAP financial measures to the appropriate GAAP measures. These can be obtained in the investor section of our website at intermexonline.com. Presenting on today's call is our Chairman, Chief Executive Officer, and President, Bob Lissy, and Chief Financial Officer, Andrus Bendy. Also on the call today, are Chris Hunt, Chief Operating Officer, Joseph Aguilar, President, Latin America, Randy Nelson, EVP of Retail Sales, Marcelo Theodoro, Chief Digital Officer, Beth Erickson, Chief Human Resources Officer, Andrew Kube, EVP, Finance and Business Intelligence, and Karim Baroni, Director of Financial Analysis. Let me now turn the call over to Bob. Good morning."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Intermex is proud to announce fourth quarter earnings that are a testament to who we are as a company. On page three, you can see that in the quarter we delivered revenue of just under $172 million, up 11.2% year over year, and diluted GAAP EPS of 49 cents, up 40% year over year. Furthermore, adjusted ETA was up 14.5% to $33.3 million, and adjusted diluted EPS up 21.7% to $0.56. We continue to deliver solid earnings and cash generation for our shareholders in every environment, and our fourth quarter results fully demonstrate that. We believe our omni-channel strategy is the most efficient way to serve the varying needs of the consumer in this market. Intermex continues to offer our best-in-class service and loyalty offerings through both our retail and our digital products. This is an advantage that no other provider can claim. Our retail network required years of careful precision effort to build, and as a result, is very difficult to replicate. Our technological advantage makes transacting fast and convenient for both digital and retail consumers. These critical factors have made our model highly profitable and drives exceptional generation of cash. How we deliver our products and services to the market is even more important. At retail, Intermex has taken and will continue to take a highly refined rifle shot approach while building our network of retail agents. This strategy enabled the company to deliver products and services to consumers through the highest performing retail agent network in the industry. All this occurs while maximizing agent retail performance that drives ROI and profitability. We are most interested in connecting with consumers in markets where our value-added approach resonates the strongest. This is when and where Intermex is able to best differentiate our value-added service, where we can in turn tax your margin, and where we ultimately benefit our shareholders. Our retail model requires a modest investment. Our sales and marketing costs are roughly 8% of gross margin and only 3% of total revenues. In our digital offering, we continue to demonstrate that same focus on efficiency and profitability while growing our transactions 43% this quarter, and doing that by way of a highly efficient customer acquisition spend. As a result, we're delivering a highly attractive margin. Finally, we continue to develop and introduce new features and functionality to deliver a user experience that is among the best in class. We continue to upgrade our application, and it has received a rating of 4.8 out of 5 from our users. Our expanding margins related to our digital product place us in a great position to expand to new markets, including India, the Philippines, and others, through our new partnership with Visa. In the broader market, significant amounts of capital have been spent by some providers to grow digital market share. In many cases, spending may not have achieved an ROI that would support that investment. Our strategy is to carefully cultivate and grow our digital business with the same efficiency that we have demonstrated while building our retail network. That is one key reason why our current digital business is profitable and growing. We're taking the approach that no one else in the industry has taken by offering a value-added product and carefully crafted strategy to capture share in the right markets. As we do with our retail business, we will leverage our best-in-class customer service and our metrical orientation to drive profitable fire growth. This translates into consistent product expansion, strong margins, exceptional cash generation, and a fortress of balance sheet. As we talked about previously, the LaNationale acquisition we closed in Q4 of 2023 brings Intermex meaningful presence in the U.S. to Dominican Republic market. With that acquisition on board for over 12 months, you will see on page five we have recast our market share calculation over time to include the DR. In 2023, we captured a 21.4% share in the top five markets to Latin America. We have successfully grown our market share over time while sustaining attractive margins year after year. Our Q4 of the DA margins excluding acquisitions were well north of 20%. some of the best we have seen in the history of the company. We have been able to attain these outside results through the execution of our metrically-driven strategy. We have a highly efficient base of retail agents who rely on our products and services. We offer and deliver these products to the customer base who appreciates Intermex's value-added approach. We continue to strengthen our relationship with our retail agents while deepening our competitive moat and growing our mutually beneficial high-margin business. Additionally, we have the ability to carefully select where and when to aggressively pursue wires at reduced gross margins. This practice is put in place when meaningful incremental transactions can be captured in areas where Intermex has a low market share and the upside potential is quite large. This approach enables us to capture new business in such a way that we do not affect margins at our current high-profit retailers. As a result, we're able to generate incremental earnings for our shareholders. We refrain from reacting to market pressures with a broad brush approach that degrades margins for the company. Our approach is simple, but not easy. It requires focus and discipline execution. These behaviors are in our corporate DNA, but are very difficult to replicate. In our quest for new business and to catalyze incremental growth, we have launched bold strategies to penetrate previously untapped and underdeveloped markets. Our focus sharpens on locales ripe with untapped wire potential detailed to the zip code where our presence has been minimal. As a part of our aggressive approach to drive revenue in high potential areas, we've decided to expand our outside sales force by adding six new positions to our already robust team of 40. This expansion is a fresh strategy designed to intensify our market penetration and coverage. Moreover, we've taken a decisive step by significantly enlarging our inside sales team, a move that marks a departure from traditional methods by tripling the team size from 12 to 36 members and strategically positioning these roles offshore. We're not only enhancing our capacity to engage with our current agents, but also tripling our daily interactions in cost-effective manner. This strategic enhancement is expected to dramatically boost our same-store sales. representing an almost 60% surge in our total Salesforce capacity. This considerable investment in our sales infrastructure is an approach we are confident will yield substantial returns over the next 12 to 18 months, signifying our aggressive pursuit of growth through innovative staffing strategies. From an inorganic perspective, we're also making great progress. The iTransfer business in Europe grew at 17% in Q4, We continue to expect great things from our European division, including strong digital opportunity to access in the coming months. While the national business in the U.S. is much more profitable and efficient than a year ago, we believe significant opportunities to remain to expand to additional corridors through our current agent base. To Mexico alone, now armed with the Intermex payer network and fee structure, we see potential for millions of dollars of increased margin annually. We have begun to execute against this plan. Additionally, there will be more efficiencies to be leveraged as the year unfolds. These businesses are proving to be great additions to Intermex, and we're excited and optimistic about their combined future. Before I turn the call over to Andres to go deeper into the numbers, a few final thoughts on operating discipline and why we say Q4 was a testament to who we are as a company. While almost all key measures were strong and exceeded market expectations, we faced some revenue headwinds. In spite of that, we persevered and delivered a solid quarter of growth. We talked about our plan to capture incremental wires in Q3. I am pleased to report that our efforts are continuing to be productive and the sales team continues to execute on that plan. At the same time, shortly after Q3 earnings, we saw Mexico market growth slow considerably to levels we have not seen in years. In true Intermex fashion, we put a critical eye on our business and challenged every corner of the company to maximize efficiency. We delivered on what we set out to do and generated strong earnings despite a weaker than expected top line. While it is difficult to predict what our key markets will do in 2024, the guidance Andres will take you through later in the presentation anticipates underlying softness in that market for a period of time. Our guidance also anticipates a tenacious focus on efficiency and execution, that is part of our culture, and why we feel better positioned than anybody else in the market. We are confident in our differentiators, and the management team and the board feel there is tremendous value in Intermex stock. We will continue to be highly profitable and produce considerable free cash in spite of the investments we are making in our future growth. And finally, we will use a share of that free cash to increase our stock buyback program. We anticipate being twice as active in our existing program and will continue to assess block trades that benefit our shareholders. With that, I'll turn the call over to Anders."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Bob, and good morning, everyone. On slide six, you can see both unique customers and transactions up double digits year over year. Most importantly, we grew this business at healthy margins, which you'll see reflected in the coming pages. On slide seven, strong trend in profitable digital growth continued. Transactions were up 42% at the best margins we've seen for our digital product. We're confident in our product, our digital partnerships, and the team that's bringing it all to market. Also worth mentioning is the growth on the digital receive side. Those transactions terminated by electronic payout methods like bank accounts, mobile wallets, et cetera, are a key factor in that almost 18% year-over-year growth you can see to the right. These transactions are typically very cost-efficient ways for us to deliver a wire, so this trend is also a nice margin tailwind for us. On slide 8, we present a picture of our volume growth and average principal cent. On face value, it appears that the average principal is down year over year to $406 a transaction in Keyport. That is mostly driven by the inclusion of La Nacional and iTransfer, where the cent amounts are structurally lower. Principal amounts excluding those businesses were essentially flat for the quarter. On the next page, you can see revenue growth up 11.2% for the quarter and 20.5% for the year. As Bob mentioned earlier, revenue was at the lower end of our guidance as we were not immune to the slowdown in cents in Mexico. However, as you see next on page 10, our strategy to grow transactions in the core while preserving margins, coupled with a rigorous cost agenda, yielded strong earnings results. You can see net income up almost 34% for the quarter and diluted EPS up 40%. As we closed on the national acquisition in Q4 last year, we're going over about $2.5 million in transaction costs, which is bolstering the gap number. On the next page, you can see a little cleaner reflection, which, among others, adjusts out those transaction costs. Adjusted net income is up 13.5%, and adjusted diluted EPS is up 21.7%. Finishing up the P&L, adjusted EBITDA grew at 14.5% in the quarter, with adjusted EBITDA margins at 19.4% versus 18.8% in the prior year. So again, our targeted strategy to grow wires in this environment without degrading margins is delivering for shareholders. Also worth it to note, Q4 23 includes a full three-months of Linastian L&I Transfer, both structurally lower margin businesses, yet our year-over-year margins still improved by 60 basis points, a testament to our focus to deliver a premium product through highly tactical execution. Finally, on cash on the balance sheet, we ended up the quarter on a Sunday of a holiday weekend with $239 million on the balance sheet and $106 million undrawn revolver capacity. Free cash generated, which again removes day-of-the-week cyclicality, was up 26% year-over-year. The balance sheet remains in great shape. While the headline shows us about 1.6 times levered, we have to remember that we closed on a weekend with $114 million drawn on the revolver, and most days of the week that revolver sits completely undrawn. If we look at our average daily debt position for 2023 versus our adjusted EBITDA for all of 2023, it implies a leverage of below one times. As far as capital allocation goes, At the top of the list are aggressive incentives at retail that deliver highly accretive transaction and margin growth. After that, we continue to see great value in the stock. In the quarter, we purchased about $25 million in stock, $10 million via our regular quarterly program, and another $15 million through block purchases. As Bob mentioned earlier, we expect to double our quarterly underlying program from $10 million to $20 million, and we'll continue to make block purchases when and where it makes sense for our shareholders. As far as M&A goes, we're always going to look for opportunity, especially with the balance sheet we have. However, we're going to continue to be selective stewards of the company's capital resources, exercising a prudent approach with robust screens for value. On the final slide, I'll take you briefly through our guidance for 2024 and for the first quarter. For the full year 2024, we anticipate the following. Revenue of $681 to $701.8 million. Fully diluted gap EPS of $1.81 to $1.96. Adjusted EBITDA of $124 to $127.7 million. Adjusted diluted EPS of $2.13 to $2.31. For the first quarter, we anticipate the following. Revenue of $150.4 million to $155 million. Fully diluted gap EPS of $0.32 to $0.35. adjusted EBITDA of 24.4 million to 25.1 million, and adjusted diluted EPS of 39 cents to 42 cents. This guidance takes into account a noteworthy step down in market growth for Mexico, the key corridor in Latin America. While we're not immune to the effects of growth slowing at the single largest country-to-country corridor in the world, we anticipate four things. We'll continue to beat the market growth rate in both retail and digital, Our margins will remain strong, justified by a premium product and highly tactical execution. We'll pivot to an even leaner operating model, maximizing returns in the face of a market whose pace of growth has come back down to earth. And finally, we'll utilize our strong liquidity and ability to generate cash to more aggressively pursue shares via our buyback program. In summary, we continue executing the Intermex Playbook and are well positioned to deliver another strong year for our shareholders. With that, I'll turn it over to the operator for questions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. We will now begin the question and answer session."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "To ask a question, you may press star 1 on your telephone keypad. If you are using a speakerphone, please pick up your headset before pressing the keys. If at any time your question has been addressed, you may withdraw your question, pressing star 2. Our first question comes from David Stark with Citizens JMP. Please proceed."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Good morning, and thanks for taking my questions. Bob, can you provide a little more, I guess, background in geographic context for the Salesforce expansion since it's such a dramatic increase, you know, particularly the internal team. Is this bolstering up efforts in the western regions, those zip codes? I know you've long been targeting, or I thought you said something about offshore. Can you just provide some more background on kind of how we ought to view this in a broader kind of multi-year context of kind of what you think your footprint will look like?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yes, the inside team has been primarily located in Miami with a few folks out in California to be more productive relative to time zones. And we had 12 folks that were directly responsible for contacting agents by telephone. Those were separate and apart, but supporting our efforts at retail with our outside sales team. We recognized that our reach could be benefited by having more folks available. And what we did is created 24 positions in Guatemala with people that are fully bilingual that will be augmenting those 12 folks and then work in teams of three people, one in the US, two in Guatemala that will have a set of agents, approximately 12 different teams. So each team will have about 1 12th of our existing agents. And what they'll be doing is calling those agents and Looking at opportunities where we might have a decline in wires where it's a slow startup with a new agent. Our experience is that contact drives many more wires, and the payback is really even good if the U.S. team, but the fact that it's much more efficient cost-wise to do this in Guatemala, we're able to triple our reach from the inside perspective without anywhere near tripling the cost of that function. Now, in addition to that, we've had 40 district sales managers in the U.S., that have been separating or accounting for our existing business and going out after new business. Those will be augmented by a 15% increase. So we tripled the size of the inside and then a 15% increase of the folks out there in the U.S. at retail that will be visiting our existing agents will have the primary responsibility for adding new agents in the vacant zip codes where we have opportunities. We've coupled this with an approach that is looking at different offerings that will be more attractive to both the agent and to the consumer in certain zip codes where today we haven't penetrated. And as we talked about and signaled in the text, that... These are opportunities where we're not giving away any margin, where even if we're taking a lower margin to be more aggressive, it's all found transactions because we have not penetrated those zip codes in the past. So it represents a total remake of what we're doing from an aggressive perspective in the West, but also a remake relative to supporting our existing base and becoming more aggressive at retail. So we think that it will pay large dividends in the next 12 to 24 months, and we'll see an ascension of our rate of growth, a further separation from our rate of growth over the market rate of growth in that period of time."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. Understood. Maybe as a follow-up along that thought of increasing the internal revenue, Salesforce focus on monitoring existing agents. You know, it looks like a lot of the forward guidance is impacted by what you're witnessing in Mexico. I mean, notwithstanding some of the movement and some of the Banco de Mexico data, I know kind of one of the largest, the largest global player, I know on their call it mentioned they had returned to gaining share in Mexico after a long time. And you've talked about pricing pressures in that corridor in past calls. Do you feel like you're maintaining share in U.S. to Mexico with sort of your mature agents?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I mean, we think there are two things going on. We think we're gaining share at retail and we're gaining share at digital. The challenge for us is today our business is not weighted the same way as the market. So we're not having 20% of our business to Mexico go digital, and that's the faster growth piece of the business. I think we believe we're growing just as well as the digital pieces and just as well as the retail pieces, but our percentages are more like 95% retail today and 5% digital. So that weighting causes our growth to maybe look not as good as it does. We think, again, we're beating and exceeding at retail and beating and exceeding at digital. And we think this program where we're adding, not only adding the folks to target, but also the fact that we'll be taking a look at what we're willing to offer the agent and and the consumer at retail in these underserved or unserved areas, it's going to make a lot of difference and will make a further separation between us and market share."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I'll sit in the market growth, which will gain further market share for us."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Understood. Just a quick follow-up for Andres. I guess, you know, salary benefit, you know, the largest op-ex after You know, agent charges, I guess it was $72 million last year. There may be some La Naciel noise. But as we think about the increase in sales headcount, I don't know if it's all variable and commission-based, but is there a kind of good figure we ought to think about for an annualized figure in salary and benefit this year? It seems like that would be the line item moving the most."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I think it's relatively small, these additions. I mean, we have, in terms of our salary movement year over year, you know, you're going to see an aggregate for the business 4% to 5%. So we've really dialed back on that. So that impact of these ads is relatively small. And taking into account all the other areas where we're dialing back costs as much as we can, you know, it's not really going to push through to be a visible impact."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. Great. Thanks so much. Our next question comes from Mike with Northland Securities."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, good morning, guys. Did you guys call out the revenue number from La National and iTransfers? I'm trying to just back into an organic growth rate in 4Q."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, sure, Mike, because we're all on the main call together. La National... The national in Q4 was about 18 million. I transferred in Q4 was about five, which means your organic growth in the core was about a little under 5.5%."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And then last quarter, you guys kind of talked about, I'll call it four, you know, growth drivers that you were sort of strategically heading towards or implementing you know one was sort of targeted counter offers one was new agents one was some overall selected pricing actions and I think kind of new market strategies could you handicap like which one of those four you're ahead on, maybe which ones you're kind of behind on. Just let us know how each of those four are going."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I think the most important and the one that we're doing the best in is the targeted offerings. So that's what we mentioned in the text was that that program is going quite well and we've executed well against it. We brought in tens of thousands of wires on that program, which we're essentially paying a little bit of commission upfront, let's say to an agent, and then we're reducing the amount of payment that the agent gets over time. So it doesn't have a huge impact on our commission that the agent gets or our gross margin over time, but it's more of an upfront payment to bring back wires that we haven't had in the past. That has done quite well, and I think we're executing and continuing to execute against that. The second one with new agents, we continue to drive growth for our new agents, and that's going well as well. Targeting that growth in specific zip codes is the thing that we're going to spend more time on. And that will be sort of a targeted along with new agents, which will be this sort of new price offering where we'll be a little bit more aggressive with both the agent and the consumer. But again, I want to highlight and make sure I underscore that that does not mean we're going to, you know, where we have, four plus million wires and we have it at X margin, we're not going and discounting there. We're being aggressive with price where we're not, where we're not getting wires, where we have a small level of market penetration, where we might not be serving in the zip code at all. And we feel both of those strategies are going well. The overall, actually, our overall approach to the market has been better margins. We've brought the pricing component into finance and And Andrew Coubet, who's ahead of the sales planning and analysis, has been running the pricing. And we've actually done much better in terms of margins versus the margins a year ago. And that's been done because we've done less of sort of wholesale changes in the market and more specific changes related to when we get wires as a benefit of moving price. New markets, I'm not sure what that piece was. I think we have Canada. We certainly have the growth in La Nationale. Let me touch on La Nationale for a minute. We think La Nationale has got a lot of pent-up growth in that it became really a Dominican Republic product. And we've now given them the payer relationships we have in Mexico and our payer cost to Mexico. And we've already seen an uptick in those wires. There's a lot more to do. There's a lot more putting them on our payer network and a lot of volume of transactions in their retail network, both the company stores and the retailers that have not been tapped in the past because Le National was focused primarily on the Dominican Republic. So we still see a lot of growth opportunity there. And then additionally, Europe has been growing well. We think there's a lot more opportunity in Italy. We think, you know, we're looking at things in other parts of Europe as well. So those are the new markets where growth will come from."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. In terms of the buyback, did I hear correctly you guys had been kind of programmatically buying at $10 million a quarter starting 1Q24. That's going to uptick to $20 million a quarter?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "That's right, Mike. And we'll also be active in terms of block purchases if they're going to benefit the shareholder as well. But we feel that we'll have an underlying $20 million that we'll be able to pick up each quarter. We have some price parameters built into that as well, so it's not at all cost, but I feel pretty good about being able to pick up $20 million worth a quarter and then blocks on top of that."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. And just lastly, are you able to put a revenue range or in terms of growth what Mexico is acting as a headwind for 24, like five points of revenue growth, 4.7 points. What do you see that headwind as roughly as compared to like 23?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I think, you know, right now we see that, that the Mexico growth in fourth quarter as an industry was only at, 3.5%, and our assumptions in the plan we presented assumed that kind of growth sustaining itself throughout 2024. So we're not dependent on that coming back at all if the market starts to come back. Just to put it in perspective, in Q2 of 2020, which was the height of COVID, the market grew at 3.6%. And in Q4 of 2023, it grew at 3.5. So it actually grew, you know, a tenth of a percent slower than it did during COVID in Q4. And we kind of projected that through 24. our upside is these investments that we're making in sales from a growth perspective that are totally been assimilated into our cost structure because we've done a lot of zero-based budgeting as well that's eliminated some, I think, unjustified or inefficient costs, right, that we've now put back into the sales perspective. We think that Our target and our aspiration is to separate ourselves further from that growth number, but our assumptions are based on Mexico staying around 3% or 4% growth as an industry through 2024."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. Hey, thank you. You're welcome. Our next question comes from Chris Vang with UBS."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks for taking our question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So my first question is about the visa direct opportunities. It's relatively new. I understand it's kind of nascent and you talked about that enabling you to go into imported markets such as India and Philippines and a couple others to call it out. at the last call and potentially some more this year. So the first part, maybe can you talk a little bit about the potential opportunities and the expansion plans this year and what are your kind of longer-term outlook from the Visa Direct partnership? And then the second part is how much of that Visa Direct opportunities or new markets have you baked into the plan this year for 2024 guidance?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, it's Marcelo here. I'm going to cover the first question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So we see a huge opportunity in this partnership because it makes the company move from a multi-country, multi-region approach to a global approach. So there are important corridors that we're going to embrace, like India or Philippines, as you said. Those are huge markets that we believe we can address at a lower cost and a great experience, as Bob mentioned before. We did incorporate that to our projections for 2024, but of course it's increasing number throughout the year due to our current focus on Latin America. So it's a new target audience that we have to embrace. We see some traction already, but it's a midterm exercise that we're going step by step."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, and I would just jump in, Chris. This is Andres. I think the overall contribution that from an overall company perspective is still quite small, what was baked into 2024. You know, I think we could see it as an option if it really pops. But right now, the contribution from the overall materiality of the plan is quite small at the moment."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "All right. Thanks a lot to both of you. That's very helpful. And the second part, I just wanted to ask a little bit about the four-quarter performance I guess, outside of the Mexico market, what were some of the trends you saw in the market and how did the performance in, I guess, the rest of the LACA regions compared to what you had expected going into the quarter? Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I think we've seen the broader market, and certainly not only Mexico but Guatemala and other key countries for us, slow down relative to growth, not as acutely as Mexico has. But we also see some really strong growth where we've executed well in certain countries and have at times been, you know, on the borderline of triple digit growth to countries like Nicaragua and others where we've been growing very quickly. So I think the overall market has slowed a bit to virtually just about every country in Latin America. But we've been able to grow well outside the size of the market in certain markets like Nicaragua, I believe, Ecuador, Colombia, we're growing much faster than the market in those areas. Dominican Republic, we're seeing that there's some slowing in that market. We think that's a market that's moving a little faster to digital. Dominican people in the U.S. tend to be more likely banked. And if they're a more likely bank, they have more options, meaning that they have the option to go to digital easier and more fluidly than somebody who's maybe an undocumented member of the workforce from Mexico or Honduras or Guatemala. So that's how I would sum up the overall trends."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "All right. Thank you so much. That's very helpful. Let's come back to the queue."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our next question comes from Sam Salvas with NeedHunt. Please proceed."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Thanks. Thanks, guys, for taking the questions. I'm hopping on for mine today. I was wondering if you guys could provide some insight into some of the pricing dynamics you saw in the fourth quarter. I know earlier in the year, I think it was in the third quarter, you guys mentioned some pricing pressures stemming from competitors. So could you guys just talk about what you saw in the fourth quarter and maybe how you guys are thinking about pricing in 2024?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, what we saw is that we've actually been able to extend our margins in fourth quarter and increase them by being more efficient and slicing it a little bit thinner. Previously, we made bigger movements with price related to the whole market and And now our price movements are related to places where there's an incremental upside in terms of wires. What we're very careful about is that we don't want to be discounting where we have wires in-house where people are perfectly happy with the pricing and those wires are already wires we're going to get. Now, as we look at 24, the big opportunity for us is certain areas of the country where there still remains For instance, Southwest, we have a million foreign-borns living in zip codes in California that we haven't tapped into at all. As big as our California business is, in which it's several million wires a year, we haven't tapped into those zip codes at all. We also have another set of zip codes that have about 1.7 million people where we've tapped into very slightly. And so, those are the places where you'll see a different pricing perspective, a different pricing action. We'll be much more aggressive there, but that doesn't degrade at all our current margins. Our current margins are going to stay relatively stable. Those margins will be ones that will come in at a lower gross margin per transaction, but will be incremental transactions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So, the overall average might come down a bit, but nothing will be done to degrade the core business."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. Okay, that's super helpful."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And then just a quick follow up. Could you guys talk more about some of the momentum you're seeing in the eye transfer business and any, you know, expectations or any goals you guys have for the upcoming year?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I would say that we built a plan that we feel comfortable can be in the mid-teens if we're operating the business similar to how it's operating today, but a little bit more efficiently. I think what we're trying to do is create more of a Big Bang plan, which if we get off to the right start, You know, we'll be investing quite a bit in the front end, I think, in the second half of the year. Italy in particular is a really interesting opportunity. I think structurally the margins are better in Italy. And I think, you know, our penetration there in what's a really big economy shows a lot of opportunity. But we're doing well in Spain as well. I mean, I think they were great. You know, I think they've restarted their growth trends in Spain as well. I think that geography is a little bit trickier because the margins aren't as good. But, you know, again, I think that mid-teens is the baseline and only upside from there."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Awesome. Thanks, guys. Appreciate it."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "What I'd add to that is that today we're generally just in two countries in Europe continent. We have one store in Germany. It's a huge market opportunity. We think there's opportunities for us, you know, with our European license, not only to expand further in Germany in the middle run, but also in France, and we're also looking at opportunities in the UK to get started there. So I think you'll see us be much more active in Europe. We think Europe is a great opportunity at retail, but because of the nature of the consumer there, we believe that our digital opportunity will catch on even faster because more consumers are already ready to do digital wires. They have bank accounts. They're paid on the books, on a payroll card. And so we're looking forward to getting our digital app up and going in Europe, and then also our expansion as we grow through other key countries like Germany, France, and ultimately UK."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, makes sense. All right. Thanks, guys. Once again, if you have a question, please press the star wine. Thank you. This concludes our question and answer session."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I would like to turn the conference back over to the speakers for any closing remarks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you all for tuning in. Look forward to talking to you all soon. Thanks again. Have a great day."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "the conference has now concluded thank you for attending to this presentation you may now disconnect Thank you. Thank you. Thank you. Thank you. Good day and welcome to the International Money Express conference call. All participants will be in a listen-only mode. Should you need assistance, please signal a conference specialist by pressing the star key followed by zero. After today's presentation, there will be an opportunity to ask questions. To ask a question, you may press the star then one on your telephone keypad. To withdraw your question, please press the star then two. Please note this event is being recorded. I would now like to turn the conference over to Alex Sadowski, Investor Relations Coordinator. Please go ahead, sir."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning, and welcome to our quarterly earnings call. I would like to remind everyone that today's call includes forward-looking statements, including our 2024 guidance, and actual results may differ materially from expectations. For additional information on International Money Express, which we refer to as Intermex or the company, please see our SEC filings, including the risk factors described therein. All forward-looking statements on this call are based on assumptions and beliefs as of today. You should not rely on our forward-looking statements as predictions of future events. Please refer to slide two of our presentation for a description of certain forward-looking statements. The company undertakes no obligation to update such information except as required by applicable law. On this conference call, we discussed certain non-GAAP financial measures. Information required by Regulation G under the Securities and Exchange Act for such non-GAAP financial measures is included in the presentation slides our earnings press release, and our annual report on Form 10-K, including reconciliation of certain non-GAAP financial measures to the appropriate GAAP measures. These can be obtained in the investor section of our website at intermexonline.com. Presenting on today's call is our Chairman, Chief Executive Officer, and President, Bob Lissy, and Chief Financial Officer, Andrus Bendy. Also on the call today, are Chris Hunt, Chief Operating Officer, Joseph Aguilar, President, Latin America, Randy Nielsen, EVP of Retail Sales, Marcelo Theodoro, Chief Digital Officer, Beth Erickson, Chief Human Resources Officer, Andrew Kube, EVP, Finance and Business Intelligence, and Karim Baroni, Director of Financial Analysis. Let me now turn the call over to Bob. Good morning."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Intermex is proud to announce fourth quarter earnings that are a testament to who we are as a company. On page three, you can see that in the quarter we delivered revenue of just under $172 million, up 11.2% year over year, and diluted gap EPS of 49 cents, up 40% year over year. Furthermore, adjusted ETA was up 14.5% to $33.3 million, and adjusted diluted EPS up 21.7% to 56 cents. We continue to deliver solid earnings and cash generation for our shareholders in every environment, and our fourth quarter results fully demonstrate that. We believe our omni-channel strategy is the most efficient way to serve the varying needs of the consumer in this market. Intermex continues to offer our best-in-class service and loyalty offerings through both our retail and our digital products. This is an advantage that no other provider can claim. Our retail network required years of careful precision effort to build, and as a result, is very difficult to replicate. Our technological advantage makes transacting fast and convenient for both digital and retail consumers. These critical factors have made our model highly profitable and drives exceptional generation of cash. How we deliver our products and services to the market is even more important. At retail, Intermex has taken and will continue to take a highly refined rifle shot approach while building our network of retail agents. This strategy enabled the company to deliver products and services to consumers through the highest performing retail agent network in the industry. All this occurs while maximizing agent retail performance that drives ROI and profitability. We are most interested in connecting with consumers in markets where our value-added approach resonates the strongest. This is when and where Intermex is able to best differentiate our value-added service, where we can in turn tax your margin, and where we ultimately benefit our shareholders. Our retail model requires a modest investment. Our sales and marketing costs are roughly 8% of gross margin and only 3% of total revenues. In our digital offering, we continue to demonstrate that same focus on efficiency and profitability while growing our transactions 43% this quarter and doing that by way of a highly efficient customer acquisition spend. As a result, we're delivering a highly attractive margin. Finally, we continue to develop and introduce new features and functionality to deliver a user experience that is among the best in class. We continue to upgrade our application and it has received a rating of 4.8 out of 5 from our users. Our expanding margins related to our digital product place us in a great position to expand in new markets, including India, the Philippines, and others through our new partnership with Visa. In the broader market, significant amounts of capital have been spent by some providers to grow digital market share. In many cases, spending may not have achieved an ROI that would support that investment. Our strategy is to carefully cultivate and grow our digital business with the same efficiency that we have demonstrated while building our retail network. That is one key reason why our current digital business is profitable and growing. We're taking the approach that no one else in the industry has taken, by offering a value-added product and carefully crafted strategy to capture share in the right markets. As we do with our retail business, we will leverage our best-in-class customer service and our metrical orientation to drive profitable buyer growth. This translates into consistent product expansion, strong margins, exceptional cash generation, and a fortress of a balance sheet. As we talked about previously, the LaNationale acquisition we closed in Q4 of 2023 brings Intermex meaningful presence in the U.S. to Dominican Republic market. With that acquisition on board for over 12 months, you will see on page five, we have recast our market share calculation over time to include the DR. In 2023, we captured a 21.4% share in the top five markets to Latin America. We have successfully grown our market share over time while sustaining attractive margins year after year. Our Q4 EBITDA margins excluding acquisitions were well north of 20%, some of the best we have seen in the history of the company. We have been able to attain these outside results through the execution of our metrically driven strategy. We have a highly efficient base of retail agents who rely on our products and services. We offer and deliver these products to the customer base who appreciates Intermex's value-added approach. We continue to strengthen our relationship with our retail agents while deepening our competitive moat and growing our mutually beneficial high-margin business. Additionally, we have the ability to carefully select where and when to aggressively pursue wires at reduced gross margins. This practice is put in place when meaningful incremental transactions can be captured in areas where Intermex has a low market share and the upside potential is quite large. This approach enables us to capture new business in such a way that we do not affect margins at our current high-profit retailers. As a result, we're able to generate incremental earnings for our shareholders. We refrain from reacting to market pressures with a broad brush approach that degrades margins for the company. Our approach is simple, but not easy. It requires focus and discipline execution. These behaviors are in our corporate DNA, but are very difficult to replicate. In our quest for new business and to catalyze incremental growth, we have launched bold strategies to penetrate previously untapped and underdeveloped markets. Our focus sharpens on locales rife with untapped wire potential detailed to the zip code where our presence has been minimal. As a part of our aggressive approach to drive revenue in high potential areas, we've decided to expand our outside sales force by adding six new positions to our already robust team of 40. This expansion is a fresh strategy designed to intensify our market penetration and coverage. Moreover, we've taken a decisive step by significantly enlarging our inside sales team, a move that marks a departure from traditional methods by tripling the team size from 12 to 36 members and strategically positioning these roles offshore. We're not only enhancing our capacity to engage with our current agents, but also tripling our daily interactions in cost-effective manner. This strategic enhancement is expected to dramatically boost our same-store sales. representing an almost 60% surge in our total Salesforce capacity. This considerable investment in our sales infrastructure is an approach we are confident will yield substantial returns over the next 12 to 18 months, signifying our aggressive pursuit of growth through innovative staffing strategies. From an inorganic perspective, we're also making great progress. The iTransfer business in Europe grew at 17% in Q4, We continue to expect great things from our European division, including strong digital opportunity to access in the coming months. While the national business in the U.S. is much more profitable and efficient than a year ago, we believe significant opportunities remain to expand to additional corridors through our current agent base. To Mexico alone, now armed with the Intermex payer network and fee structure, we see potential for millions of dollars of increased margin annually. We have begun to execute against this plan. Additionally, there will be more efficiencies to be leveraged as the year unfolds. These businesses are proving to be great additions to Intermex, and we're excited and optimistic about their combined future. Before I turn the call over to Andres to go deeper into the numbers, a few final thoughts on operating discipline and why we say Q4 was a testament to who we are as a company. By almost all key measures, we're strong and exceeded market expectations. We faced some revenue headwinds. In spite of that, we persevered and delivered a solid quarter of growth. We talked about our plan to capture incremental wires in Q3. I am pleased to report that our efforts are continuing to be productive and the sales team continues to execute on that plan. At the same time, shortly after Q3 earnings, we saw Mexico market growth slow considerably to levels we have not seen in years. In true Intermex fashion, we put a critical eye on our business and challenged every corner of the company to maximize efficiency. We delivered on what we set out to do and generated strong earnings despite a weaker than expected top line. While it is difficult to predict what our key markets will do in 2024, the guidance Andres will take you through later in the presentation anticipates underlying softness in that market for a period of time. Our guidance also anticipates a tenacious focus on efficiency and execution. That is part of our culture and why we feel better positioned than anybody else in the market. We're confident in our differentiators, and the management team and the board feel there is tremendous value in InterMet stock. We will continue to be highly profitable and produce considerable free cash in spite of the investments we are making in our future growth. And finally, we will use a share of that free cash to increase our stock buyback program. We anticipate being twice as active in our existing program and will continue to assess block trades that benefit our shareholders. With that, I'll turn the call over to Anders."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Bob, and good morning, everyone. On slide six, you can see both unique customers and transactions up double digits year over year. Most importantly, we grew this business at healthy margins, which you'll see reflected in the coming pages. On slide seven, strong trend in profitable digital growth continued. Transactions were up 42% at the best margins we've seen for our digital product. We're confident in our product, our digital partnerships, and the team that's bringing it all to market. Also worth mentioning is the growth on the digital receive side. Those transactions terminated by electronic payout methods like bank accounts, mobile wallets, et cetera, are a key factor in that almost 18% year-over-year growth you can see to the right. These transactions are typically very cost-efficient ways for us to deliver a wire, so this trend is also a nice margin tailwind for us. On slide 8, we present a picture of our volume growth and average principal sent. On face value, it appears that the average principal is down year over year to $406 a transaction in Keyport. That is mostly driven by the inclusion of La Nacional and iTransfer, where the send amounts are structurally lower. Principal amounts excluding those businesses were essentially flat for the quarter. On the next page, you can see revenue growth up 11.2% for the quarter and 20.5% for the year. As Bob mentioned earlier, revenue was at the lower end of our guidance as we were not immune to the slowdown in cents in Mexico. However, as you see next on page 10, our strategy to grow transactions in the core while preserving margins, coupled with a rigorous cost agenda, yielded strong earnings results. You can see net income up almost 34% for the quarter and diluted EPS up 40%. As we closed on the national acquisition in Q4 last year, we're going over about $2.5 million in transaction costs, which is bolstering the gap number. On the next page, you can see a little cleaner reflection, which, among others, adjusts out those transaction costs. Adjusted net income is up 13.5%, and adjusted diluted EPS is up 21.7%. Finishing up the P&L, adjusted EBITDA grew at 14.5% in the quarter, with adjusted EBITDA margins at 19.4% versus 18.8% in the prior year. So again, our targeted strategy to grow wires in this environment without degrading margins is delivering for shareholders. Also worth it to note, Q4 23 includes a full three-months of Linacity and LNI Transfer, both structurally lower margin businesses, yet our year-over-year margins still improved by 60 basis points, a testament to our focus to deliver a premium product through highly tactical execution. Funding on cash on the balance sheet, we ended up the quarter on a Sunday of a holiday weekend with $239 million on the balance sheet and $106 million undrawn revolver capacity. Free cash generated, which again removes day of the week cyclicality, was up 26% year over year. The balance sheet remains in great shape. While the headline shows us about 1.6 times levered, we have to remember that we closed on a weekend with $114 million drawn on the revolver, and most days of the week that revolver sits completely undrawn. If we look at our average daily debt position for 2023 versus our adjusted EBITDA for all of 2023, it implies a leverage of below one times. As far as capital allocation goes, At the top of the list are aggressive incentives at retail that deliver highly accretive transaction and margin growth. After that, we continue to see great value in the stock. In the quarter, we purchased about $25 million in stock, $10 million via our regular quarterly program, and another $15 million through block purchases. As Bob mentioned earlier, we expect to double our quarterly underlying program from $10 million to $20 million, and we'll continue to make block purchases when and where it makes sense for our shareholders. As far as M&A goes, we're always going to look for opportunity, especially with the balance sheet we have. However, we're going to continue to be selective stewards of the company's capital resources, exercising a prudent approach with robust screens for value. On the final slide, I'll take you briefly through our guidance for 2024 and for the first quarter. For the full year 2024, we anticipate the following. Revenue of $681 to $701.8 million. Fully diluted gap EPS of $1.81 to $1.96. Adjusted EBITDA of $124 to $127.7 million. Adjusted diluted EPS of $2.13 to $2.31. For the first quarter, we anticipate the following. Revenue of $150.4 million to $155 million. Fully diluted gap EPS of $0.32 to $0.35. adjusted EBITDA of 24.4 million to 25.1 million, and adjusted diluted EPS of 39 cents to 42 cents. This guidance takes into account a noteworthy step down in market growth for Mexico, the key corridor in Latin America. While we're not immune to the effects of growth slowing at the single largest country-to-country corridor in the world, we anticipate four things. We'll continue to beat the market growth rate in both retail and digital markets, Our margins will remain strong, justified by a premium product and highly tactical execution. We'll pivot to an even leaner operating model, maximizing returns in the face of a market whose pace of growth has come back down to earth. And finally, we'll utilize our strong liquidity and ability to generate cash to more aggressively pursue shares via our buyback program. In summary, we continue executing the Intermax Playbook and are well positioned to deliver another strong year for our shareholders."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "With that, I'll turn it over to the operator for questions. Thank you. We will now begin the question and answer session."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "To ask a question, you may press star 1 on your telephone keypad. If you are using a speakerphone, please pick up your headset before pressing the keys. If at any time your question has been addressed, you may withdraw your question, pressing star 2. Our first question comes from David Sharp with Citizens JMP. Please proceed."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Good morning, and thanks for taking my questions. Bob, can you provide a little more, I guess, background and geographic context for citizens the Salesforce expansion since it's such a dramatic increase, you know, particularly the internal team. Is this bolstering up efforts in the western regions, those zip codes? I know you've long been targeting, or I thought you said something about offshore. Can you just provide some more background on kind of how we ought to view this in a broader kind of multi-year context of kind of what you think your footprint will look like?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yes, the Insight team has been primarily located in Miami with a few folks out in California to be more productive relative to time zones. And we had 12 folks that were directly responsible for contacting agents by telephone. Those were separate and apart, but supporting our efforts at retail with our outside sales team. We recognized that our reach could be benefited by having more folks available. And what we did is created 24 positions in Guatemala with people that are fully bilingual that will be augmenting those 12 folks and then work in teams of three people, one in the US, two in Guatemala that will have a set of agents, approximately 12 different teams. So each team will have about 1 12th of our existing agents. And what they'll be doing is calling those agents and Looking at opportunities where we might have a decline in wires where it's a slow startup with a new agent. Our experience is that contact drives many more wires, and the payback is really even good if the U.S. team, but the fact that it's much more efficient cost-wise to do this in Guatemala, we're able to triple our reach from the inside perspective without anywhere near tripling the cost of that function. Now, in addition to that, we've had 40 district sales managers in the U.S., that have been separating or accounting for our existing business and going out after new business. Those will be augmented by a 15% increase. So we tripled the size of the inside and then a 15% increase of the folks out there in the US at retail that will be visiting our existing agents will have the primary responsibility for adding new agents in the vacant zip codes where we have opportunities. We've coupled this with an approach that is looking at different offerings that will be more attractive to both the agent and to the consumer in certain zip codes where today we haven't penetrated. And as we talked about and signaled in the text, that These are opportunities where we're not giving away any margin, where even if we're taking a lower margin to be more aggressive, it's all found transactions because we have not penetrated those zip codes in the past. So it represents a total remake of what we're doing from an aggressive perspective in the West, but also a remake relative to supporting our existing base and becoming more aggressive at retail. So we think that it will pay large dividends in the next 12 to 24 months, and we'll see an ascension of our rate of growth, a further separation from our rate of growth over the market rate of growth in that period of time."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. Understood. Maybe as a follow-up along that thought of increasing the internal Salesforce focus on monitoring existing agents, it looks like a lot of the forward guidance is impacted by what you're witnessing in Mexico, I mean, notwithstanding some of the movement and some of the Banco de Mexico data, I know kind of one of the largest, the largest global player, I know on their call it mentioned they had returned to gaining share in Mexico after a long time. And you've talked about pricing pressures in that corridor in past calls. Do you feel like you're maintaining share? in U.S. to Mexico with sort of your mature agents?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I mean, we think there are two things going on. We think we're gaining share at retail and we're gaining share at digital. The challenge for us is today our business is not weighted the same way as the market. So we're not having 20% of our business to Mexico go digital. And that's the faster growth piece of the business. I think we believe we're growing just as well as the digital pieces and just as well as the retail pieces. But our percentages are more like 95% retail today and 5% digital. So that weighting causes our growth to maybe look not as good as it does. We think, again, we're beating and exceeding at retail and beating and exceeding at digital. And we think this program where we're adding, not only adding the folks to target, but also the fact that we'll be taking a look at what we're willing to offer the agent and and the consumer at retail in these underserved or unserved areas, it's going to make a lot of difference and will make a further separation between us and market share."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I'll sit in the market growth, which will gain further market share for us."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Understood. And I'll just, just a quick, quick follow up for Andres. I guess, you know, salary benefit, you know, the largest OpEx after, You know, agent charges, I guess it was $72 million last year. There may be some La Naciel noise. But as we think about the increase in sales headcount, I don't know if it's all variable and commission-based, but is there a kind of good figure we ought to think about for an annualized figure in salary and benefit this year? It seems like that would be the line item moving the most."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I think it's relatively small, these additions. I mean, we have, in terms of our salary movement year over year, you know, you're going to see an aggregate for the business 4% to 5%. So we've really dialed back on that. So that impact of these ads is relatively small. And taking into account all the other areas where we're dialing back costs as much as we can, you know, it's not really going to push through to be a visible impact."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. Great. Thanks so much. Our next question comes from Mike Groudout with Northland Securities."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, good morning, guys. Did you guys call on the revenue number from La Nationale and iTransfers? I'm trying to just back into an organic growth rate in 4Q."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, sure, Mike, because we're all on the main call together. La Nationale... The national in Q4 was about 18 million. I transferred in Q4 was about five, which means your organic growth in the core was about a little under 5.5%."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And then last quarter, you guys kind of talked about, I'll call it four, you know, growth drivers that you were sort of strategically heading towards or implementing you know one was sort of targeted counter offers one was new agents one was some overall selected pricing actions and and i think kind of new market strategies could you handicap like which one of those four"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "you're ahead on maybe which ones you're kind of behind on just let us know how each of those four are going yeah i think um the most important and the one that we're doing the best in is the targeted offerings so that's what we mentioned in the in the in the text was that that program is going quite well and we've executed well against it we brought in tens of thousands of wires um on that program which we're essentially paying a little bit of commission upfront, let's say to an agent, and then we're reducing the amount of payment that the agent gets over time. So it doesn't have a huge impact on our commission that the agent gets or our gross margin over time, but it's more of an upfront payment to bring back wires that we haven't had in the past. That has done quite well, and I think we're executing and continuing to execute against that. The second one with new agents, we continue to drive growth for our new agents, and that's going well as well. Targeting that growth in specific zip codes is the thing that we're going to spend more time on. And that will be sort of a targeted along with new agents, which will be this sort of new price offering where we'll be a little bit more aggressive with both the agent and the consumer. But again, I want to highlight and make sure I underscore that that does not mean we're going to, you know, where we have four plus million wires and we have it at X margin, we're not going and discounting there. We're being aggressive with price where we're not, where we're not getting wires, where we have a small level of market penetration, where we might not be serving in the zip code at all. And we feel both of those strategies are going well. The overall, actually, our overall approach to the market has been better margins. We've brought the pricing component into finance and and um andrew coubet who said is ahead of the uh sales planning and analysis has been running the pricing and we've actually done much better in terms of margins versus the the margins a year ago and that's been done because we've done less of sort of wholesale changes in the market and more specific changes related to when we get wires as as a as a benefit of moving price New markets, I'm not sure what that piece was. I think we have Canada. We certainly have the growth in La Nationale. Let me touch on La Nationale for a minute. We think La Nationale has got a lot of pent-up growth in that it became really a Dominican Republic product. And we've now given them the payer relationships we have in Mexico and our payer cost to Mexico. And we've already seen an uptick in those wires. There's a lot more to do. There's a lot more of putting them on our payer network and a lot of volume of transactions in their retail network, both the company stores and the retailers that have not been tapped in the past because the national was focused primarily on the Dominican Republic. So we still see a lot of growth opportunity there. And then additionally, Europe has been growing well. We think there's a lot more opportunity in Italy. We think, you know, we're looking at things in other parts of Europe as well. So those are the new markets where growth will come from."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. In terms of the buyback, did I hear correctly you guys had been kind of programmatically buying at $10 million a quarter starting 1Q24. That's going to uptick to $20 million a quarter?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "That's right, Mike. And we'll also be active in terms of block purchases if they're going to benefit the shareholder as well. But we feel that we'll have an underlying $20 million that we'll be able to pick up each quarter. We have some price parameters built into that as well, so it's not at all cost, but I feel pretty good about being able to pick up $20 million worth a quarter and then blocks on top of that."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. And just lastly, are you able to put a revenue range or in terms of growth what Mexico is acting as a headwind for 24, like five points of revenue growth, 4.7 points. What do you see that headwind as roughly as compared to like 23?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I think, you know, right now we see that, that the Mexico growth in fourth quarter as an industry was only at,"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "3.5%. And our assumptions in the plan we presented assumed that kind of growth sustaining itself throughout 2024. So we're not dependent on that coming back at all if the market starts to come back. Just to put it in perspective, in Q2 of 2020, which was the height of COVID, the market grew at 3.6%. And in Q4 of 2023, it grew at 3.5. So it actually grew, you know, a tenth of a percent slower than it did during COVID in Q4. And we kind of projected that through 24. our upside is these investments that we're making in sales from a growth perspective that are totally been assimilated into our cost structure because we've done a lot of zero-based budgeting as well that's eliminated some, I think, unjustified or inefficient costs, right, that we've now put back into the sales perspective. We think that Our target and our aspiration is to separate ourselves further from that growth number, but our assumptions are based on Mexico staying around 3% or 4% growth as an industry through 2024."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. Hey, thank you. You're welcome. Our next question comes from Chris Vang with UBS."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks for taking our question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So my first question is about the visa direct opportunities. It's relatively new. I understand it's kind of nascent. Andrew talked about that enabling you to go into imported markets such as India and Philippines and a couple others to call it out. at the last call and potentially some more this year. So the first part, maybe can you talk a little bit about the potential opportunities and the expansion plans this year and what are your kind of longer-term outlook from the Visa Direct partnership? And then the second part is how much of that Visa Direct opportunities or new markets have you baked into the plan this year for 2024 guidance?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, it's Marcelo here. I'm going to cover the first question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So we see a huge opportunity in this partnership because it makes the company move from a multi-country, multi-region approach to a global approach. So there are important corridors that we're going to embrace, like India or Philippines, as you said. Those are huge markets that we believe we can address at a lower cost and a great experience, as Bob mentioned before. We did incorporate that to our projections for 2024, but of course it's increasing number throughout the year due to our current focus on Latin America. So it's a new target audience that we have to embrace. We see some traction already, but it's a midterm exercise that we're going step by step."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, and I would just jump in, Chris. This is Andres. I think the overall contribution that from an overall company perspective is still quite small, what was baked into 2024. You know, I think we could see it as an option if it really pops. But right now, the contribution from the overall materiality of the plan is quite small at the moment."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "All right. Thanks a lot to both of you. That's very helpful. And the second part, I just wanted to ask you, a little bit about the fourth quarter performance, I guess, outside of the Mexico market. What were some of the trends you saw in the market and how did the performance in, I guess, the rest of the LACA regions compared to what you had expected going into the quarter? Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I think we've seen the broader market in certainly not only Mexico, but Guatemala and other key countries for us slow down relative to growth, not as as acutely as Mexico has, but we also see some really strong growth where we've executed well in certain countries and have at times been, you know, on the borderline of triple-digit growth to countries like Nicaragua and others where we've been growing very quickly. So I think the overall market has slowed a bit to virtually just about every country in Latin America, but we've been able to grow well outside the size of the market in certain markets like Nicaragua, I believe, Ecuador, Colombia, we're growing much faster than the market in those areas. Dominican Republic, we're seeing that there's some slowing in that market. We think that's a market that's moving a little faster to digital. Dominican people in the U.S. tend to be more likely banked. And if they're a more likely bank, they have more options, meaning that they have the option to go to digital easier and more fluidly than somebody who's maybe an undocumented member of the workforce from Mexico or Honduras or Guatemala."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So that's how I would sum up the overall trends. Right. Thank you so much. That's very helpful. Let's come back to the queue."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our next question comes from Sam Salvas with NeedHunt. Please proceed."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Thanks. Thanks, guys, for taking the questions. I'm hopping on for mine today. I was wondering if you guys could provide some insight into some of the pricing dynamics you saw in the fourth quarter. I know earlier in the year, I think it was in the third quarter, you guys mentioned some pricing pressures stemming from competitors. So could you guys just talk about what you saw in the fourth quarter and maybe how you guys are thinking about pricing in 2024?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, what we saw is that we've actually been able to extend our margins in fourth quarter and increase them by being more efficient and slicing it a little bit thinner. Previously, we made bigger movements with price related to the whole market. And now our price movements are related to places where there's an incremental upside in terms of wires. What we're very careful about is that we don't want to be discounting where we have wires in-house where people are perfectly happy with the pricing and those wires are already wires we're going to get. Now, as we look at 24, the big opportunity for us is certain areas of the country where there still remains For instance, Southwest, we have a million foreign-borns living in zip codes in California that we haven't tapped into at all. as big as our California business is, in which it's several million wires a year, we haven't tapped into those zip codes at all. We also have another set of zip codes that have about 1.7 million people where we've tapped into very slightly. And so those are the places where you'll see a different pricing perspective, a different pricing action. We'll be much more aggressive there. but that doesn't degrade at all our current margins. Our current margins are going to stay relatively stable. Those margins will be ones that will come in at a lower gross margin per transaction, but will be incremental transactions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So the overall average might come down a bit, but nothing will be done to degrade the core business."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. Okay, that's super helpful."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And then just a quick follow-up question. Could you guys talk more about some of the momentum you're seeing in the iTransfer business and any expectations or any goals you guys have for the upcoming year?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, you know, I would say that we built a plan that we feel comfortable can be in the mid-teens if we're operating the business similar to how it's operating today, but a little bit more efficiently. I think what we're trying to do is – is create more of a big bang plan, which, you know, if we get off to the right start, you know, we'll be investing quite a bit in the front end, I think, in the second half of the year. Italy in particular is a really interesting opportunity. I think structurally the margins are better in Italy. And I think, you know, our penetration there in what's a really big economy shows a lot of opportunity. But we're doing well in Spain as well. I mean, they think they were You know, I think they've restarted their growth trends in Spain as well. I think that geography is a little bit trickier because the margins aren't as good. But, you know, again, I think that mid-teens is the baseline and only upside from there."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Awesome. Thanks, guys. Appreciate it."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "What I'd add to that is that today we're generally just in two countries in Europe continent. We have one store in Germany. It's a huge market opportunity. We think there's opportunities for us, you know, with our European license, not only to expand further in Germany in the middle run, but also in France, and we're also looking at opportunities in the UK to get started there. So I think you'll see us be much more active in Europe. We think Europe is a great opportunity at retail, but because of the nature of the consumer there, we believe that our digital opportunity will catch on even faster because more consumers are already ready to do digital wires. They have bank accounts. They're paid on the books, on a payroll card. And so we're looking forward to getting our digital app up and going in Europe, and then also our expansion as we grow through other key countries like Germany, France, and ultimately UK."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, makes sense."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "All right. Thanks, guys. Once again, if you have a question, please press the star wine. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "This concludes our question and answer session. I would like to turn the conference back over to the speakers for any closing remarks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you all for tuning in. Look forward to talking to you all soon. Thanks again. Have a great day. The conference has now concluded. Thank you for attending to this presentation. You may now disconnect."
    }
]