[
    {
        "date": "2022-08-03T09:00:00+08:00"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you for standing by. This is the conference operator. Welcome to the International Money Express Inc. Second Quarter 2022 Earnings Conference Call. As a reminder, all participants are in listen-only mode and the conference is being recorded. After the presentation, there'll be an opportunity to ask questions. To join the question queue, you may press star then 1 on your telephone keypad. Should you need assistance during the conference call, You may signal an operator by pressing star and zero. I would now like to turn the conference over to Mike Galentine, Vice President of Investor Relations. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning and welcome to our quarterly earnings call. I would like to remind everyone that today's call includes forward-looking statements, including our updated 2022 guidance. And actual results may differ materially from expectations. For additional information on International Money Express, which we refer to as Intermex or the company, please see our SEC filings, including the risk factors described therein. All forward-looking statements on this call are based on assumptions and beliefs as of today. You should not rely on our forward-looking statements as predictions of future events. Please refer to our slide in our presentation description of certain forward-looking statements. The company undertakes no obligation to update such information except as required by applicable law. On this conference call, we discussed certain non-GAAP financial measures. Information required by Regulation G under the Securities and Exchange Act for such non-GAAP financial measures included in the presentation slides, our earnings press release, and our annual report on Form 10-K including reconciliation of certain non-GAAP financial measures to the appropriate GAAP measures. These can be obtained in the investor section on our website at intermexonline.com. Presenting on today's call is our Chairman, Chief Executive Officer and President, Bob Lissy, and Chief Financial Officer, Andres Bendi. Also on the call today are Joseph Aguilar, Chief Operating Officer, Randy Nelson, Chief Revenue Officer, and Chris Hunt, Chief Information Officer. Let me now turn the call over to Bob."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning, and thank you for joining us. As always, we appreciate your interest in Intermex. The company's unprecedented growth continued unabated during the second quarter as we set a number of notable performance records and reached some significant milestones. On slide three, during the three-month period, we completed a record number of remittances, driving record revenues adjusted to the DA and net income. I'm proud to report that Intermex is selling almost twice as many transactions as we did when we became a public company just four years ago. To put our history of performance excellence in perspective, we have met or beaten IBIDEA expectations every quarter since we went public, 16 out of 16 quarters. Intermex is delivering sector-leading profitable growth and consistently strong operating results, creating significant value for our shareholders. As for important milestones on slide four, we surpassed 4 million wires in a single month for the first time in May. Strong volume during Mother's Day weekend, which is always a significant event in our industry, helped us achieve that record. We sold 650,000 wires during Mother's Day weekend and 232,000 wires on Mother's Day itself, which also were company records. We ramp up every year for Mother's Day because we know how important it is for our customers to honor their mothers, grandmothers, and other important women in their lives by sending money home. Our omnichannel strategy, which we articulated several quarters ago, is the foundation for our impressive growth. This strategy enables remittance senders to match their preferred way of sending wires home using various payment methods, including conveniently located best-in-class agents, or our state-of-the-art digital platform. Turning to slide five, our network of high-quality, high-volume neighborhood agents is the largest and most established distribution channel. Our growing network of highly efficient Intermex agents has been carefully crafted through a lot of hard work that makes it difficult for new or existing competitors to replicate. It is a dominant presence and an exceptional baseline for growth. Expanding our agent network is the key to the company's long-term success, and the opportunity ahead is significant. During the second quarter, the number of Intermex agents grew 11% compared with the same period last year. Within our agent network, there is a built-in opportunity for organic same-store growth. As agents mature from year one to year two, their average number of wires increases significantly. We see the same pattern repeat from year two to year three, and again going into year four. So as you can see, our retail business is growing vigorously and profitably. We are confident that that pace of growth we are achieving is sustainable over time. We're expanding the retail side of our business through surgical-focused efforts to recreate highly productive retailers in unserved and underserved zip codes. This highly targeted recruitment of retailers places our agents conveniently and efficiently where the business is being transacted. We have identified over 1,800 zip codes in the U.S. with populations of 2,000 or more foreign-born Hispanic residents where an Intermex agent is not conveniently located. We have also identified an additional 1,000 zip codes where we do not have an optimal agent presence to support the population of potential customers. Our market research and experience tells us most of our current and potential customers prefer to do business in person. We believe 90% of Intermex customers are paid in cash or by paper check, and many of these customers are unbanked. They use our retail channel because it is easy, convenient, and safe for them to stop at a local retailer on payday to send money directly home to their loved ones. It is more than just convenience, though. It is a matter of trust. Banks are not always welcoming or cost-effective solution for our customers, so many prefer doing business in their community at retail stores with a merchant they know and are comfortable with. A retailer speaks their language and understands their culture. That said, we're seeing a growing number of Intermex customers turning to their smartphones or other electronic devices to wire money home as they choose alternative benefits provided by using our state-of-the-art mobile app we launched earlier this year. The app combines the best features of choice and ease of use. For example, customers can select between the best transaction fee speed of delivery, or exchange rate to suit their preferences. Staying ahead of the consumer demand for digital remittance channels is another of our key strategic priorities. Demonstrating that commitment to expand our digital capabilities on slide six, we recently added a senior level executive to our leadership team to help build this important part of our business. Marcelo Theodoro joined our company as our chief digital officer, coming to us from XP Incorporated, where he was the EVP and head of business units focused on the company's digital and card products. Before that, he was a global head of digital products and solutions for MasterCard worldwide. We're fortunate to have Marcelo's expertise on board. We will rely on him to oversee our digital initiatives and further develop our card products, including our general-purpose reloadable card. The challenge for our customers, though, is not access to technology. It is being unbanked. And our GPR card is designed to provide an alternative to bridge that gap. Marcelo will take the lead in empowering our consumers to participate in e-commerce economy, providing with more opportunities for inclusion. He will be building our digital business on an innovative and highly scalable technology that already sets us apart from our peers. Pure world-class customer service is another point of differentiation for Intermex. Whether our customers are wiring money in person or using our digital platform, they know they can rely on us to help them complete their transactions easily, safely, and efficiently. Backing that commitment to customer service is our call centers. We have 600 highly trained customer service reps on staff who are available to help our retail agents and our customers on a moment's notice. It routinely takes us five seconds or less to answer the phone with a live person with a customer or an agent calls. Even on Mother's Day, while some competitors were apologizing for excessive hold times due to the increased volume, with some hold times running as much as 20 minutes or more, we continued to answer our phones in five seconds or less. That is important to our partner agents in thousands of retail locations across the country who value how quickly and efficiently they can deliver service to their customers. It is also important to our customers who are venturing onto a digital platform to complete transactions on their own. If they have an issue, they can call and in seconds be talking to a person who speaks their native language. With this emphasis on service, we put the customer in charge. It's a powerful combination. Our best-in-class technology combined with our best-in-class customer service delivers the highest level of service to our customers in the remittance space. Turning to our global expansion efforts on slide seven, let me give you an update on the national acquisitions. We're working through the necessary regulatory approvals at the state and country level. We expect to close the transaction during the third quarter. We will let you know as soon as the deal is completed. With the completion of the transaction, Intermex will be a market leader in all top five Latin American Caribbean markets, adding the Dominican Republic to the list. The DR, along with Mexico, Guatemala, El Salvador, and Honduras, collectively represent 83 percent of all money sent to the region from the U.S. In aggregate, we'll have more than a 21% market share in these five key markets. Acquiring La Nationale and land holdings will also enable us to enter the European remittance market for the first time, expanding our global reach from 28 to more than 70 countries. In summary, we expect Intermex to continue to grow faster than the high-growth market in which we compete. We will continue to win with our retail and online business because we have developed through our metrical approach the most productive agent retail network in the industry, complemented by industry-leading technology and outstanding customer service. There continues to be significant positive momentum for Intermex and our shareholders. With that, I will turn the call over to Anders Bendi, our Chief Financial Officer, to provide more context around the strong results we reported this morning."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Bob, and good morning, everyone. The positive second quarter results we reported this morning affirm the clear competitive advantage we've created for Intermex. Intermex stands out as an innovator and leader in the FinTech and remittance sectors, thanks to our efficient business management and intelligent investments in people, products, and technologies. We're delivering consistently strong results and sustainable growth as we expand the company's footprint in the US and globally. Building off yet another quarter of strong agent growth that Bob mentioned earlier, on slide eight you can see the number of unique active Intermex customers grew 15% in the second quarter. The growth in customers in turn generated a record 12 million remittance transactions, 18% more than a year ago. Contributing to the growth in total remittances on slide nine was a 170% increase in digitally originated transactions as customer acceptance of our new mobile app continued at a triple-digit pace. 26% of our transactions were sent or received digitally during the second quarter, demonstrating our commitment to omnichannel and meeting the needs of our customers however they choose to transact and with exceptional customer service. On slide 10, this record activity in the second quarter resulted in a 22% increase in the principal amount transferred, over $5 billion for the three-month period. the average remittance amount continued to grow by 3% versus a year ago to $447 per transaction. With the strategy of capturing share through efficiency, technology, and service, the company has continued to grow faster than the markets in which we compete. We now have a 22% share in our primary four markets, which account for 75% of all the money transferred from the US to Latin America. To reiterate, those markets are Mexico, Guatemala, Honduras, and El Salvador. And as Bob mentioned earlier, La Nacional brings to us primary market number five and will make us a market leader in the countries representing 83% of the US outbound money transfers to Latin America. As shown on slide 11, agent growth, customer growth, and increased send size all contributed to a 17% growth in revenue, which reached $137 million during the second quarter. We continue to be laser focused on unit economics and our cost structure, leveraging our growth to efficiently manage banking and payer fees on a per transaction basis. Additionally, our goal digitally is to pace our spend around our app and online offerings to match or stay ahead of customer acceptance for our markets. We believe in rational unit economics and keeping a tight pulse on consumer behavior, so we prudently allocate our spend wherever we believe the economics best support it. As a result of the strong top line growth and ongoing operational improvements, second quarter net income grew 21% to $16 million. Lower depreciation, amortization, and interest expense also contributed to improved net income for the quarter. Additionally, as in the press release, the quarter also benefited from an $800,000 refund for state business and occupancy tax. Turning to slide 12, adjusted EBITDA increased 19% to $28 million and adjusted net income increased 20% to $18 million. Both of these measures benefit from revenue growth, operating efficiencies, and strong cost management. Turning to the balance sheet on slide 13, Intermex continues to be an efficient operator and strong generator of cash. The company ended the second quarter of 2022 with $114.6 million in cash and an undrawn revolver position of $150 million. We always underscore that these positions cycle a lot depending on the day of the week of the close, but any way you slice it, we sit in a great liquidity position. The balance sheet is in excellent shape. Net free cash generated, our internal measure which removes balance sheet cyclicality, remains strong with over 60% of EBITDA converted to cash. Turning to our buyback program, we accelerated the buyback pace in Q2 and repurchased 504,000 shares for $10 million. That brings our total since we launched the program to 1.1 million shares for $19 million. We've been acquiring opportunistically, and at an average price of $17.95 per share, the program has been an excellent use of Intermex Capital. We have about $21 million left under the existing board approval for the program. We're also looking forward to deploying capital to close the La National acquisition in Q3, which we expect to do with cash on hand. When the acquisition closes, we'll provide more color on the price and how the acquisition will impact the company. We're excited about the acquisition and how it will strengthen our market leading position in Latin America while opening the door for us in Europe. We expect a positive return on this investment for our shareholders. As you saw in the press release, we've adjusted our full year guidance upward based on the strength of our second quarter results, combined with the operating efficiencies we've achieved. As you see on slide 14, we're raising our guidance for the year. We now expect revenue to be in the $542 million to $551 million range, net income of $60 million to $61 million, adjusted net income of $68 to $69 million, and adjusted EBITDA in the $104 to $106 million range. So great momentum for Intermex and for its shareholders. With that, I'll turn it over to the operator for questions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. We will now begin the question and answer session. To join the question queue, you may press star then 1 on your telephone keypad. You'll hear a tone acknowledging your request. If you are using a speakerphone, please pick up your handset before pressing any keys. To withdraw your question, please press star then 2. We'll pause for a moment as callers join the queue. Our first question comes from David Scharf of JMT Securities. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Good morning, everybody. Thanks for taking my questions. Hey, Bob, I was wondering if you can give us an update, particularly as it relates to the runway of growth that you highlighted at newer agents. Is there a vintage analysis in terms of what percentage of your installed agents are both under 24 months old and under 12 months old to sort of give us a sense of how much near-term organic opportunity there is there?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "David, I'm going to turn that over to Randy to answer."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure. Yeah, hi. Good morning, David. Yeah, we look at our agents in terms of cohorts, and we know at any point in time we've got a trailing 12 new agents versus the same store agents, and it's right around 15% of our agent base would be new, and that's increasing each month, each quarter, as we have put additional resources primarily in the western United States to help us build out the infrastructure there. And as Bob said, most importantly, that as new agents move from the trailing 12 into same store agents, 13 months and more, their volume will double between months 13 to 24, and then months 24 to 36 get a nice bump again. So we really get about three years of nice growth from the agents that we ask. Got it, got it."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "We have increased our activity. We put more people in the field as what we call regional sales executives, which are people not dedicated to a specific district who are adding to and filling those empty or underserved and unserved zip codes. So we expect that that investment, which we've been making, which has been easily, you know, sort of managed through our upturn. So you're still seeing us continuing to grow that bottom line EBITDA and net income, even though we've invested in more people in the field. And the seeds from that really don't start to blossom for two or three quarters as those agents start to ramp up. And then again, that volume almost doubles in year two, and it grows again in year three. So there's an investment that's there, that we expect to reap the benefits of in future quarters that we've been making this year so far."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. So just to be clear, the 15% that you noted, Randy, those are agents that are, you know, basically one through 12 months. It's before they've reached that kind of 13 to 24 that Bob just noted sees such a big ramp."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, yeah, yeah. So the way we look at it is, New agents are agents that have been with us 12 months or less, and I just did the math. Right now, it looks like about 20% of our agent base has been with us less than 20%. Oh, sorry, less than one year, 12 months."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, got it, got it. And related to that, I mean, you're obviously very, you know, it's a high-touch model in terms of the agent relationship and communication monitoring. Are they, you know, do you get feedback from them about... you know, on the ground what they're seeing as the sources of growth? I mean, you know, do they communicate specifically perhaps what other vendors, because obviously there's no exclusivity, you know, what other remittance competitors you're primarily taking share from at their locations, or is it entirely foot traffic? Any color that the agents are actually providing you so we could better understand how you're, you know, outpacing industry growth so much?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I think there's a couple things. One is that, as you know, the industry has and continues to grow. So there's growth there. Our best source, though, for who's doing well and who's not doing so well tends to be more the payers because that's not anecdotal. It's universal. They deal with all of the remitters, and they have a sense about who's growing and who is not. There are companies, we won't name names, in both the smaller folks who are struggling, and then we know some of the larger companies who have their model we've seen has not necessarily yielded growth over the years. Now, that growth doesn't come exactly one for one. The market leader, some people would think of it, the yellow and black, does a lot of business in big box stores. And that business, as I've always said, has moved away from big box stores year after year after year. So it's not necessarily that we take it directly from, say, a Western Union in retail. People are leaving the big box stores and they're coming into the convenient locations in the neighborhoods where we've done an excellent job of executing because we understand that the number of foreign-borns that live by each zip code. So in doing that, we have that waiting agent, the best agent possible for us in that neighborhood. We do that whole selection process to make sure we have the best agents, that on-site business review. All of those things are what contributes to our outsized performance. But I would say, you know, who's losing in terms of market share? There are some people that are bigger than us. you know, overall bigger companies anyway. And there's some of the smaller guys that are struggling. It's not universal. There's some smaller guys that are doing pretty well. But it's not universal that, you know, it's all coming from the large providers, public providers, and all going to the small guys or vice versa."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. And, you know, maybe last kind of follow-up to a different topic. I'd be remiss if I didn't ask you about – you know, future capital action plans. I know there's still, uh, capacity left on the existing authorization, but, but more broadly, um, you know, and I think this was, you know, it was sparked in my mind because I think it was mentioned in the press release about a scheduled debt repayment and, you know, setting aside the high free cashflow conversion, 60% of EBITDA, um, you know, your, your, your balance sheet, even after this acquisition is, you know, under levered, I mean, it's negative net debt effectively. And, you know, is there a target debt to EBITDA ratio that you think of business like this, you know, could and should support on a sustainable basis and maybe related to that. I have to believe that your revolver covenants have a, a ratio like that defined? And I'm wondering if so, you know, what that limit is, if that gives us any window into ultimately, you know, how much debt for, you know, capital actions above and beyond EBITDA or potential."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, David, this is Andrew. So I'll take that one. You know, I would say that we don't have a target. I think that we, you know, feel that all comfort to move to utilize the debt portion of the balance sheet a bit more. You know, I would say that our comfort levels, you know, above two and a half times probably start to wind down a bit. So if that gives you some goalposts to work with, you know, I think that we don't have a lot of appetite above that or getting near the three range. But, you know, that's where we stand right now, but we don't have any hard and fast targets. Perfect. That's very helpful."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you so much."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And I think we wouldn't push the debt in a way that we didn't have a great use for that right now. We're funding our growth very easily. As I said, we made a strong investment in making a big investment in our digital and card. We made a strong investment at our retail, more people out in the field. We continue to look and be vigilant towards potential acquisitions. We felt like La Nationale was a perfect acquisition for us. There could be others. It's our intent to find more, but what we won't do is just buy things that could not necessarily be helpful to our shareholders just because we have cash in our pockets. So that we won't do."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Understood. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our next question comes from Mike Grondahl of Northland Security. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, guys. Thanks and congrats on the results. Could you give us an update on the sales force, maybe the number of sales people out in the field compared to a year ago? And then you talked a bit about new agents and whatnot. How does the pipeline look the next three to six months for kind of continued growth in agents?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah. Hey, Mike. It's Randy. Good morning. Last year, Q2, we probably ran sales feet on the street about low 40s, maybe 41, 42 sales folks. This year, positions probably mid 50s. Now we run, we've always got a few vacant positions, of course, but that's allocated headcount probably low 40s compared to mid-50s this year. With respect to your question about pipeline, we anticipate it's going to be very similar the rest of the year as to what we've seen the first half of this year. I think Bob mentioned we had a record-breaking quarter in terms of number of new retail locations that we added to the network in Q2, and we anticipate we'll see similar type of results the back half of the year."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great, great. And then maybe just two more. Have you seen any decline in average send amount or just really any effects due to inflation, higher gas prices kind of on your end consumer? Are you seeing that?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, Mike, this is Andrus. We get the inflation question a lot. I think that you have to think about who our consumer is, and the typical consumer is somebody who's come to the U.S. to live very efficiently and work and generate as much as they can to send home to their families and eventually return to a better economic situation. So that cohort has benefited very much from an outsized growth of wages, particularly to that consumer base. So we've seen that. I think that's part of what's bolstered the growth in remittance send. When you think about the inflation side from a cost perspective to these consumers, they're not as exposed to maybe gasoline and energy prices as the typical American consumer. They're definitely not as exposed to the the overall goods, like the stuff like basketball goals, bucket, that's an inflation. But, you know, as we have seen that that number start to taper, that growth start to taper a bit in Q2. So we're only up about 3% year over year. I think you're starting to see some impact of that come through. But, you know, we are still growing. And, you know, we'll just continue to keep an eye on it. I wouldn't say it's something that has us you know, worried that we're going to see a drastic shift in principal size cent."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our next question comes from Alex Markgraf of KeyBank Capital Markets. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, Tim. Thanks for taking the questions. Just a couple from me. First, could you expand a little bit on some of the near-term priorities with the addition of Marcelo, just kind of what specifically do you see as the most high-value activities to tackle?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, well, they'll be the same level of activities that we've been. I think no one in the industry, I know you folks have a high opinion of Remitly, but they continue to sort of sink like a rock. And we're not going to participate in a behavior that will continue to have us lose on a unit economics basis. relative to each transaction online. So I think the first company that really understands how to master online the way we've mastered retail, and I don't suggest that we've done that yet, but that's what we will be spending time to do, And that today, regardless of the customer acquisition costs, which are extremely high, the unit economics just do not provide for an opportunity to do well with that business. And so we'll continue to work at that, but we'll work at that in a way that's reasonable and sane so that we can deliver profitability on the online business. The other thing is Marcel brings a huge amount of experience. He worked with MasterCard for years, and we still believe there's a huge opportunity for our card products, particularly in the Hispanic community. And in the Hispanic community, maybe even those folks that are not in the remittance business, don't send money back home. They could be second and third generation, but they still are not necessarily fully banked by U.S. banks. So we think there's a huge opportunity for our GPR card through our retailers. NetSpend's done a great job and others of managing through the big box stores their card product and through check cashers, but that hasn't really touched the Hispanic community well. So we think that's a huge opportunity for us. Today we've made really good progress related to our payroll card, but our GPR card will be one of the top priorities in terms of getting that card out in the hands of consumers as quickly as possible. So it'll be focused on you know, really building the online business, but building it in a key way that hasn't been done so far with a word called profitability. And then secondly, building that GPR part. And I think those are two really interesting verticals for us moving forward."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. And then perhaps one for Randy, just kind of expanding on the commentary around new agent growth. Any way to kind of describe the contribution of new agents in the Western states. I know you all had talked about kind of hitting your stride in the West at the NL state earlier this year. Just, I don't know if you can take it a step further and provide some more color around that commentary, but just curious if you can maybe translate that around, you know, contribution to growth from new agents in the West versus, you know, some of the kind of core regions in the U.S."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, well, I'll answer the question this way. Of the new resources that we've added to the team that Bob referred to, the regional sales executives, two-thirds of those incremental heads have been added in the western US. So as they start to hit their stride and activate new agents, primarily in unserved or unserved zip codes, we'll see that contribution from that team in the west opposed to the resources in the east. So we've already started to see the contribution they've been making this year, and it will continue to grow the back half of the year."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. Appreciate the color. Thank you. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Once again, if you have a question, please press star, then 1. Our next question comes from Timothy Chiodo of Credit Suisse. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Thank you. I want to talk a little bit about your underlying customer and the recession resistance inherent in the model. So I believe that most of the customers sending their remittances, we've talked in the past, they're in industries such as agriculture, construction, services, meaning restaurants, hotels, etc., During the last recession, the remittances were impacted pretty meaningfully into Mexico, but at the same time, it was a very different recession, right? There was a housing downturn. So maybe you could just talk a little bit about how sort of the recession resistance or the stability of the model through any potential recession. Clearly, you're not seeing anything in your results now, which is great."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, which may be even more important, we didn't see much in our results through the last recession. The macro numbers could have been very weak, and we certainly battled through those. But from 2009 through 2015, the industry virtually did not grow much at all, and we more than tripled our business. So a lot of that was taking share, and a lot of it was because some of the competitors had kind of pulled back, and they felt the recession, and they started to take the investment away from retail and away from the things that were really their lifeblood. It isn't dissimilar to what happened during COVID. When COVID first struck, we reinvested and made sure we had our full team out in the field. A lot of our competitors pulled back. And as you recall through COVID, we never had one single quarter where we actually shrunk year over year. Our second quarter was mild growth or modest growth in that first year. But no quarter was one where we actually fell off. So first of all, we think it's an approach. We do think we have a different way of handling that. We think our precision related to the marketplace and our nimbleness and somewhat of our aggressiveness to exploit the way other people will react to a downturn. But I think additionally, we do a lot of business not necessarily in urban centers. And urban centers are where those customers will work in service-related industries and which will have the most kind of impact is there's a downturn. We do a lot of business in areas that are agricultural, and we do a lot of business with our consumers who are working in, you know, construction-related. So they may not be building new homes or new home development, but it could be putting decks in the backyard or working in landscaping, things that sometimes actually do better in a recession because people don't necessarily buy a new home, but they do and fix up their homes. We feel pretty good about the core business. We have a really large sector of our consumers that are in agricultural, and we think that's really resistant completely to recession. And again, if housing starts and the construction industry stays strong, that's really the two-headed beast for us. The service is also sort of there, but we're not as dependent on urban consumers as we are in rural consumers generally, and that really bolsters us related to the agricultural and then sometimes even the housing sort of starts and construction workers."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Excellent. Really appreciate that context. Thank you, Bob. Okay."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Welcome."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our final question is a follow-up from Mike Grundahl of Northland Security. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah. Thanks, guys. Bob a question for you um you know roughly a year and a half or two years ago or even a little bit more you guys started investing in the digital side and while others were going kind of crazy with their digital spend you took a real measured cautious approach and your retail business was growing like a weed and you know, you didn't throw away dollars to get, you know, poor unit economics, if you will. And I think the biggest thing you mentioned a year and a half ago was just the CAC was, you know, a lot to get those customers, a lot of marketing spend, social media, et cetera. Have you seen any narrowing of that CAC in the last year and a half? I mean, is it, is it, still really wide to your retail business? I'm just trying to get a sense if there's been any."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I mean, I think there's two things, right? One is let's sort of reset the expectation, whereas the digital business has grown to Latin America, and that's where we're focused. It doesn't mean we don't service other countries, and certainly with the national business, we'll be, you know, obviously in many more countries, particularly outbound from Europe. But when you talk about our bread and butter today, that business – Even though the percentages of online has grown faster than retail, the absolute dollars of retail have grown much faster over the last 10 years, five years than they have. at online. So there still is a market at retail that adds more absolute dollars than the market that adds absolute dollars in terms of the digital business. So that's number one. So when you do that, you say, gosh, there's a huge business already at retail. It's been de-emphasized by some of the major players, and it's bigger already to start, and it's adding more consumers with less focus on it. So we still think that that business is really easier, lower-hanging fruit than the digital business. Having said that, we're an omnichannel provider. We coined that phrase, you know. I don't know, probably six quarters ago, four to six quarters ago, maybe eight quarters ago, and others have kind of begun to use it now. But we want to provide every option to the consumer that they might want. So on this side of the border, we have digital, and it's growing for us at triple digits. It's still a relatively small piece of our business. But it's certainly growing significantly and it's a real business now. We also have the ability to do transactions at retail, but we have the ability to capture transactions at retail also through debit card. On the other side, we pay out over the counter. We pay out directly to bank accounts. We pay out through mobile wallets. We pay out through ATMs. We're exploring other ways to pay out. So our business isn't to force the consumer into any option. And to me, when a consumer is very costly to drive to any particular option, it seems to indicate to me that there's not a pent-up volume or business waiting there, right? Or it's not hard to sell cold bottles of water in Miami at a festival in August. Hot chocolate might move a little slower. So we are really going to go where there's an opportunity to sell cold water, and that's at retail. At the same time, we're an omni-channel provider. We recognize that there's an increasing number of people that become banked. We're part of leading some of them to be banked. Our payroll card, putting in the hands of consumers, those consumers are now in some cases going to retail and using that debit card, but in some cases they're going online and using the debit card. So from our perspective, that's the way we see it. A lot of misinformation in the market about the costliness of handling a retail transaction. When we put up a retailer in our business, that retailer breaks even for us. in about seven months. It's nothing like that online. You just don't get a payback on that consumer relative to the CAC. Even if you have a CAC that drives down to a much lower percentage than it is today, even at $40, which I would think most companies probably don't have that CAC, if you're making a couple dollars a wire, you need 20 wires from that individual. If he sends 10 times a year, it's two years. At retail, I understand we're looking at a retailer versus a consumer, but after six or seven months, now we've paid for that. And by the way, we paid for them in terms of CapEx. That's just not OpEx. That's everything. So it still is a really great way for us to continue to grow, to continue to be relevant and gain shares. We continue to do in the marketplace. As we continue, no one is in here and this business is turning its back on. We spend probably a... just as much time focused on our car product and our online as we do on our retail business. But our investment today is in our retail business because the return on that is so much higher, and we're obviously trying to drive a return on investment in the short, middle, and long term for our investors. And we think that's the right approach, this omni-channel approach that we've taken."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Yeah, you're clearly executing well, and thanks for that insight."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "If there's no other questions, do we have any other questions, operator?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "This concludes the question and answer session. I would like to turn the conference back over to Bob Lissy for any closing remarks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you all for joining us. We appreciate you joining us for the call today. And we look forward to talking to you all soon and hopefully reporting continued great results. Talk to you soon."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "This concludes today's conference call. You may disconnect your lines. Thank you for participating and have a pleasant day."
    }
]