[
    {
        "date": "2021-11-03T09:00:00-04:00"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Greetings. Welcome to the International Money Express Inc. Third Quarter 2021 Earnings Conference Call. At this time, all participants are in a listen-only mode. A question and answer session will follow the formal presentation. If anyone should require operator assistance during the conference, please press star zero on your telephone keypad. Please note this conference is being recorded. I will now turn the conference over to your host, Mike Galentine. You may begin."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning everyone and welcome to our quarterly earnings call. I would like to remind everyone that today's call includes forward-looking statements including our updated 2021 guidance and actual results may differ materially from expectations. For additional information on International Money Express, which we refer to as Intermex or the company, Please refer to the company's SEC filings, including the risk factors described therein. All forward-looking statements on this call are based on assumptions and beliefs as of today, and you should not rely on our forward-looking statements as predictions of future events. Please refer to slide two of our presentation for a description of certain forward-looking statements. that the company undertakes no obligation to update such information except as required by applicable law. On this conference call, we discussed certain non-GAAP financial measures. Information required under Regulation G under the Securities and Exchange Act with respect to such non-GAAP financial measures is included in the presentation slides, in our earnings press release, our quarterly Form 10-Q, and our annual report, Form 10-K, including reconciliation of certain non-GAAP financial measures to the appropriate GAAP measures. These can be obtained in the Investors section of our website at intermaxonline.com. Presenting on today's call will be our Chairman, Chief Executive Officer and President, Bob Lissy, Chief Financial Officer, Andres Bendi. Also on the call today is Joseph Aguilar, Chief Operating Officer, and Randy Nelson, Chief Revenue Officer. Let me now turn the call over to Bob."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning, and thank you for joining us today. We are proud to announce another quarter of very strong growth across all of our operating and financial metrics. Let me highlight some of these accomplishments on slide three, compared to third quarter of 2020. Revenues grew 26.3%, to $120.7 million. Total dollars sent grew 36%. Net income was $11.5 million, an increase of 21.2%. Adjusted net income of $15.7 million, an increase of 28.3%. And adjusted EBITDA increased 19.8% to $22.9 million. As has been the theme since we have been a publicly traded company, we again generated a record number of remittances during the third quarter, with more than 10.5 million while transferring $4.7 billion for our customers. Underlying this performance, I want to commend the entire Intermex team, both in the U.S. and abroad. The Intermex brand continues to gain more traction each quarter. Our market share increased to a record high in our core markets of Mexico, Guatemala, El Salvador, and Honduras, capturing a share of 21.8% as we grew 40% more than what was already a very robust market. The company's omni-channel strategy continues to meet our customers' needs while delivering strong financial results for our shareholders. We have spoken about it before, but particularly for those who may be new to our call, it is always worth highlighting. Intermex employs a growth strategy that focuses on the consumer and meeting their needs efficiently, effectively, with a constant focus on security and timeliness. We provide choices for our consumers for what we believe to be the best retail and online product and service in the marketplace, enabling consumers to choose whatever is the best method for them to send and for their beneficiaries to receive money. On the send side, we partner with engaged, carefully vetted, top quality group of retail agents located where our customers live and work. Both our agents and Intermex strive to provide the best quality of service in the industry. At the same time, for those consumers who prefer to initiate remittances through their laptop or their smartphone, we continuously work to improve and expand our online digital business offering. Additionally, Intermex consumers can choose to send money at retail by using cash or debit card, or online by using debit card, credit card, or ACH. On the payout side, or receive side, we have thoughtfully assembled a network that delivers wires more efficiently and effectively than ever before, while providing consumers with more options than any other competitor. Our customers and beneficiaries can receive money digitally into their bank accounts loaded on a mobile wallet, paid out in an ATM, or they may pick up cash over the counter at one of our convenient payment locations. Importantly, all of these funds are available in minutes. We believe our strategy is a major differentiator for Intermex, particularly when considering the widely differing demographics of those who send and receive money throughout the world. We believe that the cashed option remains critically important in Latin American corridor, where the vast majority of wires are sent and received in cash. One of the biggest opportunities that remains for the company is our retail digital business. There are hundreds of zip codes throughout the country that are either underserved or unserved by Intermex. This means we do not have a retailer in the zip code, or we have fewer retailers in the zip code than would be optimal. We feel confident that we are in the best position to exploit these opportunities through our best-in-class retail sales force. A disproportionate share of these zip codes are found in California and the western states, and are expected to produce significant numbers of wires. We have a tremendous opportunity for organic growth in the western states, along with plenty of organic opportunity remaining even in our most established states. For the quarter, our agent base increased 13% over the prior year period, with most agents added in California and the West. Our agent growth helped deliver a 19% increase in unique customers this quarter compared with the prior year period. We finished the quarter with 2.7 million unique customers who transferred with us. Our relationship with the 4 million customers who trust and value our service is a tremendous asset for the company. We will be able to market additional products, like our card products, that I will talk about later, and of course, our digital service to these consumers. In the third quarter, our customers sent money more frequently and also sent larger amounts. As I mentioned earlier, we delivered more than 10.5 million transactions, an increase of 23% over the third quarter of 2020. This is also the largest number of remittances ever sold by the company in one quarter, and as a result, our principal sent increased 36%, to $4.7 billion in the quarter. Again, the most the company has ever sent in a quarter. With our expanding agent network, Intermex continues to capture market share fueled by exceptional growth in transactions across our core markets of Mexico, Guatemala, Honduras, El Salvador, as well as emerging markets. You can see illustrated on the next slide. We now have achieved a 21.8% market share in our combined core markets. We did this with a growth rate 40% faster than the total market for this period. Shown on slide six, emerging markets such as Dominican Republic, Ecuador, and Nicaragua, among others, also continue to experience robust growth during the quarter. The one year growth in these markets was similar to that in our core markets. The emerging markets had much more difficult comp versus last year. In total, our emerging markets grew transactions by 23% compared to third quarter of 2020. However, looking past the impact of the pandemic in 2020, our two-year growth rate for the third quarter is 66% for emerging markets and 39% for our four core markets. Both are very strong performances considering the overall market. While growing a very highly profitable base of retail agents and growing remittances at retail much faster than market, Intermex is also continuing to invest in our digital app and furthering our presence online. On the next slide, you will see the continued penetration of a digital online initiative with transactions increasing 71% compared to the prior year period. Based on the definition of some of our industry competitors who define a digital transaction as a transaction where either side of the remittance is cashless, Intermex processes more than 23% of its transactions digitally. These remittances were either initiated cashless transactions on the send side or recital cashless on the receive side. During the quarter, transactions that were deposited directly into a bank account increased 37% compared with the prior year period. Transactions processed through the use of a debit card at retail, although a small percentage of our overall wires, grew at 78% year-over-year. These transactions will continue to increase as the number of retailers who accept debit cards is expanded. Lastly, another key pillar of our growth strategy is our card product category. Cardirect, Prepaid MasterCard, and Payroll MasterCard. We have been enhancing our systems infrastructure to efficiently and effectively support these products while adding field sales and support personnel to expand our presence in the market to drive meaningful contribution to future revenue and profitability growth. Before I turn the call over to Andres, I'll conclude by saying Intermex continues to execute at a very high level. That execution has led to significant gains in market share, strong growth in revenue, adjusted IBDA, and net income. This has all been accomplished while we have simultaneously invested in the future of our company through the development of our new products. Third quarter represents another period in which Intermex has met or exceeded market expectations for revenue, adjusted IBDA, and net income. Having now been a public company for 13 quarters, we have now met or exceeded our IBDA and net income expectation for 13 consecutive quarters. We are confident in our ability to continue to execute our multi-channel plan, which provides and fuels consumer choice, ultimately resulting in the company's continued growth and strong performance in what we believe is a tremendous growth opportunity that lies ahead. With that, I will turn the call over to our CFO, Andrew Spindy."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Bob, and good morning to everyone. Moving to slide eight, let's walk through the third quarter results in a bit more detail. As Bob highlighted, it's been another quarter of strong execution in all areas of the business with plenty of new milestones achieved across our key measures. In the quarter, revenues were up significantly at 26% versus the prior year quarter, finishing at just under $121 million. Behind that strong growth were a few key factors. We had a 19% increase in customer count and a 13% increase in active agents, so our payments ecosystem and network of clients continues to grow and grow. This has helped us drive remittance transactions up 23%. Our customers sent more often in larger amounts, pushing total remittance principal up 36% versus last year. Those larger amounts also produce a revenue tailwind for us from the FX component we earn on those transactions. GAAP net income for the quarter was $11.5 million, up over 21% versus the prior year period. our strong top line was the key driver with lower depreciation, amortization, and interest expense also contributing to a solid bottom line results. These improvements were partially offset by higher salaries and general spending related to new product initiatives like CARD, investment in digital, and enhancements and modernization of our technology. It's worth mentioning that within net income, we did have to work through two unusual headwinds this quarter. One, in line with our technology and software upgrades, We recorded an impairment of about $1 million in the quarter for capitalized software related to code we will no longer utilize. And two, a small banking institution that we used was put into liquidation by the Mexico Bank regulator, resulting in a $2 million reserve for company deposits held there. Excluding the software write-off in the bank reserve, along with other certain non-cash expenses, adjusted net income increased 28% to just under $16 million, which you can see on the next page. Our strong growth in revenues, partially offset by growth in operating expenses, drove adjusted EBITDA up 20% to 23 million. Adjusted EBITDA margin for the quarter was 19%, our second quarter in a row of 19% plus margins. A year ago, margins were higher, although at that time, we were benefiting from an extraordinarily lean stretch of cost management as we're managing through what was still a great deal of uncertainty from COVID. Those savings last year accentuate this year's investment in digital card and the retail front end, all of which position us well for 2022. Moving on to slide 10, given the strength of our third quarter results, our execution trajectory, and an incredibly valuable and growing payments ecosystem, we're again increasing our full year 2020 on guidance for revenues and adjusted EBITDA, and narrowing our net income and adjusted net income ranges. We now expect revenue to be between 450 and 455 million, gap net income between $44 and $45 million, adjusted net income between $52 and $53 million, and adjusted EBITDA between $84 and $85 million. We continue to balance revenue growth and profitability while simultaneously investing for the future of our company, especially in technology, talent, and marketing. Our expectation for a strong finish to the second half is allowing us to accelerate many of these investments and position us for what we feel will be another standout year in 2022. With that, let me turn the call back to the operator for questions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. At this time, we will be conducting a question and answer session. If you would like to ask a question, please press star 1 on your telephone keypad. A confirmation tone will indicate your line is in the question queue. You may press star 2 if you'd like to remove your question from the queue. For participants using speaker equipment, it may be necessary to pick up your handset before pressing the star keys. One moment, please, while we pull for questions. Our first question is from David Scharf with JMP Securities. Please proceed with your question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Good morning, everybody. Thanks for taking my questions. Terrific results again. And, Bob, I guess, you know, first question, just it's really more macro commentary or speculation on your part. You know, some of the larger providers or Western Union and MoneyGram have both kind of remarked. that, you know, demand didn't come in quite as strong or the outlook is expected, largely a function of the Delta surge and supply chain issues. But they actually called, they did call out Latin America as sort of one of the few bright spots. So definitely in the right place at the right time. Is there anything in particular we ought to be focusing on either in the headlines or just paying attention to on your biggest core markets. You know, just kind of curious whether or not this kind of growth can be sustained, if there are any sort of macro headwinds on the horizon we should be paying attention to in your biggest corridors."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So, good morning. Thank you for the question. I think that the first thing is I'd like to say is be careful when you look at You mentioned Western Union, so I'll follow suit with that. When you're talking about the Latin American corridor, they're usually referring to that as inter-Latin America. So they're not referring to U.S. When they talk about U.S. headed to Latin America, they're talking usually about U.S. outbound. So that's just one thing. And in some of the – I'm not an expert on anyone else's business, but in some of our competitors, they suffered such a downturn in internal Latin America last year that being really in the throes of COVID, that they're lapping very, very easy numbers. So you might want to look at the two-year trend on those. But enough said about others' businesses. We want to focus on ours. That's what we do. We're not seeing any real challenge that hasn't existed before. It's all about our execution. It's about our superior technology at retail, our selective process for picking retail agents. It's about knowing where our customers are, providing the very best service in the world for them, picking up our customer service line in four seconds. Consumers continue to move towards our brand. Some of the larger competitors you mentioned really are not necessarily even in contention where those consumers are because they do business through large box stores and they haven't really modified their model over time. So all of those things have been working for us. We don't see anything on the horizon that looks like a huge reversal. Obviously, no one can look at the future and continue to project 25% revenue increases. And as you heard from our discussion, we now are talking about our – keep in mind, we talk about our growth in transactions. When you look at the two-year trend, it's equally or even more spectacular because we had a good third quarter last year. So you look at two years, we've grown our core market almost 40%, 39% plus. two years over, you know, 21 over 19. Our emerging markets are up 66%. So we continue to have consumers choosing at retail and also choosing online. Our online business is growing. And that's just a factor of all those conditions that I talked about. So we're not seeing anything that would indicate this is a temporary situation. At the same time, we're not about ready to state that 25% revenue growth is going to be into perpetuity. Obviously, that's a tough one to continue to attain forever."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it, got it. I appreciate the clarification. Hey, one follow-up. You had some brief comments on kind of card direct. We've been hearing for a number of years. kind of plans to roll out prepaid products either at retail or with employers. Can you give a little more granular update on kind of where you are on that front?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, well, we have been rolling it out with employers. We don't talk a lot about it as we don't most of our anything, even our retail money transfer business. in great detail, particularly a new sort of vertical for us. But we've been rolling it out. We're building a sales force that rolls up underneath Randy Nielsen, you know, as our chief revenue officer. We've got folks in the field now selling to employers the payroll card. And as you know, we feel like we've got a little bit of a shortcut to those employers since we process those checks. We're not a check cashier, but we process checks through our check reconciliation for our product. So we know who are the employers who create a lot of checks that end up at our retailers. So that's really underway, and it's growing for us nicely. The second piece of that is a retail card product, which is more a general purpose card that can be converted into a MasterCard or a MasterCard debit card in the long term with the individual creditors. reusing it, reloading it. And that will be rolled out sometime in fourth or early first quarter. We haven't really picked. There's just a lot that goes on around the holidays and stuff like that. So those are doing well, and we think that they'll be – they're important because they're a bridge product. A lot of our consumers, as we talked about for years, have not really been empowered with the ability to do transactions in a cashless way. So we believe that we'll also empower a lot of our consumers to be able to, if they choose, to go online and access our online product, but also to access sending transactions from retail through a card-based, debit-based transaction at retail."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. Great. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our next question is from Mark Palmer with BTIG. Please proceed with your question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yes, thank you. Good morning and thanks for taking my question. Excellent quarter again. If you could talk a bit about capital allocation priorities. You've now got over $125 million of cash on your balance sheet. You've got the full access to your credit line. What are you seeing in the environment in terms of opportunities for potential acquisitions and And barring that, what are you thinking with regard to deployment of some of that cash?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I think I'll answer your question first about, you know, what are we seeing in terms of opportunities. We've been very active on the M&A front, recognizing that, you know, our kind of underlying financial discipline, we're not going to put ourselves in a position where we're going to either overpay or overlever. And there's a lot of that going on in the market. So we're having to be very selective. But I'd say we're being very active. You know, we've been in connection with a lot of avenues that would work for the company. You know, and we'll be able to share more soon. But I think that, you know, we like on the M&A front. We like, obviously, you know, our core and what we're excellent at. You know, we like opportunities to expand there into markets where we're not as penetrated and we want to be. Also, where we have opportunity from an outbound perspective from the U.S., where there are markets, particularly west of the Mississippi, where we may be able to acquire into and have more of a presence. Those are kind of top of mind. I think in addition to that, there are a lot of adjacencies in our space where we have opportunity where it synergies where they could be either from a technology perspective, a customer perspective, or a product perspective, but are not exactly what we do, but there's enough overlap where we would see a lot of benefits. So I think from an M&A perspective, you know, that's first in line. You know, I think you would have noticed the share buyback that we announced this quarter, and what I would say about that is have to kind of take that in conjunction with what we announced earlier this year in terms of the refinancing. that was all around flexibility. So we had a much larger credit line with much better terms. That's what we did earlier this year. And then this last quarter, we took a look at creating the flexibility for us to return capital to shareholders when it made sense. And so we have the buyback program there. It's of a size that's meaningful, and I would say that we are and will be opportunistic in terms of when and where we activate that buyback. We have been talking about a buyback with the board for some time, and I think after the last quarter when we really had out-of-the-park results and we didn't necessarily see the market react the way we expected, we just realized as a board and a company that there was a lot of value there, and initiating a buyback made sense."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. I have one more question. which just pertains to the pricing environment. And Bob, you had said that you're not really seeing some of the challenges in your business that we've heard about from others in the space. What do you think on the pricing front?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Excuse me. I think we're seeing relatively the same as we've always seen. There's always going to be a pressure point And I'm going to talk about retail primarily right now. I assume that's where the question is directed towards. We're always going to see the small guys that are desperate in certain regional areas be aggressive related to both agent commissions and discounting in the form mostly of increased exchange, increased pesos, increased quetzals per dollar. But I don't think it's heightened at all. I think it kind of comes in ebbs and flows, and it's hard for some of them to sustain because some of them have gotten to a place where, based on scale, that's really difficult to discount. So we're seeing, you know, our margins. Now, some of that is buoyed by the fact that we've had higher principal amounts, but we're seeing really good solid margins, particularly in our core, particularly in our markets where, there is an exchange component, which would be primarily Mexico and Guatemala. So price compression for us is something we deal with, but not in a way that is hindering us from driving profitability or continuing to drive the everyday margins that we'd like. Randy's here as well, and I don't know if, Randy, if there's anything you want to add to that."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I would just add that To Bob's point, we feel it every day from the little, smaller companies, but our sales team, I think, is very, very good at selling through that and talking to our agents and consumers about all the other solutions and benefits we're bringing so that we don't have to compete on price or take part in the price compression."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you very much."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "As a reminder, if you'd like to ask a question, please press star 1 on your telephone keypad. Our next question is from Timothy Chiodo with Credit Suisse. Please proceed with your question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks a lot for taking the question. Slide 7 and the comments there I thought were really helpful and I think you very accurately called out that the definition of digital send can be different across platforms and sometimes it includes in-store on one end of that or in-person in cash. The mix that you shared of the 23% in Q3 for total digital as a send or receive, are you able to provide any context on the portion of those that are digital on both sides? And then as a brief follow-up, just any comments around the marketing approach for the online customers, how that might differ, how you plan to expand those efforts? Thanks a lot."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I mean, we won't disclose in great detail. I'll give you a little bit more around it that the bigger part of that, the bigger share of that is transactions deposited into bank accounts on the other side of the border, which would be considered digital because they're digital on one side, cashless on one side. So that would be the bigger part of that. We're not really and haven't really disclosed, you know, the different components of that, but that's the bigger side of it. What was the other part of the question?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "The marketing approach for online transactions and clearly how it differs and your approach to attracting customers."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, I think the online approach differs in many ways. Our conduit to the consumer at retail is through the right retailer in the right neighborhood where we know consumers are and we know competitors are, so we know wires are there. And it's about us being in that same area with a very superior product that differentiates itself. So it's really simple, and the customer acquisition cost is much lower. We've talked about that before, and I won't go into the numbers on that. On the online side, it's very much an online social media marketing kind of product. Today we don't really market to our existing customer base, which we talked about quarterly how many people that is. But on an annual basis, that's over 4 million customers. And today, because of the vibrancy of our retail business, because it's been growing revenue at 25% thereabouts year over year, we're not going and trying to convert those consumers. We're bringing consumers to online separate and apart from that. There's a couple of things that we're doing that we won't disclose and how we'll market to consumers who have been at retail. But again, we're not going to try to market to our retail customers that are customers of our retail agents and bring them to online. We never really think that's a productive process. We think that we offer, as we speak about often, the omni-channel approach. Our approach is not to try to force people into actions that may not be in their best interest. or at least what they want to do today, or in the best interest or what wants to happen from their receiver south of the border. That's why we offer things like mobile wallets and over-the-counter. and bank deposits and credit cards, debit cards accepted at retail. So from our perspective, the way that we'll market to our online business is very much through social media and online marketing. And there's a real process for that. There's been a lot of people doing that, not just with remittances, but all kinds of online. And there's a great history of that. And a lot of agencies out there to help us, we've picked a really good company to help us with that marketing, and that's the way we'll bring people today, at least initially. If we start to see a degradation of retail, and for those that have their concerns about that degradation of retail, we're not seeing it now. I mean, 25% growth in revenue in the quarter, 39% growth, two-year growth in our transactions. For our core, 66% growth in our emerging markets. If we start to see a degradation, our approach would modify. And our approach would be more aggressive towards the retail consumer. But today, the retail consumer is more profitable than the online consumer by far. It's one of the reasons when you look at some of the folks that have recently gone public that their profitability isn't near what the people that are retail is. So we're not trying to convert people to online who are not ready to be online, incur that extra cost to bring them there, and then drive that lower profitability. margin per transaction today that would be part of that so the approach will be very much those that are there and shopping for online we want to be very much a strong competitor in that process and we'll continue to go after them in that traditional online marketing way going against the other online providers excellent thank you for all that context we appreciate it thanks"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our next question is from Alex Markgraf with KeyBank. Please proceed with your question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, Tim. Thanks for taking my question. Can you talk about some of the progress with the upgrades and enhancements around your IT infrastructure? Just maybe provide some detail as to what exactly has been done to date and some of the benefits that you're seeing from this, some of the early benefits. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "We have a number of projects, and I'm not sure what you're focused on exactly, and I'm not sure what we may have told you. Can you give me a little bit more specific? I mean, you know, we're in the process of updating our core product at retail, both software and hardware. We're in the process, final stages of our new application online that is in testing now and will be available soon. To our consumers, as a very big upgrade to our online app, it'll be a native app, probably either late in fourth quarter or early first. So we have a number of things that are going on. Over the last few years, we've probably tripled our spend on technology, both in-house and with vendors on the outside. So it's a huge focus for us. We've always been, if you take away for a minute and not think about the new frontier of online. And I'll deal with that in a second. But when you think about retail, we've always been the cutting edge guys, the fastest, most reliable technology, the easiest to use. And that differentiator, we are working hard to continue to keep with our new upgrade of all of our core business at retail, again, along with a big upgrade for all of our top agents with new hardware at retail. And then when it comes to the online business, We're in the final stages, really in the testing stages internally of our new native app, and that will be rolled out either late this quarter or early next quarter for our consumers, and we think that will be a best-in-class. We think that that provides us the combination that's rare in the industry today, our world-class back-end with a front-end that competes very handily with anyone's. We've had time to be able to look and observe and look at what we think are the best factors relative to the online business, and we've been building that into that app. And we're going to combine that with the fact that when you actually dial our customer service and other things like that, you get somebody before you get tired of waiting, like in four or five seconds, which is not what you get with probably any other provider, but especially the online guys."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And Alex, this is Andrews. I would just add it's less exciting, but obviously, you know, we're investing in cybersecurity as well. You know, that's something that's top of mind with us and investors, so we're putting appropriate money to work there too."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Yeah, thank you. No, that answers the question. I appreciate the detail."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our last question is from Mike Grondahl with Northland Securities. Please proceed with your question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, guys, Mike, congratulations, too, on another strong quarter. Bob, any expansion or updates on the Salesforce? Anything to call out there?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I'm going to ask Randy to answer that, and I'll add some color if needed. But, Randy, you want to go ahead?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure. Well, good morning, Mike. We've had several upgrades in terms of sales leadership positions that we're thrilled about over the last few months. We've, as Bob mentioned in his opening comments, we've identified literally hundreds of unserved zip codes around the country. We've basically conjoined took taking those zip codes and made them districts and hired now 13 additional sales folks to work those unserved districts. So we know there are hundreds of agents opportunities in those zip codes, thousands, hundreds of thousands of wires that we're not reaching today, those consumers, because we didn't have the agents in place. So with that additional sales team, We've added them in September, a couple of them in October, and we're out of the gates really quickly here in terms of their contributions and what they're adding to our agent network."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "That's great to hear. Bob, any thoughts or insights just on 36% principal growth? How do you think about that going forward?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, you know, part of that is buoyed by our transactional growth, right? Part of it is that some of the countries that grew faster are countries with higher principles, so there is some movement, right, some shifts change there. But another piece of it is that the economics of remittances have changed a bit. You know, the average remittance has gone up, particularly in our case. We've always been a company that is at the higher end of the average principal amounts. We think that's partly due to that when someone is sending a larger amount of money, I'm not talking about ones that are, you know, raise flags, but, you know, five, six, seven hundred dollars, that those are the ones that we get because of the surety that it gets there on time and we've got great customer service and all the rest of it. But there's clearly a component that's there based on the economic conditions and based on the that have been out there, it's hard to pinpoint what percentage of our consumers have benefited directly, but I believe they've all benefited directly or indirectly. What I mean by that, they may have been recipients of a government stimulus, but if they weren't, they worked for someone that was the beneficiary of a government stimulus. Somebody got an X number of dollars and decided to finally put the deck on the back of their house or do the landscaping or whatever. So the economic activity has been greatly increased. We also have a bit of a thought process that says that as our economy has heated up, at least in terms of activity and in terms of, you know, cash in the system, some of the recipient countries are still lagging and suffering a bit from COVID or the, you know, second wave or Delta or what have you. And as a result, there's a greater need that exists south of the border and more cash north of the border. So that's buoying that average send amount. But behind that, let's not lose sight on the fact that there's tremendous transaction growth that's also there that's driven that 36% amount of principal growth. We don't necessarily rely on that. As you see, a lot of the projections that we've had over time are kind of modified. But now we've started to see that now for a succession of quarters, and typically in the past, we haven't seen that come back to its origins. What we've seen is a plateauing, and that's what we probably expect, although we're not depending on that as we project our future numbers."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. Got it. Great. Well, hey, congratulations again. Thank you. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. We have reached the end of the question and answer session, and I will now turn the call over to Bob Lissy for closing remarks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you all again for joining us for third quarter. We look forward to talking to you, well, not too soon because it'll be fourth quarter, so it'll be next year. But thanks again for your time and attention. We'll talk to you soon. Have a great day."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "This concludes today's conference, and you may disconnect your lines at this time. Thank you for your participation."
    }
]