[
    {
        "date": "2021-03-10T08:30:00-05:00"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Greetings, and welcome to the International Money Express Inc. fourth quarter and full year 2020 earnings conference call. At this time, all participants are in a listen-only mode. A question and answer session will follow the formal presentation. If anyone should require operator assistance during the conference, please press star zero on your telephone keypad. Please note this conference is being recorded. I will now turn the conference over to your host, Mike Gallanty, Vice President of Investor Relations. You may begin."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning, everyone, and welcome to our quarterly earnings call. This conference call includes forward-looking statements, including our 2021 guidance. Actual results may differ materially from expectations. For additional information on International Money Express, Inc., which we refer to as Intermex or the company, please refer to the company's SEC filings, including the risk factors described therein. We should not rely on our forward-looking statements as predictions of future events. All forward-looking statements on this call are based on assumptions and beliefs as of today. Please refer to slide two of our presentation for a description of certain forward-looking statements. We undertake no obligation to update such information except as required by applicable law. On this conference call, we discussed certain non-GAAP financial measures. Information required by Reg G under the Securities and Exchange Act with respect to such non-GAAP financial measures is included in the presentation slides for this call, in our earnings press release, and our annual report on Form 10-K, including reconciliation of certain non-GAAP financial measures to the appropriate GAAP measures. These can be obtained in the Investors section on our website at intermexonline.com. Presenting on today's call will be our Chairman, Chief Executive Officer and President, Bob Lissy, and Chief Financial Officer, Andres Bendi. Also on the call today is Joseph Aguilar, Chief Operating Officer, and Randy Nielsen, Chief Revenue Officer. We now turn the call over to Bob."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning and thank you for joining us today. We have a lot of great information to share with you and we look forward to answering your questions following our prepared remarks. The past year has been an unprecedented period of challenge and change and a set of events that none of us ever imagined experiencing. While people and organizations are tested through this kind of once-in-a-lifetime experience, much can be learned about the quality, stability, and resiliency of those people and organizations. I'm proud to say that I have never been more appreciative of or grateful for our agents, consumers, and employees than during the challenges of the past 12 months. In large majority of cases, our agents continue to be open for business throughout the pandemic to serve their communities and the needs of our mutual customers. Our customers, many of whom deemed essential workers, continue to work every day, in many cases risking their health in the process to provide for critical and essential needs of their families in their home countries. During this time, our employees stayed focused on what we could accomplish through innovative and modified work practices while supporting our retailers and delivering continued excellence and service to our customers. Simply said, when COVID-19 arrived, the strong foundation on which our company has been built, along with our nimbleness to pivot quickly, delivered industry-leading growth throughout this extremely challenging and unprecedented time. We take our responsibility of providing a critical service to millions of hardworking individuals who sacrifice so much to provide for their families very seriously. We provide a critical service that millions of people rely upon to provide for basic needs such as food, shelter, and medical care for their loved ones back home. Our agents are carefully screened as we're seeking retailers who share a passion to deliver for our customers. Once the agent becomes part of the Internex team, they are treated with respect and dignity. They're viewed as our partners. We support them in every way possible to provide the best service for our mutual customers and serve their communities with pride. We do this by providing our agents with solutions for their business through state-of-the-art equipment, technology, and world-class service. Our customers are at the center of all we do, and we aim to provide industry-leading service on every transaction. We achieve this by providing the best customer-payer network and service experience in the industry. Lastly at Intermex, we value our employees and we have created an environment in which they can and will excel. We ensure that they have the tools and support to continue to perform their jobs at an exceptional level, even during these trying times. We feel we have created a strong bond with our employees. We are not forced to rely on layoffs or pay cuts during 2020, as some of our competitors did. We recognize that there likely would be a service shortfall related to our competitors. Instead of contracting during the pandemic, we quickly adjusted our efforts to enable us to continue to aggregate market share by mobilizing our sales team to expand their reach with our retail network remotely. As a result, we continue to grow revenue and remittances throughout the year. This business philosophy is the foundation the company is built upon, and I believe it's what enabled Intermax to have such a record year and exceptional fourth quarter while others struggled. Let me highlight on slide three some of the full-year 2020 metrics the company achieved. Net income grew 72% to $34 million. Since 2018, net income has increased by 350%. Adjusted net income grew by 30% to $42 million. We increased adjusted EBITDA by 19% to $68 million in 2020. And over the last three years, it has increased by 105%. We grew revenues 12% to $357 million despite the effects of the pandemic, especially in second quarter. Since 2018, we have increased revenues by 66%. These results were driven by our hybrid strategy of continuing to grow our targeted high-quality, high-volume agent network, along with making disciplined, cost-effective investments in new products. These investments include our digital apps, card products, and expanding our send and receive markets. Throughout, we continue to provide the highest quality of service in the industry. Our results in fourth quarter were even more spectacular on slide four. Net income was $10 million, an 80% increase compared with prior year period. Adjusted net income of $12 million, an increase of 54% over the prior year period. Adjusted EBITDA increased 32% to 19 million, and revenues grew 19% to 99 million. These totals in revenue, net income, adjusted EBITDA, and adjusted net income are all quarterly records for us. This is an amazing performance given today's environment. On the next slide, you will see that our peer-leading financial performance has been fueled by our strong growth in transactions, both in our core markets as well as our emerging markets. In fourth quarter of 2020, we produced the best quarter ever for remittances, producing 9 million net transactions. an increase of 18% over fourth quarter 2019. Transactions in some of our emerging markets such as the Dominican Republic, Ecuador, Nicaragua, Brazil, Kenya, and Ghana are growing much faster than our overall business. Total, our less developed markets increased transactions by 33% compared to fourth quarter 2019. This strong growth in remittances in our emerging markets is also evident as seen on the chart. While our growth slowed in second quarter in the height of the pandemic, these markets are now growing as fast as they were pre-pandemic, and they're growing at almost twice the rate of the overall company. On slide six, the strong multi-year growth in transactions had led to a significant increase in market share. In our core markets of Mexico, Guatemala, Honduras, El Salvador, and El Salvador, which are 75% of the entire Latin American market, we increased our share by 100 basis points from 2019 to 2020. We now have a 19.4 market share in these core markets. In fourth quarter of 2020, in the same four markets, Intermex achieved a monumental 20% market share for the first time. Since the end of 2018, Intermex increased its market share by 210 basis points in these core markets. If we go back a few more years, the company has more than doubled its market share in these key markets, validating our differentiated strategy and world-class execution. This long track record of transaction and market share increases translates into revenue and EBITDA growth. So far in 2021, we have continued where we left off last year. We are experiencing continued strength in remittances with January and February running 19% above 2020 levels. On the next slide, more recently, we have continued to experience strong growth in our mobile app with transactions increasing 125% versus the prior year. Additionally, the number of overall wires that were deposited directly into bank accounts increased 50%, and that now represents 20% of overall wires. We have increased our focus on our investment in the digital offering in the fourth quarter of 2020 and have continued to build out our digital organization. We expect our new and enhanced app will be completed by the end of second quarter 2021. Andrus will highlight some of the additional investments they were anticipated making related to the digital opportunity that we see developing in the coming years. In 2020, the company continued to modify its capital structure. On slide eight, the company completed a follow-on offering in conjunction with certain original shareholders selling 5.7 million shares. In 2019, the company completed a secondary offering where certain shareholders sold over 6 million shares of their stock. Also in 2019, the company purchased or converted into shares of common stock all of the outstanding warrants which were part of the original capital structure. As a result of these transactions, no single shareholder owns more than 10% of the company. There's no risk of potential dilution for warrants being executed. Additionally, on slide nine, in 2020, two board members retired An independent lead director was appointed, and the company completed the process that started in 2019 to transition to an independent board. All of these actions diversified the company's ownership structure, reduced a perceived stock overhang, and improved the average daily trading volume, and strengthened our corporate governance. In closing, the underlying appeal of our business model with highly productive localized agent network and superior service quality enables the company to consistently deliver strong financial performance in challenging times and in good economic times. Our model also provides a high degree of predictability in the business and generates market share increases, double-digit compounded revenue, adjusted EBITDA, and net income growth. This enables us to reinvest in attractive growth opportunities To provide additional future returns, we remain confident that our philosophy and dedication to profitability and sustainable growth will continue to drive a significant competitive advantage for Intermax. With that, let me turn the call over to Andrew Spendi."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Bob, and good morning to all the analysts, investors, and customers that have joined us. My comments will now focus on our fourth quarter results and our full-year guidance for 2021. You can find the full-year 2020 results in our press release and the attached financial schedules. Turning now to slide 10, let's walk through our fourth quarter results in a bit more detail. As Bob mentioned, the company had a record-setting fourth quarter across just about every one of our key metrics. It's even more remarkable considering most of the country is still operating at limited capacity, while in 2019 we were still in the old normal. It's a testament to how resilient our customers and employees are and shows what a solid operating company the team has built at Intermax. In the quarter, driven by an 18% increase in remittances, we generated record revenue of $99 million, an increase of 19% over the prior quarter. The company's continued focus on growing a world-class, high-performing agent network while making measured investments in other products and revenue streams, like digital, has enabled Intermex to generate double-digit percentage revenue growth every quarter since entering the public markets, except for the second quarter of 2020, which of course was the height of the shutdowns. In the fourth quarter, the company delivered record net income of $9.6 million, an increase of 80% versus the prior year. On page 11, you can see that translating to an adjusted net income of $12 million, an increase of 54% versus the prior year. A strong increase in revenues coupled with a continued focus on efficiency helped generate adjusted EBITDA of $19 million, a stout 32% increase over the prior year quarter. This growth outpaced revenue growth, as we generated leverage from the ongoing migration to lower-cost deposit services and reductions in cost to our payer network. As Q4 was still rife with uncertainty, we were also very judicious in expense management, as we held professional fees, travel, and advertising spend to a minimum, which provided an additional tailwind to our financial results. As with revenue, Intermex has a long and successful track record of generating adjusted EBITDA growth, in double digit percentages every quarter since trading in the public markets. Even in the second quarter of 2020, during the height of the shutdowns, Intermex generated double digit adjusted EBITDA growth, clearly something that the other remittance companies just can't say. Adjusted EBITDA margin for the quarter was 19%. That's an 180 basis point improvement compared with the fourth quarter of 2019. This is very healthy for a public company of our size, however, As we'll outline a little more in our guidance, we expect adjusted EBITDA margins to come down a little more in line with our historical results as we invest in our digital offering and other growth initiatives, increase our advertising expense, and employees begin to travel more. Moving to slide 12, our strong operating results in the fourth quarter and full year 2020 demonstrated the resiliency of the business strategy. This further underscores our confidence in the business model, and we will return to providing full year guidance for the current year. Assuming the worst of the pandemic is behind us and based on recent trends and some historical seasonality, we expect to deliver the following for 2021. Revenues up between 16% and 18% versus prior year. That means $414 to $421 million. Adjusted EBITDA up 11% to 14% versus prior, which means $76 to $79 million. adjusted net income between 47 and 49 million, that's up 12 to 15% versus 2020, and gap net income between 40 and 42 million, that's up 19 to 24% versus 2020. It's worth noting that our strong EBITDA growth percentage in 21 will not be quite as dynamic as our revenue growth as some of our 2020 cost tailwinds dissipate, but we'll also be making some key investments in the future of our business. Our investment will be centered in three key areas. First and foremost, enhancing and upgrading our IT systems as we continue to transform our ecosystem to more modern architecture. That's going to mean quicker time to market, enhanced integration capabilities, and a better experience for our partners, vendors, and customers. Second, investment related to our digital business itself as we look to cost-effectively grow the user base. Based on some early initiatives starting in the second half of 2021, When the new world-class app is available, we expect to significantly increase marketing spend to capture a greater share of digital. Finally, we'll continue to invest in our talent pool as a public company with specific focus on key leadership positions, front-end growth, and technology. From a quarterly perspective, we expect the second quarter will have the highest growth rate because of the 2020 comparatives, which were heavily impacted by the shutdowns. The first quarter should also exhibit relatively strong growth due to some 2020 shutdown impact, and this is even despite the February weather impacts of this year. And then the third and fourth quarters of 2021 should be better benchmarks for the underlying business growth trends. In closing, our continued focus on high-quality, high-volume agents along with delivering a differentiated quality of service continues to drive our growth and gains in market share. As Bob highlighted at the beginning of the call, over the past three years, Intermax has grown net income 350%, adjusted EBITDA 105%, and revenue 66%. On that backdrop, we're forecasting yet another year of double-digit growth on all of those markets. With that, let me turn the call back to the operator for questions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And at this time, we'll be conducting a question-and-answer session. If you'd like to ask a question, please press star 1 on your telephone keypad. A confirmation tone will indicate your line is in the question queue. You may press star, too, if you'd like to remove your question from the queue. For participants using speaker equipment, it may be necessary to pick up your handset before pressing the star keys. One moment, please, while we poll for questions. And our first question is from David Scarf with J&P Securities. Please proceed with your question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning, everybody. Thanks for taking my questions, and congrats, Bob, on obviously navigating a very challenging year for all of us. The first question has to do with geographic reach. When I saw the footnote on the slide with emerging markets, I guess I kind of lost track of just how many – how many received geographies you're in now, particularly in Africa. Can you just provide an update on, as we enter 2021, what percentage of the business, from a revenue standpoint, you know, is captured by those emerging markets?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "We don't disclose Africa by itself, Mike. So, David, I'm sorry. But if we were to, you know, and we don't normally look at the percentage of the business that is the rest of Latin America by itself, but it's a significant piece today. I mean, you know, between Mexico, Guatemala, El Salvador, and Honduras, although they're a large share of our business, there's tens of millions of dollars in revenue today. to countries like Dominican Republic, Colombia, Ecuador, Peru, Nicaragua, and others. And as we've talked about many times, we really built the business intentionally to build out Mexico first, being the most profitable market in terms of gross margin and the largest market by far. And then secondarily, Guatemala. And then from there, obviously, El Salvador and Honduras. We continue now with the... Next largest received market in Latin America is Dominican Republic, and that's been growing tremendously for us, sometimes more than 40% year over year. So that group together is growing very quickly, and it's a significant part of the business, but there's a huge upside. Africa is still a small piece. We've only been in Africa a little over a year, and it's – There's some complexities there because it's not, when we talk about Africa, we talk about it as sort of monolithic, but it's many different countries, obviously, and some different language barriers and things. But the core of that market is really going to Nigeria, Ghana, and a couple of other countries. And we're beginning to, you know, to grow that, but we haven't disclosed how many or how big a business that is for us today as of yet."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "No, no, understood. And I guess, you know, the main reason I'm asking is obviously, you know, Back when your core market was designed where maybe just you had 10%, 15% share, you know, not the 19, 20 you have now. You know, we were inclined to closely track Mexico data, try to get a sense for how U.S. to Mexico was trending. But, you know, with a much broader geographic reach now in mix, you know, just trying to get a sense for if there are other leading indicators. Right."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, there are clearly huge opportunities with about four or five countries in Latin America. And when you get to, when you add Dominican Republic, Colombia, a couple of other countries, now you start to get to approaching 90% of the market. So we've talked about it. It's a really concentrated market, 75% in just those four countries where we've really focused. But still a tremendous opportunity. For instance, Dominican Republic is just as large as a receiving country as El Salvador or Honduras, which means that we could triple our business there easily and still have headroom to grow. And Colombia is another market. So we've got a lot of green field in both of those areas. They're heavily concentrated markets. Dominican Republic really generally is the East Coast. Boston, New York, Florida. Colombia is pretty concentrated in the East Coast as well. So they're not markets that are as pervasive as Mexico or Guatemala and easier for us to really tap into as now we've already built that base."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Understood. Hey, just maybe one follow-up to a different topic. You know, on the digital front, I know it's very nascent at this point, but I'm curious, you had referenced that 20% of overall wires from Intermex are deposited directly into bank accounts."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Correct."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And I would imagine on the receive side, you know, that's kind of one of the big barriers. for digital adoption. I think that may be the first time I've heard that metric. Can you just provide some context? You know, over the last, like, three years, has that generally been?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, no, it's growing. I mean, and, you know, a lot of the payers are either banks or they have subsidiaries that are banks. Like, you know, Electra is a big payer in Mexico. It has Banco Azteca. Copel has Banco Pel. And so all of them have been on a push to And I think through trying to create accessibility to financial services in Mexico, the government has been trying to encourage more bank accounts in-country in Mexico. Now, the challenge for that is we think that those folks, those 20%, are, with their sender, probably less resistant now. to the online business. It doesn't mean necessarily that the sender on this side of the border is equipped with a bank account in the U.S. to do a wire, but we do think it's an indicator of moving more digitally. And like we say, 20% now of our wires, and it's been growing very, very quickly. Some of the banks... have a very large share, you know, as high as 30% or more. And even in Guatemala, there's a couple of the big banks are very high in terms of percentage of deposits into bank accounts. So we see that movement going on, but we don't necessarily always correlate it to willingness or acceptability to originating side with digital or online. Right, right. Got it."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you very much."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "You're welcome."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our next question is from Mark Palmer with BTIG. Please proceed with your question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yes, good morning and congratulations on a really strong quarter and a great display of resilience during the pandemic. As you mentioned, the company really adapted well to the environment while others have struggled. Can you talk a little bit about the competitive environment You know, we had seen discounting in certain states prior to the pandemic. What are you seeing both in terms of competition and pricing at this point?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, thanks, Mark. I think that I'll start off by just, you know, talking a bit about what we did very quickly. When we saw the beginning of the pandemic, I mean, we had a couple choices to make. You know, we knew that our sales force, the sales force that interacts in retail was with our agent network would be not mobilized, would be stuck at home for some period of time. And we had the choice, like many of our competitors, to either kind of pull back and retract a bit, maybe lay people off, maybe cut some salaries. And we kind of doubled down. We right away went to our sales team and said, you know what, we're going to keep you whole for a certain period of time until we sort of figure this out and where COVID is going. But here's what we're going to ask from you. So normally... They were out calling on X number of retailers in a day. She said, you're stuck at home, but the retailers are still open in many cases, and we need you to contact about five times as many retailers a day by telephone. So actually, it was interesting for us. We actually expanded our reach by five times what it normally had been. Now, it wasn't the in-person visits, but it was the over-the-phone, and we think it had a lot to do with while everyone else was kind of pulling back, we were actually more aggressive, at least contacting more agents on a daily basis by the phone versus less agents in person. As that happened, we think that we not only held service in our retailers, but remember, in most cases, we're alongside of other companies, and most of those other companies did not execute nearly as well. In many cases, they became fearful early on and created layoffs or created pay cuts, created a bit of demotivated sales force, while our sales force felt pretty secure and also pretty willing to go out and be assertive and aggressive at retail, and that helped us a lot. I'm going to have Randy Nelson, as you know, our Chief Revenue Officer, though, who's obviously a lot much closer to what's going on at the field, comment a little bit further on that. Randy?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, thanks, Bob. Hi, Mark. Bob's exactly right. I think the point I'd like to stress is our field team was extremely motivated the entire year. Bob and I made the decision to keep their commissions whole during this challenging time, so we had a very motivated sales team that was out working hard the entire year and bringing in great results, of course. I want to address your question a little about the price compression. What we saw, as you know, we generate revenue on two streams, fee income and FX income. Both were really helped this last year as the average principal, the amount people were sending home, increased. So our fee per transaction actually increased as the principal increased, as did our FX revenue. So while there may have been a little bit of price compression on the amount of FX that was being offered on each transaction. It was offset by the amount being sent. So our gross margin and our revenues per transaction were actually remained very healthy, if not a little better than the year before. Does that answer your question?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "It does. If I can just ask one quick follow-up along those lines. What do you believe were the drivers of the larger principle per transaction? during the pandemic, and do you anticipate that that's going to continue as the pandemic abates? And thanks very much."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah. We think, as far as we can conclude at this time, that there are greater needs, as great as the needs were here in the U.S., that people back home in Mexico and Guatemala were hit even harder in terms of the pandemic. and whereas most of our workers were essential workers or a great share of them were essential workers, and others were nimble enough to find movement away from areas where they couldn't work, either verticals that were closed down like restaurants or even geographic areas that they moved to to stay employed. So they were working, and the needs back home really increased a lot. And so we think that that had a lot to do with it. We think in terms of our Mexico market, because so many of those folks are in like the food processing or picking of crops and agriculture and things like that, that that stayed really, really stable. And those folks had the equal amount of money and the needs were bigger back home. As we created our budget for 2021, we haven't really considered that the principal amounts will stay at that level all year. So far during 2021, we've seen principal amounts staying relatively high. and they're tens of dollars, $30, $40 higher than what they traditionally have been. So far, we've seen them at those levels, but it's not something that we've felt that we could take for granted throughout the year. So much of the stuff you hear us talk about for 2021 is assuming that those principal amounts come back to the normal average amounts throughout 2021. Although, again, through the first couple of months, they've remained high, looking more like what they were in 2020."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Welcome. Our next question is from Mike Rondeau with Northland Securities. Please proceed with your questions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, guys, congratulations on the quarter and the outlook for 2021. Maybe, Randy, just staying with the field sales force for a moment, did you hire at all during 2020? Did you expand that sales force? And then anything to call out in any U.S. regions where things maybe came back quicker or more resilient or even a little slower than what you might have thought?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah. Yeah. Yeah, thanks. Good morning, Mike. Good to hear from you. Let's take the geography question first. Surprisingly, our Northeast region, even though it was the hardest hit early on, continued to perform extremely well. We're really proud of that team and the resilience they've had all year and really for a couple of years now. We've upgraded the team for sure. We took advantage of the opportunity. We upgraded our sales team throughout the year. We hired three tremendous sales leaders that we're really excited about in September, and they've made an early contribution. We added two more tremendous sales leaders in the beginning of December that have come in and made an early impact. So we like the way our team has structured. If you'll remember, fourth quarter 2019, we had several vacant positions that we think slowed our sales down a little bit. And if we compare that to fourth quarter of 2020, we had many more feet on the street, and we were more productive per headcount in 2020 than we were 2019. So all in all, yeah, we staffed up, expanded our team, and we're more productive today."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "That's great to hear. And then just maybe as a quick follow-up, um, the three things you guys called out as kind of key investments, um, any rough dollar range that's kind of going to those as a bucket, just so we can kind of gauge it and, you know, kind of think about 2022 and going forward and if those are continued to be needed."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, this, this is Andrus. Um, Mike, I think the best color we'll give you on that, because some of it, particularly marketing spend and digital, is something that is kind of sensitive and we want to keep on our own, is the guidance that we said of coming back to more normalized margins. So I think between our investments in IT, our investments in digital business itself, and investments in our talent pool, I don't think we'll be up at the 19% adjusted EBITDA. I would expect us to come between 18% and 19%."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. Got it. I hear it. Hey, guys, thanks a lot."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Sure. And as a reminder, if you have any questions, you may press star 1 on your telephone keypad. Doing so will ensure that you have joined the question queue. Our next question is from Justin Forsyth with Credit Suite. Please proceed with your question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, Bob, Andrus, Mike, how's it going? Good to hear from you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So I wanted to follow up a little bit on the prior conversation around some of the more nascent markets that you guys are in in Latin America, such as Dominican Republic, Colombia, Peru, Nicaragua, et cetera. Nice announcement earlier around them growing 2X, the company average, about. Just trying to dig into that a little more. I mean... Can you unpack the growth algorithm, how you expect that to kind of fuel transaction growth in this mid to high teens in the future? Meaning, you know, how do you expect to gain share there, given some of these are kind of less United States based, meaning they're getting sent from perhaps other countries within Latin America, such as call it. you know, Costa Rica sending over to Nicaragua. Is there an opportunity there to expand your SEND capabilities into other Latin American countries for kind of an inter-Latin America exchange, or are you looking perhaps to further gain share elsewhere in the States, or maybe just, again, unpack that growth algorithm, especially in some of these more nascent countries?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. Well, there's a lot of questions there in one, so let me start out first with that. Our growth trajectory is although it'll be very much fueled by U.S. outbound to or contributed to by U.S. outbound to countries like Dominican Republic, Ecuador, Peru, Nicaragua, Colombia, is not dependent on that. There's still a huge amount of growth for us. And if you look at our growth trajectory, that still exists in the way we're gaining share in the four core markets, which are 75% of Latin American business, U.S. outbound. There's still a lot of growth there for us. We've continued to gain share not only in the newer ones for us, Honduras and El Salvador, but in Guatemala and even in Mexico. So there's a lot of opportunity there. As we look at Dominican Republic, whenever we talk about share and we're talking about opportunities U.S. outbound, we don't look at, yes, there's some business for Dominican Republic even from Europe, as unusual as it might seem, even from countries like Switzerland to Dominican Republic. But we focus on the U.S. market size. And the U.S. market size of Dominican Republic, for instance, just to pick one, is about the same size as El Salvador and Honduras, and yet we do about a quarter as many wires to Dominican Republic. And also, remember, we have a growth trajectory in El Salvador and Honduras. So there's a tremendous amount of growth that's available from countries like Dominican Republic, from Colombia, Ecuador, Peru, Nicaragua, and others, U.S. outbound exclusively. Now, You bring up a good point. It's something that we're taking a look at and we don't want to say too much about because there's not a lot of folks in that arena, but we also do believe there's a lot of intra-Latin American business. For instance, the Dominican Republic is a big receiver from Puerto Rico. Today, we really don't send wires from Puerto Rico to the Dominican Republic, but there's also a lot of wires internally within what we would think of as Central America. People from Costa Rica to Guatemala, Guatemala to El Salvador, Mexico to Guatemala, Guatemala to Mexico. And we think that with our current payer network and our branding, that there's an opportunity there that we are looking at. But again, we don't want to say too much about that. And any plans that you see or hear of that we talk about are really talking exclusively about the growth we believe we have to our core markets, which I think is still significant. And then along with those secondary markets to Latin American and, of course, Africa and other new countries where we're servicing. We don't have to have... tremendous growth to those secondary countries to have great growth. There's so many opportunities that if every lever was absolutely played out perfectly, any one of those levers can drive the kind of growth that we need. And they all have their different challenges. But as I said, we still have tremendous growth, particularly in the West. We've been growing in the West forever. We have some states that we've grown tremendously, like Arizona, but we're still relatively underrepresented in the western states versus the eastern states and still a tremendous amount of work to do there and a tremendous opportunity to access just with our core markets. So we think there's opportunity everywhere, if it makes sense. But you did hit upon something I think that's really valuable, that inter-Latin America kind of transaction. is something that we are looking at and we think that there's an opportunity there. But we're not at that, you know, at that point yet. And it's certainly not anything we have suggested in any of our planning for 2021."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. No, that's super helpful. And I guess the thought was coming around, you have a massive payout network already somewhat at scale there. And it would seem perhaps a logical next step to turn those just into sending markets. But one quick follow-up, if I may. Regarding digital, and thank you for the disclosures around the transaction growth there, just wanted to parse through the growth. Would you say that is more from a tougher comp dynamic, or would it be more of a shift, like you saw a big shift in Q2 to digital just due to lockdowns and such? And given you're more, though, focused on brick and mortar, was that more of a just return to in-store, or is that a tougher comp issue? Thanks so much for the time, guys."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, thank you. I mean, the first thing we want to make sure we get kind of out of our language is brick and mortar. You know, we're no more brick and mortar than Airbnb is. I mean, we don't own brick and mortar. The 7,500 agents we have are agent retailers. They own the brick and mortar we provide as service. And the service we provide is digital. And the only difference between what the marketplace calls digital and what we do is that that digital is extended to the hand of the consumer versus sitting on the agent retailer's desk in terms of their PC. So I want to make sure we're clear about that. It's one of the great things about our model versus models that might have a lot of brick and mortar and leases of their own. I think we have about 7,500 agents and we have about 30-some retailers that we actually own the lease on the building. So most of our business is not really brick and mortar in a traditional sense. It's an outlet that we're, you know, someone else's brick and mortar that we're using as a window of commerce to the consumer. But going on further with the whole brick and mortar, we did see a movement, I'm sorry, the online business, we did see a movement in second quarter that everybody saw to online. We are seeing people, as we look at our research, though, we're seeing people that are actually some people who are, it's an interesting concept, that have come to us, first time to us at least, on an online transaction and then actually moved to a retail transaction, and primarily are retail now. We're seeing people that are going to both, and we're seeing people that have migrated to one or the other. So now, overall, we're not seeing a huge amount of crossover overall, but there's actually in our numbers, they're not huge numbers, but in our numbers, we've seen more people come to us to start with in digital and then go back to over-the-counter retail. Then we've seen people come to us first in retail and go to digital and stay at digital. So it's sort of an interesting thing, which for us kind of reinforces that we know that digital is going to be a growing part of the market. There may be very different customer groups right now. That's what we're generally seeing. And I think other competitors have said similar things. And the other part is that there seems to be a great amount of resiliency and determination to stay at retail for those people that are at retail. We think, though, that the retail business, and if you talk to any of the people, primarily most of them that are pure play are not public companies, so they don't necessarily, and there are not disclosure reports out there, but the biggest cost in the digital business is going to be the customer acquisition cost. And it's how much do you want to spend to build a customer base that that you know at this time is very, very expensive to build. And how do you build that? We think that the best way for us is to build that through the fact that we have 4 million distinct customers every year, and we want to be very respectful of our retail network and our partnerships at retail, but we also think that we're in a much better position than the pure plays to be able to win consumers that are today at retail are interested in moving to an online transaction that we're well positioned because we have a relationship with them. And we think that the companies that find a way to be in both, by the way, And, you know, I can't disclose who, but I've spoken to about three or four online guys who all say, we think the best thing is to be involved. And these are people that are pure play. So I think that the company that finds a way to be able to be offering both alternatives to the consumer and doing that not to necessarily be forceful in moving people from retail, that could actually be detrimental to that very high quality and profitable business are going to be the companies that's further ahead. And those are the things that we look at is how to best serve the consumer while staying very focused on both sides of the equation. Because we think five years from now, even 10 years from now, you're going to need to be in both sides, particularly in certain markets. That may not be the case in India or the Philippines, but it's going to be the case with the markets that we're primarily focused in, that both sides of that equation are going to continue to be important."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. So to summarize, it does sound like a decent amount went to digital for one or two transactions and boomeranged back to using retail, or online, I should say. Sorry."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Not really. That's not correct. More people came to us initially online, just never saw before, and then went to retail after they knew us. than people that came from retail and went to online and stayed in online. Most of the people that converted kind of went in both. They integrated back and forth. So we didn't see a lot of people, and again, we don't have a huge online business, but we have tens of thousands of transactions per month, so we certainly have a big enough sample size. And we're not seeing that a lot of consumers, a big share of consumers, left retail to go to digital and stayed there. we're seeing actually the opposite, that more people actually started it online and went to retail and stayed there. The opposite. Interesting thing we've seen."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you so much."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "You're welcome."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And our last question is from Josh Beck with KeyBank. Please proceed with your question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, team, for taking the question. I have a two-parter. Maybe if you could just share anything that we should be thinking about on Q1 seasonality versus prior years. You obviously gave some helpful guideposts on Q2 being the high water bark for year-over-year growth, but not sure if there's anything else you can elaborate there. And then this might be a bit tricky to do, but just as you think about 21 and could you help us understand what you're expecting in terms of market growth. I know that's a really difficult one, and there's probably a lot of range of scenarios, but any color on those two points would be appreciated. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, great. So let me start with the second one first. I think that's may not be an easier, but it's a quicker answer. We've seen Mexico remain really strong throughout 2020, surprisingly so. I mean, not because we didn't think it was a resilient market, but it was so strong and came back so quickly that even our mixed shift at times of the year started to shift more back to Mexico versus all other countries, not meaning it was bigger than all others, but it was growing faster than all others for a period. Now, we started to see that stabilize again, but The core of the business, Mexico, I think we would think will probably be in at least the middle, if not the high single digits. It could be as high as 9% or 10% year over year. We have seen it be a little bit choppy month to month right now. But I think the average has been in the high single digits to even as high as 11% or 12% on the average. So it's performed extremely well. Guatemala and other countries have been a little softer. El Salvador, Honduras. Particularly during the height, and not that we're through COVID, but during the height of COVID, we saw times where those countries really struggled in receiving because banks would be closed on particular weekend days, which caused there to be really unpredictable demand. And then the days were just off and all of that, and the overall numbers were weaker. But I think when we look at the market, we're pretty optimistic about 2021. Mexico's remained strong, and we think some of the other countries will be lapping relatively weak numbers, so we expect them to stay pretty strong. As far as the first quarter, year over year, 21 versus 20, we're really dealing in a world in January and February of 21 versus 20 of a very normalized world. I mean, most of us, you know, didn't hear much other than a blurb here or there about COVID until we got into March. In March, the business became really volatile, and it's the first time in history that I've been around this, and we've got folks in the room between Joseph, Randy, and me that have been around the industry a long time, where we saw the peso actually trade and move in terms of pesos overnight and not centavos, where a couple of times we saw during March where the peso went from 21 to 23 or 23 to 21 overnight, which was completely different and new and nothing we've ever experienced before. that led to March being really crazy last year. And so we think we've got a good comp because there were times in March where everybody was rushing and sending and you had really crazy comp days. But overall as a month, we think we've got a good comp to March of last year. The first quarter having, you know, started off really strong for us. It would have been a lot stronger. There are two things that happened in February. One is we knew about was we were going 28 days to 29 days. So right away, you have a 2% or 3% decline in growth because of that. And second, the snowstorms that hit really hard in the south and the southeast, and even in Texas, Really, there were days where those markets were virtually shut down. But even coming through that, we still were around 19%, 18%, 19% transaction growth year over year. March is a good comp. We should come in really strong in March. We're too early to predict, but the business in that month last year was really choppy. And then, of course, remember for us, we didn't really have a horrible second quarter last year. We had a horrible April last year. But we popped out pretty quickly. So we versus a lot of our competitors don't have the easy comp that they have because we didn't go fall through the floor. We actually grew IBDA in second quarter last year, 20 versus 19. So we have a good comp, but we don't have a comp that's like some of our competitors where they might have contracted by 20% in IBDA or in that income in second quarter of 20 versus 19. So it'll be a good comp for us, but it's not nearly as good as some of the others because we had such a strong second quarter, relatively speaking, compared to the market in 2020."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I think I just echo what Bob said. I think the fact that we're two months through 2021 with those snowstorms still running 19% above 2020 levels and headed into a good March comp, I think Q1 is going to look pretty good. And Q2 is obviously going to be our biggest comp quarter. But if you benchmark Q2 versus some of our competition, as Bob said, we might not stand out as much, but it's going to be a good comp for ourselves."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Really helpful. Thanks, guys."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. We have reached the end of the question and answer session. I will now turn the call over to Chairman and CEO Bob Visti for closing remarks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, thank you all for joining us on this first quarter call. Happy to have 2020 behind us. It was a year of a great deal of challenge, and we're really proud as a company that we're able to grow the way we did keep our employees, you know, fully employed and kept the company strong. And I think it's been a testimony to the real sustainable growth and profitable growth that we built into our business. It's a bit of an old-fashioned business in some ways, right? But that old-fashioned business held up like the house of bricks that we've described it many times. So we're really proud of the results and the results that this team and the rest of the team has developed and and created in 2020, and we're looking forward to a great 2021. So we thank you all for joining us, and we look forward to talking to you all soon."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "This concludes today's conference, and you may disconnect your lines at this time. Thank you for your participation."
    }
]