[
    {
        "date": "2022-03-07T09:00:00-05:00"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Greetings. Welcome to International Money Express fourth quarter 2021 earnings conference call. At this time, all participants are in listen-only mode. Any question and answer session will follow the formal presentation. If anyone today should require operator assistance during the conference, please press star zero from your telephone keypad. Please note that today's conference is being recorded. At this time, I'll turn the conference over to Mike Galentine, Vice President of Investor Relations. Mr. Galentine, you may now begin."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning, everyone, and welcome to our quarterly earnings call. I would like to remind you that today's call includes forward-looking statements, including our 2022 guidance, and that actual results may differ materially from expectations. For additional information on International Money Express, which we refer to as Intermex or the company, please see our SEC filings, including the risk factors described therein. All forward-looking statements on this call are based on assumptions and beliefs as of today. You should not rely on our forward-looking statements as predictions of future events. Please refer to slide two of our presentation for a description of certain forward-looking statements. The company undertakes no obligation to update such information except as required by applicable law. On this conference call, we will discuss certain non-GAAP financial measures. Information required under Reg G under the Securities and Exchange Act with respect to such non-GAAP financial measures is included in the presentation slides, our earnings press release, and our annual report on Form 10-K, including reconciliation of certain non-GAAP financial measures to the appropriate GAAP measures. These can be obtained in the Investors section of our website at NNMXonline.com. Presenting on today's call will be our Chairman, Chief Executive Officer and President, Bob Lissy, and Chief Financial Officer, Andres Bendi. Also on the call today is Joseph Aguilar, Chief Operating Officer, Randy Nelson, Chief Revenue Officer, and Chris Hunt, Chief Information Officer. Let me now turn the call over to Bob."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning, and thank you for joining us today. We are proud to announce the fourth quarter and 2021 year-ending results. Let me highlight some of our accomplishments on slide three, compared with fourth quarter and full year 2020. We achieved revenue of $127 million, a 28% increase versus last year. Net income of $13 million, 37% increase. Adjusted net income was $16 million, an increase of 36%. and adjusted IBDA for the quarter of $24 million, an increase of 27%. For the year, revenues were $459 million, an increase of 29% over the previous year. Net income was $47 million, an increase of 39%. Adjusted income was $57 million, an increase of 36%. Adjusted IBDA was $87 million, an increase of 27%. These are very impressive results in their own right, but even more impressive given the comparison to our very strong results of 2020 fourth quarter and full year, in which revenues increased 19% and 12% respectively. That income increased 80% on the quarter and 72% for the year, and adjusted EBITDA grew 32% and 19%. The two-year growth for 2021 was 45% in revenue, 139% in income, and 51% in adjusted VDA. We are truly a stronger, more profitable company than we were when the pandemic began in 2020. This performance validates our high-quality, omni-channel, customer-focused strategy. The company utilizes cutting-edge, high-tech proprietary software through every step of our business to meet the customers where they choose to transact, whether digitally or in person. This allows Intermex to deliver a robust, and easy-to-use agent interface, provide our services efficiently, and support back-office IT infrastructure. As a result, Intermex exhibits all of the characteristics of a high-tech growth company. Importantly, as I will discuss more in greater detail momentarily, because the service we provide to our customers is essential, our business was built to operate well in both good times and in challenging economic environments. We firmly believe this position's intermix to take advantage of a very long runway ahead. Before I provide additional color on the customer side of the business, I would like to discuss the company strategy related to our agent partners, who are carefully chosen to ensure that they share our philosophy of providing superior customer service and support. Our service is vital to customers who may be sending funds to assist their family's critical needs in such areas as housing, food, and medical expenses. We accept that responsibility and work diligently to deliver 100% of the time. We fully expect the agents with whom we work to have the same sense of urgency, realizing that our service is essential and may be life-changing. Our agents are located in areas that have been strategically selected, including the demographic characteristics of the geographies, to help meet the needs of each and every consumer. The agents who partner with us benefit from using our cutting-edge proprietary software that enables the fastest remittance processing in the industry. We continue to endeavor to upgrade our industry-leading platform at retail. In 2021, we invested in significant IT enhancements. One of these investments is the launch of our new Intermex Direct agency software application in December, which features both upgrades in hardware and software. Intermex Direct provides the added benefit of streamlining the process for agents by allowing them to log into one system and access multiple applications with added security and enhancements. The system also benefits Intermex through better reporting and the ability to provide continuous improved support. Agents also choose Intermex because of our strong compliance culture that we have built and in which we continue to invest. Those investments span systems and people to ensure that Intermex remains best in class and at the forefront of the remittance industry. Strong compliance culture allows agents to utilize our extensive network of banking relationships and conveniently located local branches deposit funds. This is an important fact because some of the banks are not willing to bank small businesses that generate large amounts of cash deposits. With Intermix's wide network of banking relationships, we can solve this problem by providing Intermix's own bank accounts for the agent partner to deposit into. Finally, agents benefit from the same top-notch, unparalleled customer service as do our customers, with average speed of answering calls within five seconds and often faster. This quick turnaround time frees the agent to focus on customer service, resulting in shorter wait times and more satisfied customers. We also provide significant value to our customers on the product side, as Intermex firmly believes in providing the customer with choices that best meet how they want to conduct a transaction. We give our consumers the choice of initiating a transaction remotely via our digital app or in person at one of our convenient agent locations or one of our company-operated stores. Consumers can send cash or use a debit card at a convenient retail location, or they can use a debit card, credit card, or bank account to initiate a transaction online. This philosophy of consumer choice also extends to how remittances are received and paid in country. Our customers' beneficiaries can receive money digitally into their bank accounts, loaded on a mobile wallet, paid out in an ATM, paid out over the counter in a convenient retail location, or home delivered. Importantly, all of these funds are available in minutes. We have further enhanced customer choice with the launch of our new digital application this week. This app offers consumers the option of selecting lower fees or higher exchange rate in real time. It also includes enhanced functionality that provides consumers with several options to fund their remittances and payout methods. As with our retail-based remittances, funds are available within minutes and backed by our world-class customer care. The new Intermex application also contains an intuitive navigation flow that allows users to fund a remittance with debit or credit card or ACH for a transfer. Users can select a variety of receiving methods, including cash pack pickup at thousands of locations, direct deposits into bank accounts, debit cards, mobile wallets, and home delivery in select markets. Intermex also expects to make this application available to our co-branded digital and mobile partners in Latin America and Asia. This omnichannel, customer-focused strategy has generated strong and consistent growth for Intermex and has resulted in our taking market share from our competitors. On slide four, in the fourth quarter of 2021, our market share increased to 21% to a record high in our core markets of Mexico, Guatemala, El Salvador, and Honduras. Besides the strong growth we have generated in our core markets, as shown on slide five, emerging markets such as the Dominican Republic, Ecuador, and Nicaragua, among others, continue to experience strong growth during the quarter. Our emerging market business is one of our many bright spots, with transactions increasing 32% from the fourth quarter of 2020. Turning to slide six, as I previously noted, Intermex is continuing to invest in our digital application, and you see the company's continued progress in our digital initiatives, with transactions increasing 96% versus the prior year period. Some of our peers define a digital transaction as one where either side of the remittance is cashless. Based on this definition, Intermex currently processes more than 24% of its transactions digitally. where they were initiated as cashless transactions on the send side or settled as cashless on the receive side. During the fourth quarter, transactions that were deposited directly into bank accounts increased 44% compared with the prior year period. Transactions processed through the use of a debit card at retail are a small percentage of our overall wires but grew at 98% year-over-year. We expect these transactions will continue to increase as we expand the number of retailers who accept debit cards. Lastly, another key pillar of our growth strategy is our card product, where some of our 2021 investment was directed. This category includes card direct, prepaid MasterCard, and payroll MasterCard. We have been enhancing our systems infrastructure to efficiently and effectively support these products, while also adding field sales and support personnel to expand our presence in the market to drive meaningful contribution to future revenue and profitability. We plan on discussing more on this product category on Investor Day we are holding later today, which will be available by webcast for those of you who are unable to attend in person. In a second, I will turn the call over to our CFO, Andrew Spendi, for his remarks on our record financial performance that Intermex delivered for fourth quarter and for full year 2021. I will conclude by reiterating how our unique customer-focused strategy that provides choice matched with high-quality products in the form of reliable, fast money remittance, supported by quality agents and customer service, and utilizing proprietary apps and infrastructure is sustainable and differentiating ourselves. This strategy has produced peer-leading results and positions Intermex as a high-growth fintech leader with sustainable long-term growth strategy. We believe 2022 will be another year of strong, market share growth, coupled with double-digit increases in revenue, net income, and adjusted VDA. And we look forward to sharing our continued progress with you. Now I'll turn the call over to Andres."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Andres Vazquez- Thanks, Bob, and good morning, everyone. Moving to slide seven, let's walk through the fourth quarter results in a bit more detail. As Bob highlighted, it was another quarter and year of stellar execution, along with growth in all areas of the business with plenty of milestones achieved across our key measures. These impressive results reflected our focus on providing high-quality customer service matched with our omni-channel distribution strategy. We're successfully meeting our customers where they live or work, and we're providing them with product and service choices that best suit their needs, backed by world-class service. It's important to remember that we do not compete on price. For our customers, quality, dependability, and choice are more important than being the least expensive. As Bob referenced, we're providing our customers with a critical lifeline service for their families. In 2021, we talked a great deal about the investments we're making in systems, people, and products. As Bob noted, the rollout of Intermex Direct has made agents even more productive. At the same time, we've added field sales and support personnel primarily west of the Mississippi. Both of these initiatives have resulted in continued agent growth and productivity. In the fourth quarter, digital transactions initiated increased 96% over the prior year period, which is especially gratifying considering we achieved those results with our legacy digital app and with limited marketing dollars. This growth comes on top of already strong growth in 2020. With the deployment and rollout of our new world-class app, we'll be increasing our efforts to generate continued high growth from our digital app service. In addition to our very strong digital growth in the fourth quarter of 2021, we realized 12% agent growth compared with the prior year quarter, with a specific focus on agent growth west of the Mississippi, as I mentioned earlier. These agents helped drive 20% growth in customers for the quarter, who generated a 24% increase in transactions to $11 million, while sending 40% more principal, totaling $5 billion for the quarter. Included in those strong transaction numbers is the growth in the number of digital transactions that I just mentioned, and the 32% growth in our emerging market countries continues our trend of growth in this market at an accelerated pace. On slide 8, all these positive growth drivers generated a 28% growth in revenues compared with the 2020 fourth quarter, finishing at $127 million. Importantly, we believe these strong growth drivers provide a significant runway in 2022 and beyond. We'll also be discussing our plans and strategy in more detail at our Investor Day later today. Through a continued focus on effective expense management and economically positive investments in people, products, and support, GAAP net income for the quarter was just over $13 million, up 37% versus the prior year period. Our strong top line was the key driver with lower depreciation, amortization, and interest expense also contributing to a solid bottom line result. These improvements were partially offset by the expected increases in salaries from higher sales headcount as well as investments related to new product initiatives, such as the card products that Bob mentioned that we are rolling out in 2022, investments in digital, including our new digital app, and enhancements and modernization of our technology, such as Intermex Direct. On slide nine, excluding certain other expenses, adjusted net income increased almost 36% to just under $16 million. Our strong growth in revenues partially offset by the increase in operating expenses I previously mentioned resulted in a 27% growth in adjusted EBITDA to just under 24 million for the fourth quarter of 2021. Adjusted EBITDA margin for the quarter was steady at almost 19%, consistent with the prior year level, although at that time we benefited from very stringent cost management related to a great deal of uncertainty as a result of the COVID-19 pandemic. Turning to slide 10, for the full year, Intermex's results were influenced by similar drivers as in the fourth quarter. The company generated 29% growth in revenues to $459 million. This was driven by an 18% growth in customers that sent 25% more remittances during the 2021 year compared with the prior year. While 2021 was a year of incremental investment in people, products, and technology, we continue to balance strong top-line growth with significant growth and profitability due in large part to the very efficient operating model that we've created. For the year, the increase in revenues translated to 39% growth in net income to $47 million. And on slide 11, on an adjusted basis, we delivered 36% growth in adjusted net income to $57 million and 27% growth in adjusted EBITDA to $87 million. All very impressive growth numbers and just the latest in a long history of double-digit percentage growth And importantly, while Intermex has been investing to drive future growth, adjusted EBITDA margins have stayed very consistent in the high teens. Moving to our balance sheet and cash on slide 12, we wanted to give some insight into how much cash the business generates. Because our settlement assets move so quickly, day of the week of the financial close can really muddy the water if you try to interpret operating cash flows. So we normalize it through an internal measure we call free cash generated, antiquated to how much of the salary ends up in the savings account in the end. If you can see on the left, Intermex generated 47.6 million net free cash in 2021, 26% higher than 2020. This means the company converted 55% of its adjusted EBITDA to net free cash generated for the year. We need to underscore again that our working capital is very cyclical. However, Intermex ended the year with 132 million in cash and an undrawn revolver capacity of 150 million. Looking at our capital allocation, as we've demonstrated, our preferred first use of cash is to reinvest in the business to accelerate our growth in what we do today already. We also continue to look at inorganic growth opportunities that have a positive risk adjusted rate of return. Finally, in terms of the uses of cash in the fourth quarter of 2021, Intermex repurchased approximately 271,000 shares of our common stock for a total of 4.4 million. For all of 2021, the company repurchased approximately 342,000 shares for $5.6 million. Management continues to believe that repurchasing our stock is a very attractive use of cash at these valuations. Moving on to slide 13, given the strength of our fourth quarter and full year results, our execution trajectory, an incredibly valuable and growing payments ecosystem, our full year 2022 guidance for revenues, net income, adjusted net income, and adjusted EBITDA are as follows. We expect revenue in the range of $537 to $546 million, net income in the range of $58 to $59.5 million, adjusted net income in the range of $66 to $67.5 million, and adjusted EBITDA in the range of $100 to $102 million. We continue to balance revenue growth and profitability while also continuing to invest in technology, talent, and marketing to drive future growth. For 2022, with the launch of our new and improved remittance app, we expect to see strong digital growth along with growth in our card products. Management also expects to increase market share by further growing our productive agent base in the retail channel, which means more customers and more transactions for Intermex. As our guidance shows, we believe Intermex has a strong and sustainable growth opportunity ahead of it, and we are in a great position to take advantage of that opportunity by continuing to be an innovator and leader in the fintech space with a unique and differentiated service delivered by Omnichannel. With that, let me turn the call back to the operator for questions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. At this time, we'll be conducting a question and answer session. If you'd like to ask a question today, please press star 1 on your telephone keypad, and the confirmation tone to indicate your line is in the question queue. You may press star 2 if you'd like to remove your question from the queue. For participants using speaker equipment, It may be necessary to pick up your handset before pressing the star keys. One moment, please, while we poll for questions. Once again, that is star one. Thank you. Our first question is from the line of David Scharf with JMP Securities. Please proceed with your questions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hi, good morning, and thanks for taking my questions, and congrats on another tremendous year, Bob. Hey, you know what? I'll let others kind of pile on with all the digital questions. I had a couple more mundane ones. Hey, Bob, we've seen the average remittance size trend upward really for the last couple of years throughout the pandemic. I don't know if wage pressure and inflation are contributing to that. But as we think about the very strong revenue guidance you just rolled out for 22, Are you anticipating remittance sizes to continue to trend upward? Is that embedded in your guidance?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, this is Anders. I'll take that, David. I think we can't count on year-over-year growth like that, which was really outsized last year, so we've tapered back our expectations on that and modeled in minimal growth in 2022. So if it does continue on the rise, that's going to be a tailwind for us."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. Okay, and then is the follow-up question. I know, you know, last quarter you talked about kind of building a sales effort for this card direct initiative, basically to get payroll cards to employers. And I believe you may have added somebody to that. you know, from a prepaid issuer in the past to build that commercial sales effort. Is that effort actually begun? Is there any kind of update you can provide there?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure. Hi, David. This is Randy. Yeah, to answer your question, we've got a team now of eight salespeople out selling to employers and doing a good job. I think we ended the year with right around 35 employers working with us."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. And is there an employee count you're able to share that maybe does 35 employers in aggregate represent?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Oh, yeah, I don't think we've really been sharing that because, you know, it's still a pretty – Pretty competitive business and the where we're going about it There's a lot of folks coming into the industry and we're trying to keep that pretty close But I think it's it's what we can't tell you is that you know these are a lot of businesses that are right at a core of our consumers, so it's not only the card but that we put in their hands that we make money off of, but we're also empowering that consumer to then be more digitalized. They can either use their card then, as you've heard, in our expanding acceptance of credit card or debit card rather at retail, and then, of course, online. So it's going in the hands of people, not just indiscriminately to try to go out for employers, but employers that would be employing consumers that would be our joint consumers with remittances as well in the most part."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. Terrific. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "That's really the value, right? That's really the value because people talk about digital, but, you know, if you don't empower that consumer, you're not going to get them to be able to do an online digital until they have some kind of plastic in their hands."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Right."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Terrific. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our next question is from the line of Mark Palmer with BCIG. Please just answer your question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yes, good morning. I'll echo that the performance was very impressive. The guidance calling for more of the same. With regard to the 22 guidance, you noted in your prepared remarks that addition of production agents was the key to additional market share gains. Can you talk a little bit about the competitive dynamic in the space and what's going on with other remittance firms such that you're able to sustain these market share gains over time, which you have been doing for quarters and years now?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Mark, I'll start, and then Randy, who's our Chief Revenue Officer, as you know, will jump in because he's going to be much closer to the action and have more granular stuff than I do. I would tell you that there's a big misnomer in the marketplace. about retail. We don't want to shout it too loudly, but you'll see today from our investor day that just how big the retail market has gotten over the last 10 years. And so what we see is companies, some of the biggest companies that are public, recalibrate themselves to go with what the market believes is going on rather than what's going on, and they've really vacated retail. I won't mention any names, but you could figure out who it is. So that's a big piece there. The second piece is that then we're competing against the small guys, which Randy will talk about, just all the ways that we compete in a way that has advantages. We've always competed in a way that's value-added, so we're not a commodity-type provider. We're typically going to be higher into the pricing range, but with a lot of added value to it. And we've seen our business have margins that have really declined very, very small over the years while we've added a great deal more market share and taking customers from our competitors without being a discounter. And that's really the key to it. But part of this is that there's this jewel in retail because some people have said there isn't. A lot of people want to believe that there isn't. and that's growing at a very high rate still. It's still growing. It's not that it's melting. It's growing, and we're the only guys that are really executing with any real power and resources to go at it day by day, retailer by retailer, zip code by zip code. I'm turning to Randy for a little bit of addition there. Yeah, thanks, Bob."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So, Mark, what Bob said is exactly spot on. I think it boils down to disciplined execution and Each one of our sales representatives has a quarterly sales plan that includes adding agents and unserved zip codes, further penetrating underserved zip codes, and focusing on agents where there's more market share and we're just not getting the amount of business out of that retailer that we think we should be. It really boils down to execution. The fact that we've got such great products and such great services and support these retailers better than our competitors just continues to provide us opportunity to take market share."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. One more question. I'm sorry."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Go ahead. I was just going to add, as we talk about a lot, this rifle shot approach where we understand our market share down to the zip code level and go in and recruit and really scan and – make sure that we get the very best retailer in the very best location. It really makes a big difference. Our retailer performance is so high compared to our competitors because we're bringing in the very best retailers because of the approach we take. So it really makes a huge difference versus competitors that are indiscriminately adding lots of retailers that become really a distraction versus quality retailers."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "You have $132.5 million in cash. You have $150 million available under your revolver. I know in the past we've talked about M&A opportunities and the opportunities that are out there have been expensive. Given the pullback in the market and what's going on there, Are you seeing any of those opportunities becoming more available? Is there any softening with regard to prices such that there could be an opportunity to use some of that cash and revolver availability in M&A?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, we're more optimistic and further along related to M&A than we've had been in the past. There's nothing to report specifically at this time. But I think there's a very good chance that you'll see M&A activity from us this year. But, you know, can't really say for certain. But absolutely, we're seeing things that we think will add to our business both at retail and also potentially things that might add to our business in vertical adjacent sort of businesses or may add to our business in different ways related to card and things like that. So we think there are going to be opportunities out there more as the year unfolds, but we're deeper than we've been. So Anderson might want to add to that. Yeah, and Mark, I would also just,"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Just to add in terms of that cash position, because our working capital moves around so much, you know, that number is probably on not the highest side. We drew more on the revolver this quarter, more volume on the revolver than we ever had as a business. So, you know, depending on the day of the week, we're not as cash heavy as it may appear."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "But we do have about how much in cash, just so?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "The max we've drawn on the revolver is $40 million. And we've got $150 million revolvers, so you can do the math. Yeah, we've got 110, right?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Unless my math is off today. I just didn't want them to think it went from 132 to 50, right? So that's right. Fair enough."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our next question is from the line of Alex Markoff with KeyBank Capital Markets. Please proceed with your question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, thanks for taking the question. Nice to see the customer growth acceleration in the fourth quarter. Just kind of curious as we look at the guide for 22 at 18% at the midpoint. Wanted to get your thoughts on how you're thinking about customer growth level in 22 versus kind of what we saw in 21 and the 29% top line growth."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I mean, I think that the customer growth in 21"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "was very, very high, and it's probably, sometimes you can look at that, it's disproportionate to the amount of retailers, new retailers we added. We've been a little more conservative. We tend to do that. Now we've beaten our numbers for the year, I'm sorry, beaten our numbers for the quarter, NVIDIA, 14 straight times, and beaten and raised a number of times this year, this past year in 21. So we're not assuming the same number of new customers. The way we get a new customer in retail typically is going into a geography that we haven't been in, or going into geography where we're underrepresented, and we go into a new retailer that has customers that we haven't touched before. So we don't expect that activity to go down dramatically. As a matter of fact, we put more people in the field, particularly in the western region, that should drive that growth. But I think, if anything, you would see that customer count as a little bit conservative, and partly just because we're lapping a really big number, right? As you continue to lap a number, just like, you know, as we're lapping fourth quarter of 21, when we get to fourth quarter of 22, that quarter will be a bit of a challenge because we're going to lap 27% of the DA growth. It's kind of the same way with the customer count. So we expect to have another strong year of that, but it's going to be on top of this strong growth that we had in 21."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. That's very helpful. Thank you. And then just to clarify, I guess kind of the same question around agent growth. Was your comment more of a, more or less a convergence of those growth rates versus maybe what we saw in 21, where it was kind of low double-digit type agent growth with kind of 20% customer growth? I just wanted to clarify what you were saying there around the disproportion in 21."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah. Hi, this is Randy. I'll take that. So yeah, they go hand in hand. As Bob mentioned, as we add locations where we're underrepresented or unrepresented, then that first year, almost all of the consumers are new to our franchise. And we see a second bump in customer acquisition that second year because as the retailer becomes more confident with our systems, likes our services better, they start to transition their customers that have been using competitive services over to us. So we really get two plus years of customer acquisition when we add a retail location. So they go hand in hand."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, great. Thank you all."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Our next question is from the line of Mike Grondahl with Northland Securities. Please receive your questions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "yeah good morning guys and congrats on another very robust quarter um kind of a two-part question um you talked about the 12 growth and agents and i understand that strategy uh well could you talk a little bit about where the backlog sits for new agents you know just In relation to historical trends, is it sort of above, in line, or below? And then somewhat related to that is just sort of maybe Randy could give us an update on the overall sales force and how that's trended the last six months and maybe your outlook there."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I mean, I don't think we call it a backlog. I think where we see opportunity... is, again, in certain markets, we always talk about the western states. We still think California, Texas, and other western states are... We have less retailers per foreign-borns, and so those are the places where there's opportunities, and we have less wires per foreign-borns in those markets. And so that's the biggest place, but even in the eastern states, there are still pockets of opportunity for us. So we don't really see a backlog. If you think of a backlog like... retailers calling in and want to become an agent and we can't get to them. We really don't have that. We're out selecting agents. We're not necessarily passively responding to agent requests. So we're going into specific retail markets where we know that there's an opportunity based on the demographic analysis we use. and how many wires we have today, and we're seeking out the best retailers. So it's more about us creating those opportunities. And I'll turn it over to Randy. We are investing much more in the western states. We've got more people there selling today, but Randy will add a little more color to that."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure. Thanks, Bob. So as we mentioned on our last call, we specifically had an increase of about 20% to our retail sales team in Q4. We brought them on in Q4. with the primary reason to work through their learning curve so they could be contributing at 100% come 2022. And that's exactly what happened. So we hired that team of people. They started making their contribution. And as we hit 2022, we're basically in full stride with that team. To Bob's point, we've identified well over 1,000 zip codes, both in the east and in the west. but skewing to the west in terms of where we're under representative and where we have those resources pointed. So we think that's going to make significant contribution this year, that team."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. And hey, Bob, anything to call out interesting or insightful just related to Mexico or Guatemala?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I don't think so. I think the markets have remained very, very strong, and I think we still have lots of opportunity. I mean, the market has been good in that a couple of companies that were discounting a little bit more, that were middle-tier independents, have gotten private equity deals in the last year or two. So some of that's come back a little bit. So I think pricing is maybe a little less pressured. You know, we've never really engaged in an equity. We always ride with a value add. So, you know, we might be three or four or five centavos more expensive to the consumer than the discounters. It's still able to take the business from them at that level because of the quality of the service. So we're not seeing – we still think there's opportunity. We've still grown our market share in each of those countries. You know, with Guatemala obviously being in the high 20s, but we think it can grow from there, particularly because of the opportunity in Texas and California and, you know, other western states, Arizona. Nevada, Utah, Colorado. The number of foreign-borns there really pales the number of foreign-borns in the East, where we do a tremendous business already. We have a great business in the West, but proportionately, it has a lot of opportunity for growth versus what we have in the East. We're seeing a very good runway still. You know, when you look at the numbers that we produced in fourth quarter in terms of growth, you know, a lot of folks doubted us when we went public in 18, right, in terms of not saying you were one of them, but, you know, and today, you know, our EBITDA is two and a half times almost what we went out at. Our business is revenue is, you know, more than two. It's about two and a half times where we went out, and we see that kind of continued growth. Now, we're always very conservative, and you see our guidance where it's pretty – pretty aggressive. We're not the type of company that goes out and overstates, and we recognize that growth on top of growth on top of growth, we just start to deal with a big denominator. But we think we've got tremendous growth opportunity, and we think that this whole notion, and by the way, I don't want to undersell digital. You'll hear in our in our investor meeting later today that, you know, we're doing all kinds of things related to what people think of digital, the online capture digital from this side. But there's so much opportunity at retail that is basically being neglected by so many folks. And retail is not shrinking. Retail is growing dramatically. We'll show some numbers later today that just shows how big that's getting and growing faster than the GDP, the remittances to Latin America at retail over the last several years. And we believe that that omni-channel approach, being able to offer the consumer every way to send money from here and every way to receive it there is the way to do business."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Our final question today comes from the line of Timothy Chiodo with Credit Suisse. Please receive your question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Good morning, everyone. Thanks for taking the question. I wanted to touch on the growth algorithm implied in the 18% growth at the midpoint. It sounds like the components should be in our new agent location additions, which have been strong. Also, the maturing, as Randy mentioned, of the recently added locations, so they result in more transactions per location. You also mentioned during the call here that there is a slight increase in transaction size that's embedded in the guidance, but not nearly as strong as last year, which is maybe appropriately conservative. And I guess some of the other factors would be either pricing or mix or new products and digital. Maybe you could just touch on that overall growth algorithm, if there's any pieces there that I might be missing or any that you would highlight in particular."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, I think, you know, in terms of pure numbers that are going to drive EVDA today and revenue today, a lot of that's going to come from retail. In terms of percentages, we're very excited about our online business, which has been growing over 100% year over year lately. We're excited about the card, as Randy talked about earlier, the payroll card. And we're excited about the launch of our new... of our new GPR card that we'll be putting out. So all of those will be contributors, but in the early stages, what's really gonna drive the business this year is we're investing more at retail, particularly in the West, with more people on the street. And there's, as we've talked about a number of times, When we put a retailer up and active, we get a payback on that in about seven or eight months. And so it's a very, very lucrative return on investment for us with the folks that we have out and putting up new retailers in zip codes, particularly in California, Texas, and other parts of the West. So that's going to be a big contributor. You'll see, though, that... All the retailers that you put up in 2021 are going to be big contributors, even though it comes out as same-store sales in 2022, because they're part of 2022 same-store, because the second year is where retailers really grow quite a bit, and they also grow quite a bit in the third year. So some of that will be coming from same-store. Some of that will be coming from the new store and the retailers we're adding next. And that combined will drive the biggest uptick in revenue and EBITDA for 2022 will be the retail side."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Excellent. Thank you so much for taking the question."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Timothy, this is Randy. Let me just add one more component. I think maybe this is where you were headed as well. On the pay side of the business, with the partners that we work with in Mexico, Guatemala, et cetera, as our volumes increase, year over year, it gives us the opportunity to negotiate better fees with each of those partners. So this year, as we see our money transfer business increase with those pay partners, we'll see that fees that we pay them come down slightly, which, of course, that savings drops right to the bottom line. So that's another component."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Excellent. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay. Thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. We've reached the end of the question and answer session, and I'll turn the call over to Bob Lissy for closing remarks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, thank you again all for joining. We hope to see some of you either in person or watching on video our investor conference later today. We look forward to continued great results. We're very optimistic about the business. It's been a great year. I think when you look at the last two years during COVID and just when you look at some of those numbers we released, and just how the business has grown from 19 to 21, it's really astronomical considering the pandemic that had been going on. And when you look at some of the larger public companies in our space and how they've contracted during that same period of time, and we believe that we've got the ability to continue to do that even as times get a little better this year. So we're looking forward to great results, and we hope to talk to you all soon. Thank you for your time and attention today."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. This concludes today's conference. You may disconnect your lines at this time. Thank you for your participation."
    }
]