[
    {
        "date": "2022-05-04T09:00:00-04:00"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Greetings and welcome to International Money Express first quarter 2022 earnings conference call. At this time, all participants are in a listen only mode. A question and answer session will follow the formal presentation. If anyone should require operator assistance during the conference, please press star then zero on your telephone keypad. I would now like to turn the conference over to your host, Mr. Mark Galentine, Vice President of Investor Relations. Thank you, sir."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning, and welcome to our quarterly earnings call. I would like to remind everybody that today's call includes forward-looking statements, including our updated 2022 guidance, and actual results may differ materially from expectations. For additional information on International Money Express, which we refer to as Intermex or the company, please see our SEC filings, including the risk factors described therein. All forward-looking statements on this call are based on assumptions and beliefs as of today. You should not rely on our forward-looking statements as predictions of future events. Please refer to slide two of our presentation for a description of certain forward-looking statements. The company undertakes no obligation to update such information except as required by applicable law. On this conference call, we discuss certain non-GAAP financial measures. Information required by Reg G under the Securities and Exchange Act for such non-GAAP financial measures is included in the presentation slides, our earnings press release, and our annual report on Form 10-K, including reconciliation of certain non-GAAP financial measures to the appropriate GAAP measures. These can be obtained in the investor section of our website at intermexonline.com. Presenting on today's call will be our Chairman, Chief Executive Officer and President, Bob Lissy, and Chief Financial Officer, Andres Bendi. Also on the call today are Joseph Aguilar, Chief Operating Officer, Randy Nelson, Chief Revenue Officer, and Chris Hunt, Chief Information Officer. Let me now turn the call over to Bob."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning, all, and thank you for joining us. We appreciate your time and value your interest in Intermex. 2022 is off to an outstanding start for our company. The strength of our first quarter operating results is a demonstration of the powerful connection we have built with our customers through our unique omni-channel suite of money transfer services. The people who rely on Intermex know they can send money home to Latin America and other areas of the world quickly, safely, and efficiently. They know they can complete their money transfers by a variety of methods, whether it is through our versatile mobile application or in person from one of our thousands of conveniently located retail locations across the U.S. and Canada. As you see on slide three, Intermex continues to achieve unprecedented double-digit growth quarter after quarter, year after year. We are growing by these key measures and metrics uninterrupted by economic ups and downs, global pandemics, or geopolitical upheaval. Anders will go into greater detail on these impressive quarter results and a bit later on the call. Moving to slide four, we are perfectly positioned to outperform in our sector, capitalizing on double-digit average annual growth rate in total remittances to Latin America and our steadily increasing share of that business, both digitally and via our retail network. We are a leading money transfer service in four of the top five Latin American markets, including Mexico, Guatemala, El Salvador, and Honduras. These key markets comprise 75% of the money sent to Latin America. With the anticipated completion of the La Nationale acquisition, we will be a market leader in the top five receiving markets in LATAM. More on La Nationale in a bit. Our addressable market includes 24 million people born in Latin America or the Caribbean who live in the United States today. We provide them a valuable service, making it possible for our customers to send money home to loved ones to pay for such essentials as housing, food, medical expenses, and more. Intermex is an important part of that transfer of funds, evidenced on slide five by the impressive 20% year-over-year growth in the total number of transactions we completed during the first quarter. As shown on slide six, in our four core markets, Intermex continues to take share and has achieved a 21.4% market share. in those large and key markets in the first quarter of 2022. We aim to complete each one of these important funds transfers without fail, 100 percent of the time. Importantly, we provide those services at locations familiar to our customers, close to where they live, in a culturally welcoming environment, and in their native language. These are all important factors that have contributed to building the consumer trust our brand has achieved, resulting in a market-leading operating performance. We have established Intermex as one of the industry's premier remittance services through our targeted and prudent investment in new technology and software, while at the same time expanding the critical and profitable retail side that Intermex customers value so very much. The vast majority of our customers prefer to conduct business in person. One key reason is the trust they place in the familiar agent retail. Additionally, many of our senders do not have the necessary banking relationships to send money online, or may be paid in cash or check that are easily negotiated at a retailer. We have not seen much change in these behaviors over the last several years, and we don't see these preferences or consumer behaviors changing dramatically anytime soon. The consistent strong growth in Intermex enjoys is tied directly to growing consumer demand for the accessible omni-channel approach we provide. On slide seven, the 17% growth in the number of Intermex customers that we achieved during the first quarter reflects the success of our omni-channel strategy. We intend to be there for our customers, offering multiple options to send money, whether it be through our retail network or on our new state-of-the-art mobile application recently launched. Regardless of their preference, we provide the same industry-leading customer care. That said, many of our customers have begun to explore the option of sending or receiving remittance digitally. As shown on slide eight, a full 25% of Intermex transactions during the first quarter were either originated or completed digitally, which is an important measure as we continue to evolve our omnichannel offering to our consumers. To underscore our valuable consumer proposition, unlike certain competitors, we offer the consumer options from which they can choose the most attractive for them. Of course, an important component of Intermex Value Chain is a strong relationship with the independent agent who manages and facilitates our retail transactions. Just to size the importance network for you, we work with thousands of independent agents across the country. For the first quarter, our agent network was 10% larger compared to first quarter 2021. Simply put, the more quality retailers we add, the more transactions we complete. By the way, these are the right agents in the right locations, carefully vetted and recruited for their alignment with our core values and commitment to the best in class customer service. We provide our partner agents with the technical support and capabilities they need to swiftly complete transactions in 20 seconds or less. That is the fastest time in the industry. The speed at which Intermex transactions are completed is a key differentiator for our busy retailers. It enables them to process more wires more quickly. Another strong draw for all of our key shareholders is our adherence to compliance protocols. Our agents as well as our banking partners rest easily knowing that we have robust safeguards in place to detect and prevent money laundering, fraud, and other transactions deemed unacceptable. We continuously invest to take compliance to the next level, which is one of the key reasons we have longstanding business relationships with premier list of regional and national banks who trust and respect the regulatory rigor that we have created. We highly value those banking relationships because they underpin our growth given the high volume of business our agents facilitate. Just a word or two on the importance of our partner agents. These are people we rely on as brand ambassadors for Intermex. They choose Intermex over other options because of the attributes I've mentioned. We choose them because they embrace our values and are committed as we are to respectful quality customer service. They are the key to our success. The carefully chosen retail network we have created sets us apart from our peers. Turning back now to La Nationale, the acquisition represents a significant step forward in global expansion ambitions. Acquiring La Nationale in land holdings provides intermix with important geographic diversity, while at the same time strengthening our competitive position in key Latin American countries where the land share of the business is transacted. Once integrated into our operations, La Nationale and land holdings will make Intermix, a leading remittance provider to Dominican Republic, adding a fifth Latin American country where Intermix will be a leader. As a reminder, the Dominican Republic, Mexico, Guatemala, El Salvador, and Honduras collectively represent 83% of all the money sent to the region from the U.S. In aggregate, we will have more than a 21% share to these five key markets. Additionally, La Nacional also enables us to enter the European remittance market for the first time expanding our global reach from 28 to more than 70 countries. Through land holdings, we will be requiring eye transfers in Europe, which will make it possible for Intermex customers to send money to Latin America, Africa, and Asia from Spain, Italy, and Germany. We believe this is an excellent opportunity for the company and our shareholders, and we expect the national acquisition to close in third quarter. So definitely, there's a positive momentum for Intermex. Put it all together, and we are creating significant value for our shareholders. achieving consistent, strong growth across the board, and setting ourselves apart as an undisputed leader in the industry. With that, I will turn it over to Andres to provide more context around the operating results we reported this morning."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Bob, and good morning, everyone. Our record of consistently strong operating results continued unchecked during the first quarter as we fully capitalized on our competitive advantage as an innovator and leader in fintech and remittances. As shown on slide nine, year-over-year revenues for the period were up a strong 21%, driven by solid growth in nearly all of our key operating metrics, including agent growth, customer growth, and growth in overall transactions. GAAP net income for the quarter was $11.7 million, up 30%, compared with the prior year. On an adjusted basis, net income increased 26% year-over-year. Our strong top line was the key driver, but we also did a nice job being efficient from many angles during the quarter, managing down the pace of expense growth, particularly on salaries, bank fees, and efficient use of a much better priced credit line. Remain focused on effective expense management and economically positive investments in people, products, and support. Importantly, growth in digitally originated transactions was also a contributor. On slide 10, digitally initiated transactions during the period increased a very strong 105% from the same three-month period last year, helped by the rollout of our new mobile app. We're committed to drive high growth in digital transactions and to guarantee that we can complete money transfers however our customers want and with great customer experience each way. I want to emphasize that seamlessly facilitating digital money transfers is an increasingly important component of our omnichannel suite of remittance services. That said, we're getting more clarity as time passes on unit economics driving digital expansion in our industry. Our approach will be to resist the temptation to overspend in digital customer acquisition. We choose instead to prudently scale digital spend in line with the customer preference we observe across our omnichannel network. Drilling down into other top-line drivers, we're continuing to build out our valuable network of retail agents across the country with an added focus on locations in communities and states in the west of the U.S. We've been focused on increasing agent productivity and efficiency rolling out the new Intermex Direct Agency software late last year, and adding field sales support personnel to accommodate the new territories we're adding. It's important to remember that we do not compete on price for our customers. Quality, dependability, and choice are more important than being the least expensive. On slide 11, these efforts drove the double-digit growth in customers and transactions, and 30% more principal sent, totaling more than $4 billion for the quarter. It's also worth noting that the contributions from emerging market countries were up over 28% during the quarter, as seen on slide 12, in an indication of our ambitions to significantly and consistently outpace the underlying growth rates in these markets. Aside from the peak of the pandemic impact, we are consistently growing at 20 to 30 and sometimes 40 plus percent every quarter in emerging markets. On slide 13, first quarter adjusted EBITDA increased 23% to almost 21 million, with margins up over 18%, a nice steady margin expansion over prior year comparatives. Turning now to the balance sheet on slide 14, Intermex continues to be an efficient operator and strong generator of cash. We ended the quarter at 157 million in cash and an undrawn revolver capacity of 150 million. We always underscore that the cash balance fluctuates based on day of the week at the quarter end but any way or any day you look at it, the balance sheet is in great shape. Looking at capital allocation, our preferred use of cash always is to reinvest in the business to accelerate growth, which we have been doing and will continue to do so, and our earnings already reflect that. We also consider inorganic growth opportunities that have a positive risk-adjusted rate of return, and as discussed earlier, we plan to close La Nacional in the third quarter of this year when we plan to close with cash on hand. As for the deal, we haven't disclosed terms at this point, so we won't share what the impact on cash will be for now. We believe, though, that this is an excellent use of cash to grow the business and will strengthen our market-leading position in Latin America, as well as open the door for us in Europe. We expect a very positive return on this investment for our shareholders. As for other uses of cash, we continue to believe that there is value in our common stock at these levels and that our repurchase program makes good sense. With the deal now under SPA and clarity on our medium-term cash needs, we expect to accelerate the pace of buyback activity versus what you would have seen in previous quarters. During the first quarter, the company repurchased approximately 244,000 shares of our common stock for a total of $3.6 million. From its inception in 3Q last year, the company repurchased approximately 566,000 shares at a weighted average price of $16.24. As noted in the press release, we've adjusted our full year guidance upward based on the strength of our first quarter results, combined with the exceptional operating efficiencies we've achieved. While our revenue forecast remains unchanged, everything below that line moves up as we continue to reap the benefits of a company DNA that's laser-focused on efficiency. As shown on slide 15, to reiterate, we still expect revenue to be in the $537 million to $546 million range, but for net income, We expect $59 million to $60.5 million, adjusted net income $67 million to $68.5 million, and adjusted EBITDA in the $101.5 to $104 million range. Overall, Intermex is creating significant value for shareholders, particularly for those who appreciate the value of solid, sustainable, and consistent growth in revenue and earnings, along with great cash generation in the CapEx Lite business model. We're confident in our unbroken record of double-digit growth and expect to build on it. We're in an excellent position to take advantage of the market opportunities by delivering on the promise of our unique and differentiated omnichannel model. With that, let me turn the call back to the operator for questions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you, sir. Ladies and gentlemen, at this time, we'll be conducting a question and answer session. If you'd like to ask a question, please press star and then one on your telephone keypad. A confirmation tone will indicate your line is in the question queue. You may press star and two if you would like to remove your question from the queue. For participants using speaker equipment, it may be necessary to pick up your handset before pressing the star keys. One moment, please, while we call for questions. Our first question is from David Sharp of JMP Securities. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Good morning, everyone. Thanks for taking my questions. Bob, I wonder if we can kind of take a step back, and you may have addressed this at the Investor Day a few months ago, but given how strong the market share gains have been, if you can maybe just bring us up to speed on what you're seeing competitively. We obviously tend to hear a lot about the big global players, MoneyGram and Western Union, which you really don't compete with much, or, you know, the all-digital entrants like a Remitly and a Wise. But, you know, as far as the companies that often have a terminal behind the checkout counter, many of the agents you're located in, you know, like a Segu or, you know, TransferMax, can you talk a little bit about, you know, A, whether there's you know, anything we ought to be aware of that's occurring at some of these primary competitors, either strength or weakness, and broadly speaking, what kind of price movements you're seeing out of them lately. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I think I would start out with, first of all, that the market, or at least a lot of the investment community, has a misconception about how strongly retail continues to grow."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "There's more dollars being added in absolute dollars at retail year over year, this quarter, last quarter, next quarter, than there is at digital. So first of all, there's a vibrant retail market. The marketplace has been misled by some of the public players, other than us, who have continued to contract retail. Because they've thrown in the towel, they haven't necessarily been able to compete in retail, so they've sort of channeled their efforts and channeled the emphasis and the attention of the investment community on digital. That's great. We do, too. We want to do digital. It's going to be a big part of our business. That's why we consider ourselves to be omnichannel. But there's still a strong, strong market in retail. First of all, don't think about the market at retail as this melting ice cube or contracting. It's growing. It's bigger in absolute terms year over year, bigger in absolute dollars in growth than is happening at digital, particularly when we talk about Latin America. Now, you've seen the numbers from some of the other public companies, and you see that they do, although we don't compete directly with some of them because they're more in big boxes, they still are contributing share back to the market. They're growing slower than the markets. So that is still a factor. And then when you get to retail, we've done a great job through what we've always done. There's not a big change. What we've always done is we've been a value-added provider that is... processes transactions faster with the best technology at retail, answers their customer service line in four seconds, has the best banking relationships, and carefully orchestrates the addition of every retailer, zip code by zip code. So it doesn't matter to us much what the competition does. Competition will come and go. Competition will flurry up and discount heavily. Competition will, and we can't be, we cannot be influenced by that too strongly. It's not that we're living a bubble, but we have to stay focused on our mission, which is a value-added provider, very targeted to where our consumers need our services, And that continues to play out in a very strong market overall with double-digit growth, whereas still the retail market is much stronger than people think, whereas in that market the key public companies have struggled. Um, there are still some of the small guys who are doing well. I would tell you there's probably some small guys that are growing pretty well because the market is growing well. I think we're doing better than any of them in terms of percentage of growth and certainly in market share, but, um, it's a strong market at retail still."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Don't be misled by the numbers you might see from other public companies."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. No, it's helpful. Um, and maybe just as a followup switch switching gears on the product front, uh, I know a payroll card, getting a GPR card in the hands of employers that can pay your senders onto that card has been in the works for a number of years. It sounded like a couple months ago you said that you were really sort of gaining some traction, at least in terms of sort of executing on the rollout. Can you provide just an update on what your expectations are for that product?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I mean, and Randy will comment more on it, Randy Nelson, but, you know, we continue to move forward with the product."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "We think it's got great utility for both the employer who may be faced with writing checks, sometimes even paying people in cash, very cumbersome taking them into town then to maybe cash their checks because these are a lot of times..."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "visa workers, and also for the worker themselves that now have options."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "You know, we're one of the only companies that take a card, debit card at retail, so where we're putting up these kinds of employers with the card, we're making sure also that our retailers take a card to retail so that our consumer, who may still, even though they're now neo-banked, might still choose to go into a retail setting, still have that choice. So we think it's going well. There's a lot of retailers to go to, and there's not retailers, but a lot of employers to go to. Most of those employers are not people that employ 10,000 or 100,000 people. So it's a numbers game, and it's a matter of having people out there just like we did at retail and building that network of employers. So, Randy, I don't know if there's anything you'd add to that."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure. I would just add that Bob's exactly right. We're in those early stages of building out the infrastructure. This past quarter, we added more employers to our network than any other previous quarter. Fourth quarter of last year was the second highest month in terms of adding employers to our network of employers who offer the card to their employees. So as we build out the number of employers that offer our card to their employees and use it as a payroll vehicle, it, of course, puts more cards in the hands of employees as they use the card for their purchases, we start generating revenue. So we're learning a lot. We've made some great contacts with industry leaders. Our reputation is being very well received. Employers are hearing more about us. They like the one-two punch that we bring, not only as a payroll vehicle for them that's more efficient and less expensive than what they've used with paper checks, but also the convenience of money transfer offering to their employees. So it's going really, really well. And secondly, it's important to understand that the GPR card, the general purpose reloadable card, is now being tested at our corporate stores with the anticipation of rolling that out to our retailers here soon. Great."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you very much, guys."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yes, thanks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. The next question is from Mark Palmer of BTIG. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yes, good morning and congratulations on a great quarter. In the first months and, for that matter, quarters after the COVID outbreak, it became apparent that principal sizes on transactions were above normal. And There was some thought that that might normalize over time, but we continue to see principal sizes be larger than what we had seen prior to the pandemic. Just wanted to get your updated thoughts on what may be driving this, the sustainability of it, and how it relates to what's going on on the ground with your customers."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, we're seeing, again, continued growth. principal amounts that would have been higher than what we would have seen in the past. But yet, now as we get into months, even years of this, we start to look at it as potentially a new normal amount. In the past, when principal amounts have gone up, they usually have not come back down. They've plateaued, and from there they they kind of stay at that level. So I don't know that we're expecting them to come back down. We've done some work in terms of projections from a conservative perspective. What if they do? But we don't necessarily think they do. They will. I think when you look at the overall economics of the United States today, is a really high inflationary time, right? So everything is costing more, and people are probably also, our workers are making more, you know, if they work for a landscaper, if they work for whomever they work for, and because there's just more money in the system. I think initially we thought that part of it was is the stability of our workforce because they were mostly essential workers and that there was a lot more hardship in places like Mexico and Guatemala where the economy had not come back as quickly. But now as this continues to sustain itself, we look at it as probably a new normal. And again, we've kind of allowed for if it doesn't stay there, how we adjust to that. But we're not expecting a big pullback in terms of principal. Now ultimately what happens is we're getting to a place now where we're beginning to lap the higher principal amounts, meaning that when we look at them, it's not like now that the principal amount will be up several percentage points from last year. It'll be more even if you sustain it because we're beginning to lap periods where we had a high principal amount last year. But again, we're pretty comfortable with it today based on what we're seeing. And we've always been, versus the market, higher principal amount provider. There's a lot of reasons for that, I think. Some of them are pricing-wise. Some of them are security-wise. But we would expect stability in where those are today. But we have also, from a conservative perspective, from a budgeting perspective, have planned for the possibility of them returning down a few percentage points back to where they were pre-pandemic."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Just one more question. We saw, of course, the increase in your guidance for adjusted DBTA reflecting the efficiencies that you're realizing. At the same time, you reiterated on the top line, you know, everything seems to be very strong in terms of the company's operating performance. Was the reiteration simply conservatism based on macroeconomic factors and whatnot? And are you feeling relative to the range? Are you feeling better about the top end of that range as a consequence of the quarter?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, no, I would say I'll answer the second question first. You know, I think that we've edged a little closer towards the top end of the range based on the first quarter's performance. But, you know, overall, you know, with the efficiency, we think we really can count on. I mean, how we did with agency commissions, how we did on processing costs, how we've managed the OPEX and the hiring within the business, you know, those are a lot more maybe in our control. I'd say we still feel good about revenue, and after another quarter is under our belt, we'll look at it again."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, and I think your first question can tie back to that a little bit, Mark, is that, you know, with the principal piece, right, not being certain, that's part of our conservatism because that is a big part of that revenue growth. So, you know, it's a little bit conservative at this point, but we think that's the right thing to do. We're very certain about the bottom line as we continue. We've always been really efficient operators, and we continue to have those efficiencies. I don't want the marketplace to think that that in any way would be indicative of a less of an investment in the business, because we've been investing heavily, been adding folks, particularly in areas that can contribute to our new businesses, like our online business, like our car business. So we continue to invest there. But because, you know, a percentage growth of, you know, now our business is big enough that a percentage growth in revenue of 20% really goes a long way towards being able to add additional people and invest in the business and still drive and leverage that bottom line. That's what we've been able to do. But to Andrus's point, I think, you know, we'll revisit it after this quarter and see where we stand. But right now, after just one quarter, we chose to be, to stand on the revenue piece and move up the EBITDA and net income piece right now."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Very good. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you very much. Ladies and gentlemen, just a reminder, if you wish to ask a question, please press star and then one. Our next question is from Mike Grandejo of Northwood Securities. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, guys. Good morning. First question is maybe just digging a little bit deeper on inflation, gas prices. You talked a little bit about average send price. but maybe specifically, did you see anything softer March, April, versus maybe the prior months?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "There's been some choppiness in the growth, and we can't talk about April now, but when we talk about the first quarter, there was some choppiness. We felt most of that was related to some of the policies put in place by the main bank in Mexico, by the Fed in Mexico, where they tried to stabilize the peso a little bit. And when that happened, we saw a slowdown, people kind of waiting, right? Because the peso, when we talk about when the peso becomes weak, people think it's on sale. Well, when the other thing happens and the peso is strengthened, people will hold back a little bit. So we saw a little bit of choppiness at different points in the quarter. But... You know, we're not seeing anything that's happening abruptly related to inflation, yet I wouldn't expect to because inflation's been something that's been going on for more than a year now, right? It's been gradually building. And so I think we're seeing that in all aspects of inflation. of life today. So in terms of economically, so, you know, that the really only impact that we can really draw is that monetary policy that was set by the, by the, by the Fed in Mexico with stabilizing the peso."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. And then secondly, I think your agent growth, I know you don't disclose the number of agents, but your agent growth, Am I correct in thinking at 10% that growth has accelerated a little bit over the last year or two? And could you kind of comment just kind of on your outlook, maybe just 10% growth, something you can do in 2020, or kind of how do you feel about aging growth going forward?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, remember what we talked about in the – in the release that we did earlier, the earnings release, was 10%, our agents are up 10% year over year. So it doesn't mean we're adding 10% more agents in the quarter. It means that if we had 1,000 agents last year in first quarter, now we have 1,100, right? So we're adding about 10%. Puts and takes, agents that leave, agents that are added. We have about 10% more agents than we did last year. The pace at which we're adding, though, and I'll have Randy comment a little bit on that, has accelerated. We've invested a lot more in particularly the western states. We have more salespeople that are freelancers out there adding. retailers, and that's been a mission of ours, as you know, and now with the resources to be able to do it, we've been executing against it. So we will expect to be adding more retailers as time goes on throughout this year."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, Mike, it's Randy. You'll recall that a quarter or two ago, we mentioned that we were adding really about 20% more folks that are out just helping us add new locations, activating new locations, and We started hiring that team, group of folks, in fourth quarter last year. We've seen some of them ramping up in terms of getting their stride. But the past two quarters, you're exactly right. We have seen more agent activations than previously in our history. And we anticipate that will continue throughout this year for sure."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. And, hey, maybe lastly, guys, Law National – The acquisition, can you disclose what trailing revenues were or 2021 revenues? I know you're not disclosing the price you're paying for it, but just what revenues they did last year?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, Mike, we're not disclosing that at this point. The only thing we're disclosing is the market share that it's going to help us achieve in the Dominican Republic, which is 20 plus. So not at this time."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And keep in mind, this is, you know, again, in a cash purchase, cash sitting on the balance sheet that's not being used today, that's going to be used to really productive use. We think La National is going to be a big opportunity for us in that, you know, it's a fifth country that we'll have one of the leading shares in. So now you have Mexico, Guatemala, El Salvador, Honduras, and Dominican Republic in in aggregate, that will be a 21 share or better. And those are 83% of all the money leaving the U.S. to Latin America goes to those five countries. Secondly, I think it gives us a really strong concentration in the Northeast, which has been strong for us, but their retail locations, you know, retail locations that they personally own versus agent, third-party agent, are not a good thing unless they're highly productive. Well, they have a lot of really highly productive branch locations that are really going to be linchpins for us in a lot of ways in the Northeast. And then lastly, it opens up the European corridor for us. And I think that there's an opportunity in Europe. Once you have a European license, it's portable throughout the European Union. Today, they're in Spain, Italy, and Germany. but we think there's opportunity in other countries. And we also think that Europe may have even a bigger opportunity because of the corridors which it sends to, because of the nature of stability and the banking status of the consumer sending, bigger online potential. So that European corridor that we open up with... the iTransfer business could give us an opportunity to even do more business from an online perspective than it may even at retail. So we think there's a lot of really valuable things that it brings. It's a little bit of a diamond in the rough. It's a business that we think has got, with our sort of leveraging at that business the way we have done other things in creating a sort of the efficiencies we have in our business has the opportunity to add tremendous value over time for our shareholders."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sounds very strategic. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you very much. The next question is from Alex Markcroft of KeyBank Capital Markets. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, guys. Nice to speak with you, and thanks for all the commentary this morning. So macro uncertainty is certainly top of mind for a lot of investors. Can you speak a bit about the resiliency of the remittance market in recessionary periods? If you just look at industry data, it suggests a relatively defensive subsector of financial services. We just appreciate any thoughts you have there. And then related to that, Bob, I think you've spoken to this a bit, but just curious kind of on what you're watching from a macro data point perspective to gauge the health of your unique customer base."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Well, we've seen, you know, I came to Intermex and began in the middle of a recession, one of the biggest downturns, right, 2008. The residual of that was coming in in 2009, and we've been able to continue to grow the business throughout all of that. Remittances is a pretty resilient business generally. It had a few down years, but it kind of held its own. It didn't have big downturns during the recession. Remember, a lot of the people that we service are doing things like picking crops in California. That's not something that there's going to be less of. If there's a recession, people still eat oranges and radishes and strawberries and all the other things. that they also are people that work in other essential businesses that continue to be relatively strong. One of the things that we always look at, because we consider the agricultural component very stable in our industry, is construction and housing starts. So when that starts to get a little weaker, we'll see the industry get a bit weaker, and it requires a little more diligence on our part, a little bit different strategy on our part to continue grow during the downturns we're not seeing that at this point as you know I'm sure there's a pretty strong housing market today and those people that are also staying in their homes are doing a lot of home renovations things like that that have been really helping I think in booing our our consumers our ultimate consumers by getting more work we you know we look at the macro factors I know this isn't going to sit well with Wall Street, but I think macro factors are kind of for people who can't compete. Like, we find a way to drive wires no matter what's happening. We'll win six to three on the money field, and we'll shoot it out with you 45-42. You know, we'll do what we need to do. And if the market gets tough, we'll get tougher. And that's what we've done. We've proven our business has gone from a business that was $40 million in revenue to to now over half a billion dollars in revenue, and it wasn't always during really great growth times. From 2008 until 2015, the market was essentially flat, yet our business grew dramatically during that period. So it is about having a value-added proposition in retail, a strategic approach to the market, And combining those things and staying resolute and not being sort of affected by every wind that blows every which way every day, it's great to stay in tune with that. But what we don't want to do is create our own sort of method and our own reason for failure by looking at those things. So whereas we look at them, we think there's just so much opportunity for us. We think that the lack of understanding by the greater marketplace, particularly some of the investment community and particularly a lot of the analyst community, that don't understand that retail grows and adds more dollars. I encourage you to take a look at how that retail grows faster and adds more dollars and billions of dollars being sent than digital does today. in an absolute sense. If you've got a small number and you grow by a certain number, it's going to be a bigger percentage. It's a very vibrant and strong retail market, and even if that slows down, the opportunity that exists for us in the western states that we're executing against, where we're still very strong and have a great franchise, but we aren't anything like the leader that we are in most of the eastern states, is really going to offset any downturn from our perspective, we feel really strongly. And one of the things that also happens in these downturns, we see it every time, is some of the weaker guys start to get even weaker. When I talk about the weaker guys, I'm not talking about big public companies who haven't performed. Not performing and being weak are two different things. I'm talking about small guys that really struggle to make their payroll. When things get tough, it gets tougher, and some of them go by the wayside. Some of them are not able to perform. So We feel good about our chances and our ability to perform no matter if it's a strong market or if it's a market that's downturned. We'd much rather have a strong market, but we will do well even if the market slows down."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. I appreciate the thorough thoughts there. Maybe just last question for me. Can you guys maybe just provide a quick update on some of the newer inbound and outbound markets being Africa, Asia, and Canada? I think you're maybe two to three years in on each of those. I'm just kind of curious how you would describe, you know, customer behavior, go-to-market success in those regions. Are there any more pieces to put in place here? Do you feel like those regions are kind of fully built out other than maybe, you know, adding agent locations?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure. Sure. This is Randy. The markets that you're referring to really are in the very infancy stages for us, and we haven't built out any retail yet. locations around Asia or the Filipino or the Vietnamese markets. We're really just partnering online with those offerings at this point in time. Africa, the entire industry has seen some challenges to Africa over the last year and a half. The Central Bank of Nigeria made some changes that has really impacted the way consumers are sending money to Nigeria now. So We're working through that. We're working through a license in Nigeria that will make us more competitive. But for the time being, the Asia opportunity continues to be online, and we're working through the Africa opportunity."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. Thank you. Thank you very much. Ladies and gentlemen, our last question is from Kim Chiodo of Credit Suisse. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great thank you and good morning. A lot of the topics I wanted to cover have been addressed and quite well but I just want to double down on slide 12 which is the emerging markets contribution to growth. So really strong growth in transactions in Q1 and on top of a tough comp and you just mentioned some of the prospects ahead for the Dominican Republic and also gave some context around some of the other emerging markets but maybe you could just recap for everyone again just the overall share in those markets relative to your core markets, just to demonstrate how much run weather is there. And if you're able to execute on the same track record that you've done in the core markets, that's a bright prospect ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "So I just want to make sure I understand your question. The question being, what are the other market opportunities if they were to attain the same kind of market share that we have in our core?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Sure. That's surely a part of it. Maybe if you could just talk about what your share is in those markets in aggregate relative to the core, which would be suggestive of the runway."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "First of all, let's keep in mind that you're not going to win in Latin America by sending lots of wires to Bolivia. We can talk about Bolivia. We can talk about countries like that, Argentina even. but they're a tiny fragment of the business. That's why we talked about that 83% of the business is driven by those countries that we talk about, Mexico, Guatemala, El Salvador, Honduras, and then Dominican Republic. Colombia would be the next biggest, and when Colombia market share, which today, we're relatively small, it's single digits, but Colombia, we have some initiatives working. In Colombia, if you added that to the mix, you're getting close to 90% of the money, probably high 80%, 88% of all the money sent to Latin America. So that's where you'll see a lot of our focus. After that, there's Ecuador. There's Peru, Nicaragua, but you probably have three or four other countries that are really going to get you pretty close to 100%. There aren't a lot of people coming from certain countries to the US to work and send money back home. So we're doing this very strategically and we haven't left anything out in a way because we just left it out. We did it because it was the best application of our resources to drive the business. Today, if we could spend a dollar to go get a wire, the best place we could spend a dollar to get a wire is still Mexico. There's no market like Mexico. There's no place in the world that sends $40 billion plus from one country to another at a margin that's, for us, not for a lot of the small guys, but really, really hefty and is two times as big as some of the low-end markets. So you'll still see us driving Mexico. You'll still see us driving Guatemala. Those emerging markets are going to be a nice add-on, but it's kind of like... You know, you've got a really good store, and Ecuador and Peru and countries like that are putting a nice awning in front, right? It's really not going to change a lot about the store. It can make it look a little more welcoming, but our business will be driven by those core countries. Now, when you aggregate all that, when you aggregate those incremental countries in Latin America and you aggregate the opportunity in the continent of Africa and you start thinking about our opportunities as they grow, from Canada and also from areas in Europe, along with the US, to other countries in the Asia area, for instance, possibly places like India and the Philippines that are predominantly online markets, Now you have some other interesting opportunities that we're very much focused on and we'll look to as we get our arms around that La Nationale iTransfer business in Europe. So we think that there's a lot of fuel there in terms of growth, but a lot of that will probably even be online, which the market will love even more. But I want to be really clear that the big opportunity still remains. Even though we have a 21 share in Mexico, if we picked up a 4% or 5% more share in Mexico, that's going to be more valuable than taking Ecuador to a 20% share, partly because of the size of Mexico, partly because of the profitability, but also because we know that's doable when we look at the share we have of Mexico globally. In many of our states in the U.S., if we're projected anything even close to that in some of the states out west, which we're growing at a market rate that's faster than the market's growing, then Mexico, we could end up with a 25 share or more to Mexico, a 35 share or more to Guatemala. I'm not projecting that. I'm not guiding that. But I'm saying those are the possibilities, and those are highly profitable markets. And they're big markets. Guatemala's a $9 billion market. all of Africa is probably, from the US, is not much bigger than Guatemala from the US. Now again, as we open up the corridors from Canada, and we open up the corridors from Europe, the continent of Africa becomes bigger. The Asian continent becomes bigger, particularly, as I said, the Philippines and India. So we'll continue to kind of look at it that way. But I think there's tremendous opportunity in a number of areas, both at retail and online. And the difference between the guys that are stuck into pleasing the market that from the outside looking in believes that this is all about online, they're pushing things, right? What we're saying is the opposite. We're saying, hey, if we go to Europe, when we're in Europe and when we own the business in Europe, We know that the consumers in Europe are going to be more likely than in the U.S. to prefer online, particularly to those particular markets. So we want to serve the consumer's needs rather than force the consumer into the product we have in stock, which is online maybe in some people's cases. We give the consumer that omni-channel choice, and that's really the beauty of what we'll be doing not only in the U.S., but as we continue to build out Canada and as we take our business to Europe and mesh that with the iTransfer business."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Excellent. Thank you for all that context and points well taken on the relative sizing."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you very much. Ladies and gentlemen, that concludes our question and answer session. And I would like to hand the conference back to Mr. Barbalesi for the present comments."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you all again for joining us and for the great questions. We appreciate your interest in the company and your support and we'll speak to you all very soon."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Have a great day."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you very much, sir. Ladies and gentlemen, that then concludes today's conference. You may disconnect your lines at this time. Thank you for your participation."
    }
]