[
    {
        "date": "2024-08-07T09:00:00-04:00"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good day and thank you for standing by. Welcome to the International Money Express Inc. Second Quarter 2024 Earnings Conference Call. At this time, all participants are in a listen-only mode. After the speaker's presentation, there will be a question and answer session. To ask a question during the session, you will need to press star 1-1 on your telephone. You will then hear an automated message advising your hand is raised. To withdraw your question, please press star 1-1 again. Please be advised that today's conference is being recorded. I would now like to hand the conference over to your first speaker today, Alex Sadowski, Investor Relations Coordinator. Please go ahead."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning, and welcome to the Intermex second quarter 2024 earnings call. I would like to remind everyone that today's call includes forward-looking statements, including our 2024 guidance, and actual results may differ materially from expectation. For additional information on International Money Express, which we refer to as Intermex or the company, please see our SEC filings, including the risk factors described therein. All forward-looking statements on this call are based on assumptions and beliefs as of today. You should not rely on our forward-looking statements as predictions of future events. Please refer to slide two of our presentation for a description of certain forward-looking statements. The company undertakes no obligation to update such information except as required by applicable law. On this conference call, we will discuss certain non-GAAP financial measures. Information required by Regulation G under the Securities and Exchange Act for such non-GAAP financial measures is included in the presentation slides, our earnings press release, and our annual report on Form 10-K and quarterly reports on Form 10-Q. including reconciliation of certain non-GAAP financial measures to the appropriate GAAP measures. These can be obtained in the Investors section of our website at intermexonline.com. Presenting on today's call is our Chairman, Chief Executive Officer, and President, Bob Lissy, and Chief Financial Officer, Andrew Spendy, as well as other members of the Senior Leadership Team. Let me now turn the call over to Bob."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Good morning, shareholders, analysts, partners, and media representatives. I appreciate you joining us today. It's a pleasure to share the progress International Money Express has made in the second quarter of 2024. We are proud to report that our momentum has continued and we are seeing substantial progress across our key focus areas. While just as IBIDEA ended up just shy of our own expectations, we successfully delivered on all metrics within our guided ranges. underscoring our robust performance and strong execution in a challenging market environment. Our total revenue for Q2 reached a record of $171.5 million, marking another significant achievement for the company. Additionally, we produced an impressive performance with regard to adjusted EBITDA, reaching $31.1 million, a margin of 18.1%. Our EPS and adjusted EPS for this quarter were 42 cents and 55 cents, respectively. We're extremely proud to have grown adjusted EPS by 10% versus last year, considering the very challenging market environment. This underscores our laser focus on operational efficiencies and our ability to deliver value to our shareholders during difficult times. Our digital business outpaced market growth by further expanding our margins and profitabilities. We feel our strategic agility and deep market understanding is a significant differentiator for the company, enabling us to excel across multiple metrics for digital at precisely the right moment for that product. This quarter, we have not only sustained our financial performance, but also achieved significant milestones in strategic initiatives. The integration of La Nationale continues to pay off with a threefold increase in its EBITDA, underscoring the strategic merits of our acquisitions and the ability to enhance value by operating that division with a highly efficient, metrical approach that has become the Intermex way. Our global strategies are yielding revenue records in nine countries, reflecting our strong market presence and execution capabilities. Our retail operations remain a cornerstone of our success, delivering excellent margins and generating substantial free cash for the business. Our keen financial management and strategic initiatives driving our performance create the perfect backdrop to grow our digital business as a part of our omni-channel offering. Our digital channels have reached unprecedented levels of user engagement and profitability, showcasing the effectiveness of our disciplined growth approach and our strategic investments in product development marketing. We're continuously enhancing our digital offering through strategic partnerships, particularly within our Wires as a Service platform. The European market in particular holds immense potential, and we anticipate that our best-in-class digital solutions will be a great growth driver for us in that region in the coming months and years. During Q2, we encountered several economic and market-specific challenges. However, our nimble culture and adaptive business model enabled us to not only cope but to excel. Our success demonstrates our deep understanding of market dynamics and our ability to swiftly adjust our strategies to maintain momentum and deliver profitability as exemplified in our digital business. Our digital business has been a stand-up performer growing significantly and boosting our bottom line. Recognizing the market's embrace of these solutions, we see a tremendous opportunity to accelerate our expansion. At the same time, our robust retail base, contributing over $600 million in revenue to our portfolio, provides us with a foundation to strategically invest in our digital business. The decision by our competitors to de-emphasize retail has put us in a great position to outperform that market and enhance our returns as a company. The balance between retail and digital growth highlights our omnichannel strategy, which leverages the strength of both the traditional and the online digital financial services to drive future growth. By investing in our digital capabilities while maintaining our strong retail operations, we are well-positioned to capture diverse market opportunities and sustain our growth trajectory. The long-term resilience of retail, combined with our own strategic digital investments, wrapped with the culture of metrically-based efficiency, positions us to remain adaptable and poised to continue success. International Money Express stands at the forefront of fintech innovation, pioneering the omni-channel remittance model. Our business is anchored by a robust retail network and a rapidly expanding digital sector. The omni-channel strategy ensures seamless integration of traditional retail transactions with cutting-edge digital solutions, providing comprehensive coverage across various customer touchpoints. At the core of our identity is our focus on quality service targeted growth, and homing in on the most profitable agent retail locations in geographies to maximize profitability. Our ability to price services efficiently below the zip code level and to and by specific agent level underscores our sophisticated rifle shot operational capabilities. Our world-class call center, exceptional customer service, and strong banking and payer relationships are pivotal to our success in taking years to build and would take equally as long to replicate. We take pride in our reliability, having never failed to honor or pay out a transaction in a timely manner. Our retail operations are renowned for their cost efficiency and effectiveness and enable us to strategically nurture our digital ventures. This balance safeguards investor funds and promotes sustainable business growth. Leveraging cutting edge proprietary technology, we deliver exceptional value added services that strengthen our relationship with a highly productive network of retail agents. These small, locally owned businesses benefit from solutions that set us apart in the marketplace. By blending the strength of both retail and digital technologies, Intermex captures diverse marketing opportunities driving future growth. This strategic equilibrium not only expands our service capabilities, but also solidifies our position as a leader in the financial technology landscape. The second quarter of 2024 has brought transformative advancements for IMXI. Our strategic breakthroughs and operational progress has set a solid foundation for future growth. Our digital business has been particularly impressive with consumer acquisition costs decreasing while unit economics have continued to become increasingly more profitable. This is due to increased revenue per transaction and significant processing cost efficiencies. Our diversification efforts have led to a full suite of products and services, enhancing our value proposition to consumers. In July, we closed on the acquisition of a small remittance company in England. This acquisition secures a remittance license for the company in the UK, enhancing our ability to expand and grow in the European market. This addition complements our existing passportable EU license, providing us with access to the most critical markets in the region. Our presence significantly bolsters our growth prospects, especially in our digital segment, and positions us to leverage new opportunities across the region. Domestically, we reworked our retail sales organization, bringing in new leadership, including head of retail sales, director of inside sales, and a regional vice president in the Northeast. This infusion of new talent is expected to drive strategic growth and enhance our strong market presence. While their competitors have retreated from retail in the face of challenging times, we have invested, with a total cost of sales and marketing and retail remaining at just 7% of gross profit, leaving ample room for future expansion of our retail and digital initiatives. That fact, coupled with the reality that about 75% or more of remittances to key Latin American destinations originate at retail, makes that channel a key component of any true omnichannel offering. Unlike many others, Intermex has the capacity and the will to compete and succeed at both the digital and retail markets. Moving into the second half of the year, we will be supported by a strengthened sales effort led by our enhanced and upgraded team. Our focus remains to continue to be a lead player from any key market through the retail channel while growing our digital business efficiently and, most importantly, profitably. With that, I return the call to our CFO, Andrew Spendy, who will provide greater detail on our financial performance."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thanks, Bob. In the second quarter of 2024, International Money Express continued its trajectory of robust financial performance and set new records highlighting the strength and resilience of our omni-channel business model. We achieved second quarter revenue of $171.5 million, up 1.4% year-over-year in a market where others are struggling to maintain growth. Our digital channels have performed exceptionally well with digital revenue up by almost 70% and gross margin per transaction close to double versus the same period last year. This performance reflects our focused efforts on expanding our digital footprint and enhancing user engagement through innovative offerings and a best-in-class product and client experience. Additionally, the gross profit per digital transaction is now about 40% higher than retail, highlighting the progress we've made in this product and its potential to self-fund significant future growth. During the quarter, our consumer base increased to 4.2 million customers, showcasing our strong brand loyalty and the successful enhancement of our customer engagement strategies. It's important to underscore that we continue to grow revenue, despite the consumer-facing forces impacting the broader retail environment right now. What's more, we have taken action early to get ahead of sluggishness in the top line by constantly rooting out inefficiencies, as you can see salaries and general administrative expenses both down year over year. In addition to the benefits we're reaping from prior cost actions, we're already taking steps to ensure we stay on the front foot. In the quarter, we booked a restructuring charge of $2.7 million, mostly to streamline offshore operations. We anticipate over $2 million in annualized savings once all our actions are complete, and we'll start to see the benefits from that restructuring at the start of 2025. Efficiency is part of our Intermex DNA, allowing us to grow adjusted EBITDA in Q2 and reach a second quarter record for the company at $31.1 million, representing a 0.6% year-over-year increase. Adjusted EBITDA margins have held steady at just over 18%. Earnings per share grew in the quarter, 10% on an adjusted basis. Diluted gaps EPS was flat to the prior year, impacted by the $2.7 million restructuring charge I mentioned earlier. Interest expense rose to $3.1 million, reflecting slightly higher suffer versus a year ago, and increased revolver usage as we continue to deploy more of our idle cash to our buyback program. Depreciation and amortization were up just under 10%, much driven by the new headquarters facility built out in 2023 and relocated two in one queue. Our tax rate came down to 29.2% in Q2 versus 30.2% one year ago, primarily from lower state taxes. It was another strong quarter for free cash generation, our internal metric that attempts to adjust for working capital swings. In Q2, we generated another $13.3 million in free cash, up over 2.3% from last year. If you add back the last of the new HQ CapEx spend, $1.6 million in Q2, free cash generated would be up almost 15% for the quarter. During the quarter, we bought back over 521,000 shares, having deployed just under $35 million year-to-date towards the buyback program. Though still very active, we stepped down our purchase rate from 1Q as we closed on the UK acquisition and provided some additional growth capital to our Europe business. For the moment, we're also keeping a little more prouder drive for M&A. Looking ahead, we continue to lay a strong foundation for our long-term success. We are well positioned to differentiate and outperform in both retail and digital and execute with an eye on efficiency and unit economics that is uncommon in our space. While we are confident in our ability to manage the controllable, we're not immune to the top line headwinds our entire industry and retail more broadly is facing. With that, we feel it's prudent to update our outlook and recalibrate closer to the lower end of our previous guidance. We're now projecting for 2024, full year revenue of 657.6 to $677.6 million, fully diluted gap EPS of $1.73, to $1.87 per share, adjusted diluted EPS of $2.07 to $2.25 per share, and adjusted EBITDA of 121.1 to $124.7 million. For the third quarter specifically, we anticipate revenue $170.6 million to $175.8 million. Fully diluted gap EPS of 49 to 54 cents per share. Adjusted diluted EPS of 57 to 62 cents per share. And adjusted EBITDA of 32.1 to 33.1 million dollars. And with that, I'll turn it back to Bob."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "We are now ready to take your questions and provide future insights into our performance, strategic initiatives, and optimistic outlook for the future. We welcome your inquiries and are eager to discuss our future plans and projections. I open this session now for questions."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. At this time, we will conduct the question and answer session. As a reminder, to ask a question, you will need to press star 1 1 on your telephone and wait for your name to be announced. To withdraw your question, please press star 1 1 again. One moment while we compile the Q&A roster. Our first question is from Gus Gala with Monus, Crespi, Hart & Co. Your line is now open."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, good morning, Bob. Good morning, Andres. Can we talk a little bit about the assumptions for growth, I mean, on both the key end markets and across the two channels? I mean, and can you comment, are you seeing incremental pressure in the U.S. on your agent base? Your big tier has made some interesting comments on agent activations going up 50% so far this year. Just anything you can help us out there."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I'm sorry, I didn't catch the 50% of activations. Could you repeat that part?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah. I mean, one of your larger peers talked about in the U.S. going after the independent channel and having quite a bit of success versus the past. Is this something you're seeing incremental pressure from, or is this really just a macro, the retail side of remittances is just softening? just 110 parts of those out."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yes. No, I understand that question. Yes. I would say that most of any pressure that we see at retail would not be from who you would consider to be a major competitor. The small regional guys, and they're not really regional, it's just a term used, but that are not public are probably the most aggressive folks in retail. But from our perspective, what we're seeing is that We believe that by the best calculations we can get, because no one publishes digital versus retail, we extrapolate from our payers the percent that is digital today and its growth rate. We believe that we're beating the market at retail and we're beating the market at digital. The challenge we have is today that we're overweight in retail and underweight in digital. And we continue to move to more balance that out. I want to be very careful and cautious to point out to everybody that 75% of the wires at least going to our core markets are still originating in retail and they're not dissipating at a very large or very fast pace, as a matter of fact, when we saw a resurgence in the numbers in June. to Mexico, we turned very positive in our own numbers to Mexico. So there's just this little inflection point right now where the market is soft and digital is, is really representing a large share of that growth. That's causing a bit of an inflection where we see, um, you know, our retail suffering, but once the numbers get better, the macro numbers, We still think retail is a strong market. We just also think we need to rebalance and continue to invest in digital. And as we do that, we'll have a number that's more reflective of the market. The second part of that is, is that whereas I firmly believe that all the things we've done in the past we're still doing and we're still beating the market at retail. We see a huge opportunity now with our new head of sales, Chris Koala, has an extreme great success record, been in the industry for a long time, and the things that he's bringing along with some new folks. And we believe that we can greatly exceed the growth of the retail market in the coming months and years. That's going to take a little bit of time to kind of get back there, But it's not a softness now. It's more of a macro softness. And from our perspective, we think we can do things to mitigate, even if that softness remains, through the actions we're taking today at retail."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Gotcha. That's very helpful. I mean, you kind of got into my second question. So the new sales folks, can we take this to mean, I mean, particularly on the outside sales part, that we're going to be leaning into California and Texas, you know, the Western U.S. in the coming? I imagine this is not a... By the end of the year, you'll see a big inflation. I imagine there's a calendar 25 type thing. And then can you remind us on Segway, they shut down earlier this year. I think at one point there was a filing from 08, but they had like 7,500 locations. Kind of what was it when it was shut down? And then geographic dispersion. I mean, that sounds like one of the smaller players where you're going to be able to play in. Maybe just comment on that."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah. So under the first question, um, certainly States like California and Texas that have large populations of foreign born Hispanics that are our market, particularly Mexico and Guatemala are going to be States that are going to be a high on our list, but we feel like we've got opportunity to execute across the country. There's going to be places that we can execute and drive more wires in key markets that have been very strong for us. So we're going to play out our plans wherever we can be most efficient. and we're doing that today. Obviously, the biggest opportunities are going to be Texas and California and other parts of the West, but that doesn't exclude the East. It doesn't say that we don't see huge growth opportunities in states where we've been even dominant, maybe not as big as the West, but still opportunities. On your second question, CK is really a great example kind of what's going on in the marketplace, right? We've seen the demise of Seagate. We've seen the demise of Small World, which is primarily Europe, but also had a large business in the Northeast in the United States. Both of them are no longer in business. We've seen one of the two largest players or best known players cut their field force, their sales force by, you know, 60% and try to dedicate themselves more digitally so we're seeing challenges in retail for a lot of folks we don't believe those are permanent challenges we don't believe that we think it's a you know a little bit of a dip in the market and we feel like the investing we do are going to get us past that um Seagate, in particular, to answer that question, had started to atrophy and die on the vine for a long time. There wasn't much left of it. So what was happening with Seagate is by time it actually shut down, it was just a small fraction of itself. And in many cases, we were alongside Seagate or others were in those retailers, and those transactions began to sort of filter off to other players over time. So there wasn't a large, you know, insurgence of wires, I think, that anybody saw when they finally went out of business because they were probably only about 20% to 25% of their original self by the time they closed down."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Gotcha. That's super helpful. And then my very last one, and I'll jump back in the queue. Can we just expand on the capital allocation priorities? I think earlier in the year we talked about roughly $20 million a quarter in buybacks. Is that off the table now, and we're just putting more towards M&A? And on the M&A side, are we looking more internationally, domestically, and is it more of a maybe expanding distribution panel versus, I don't know, corridors?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yes. On the capital allocation, Gus, this is Andrews. I would expect that you would see going forward for the rest of the year activity, it looked a little bit more like 2Q. I think in general, during the quarter, we did close in the UK acquisitions, give us a license in the UK. Not huge, but about a million and a half, and that'll have some additional growth capital, provided some additional growth capital to our Europe business as well. So taking those into account and some properties from an M&A perspective that are interesting. you know, we did dial back the buyback. So in terms of what we're interested in, Bob, do you want to talk a little? Types of M&A we're interested in?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I mean, we continue to look at things that will be diverse and bring us opportunities. So there's a couple of small things. There's a set of agent retailers here in the United States that are being operated by a bank that's offshore that we pay through that could potentially be an opportunity for us to look at. We're also looking at some opportunities related to our digital business that I think will be really great opportunities to have us invest more into the digital, and leapfrog us ahead of where we are very quickly. So those are both sort of on our agenda, as well as some other things that would play out at retail. So probably three to four things that we're looking at that are in early to middle stages right now. Nothing that we could be any more specific about this time."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you for all the callers."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Our next question comes from Andrew Hart with BTIG. Your line is now open."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Hey, guys. Two questions for me, one kind of on macro and then one on Europe OS at second. I guess the first one just on macro. Bob, you alluded to in the first question, I just want to be clear on this. You said kind of June trends, I think particularly in Mexico, got a little bit positive. But then obviously with the kind of top line reduction that we're looking at now, is it Is it safe to assume kind of what we saw in June from, you know, the Bank of Mexico data that we've been looking at probably didn't hold through August or through July? And then just kind of, I think there's also some commentary about the mix between digital and retail that you also saw there. So can you just kind of clarify that from the macro perspective? Are those June trends holding or have they pulled up a bit? And then is that 3.5% just under 3.5%, I think?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Mexico assumption and prior guidance is that no longer the case that we should be considering Okay, so um the June trend was driven by the Some election stuff that was going on in Mexico that drove the peso to weaken and when you see the peso weakening We'll get a surge of business it's been a little bit choppy, but certainly hasn't had any big swings and And what happens, even though the pesos sustained a more pesos per dollar exchange rate, consumers get used to that if that trend doesn't continue. So we don't expect that. It certainly hasn't happened in July where that same resurgence was there. It was short-lived because of the big drop in the peso really over a weekend in June, right at the end of May and June, that really played out in most of June or a big part of June. We're not seeing that at this point. Hard to predict, but we don't see anything on the horizon like an election or anything else that would be as acute of a drop in the peso in terms of its valuation and those are things that typically have a big spike in the business if even they are only short-lived um on the second part um relative to the retail and digital so just to kind of like so so if you take the growth in the market and it's about 6% is what's been published by the Bank of Mexico. Extremely choppy, one negative month, one really high month because of the June sort of drop in the peso. If you take that 6.1%, it's our belief from everything that we can put together that the digital business is about 25% of all the business going to Mexico. And we believe from the numbers we can gather, again, there's nothing published, that that's somewhere around 40% growth, which would give somewhere between an 8% to 10% lift on the overall market. And so if the market is 6.1%, we would believe that as a consequence or as a deduction that the retail market is probably a minus 3% or a minus 4%. And that's where we get our assumption, our belief that we're outperforming the market as it sits today. We think that if you take our digital lift out of our number, that we're still outperforming in retail and then outperforming in digital as well. It's the weighting that we have. We don't have a 25% weighting on digital. It's a much smaller business than that. It's in single digit numbers growing very, very quickly. Extremely profitable. I think the really good news is that, you know, our team has built a product now with a gross margin. And this wasn't what it was. I was one of the biggest detractors of digital because the numbers supported that. But today, the gross margin in digital is better for us than our gross margin at retail by almost a dollar. And so that is really turned around. We're doing better on the revenue line, and we're doing better on the gross margin line because we've also done a great job related to processing costs and other fees related to taking those wires. And so part of what we need to do going forward is rebuild and exceed the market at retail the way we used to. I think we're beating the market at retail, but only by one or two percentage points. and then really invest in digital because that's a piece that has explosive growth opportunity. And when we put those two together, that's going to be the key to the future, you know, over the coming months and years. Okay."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, that's really helpful clarification. Thank you. And then I guess a follow-up, you know, in the prepared remarks, Bob, you talked about digital having this fantastic opportunity in Europe, it sounds like it's more 2025, 2026 story. I guess maybe can you just size up both retail and digital, kind of how big the European business is as a percentage of Intermex as a whole? And then when we're thinking about digital in Europe, can you talk about branding and go-to-market, how it might be a little bit different than what we're seeing in the U.S.? Will it be through the iTransfer brand? Do you plan on bringing the Intermex brand there to drive digital just How is Europe going to look a little bit different with the digital offering than what we'll see in the U.S.?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, so today our European business is relatively small as a percentage. Let's call it low single digits percentage of our overall business. It's primarily driven by Spain and Italy. We have a small presence, one company store in Germany. So part of our opportunity there is the largest markets, as you probably know, are Germany, France, and UK. We just got a license now in UK as part of buying our small acquisition there. So from our perspective, we have a big opportunity to build out where we are already, which is Spain and Italy, but then be able to expand into Germany, France, and UK. Part of that will be... built on the ability of ourselves to be able to get banking relationships in those countries because that's a big part of the retail network we talk about the retail side so today we have to have better banking relationships in germany and get a banking relationship in france and maintain and expand upon the one we inherited in the uk that'll be a big part of that growth but the european business can grow several times over in terms of its size today if we only did proportionally In Germany, France, and UK, which we're not anywhere near full growth in Spain and Italy, you know, it can triple our business because markets are so much bigger than the Spain and Italy market. That's on the retail side. On the digital side, the reason we talk about... The opportunity in digital in Europe is because it's a much more advanced towards digital market. The biggest obstacle to digital in the U.S. is that we have a lot of consumers who are not banked and in many cases can't be banked because they may be undocumented. That's not the case in Europe. It's less of that. Most people tend to be banked. Most people tend to have debit cards. As a matter of fact, the small retailer that we bought, the small – processor, money transfer company in UK, about 70, I think about 85 to 90% of the wires they do at retail are through a debit card. All of those customers are eligible to do digital. They have the means to do it today, and they're still doing retail. So we find that market to be much more ready for digital. The key there will be to drive consumers to that site, the same thing we have to do in the US. Today in the US, we've built a wonderful application that people are rating very highly and customers are very pleased with. And our unit economics are tremendously attractive, better than they are even at retail today. But the challenge for us will be to make the investment to drive consumers to our U.S. business to do wires digitally, and that will be the same challenge we face in Europe. But the opportunity is enormous, not nearly what it is in the U.S. for digital, but a very big opportunity there as well. and possibly easier to access because of the presence of bank accounts in the hands of those consumers that we would attract to our digital site thank you very much i appreciate it thank you our next question comes from mike grondel with fnbo northland your line is now open hey guys thanks um first question"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Bob you've talked about invest in digital and how the gross margin is double what it was last year dollars and it's even 40% higher than the retail gross margin dollars can you just I don't know maybe provide a few more details is invest in digital does that primarily mean marketing and spend, I guess, just defined invest in digital for, you know, specifically, what do you mean there?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I mean, going forward, the biggest, I know we've invested a tremendous amount to have a site now, an application that we think stands with anyone. And that investment's been done. And it's being proven out through hundreds of thousands of wires going through our digital site monthly. So that we know, and most of that, there's always going to be, you know, a upgrades and stuff that will be done to that system and the application, but that primarily has been done. The biggest part now is in the area of product management, but then even more so in marketing. And then marketing is really that customer acquisition cost that we think we've driven down much lower than it was in the small amount of money we've been spending. The acquisition cost has come down probably half of where it used to be. But we still need to be able to invest a certain amount of dollars to drive digital wires because we need today, most of what's happening is people that are coming to us and doing the wire because they understand or recognize the Intermex name, and they're coming there to Intermex purposefully. We're not spending the money the way some of the leaders in digital, not even a tiny fraction of that, to drive people to our site. And that will be the piece of investment that we need to make. From our perspective, unlike some other companies that have built a strong digital business and had to build that by causing a great deal of red ink, we don't need to do anything at all like that. As we talk about our future projection for this year, we're still making over $120 million in IBDA and still growing our earnings per share. We still throw off, you know, $50, $55, $60 million of free cash, $65 million if you don't count our movement of our moving to our new headquarters office. So we have built into this strong fortress of a financial performing company the ability to invest in it. What we have to do is do that in such a way that it's supported by the marketplace and supported by our investment community, our investors, as we invest in digital. And that's the challenge, and that's the line we've been walking. We feel like we've got a great digital product now. The application is as good as any. The margins, as I said, on the unit economics are tremendously good. And lastly, we've done better in terms of getting a better smaller, more affordable customer acquisition costs. But it still requires that we make an investment in that to build that business to catch up to the market, if you will, relative to the weighting between our digital and our retail. One more thing I want to say, and I don't want to ramble on, but I want to reinforce, 75% of the wires today, not degrading by huge numbers, are still coming from retail. And that fortress only costs us about 7% in sales and marketing costs of our gross margin, a tremendous business that can give us the ability to leapfrog from that into being a large digital player while we're still a strong retail player. And I think that's the prescription for us going forward."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Got it. Got it. And then I guess I have a follow up on retail itself. And the challenges you're seeing there. I think what you guys have been saying is those are inflation and macro driven, and not really coming from your competitors or the competitive environment. Could you just provide a little clarity there? What's the source of the challenges at retail driving minus three, minus four to Latin America?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Okay, so I think what we're seeing right now, and if we went back historically, we went when we've seen market downturns before in Mexico wires. We've seen the Mexico market contract on a consistent basis, middle to high single digits. I don't believe that there's a huge segment of the current consumers that have migrated to digital. I believe the fact that the digital is now encompassed within the overall number is what's driving that number not to be more negative than it is and to be negative some months and other months be slightly positive. We take out June, which was an anomaly because of the peso weakening. So I think from my perspective that What we're seeing is a retail market that's cyclical that we've seen before. And at retail, I would suggest that the retail today for the quarter was probably a minus 3% or something like that, which means that we beat retail, not by a long shot, not like we used to. So we need to execute better, but we still beat retail. Our biggest adversary is not the competitors. The biggest adversary is the macro conditions that the market at retail is smaller than it was a year ago, and that's what we're fighting against. Now, we also have recognized our ability to execute better, and that's why a lot of the changes we're making in the sales organization with Chris coming in and bringing in some additional talent. But there is a challenge in the macro environment, not really from small competitors or others taking the business, certainly not from the competitor alluded to earlier that's spending a lot of time at retail trying to build their independent network. Got it. Hey, thanks a lot and good luck. Thank you."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. Our next question is from the line of Bill Desalem with Tieden Capital Management, your line is now open."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. That's Tieden Capital. Two questions, one which I think you have helped clarify, but relative to your multiple comments that you're focused on digital in Europe, are we understanding correctly that is because of the bank account and just the banking capability that the people transferring have? versus the inability to have a bank account here in the U.S. and that really relegates them to retail? Are we understanding that correctly?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "I think that we believe, we don't know for certain, right, but we believe that it's easier for somebody to get a bank account in Europe and so people are more banked. And that's what we've seen from the small acquisition we made, as I indicated earlier, as much as 90% or more of the wires that are going from their retail location are done with a debit card. And in the U S it's a different consumer. It's not only ability, but it's the faith in banks knows not everybody is banked in their home country. That's coming to the U S. So even if they can, if they're humble workers, we're not talking about people that are, you know, um, that are more upscale or more affluent, but the humble worker coming across the border, even if they have, even if they're documented, they may not have a bank account because they weren't used to having bank accounts. So I think it's very different in Europe It's a different consumer. It's a different... So that consumer might be has different values from where they came from. And then they also are coming into a system that makes the bank account accessibility much more easier for them. And those combined will make digital a bigger opportunity. That's not to say that we think retail won't be a big opportunity in Europe. We're already driving a business there that's profitable and does hundreds of thousands of wires per month at retail. But we think that there's more receptability, even more receptability in the client base that we'll offer our services to in Europe to do wires online because they're better ready to do that because of the presence of their bank account."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "And does that also apply to the migrant community in Europe?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "We don't distinguish our consumers of migrants from But non-migratory, I mean, you know, in UK where we're talking about where it's 90%, those are consumers sending money back home. I mean, I don't know how you define them as a migrant worker. You know, they may be permanently in the country or they may be temporarily in the country, but there still is that accessibility for bank accounts. More people are paid directly into a bank account and have a debit card there than they do here relative to potential senders."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Great. That's helpful. And one additional question, please. Relative to the two competitors that failed, when you look back on their failure and dissect it, what do you believe were the key failings on their part that ultimately led to their demise? What are you doing different versus and the surviving competitors versus what they did?"
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Yeah, I think, and again, you know, this is me from the outside, so I don't have any inside information, and I'm reluctant to answer that, but I'll try to answer it as best as I can. I think in the case of Small World, they just were in too many things, too diluted into too many things at one time, and they didn't focus in. We built our company... I built this company from the time that I came in on the fact that Mexico is the largest single country U.S. to Mexico in the world in sending. India gets more money. China gets more money. But for many places, there's no one single quarter that big or that profitable. And so we built the business on that, then secondarily Guatemala, which is an enormous market, which is secondary or second to profitability per transaction in Mexico. And that base is that base that's built, this cash that gets thrown off every month that allows us to invest, allows us to buy back stock. Others didn't really act metrically. They considered every country equal. They considered every destination equal in terms of its opportunity. And we're very metrically driven, which is not what I think happened in some of the other companies. I think in the case of Seagate, technology was a big problem. And we always sort of jump over the fact that technology at retail is a big deal. We always think of technology of just being digital. Well, digital is just the extension of the same thing that's at retail to the hand of the consumer and their phones. So Seagate had a really not-so-good application at retail, and so they did a lot of their wires with what's called a telehero product, where the consumer goes in and picks up a phone and goes directly to a call center for Seagate to do a wire. Their technology was not so good, and there are parts of the country where the telehero was not a real attractive option. So that, along with some misinvestments that they made trying to go into areas they shouldn't have, they made an acquisition a while ago, that unlike our acquisition of the National, drained them and was very unprofitable. And those two things, I think the distractions in both cases, in Seagate's case, the lack of a quality technology, those all drove them to where they are today."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you for the time and perspective. You're welcome."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you. I'm showing no further questions at this time. I would now like to turn it back to Bob Lissy for closing remarks."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you all for joining us today. We appreciate the questions and we'll look forward to talking to you soon. Let us know if we can clarify anything else for you or be of further assistance. Thank you again. Have a great day."
    },
    {
        "speaker_name": null,
        "speaker_title": null,
        "text": "Thank you for your participation in today's conference. This does conclude the program. You may now disconnect."
    }
]